{
    "description": "[problemUrl]: https://atcoder.jp/contests/code-festival-2015-okinawa-open/tasks/code_festival_2015_okinawa_d\n\n",
    "inputFormat": "Inputs will be given by standard input in following format.\n\n> $ N $ $ M $ $ p_1 $ $ q_1 $ $ p_2 $ $ q_2 $ : $ p_M $ $ q_M $\n\n- At the first line, an integer $ N(1≦N≦100,000) $、$ M(1≦M≦200,000) $ will be given.\n- From the second line there are $ M $ lines that represent all the words in this dictionary. For the $ i_{th} $ line, integer $ p_i(1≦p_i≦N) $ and $ q_i(1≦q_i≦N) $ will be given divided by space.\n\nIt is possible that there are different words that begin with the same character and end with the same character. In other words, it is possible that $ p_i\\ =\\ p_j $ and $ q_i\\ =\\ q_j $ even when $ i\\ \\neq\\ j $.",
    "outputFormat": "Assume that two players will try their best. Output `Snuke` if the first player wins, output `Sothe` if the second player wins in one line. If the game will never halt, output `Draw` in one line.\n\nPrint a newline at the end of output.",
    "samples": [
        [
            "6 5\r\n1 2\r\n2 3\r\n3 4\r\n4 2\r\n2 5",
            "Sothe"
        ],
        [
            "6 6\r\n1 2\r\n2 3\r\n3 4\r\n4 2\r\n2 5\r\n5 6",
            "Draw"
        ],
        [
            "6 8\r\n1 2\r\n1 3\r\n3 4\r\n3 5\r\n2 1\r\n4 5\r\n4 6\r\n5 6",
            "Snuke"
        ],
        [
            "4 8\r\n2 3\r\n2 3\r\n3 4\r\n4 1\r\n3 1\r\n2 2\r\n4 2\r\n4 3",
            "Sothe"
        ]
    ],
    "hint": "### Problem\n\nIn a country where $ N $ different kinds characters are being used, there is a dictionary that contains $ M $ entries, each entry is a definition for a word. All the kinds of characters are listed as character $ 1 $, character $ 2 $, ..., character $ N $. The $ i_{th} $ entry (as a word) of this dictionary begins with the letter $ p_i $, and ends with the letter $ q_i $.\n\n Cat Snuke and Wolf Sothe will use this dictionary to play a game called **Shiritori** . (Please note that Shiritori in this game is different from a normal Shiritori game.)\n\n- The first move will be made by Cat Snuke, then two players will move alternately.\n- For the first move, the player in turn has to say a word the begins with character $ 1 $. If there are no any words that begin with character $ 1 $, the player in turn loses.\n- For the rest moves, the player of that turn has to say any word that begins with the last character of the word being said in the previous move from the dictionary. If there is not any appropriate word, the player in turn loses.\n- **Any word can be said any number of times** .\n\nThere should be some dictionaries that two players can not change the result of the game even if they tried their best. For these dictionaries, in this case, we want to find out if the first player or the second player will win, or even the game will never halt.\n\nAll the words in the dictionary will be given. We can assume that the two players will try their best. Please decide if the first player (Cat Snuke) or the second player (Wolf Sothe) will win, or even the game will never halt.\n\n### Sample Explanation 1\n\n\\- For the first move, Cat Snuke has to say the first word. - For the second move, if Wolf Sothe said the 6th word, Cat Snuke will have no appropriate word to say for the next move, thus Wolf Sothe wins.\n\n### Sample Explanation 4\n\nPlease note that for the first move it is possible that there is no appropriate word that can be said.",
    "translation": "给定大小为 $n$ 的字符集和 $m$ 个单词，第 $i$ 个单词以字符 $a_i$ 开头，以字符 $b_i$ 结尾。\n\nSnuke 和 Sothe 轮流玩单词接龙游戏（Snuke 先手）。每次游戏那个人必须说出一个以上个单词的末尾字符开头的单词，第一个人必须说出一个以字符 1 开头的单词。若轮到该人进行游戏时，说不出符合条件的单词，则该人失败。\n\n假设两人绝对聪明，判断谁是胜者或者游戏会永远进行下去。\n\n$n\\le 10^5,m\\le 2\\times 10^5$"
}