{
    "description": "[problemUrl]: https://atcoder.jp/contests/code-festival-2015-okinawa-open/tasks/code_festival_2015_okinawa_c\n\n",
    "inputFormat": "Inputs will be given by standard input in following format.\n\n> $ N $ $ c_{1,\\ 1,\\ 1} $$ c_{1,\\ 1,\\ 2} $$ c_{1,\\ 1,\\ 3} $ $ c_{1,\\ 2,\\ 1} $$ c_{1,\\ 2,\\ 2} $$ c_{1,\\ 2,\\ 3} $ $ c_{1,\\ 3,\\ 1} $$ c_{1,\\ 3,\\ 2} $$ c_{1,\\ 3,\\ 3} $ $ c_{2,\\ 1,\\ 1} $$ c_{2,\\ 1,\\ 2} $$ c_{2,\\ 1,\\ 3} $ $ c_{2,\\ 2,\\ 1} $$ c_{2,\\ 2,\\ 2} $$ c_{2,\\ 2,\\ 3} $ $ c_{2,\\ 3,\\ 1} $$ c_{2,\\ 3,\\ 2} $$ c_{2,\\ 3,\\ 3} $ : $ c_{N,\\ 1,\\ 1} $$ c_{N,\\ 1,\\ 2} $$ c_{N,\\ 1,\\ 3} $ $ c_{N,\\ 2,\\ 1} $$ c_{N,\\ 2,\\ 2} $$ c_{N,\\ 2,\\ 3} $ $ c_{N,\\ 3,\\ 1} $$ c_{N,\\ 3,\\ 2} $$ c_{N,\\ 3,\\ 3} $\n\n- At the first line, an integer $ N(1≦N≦50,000) $ will be given.\n- From the second line there are $ 3N $ additional lines to give the status of an ongoing game. In these lines, from the $ 3i\\ -2_{th} $ line to the $ 3i_{th} $ line there is information about the $ i_{th} $ level (from the bottom) blocks. At the $ 3(i-1)\\ +\\ j(1≦i≦N,1≦j≦3) $ line, $ c_{i,\\ j,\\ 1} $, $ c_{i,\\ j,\\ 2} $, $ c_{i,\\ j,\\ 3} $ will be given without any separator. These are either `#` or `.`. If $ c_{i,\\ j,\\ k} $ is `#`, it means that the block that in the corresponding position (please refer to the figure below) of $ i_{th} $ level (from the bottom) has NOT been removed. If $ c_{i,\\ j,\\ k} $ is `.`, it means that the block that in the corresponding position of $ i_{th} $ level (from the bottom) has been removed.\n- If $ i(1≦i≦N) $ is odd, for $ k\\ =\\ 1,\\ 2,\\ 3 $, $ c_{i,\\ 1,\\ k}\\ =\\ c_{i,\\ 2,\\ k}\\ =\\ c_{i,\\ 3,\\ k} $.\n- If $ i(1≦i≦N) $ is even, for $ j\\ =\\ 1,\\ 2,\\ 3 $, $ c_{i,\\ j,\\ 1}\\ =\\ c_{i,\\ j,\\ 2}\\ =\\ c_{i,\\ j,\\ 3} $\n \n![sample](https://cdn.luogu.com.cn/upload/vjudge_pic/AT_code_festival_2015_okinawa_c/72a3b0060c6271982e751b31df3b69c6226b9f5f.png)The figure on the left shows the plan view of the corresponding placement of the odd-numbered level (from the bottom) blocks. The figure on the right shows the plan view of the corresponding placement of the even-numbered level (from the bottom) blocks.\n\n There is no input that has already been an **unstable placement** .",
    "outputFormat": "Please decide which player will finally win if both of them play as best as they can. If Cat Snuke wins, output `Snuke` in one line. Otherwise, if Wolf Sothe wins, output `Sothe` in one line.\n\nPrint a newline at the end of output.",
    "samples": [
        [
            "2\r\n#.#\r\n#.#\r\n#.#\r\n###\r\n###\r\n...",
            "Snuke"
        ],
        [
            "4\r\n###\r\n###\r\n###\r\n...\r\n###\r\n###\r\n##.\r\n##.\r\n##.\r\n###\r\n###\r\n###",
            "Sothe"
        ],
        [
            "4\r\n###\r\n###\r\n###\r\n...\r\n###\r\n###\r\n.#.\r\n.#.\r\n.#.\r\n###\r\n###\r\n###",
            "Sothe"
        ]
    ],
    "hint": "### Problem\n\nCat Snuke and Wolf Sothe are going to play a kind of game to celebrate the new year. There are $ N $ designed levels of blocks, on the top of the blocks there is a Daruma doll (a kind of Japanese traditional ornament). $ 2 $ players will keep removing blocks one by one alternately and keep the Daruma on the top.\n\nThe following figure shows an example of blocks, the placement of the odd-numbered level (from the bottom) blocks, and the placement of the even-numbered level (from the bottom) blocks.\n\n ![sample](https://cdn.luogu.com.cn/upload/vjudge_pic/AT_code_festival_2015_okinawa_c/619456c6753765bb289a5a073a7a9bffb529cb72.png)Here is an example of blocks (the figure on the left), the plan view of the placement of the odd-numbered level (from the bottom) blocks (the figure in the middle), and the plan view of the placement of the even-numbered level (from the bottom) blocks (the figure on the right).\n\n Cat Snuke starts first, then they repeat removing one block each time from the remaining blocks in turn (alternately). However, it is not allowed for a player to remove a block if removing this block will cause **unstable placement** of the rest blocks. Any other blocks are allowed to be removed. If there are only blocks that are not allowed to be removed, the player who is in turn loses the game.\n\n **Unstable Placement** is defined as follows: among the $ N $ level blocks there are $ 1 $ or more levels that have no block or only have $ 1 $ block on the end of either side on that level.\n\nThe status of an ongoing game will be given. Because Cat Snuke starts first, if there are even number blocks that have been removed, then the next turn is Cat Snuke’s. Otherwise, if there are odd number blocks that have been removed, the next turn is Wolf Sothe’s. Please decide which player will finally win if both of them play as best as they can.\n\n### Sample Explanation 1\n\nIf cat Snuke removes the block on the end of side that has not been removed on the 2nd level (from the bottom), Wolf Sothe will have no block that can be removed.\n\n### Sample Explanation 3\n\nPlease note that there are $ 3 $ blocks that have been removed by the input status, thus the next turn is Wolf Sothe’s.",
    "translation": "给定一个初始状态如图所示的建筑，共 $n$ 层（不包括 Daruma），自底向上编号 $1\\sim n$。\r\n\r\n下图分别表示建筑的初始状态、奇数层的放置和偶数层的放置。\r\n\r\n![](https://code-festival-2015-okinawa.contest.atcoder.jp/img/other/code_festival_2015_okinawa/vfgagrt/C1.png)\r\n\r\nSnuke 和 Sothe 轮流进行游戏，Snuke 先手，每次游戏可以拿走建筑中的任意一块砖头，但不允许拿走砖头后建筑变得**不平衡**。如果不存在砖头可以被拿走，那么该玩家输。\r\n\r\n给定一个未结束的游戏，判断两人在绝对聪明的情况下，谁是必胜者（需要根据以拿走的砖块数量确定先手）。\r\n\r\n**不平衡**的定义是，$n$层中，存在某层没有砖块，或只有一块砖且这块砖在两侧。\r\n\r\n$n\\le 50000$"
}