{
    "description": "[problemUrl]: https://atcoder.jp/contests/jag2013summer-warmingup/tasks/icpc2013summer_warmingUp_e\n\nWizard KM often forgets to close doors.  \n So he invented the magic door which opens with a magic spell and automatically closes after a while.  \n He put the doors in many places in his house, so it became very difficult to move around.  \n He wants to know the shortest time to move between two places in his house, so he cast a magic spell and summoned you, the excellent programmer.  \n KM's house consists of a matrix of square cells. A cell is one of the followings.\n\n```\n\n. empty\n# wall\n^ start\n$ goal\r\na-h\\ magic\\ circle\r\nA-H\\ magic\\ door\r\n\r\nHe\\ can\\ move\\ one\\ cell\\ to\\ its\\ 4 $-neighborhood in a second.<br></br>\nHe can move into empty cells, start, goal, magic circles, and opened magic doors.<br></br>\nThe house is surrounded by the walls, so he can't go out.<br></br>\nOn a magic circle, he can cast a magic spell by consuming arbitrary amount of MP (Magic power). This takes a second. When he uses $ x $ MP, the corresponding magic doors opens during $ x $ seconds.<br></br>\nHe can move into a door which closes at that time.<br></br>\nThere may be more than one same magic circles or same magic doors. In this case, all the corresponding magic doors opens when he cast a magic spell on any magic circles.<br></br>\nAt the beginning, his MP is $ 0 $. He can meditate at arbitrary timing and restore MP. Meditation takes a second per $ 1 $ MP. There is no upper bound of MP.<br></br>\nFind the shortest time to move from the start to the goal.<br></br>\n\n\nThe first line of the input file contains two integers $ H $ and $ W $ ($ 1\\ \\leq\\ H,\\ W\\ \\leq\\ 30 $).<br></br>\nSubsequent $ H $ lines of $ W $ characters $ \\{c_{ij}\\} $ are the map of KM's house.<br></br>\nEach character $ c_{ij} $ is one of the letters ```\n.\n```, ```\n#\n```, ```\n^\n```, ```\n$ ,\\ a-h,\\ A-H.\r\nThere\\ is\\ only\\ one\\ start\\ and\\ one\\ goal\\ in\\ the\\ map.\r\n\n\r\nOutput\\ the\\ shortest\\ time\\ by\\ the\\ second.\r\nIf\\ it\\ is\\ impossible\\ to\\ reach\\ the\\ goal,\\ output\\ -1\\ instead.\r\n\n\r\n\r\n1\\ 3\r\n^. $\n\n```\n```\n\n ```\n\n2\n```\n\n ```\n\n1 4\n^aA$ 5\r\n\r\n\n\r\n\r\n1\\ 4\r\n^aB $\n```\n\n ```\n\n-1\n```\n\n ```\n\n3 3\n^AB\na#A\nb#$\n```\n\n ```\n\n19\n```",
    "inputFormat": "",
    "outputFormat": "",
    "samples": [],
    "hint": ""
}