{
    "description": "Vova has won $ n $ trophies in different competitions. Each trophy is either golden or silver. The trophies are arranged in a row.\n\nThe beauty of the arrangement is the length of the longest subsegment consisting of golden trophies. Vova wants to swap two trophies (not necessarily adjacent ones) to make the arrangement as beautiful as possible — that means, to maximize the length of the longest such subsegment.\n\nHelp Vova! Tell him the maximum possible beauty of the arrangement if he is allowed to do at most one swap.",
    "inputFormat": "The first line contains one integer $ n $ ( $ 2 \\le n \\le 10^5 $ ) — the number of trophies.\n\nThe second line contains $ n $ characters, each of them is either G or S. If the $ i $ -th character is G, then the $ i $ -th trophy is a golden one, otherwise it's a silver trophy.",
    "outputFormat": "Print the maximum possible length of a subsegment of golden trophies, if Vova is allowed to do at most one swap.",
    "samples": [
        [
            "10\nGGGSGGGSGG\n",
            "7\n"
        ],
        [
            "4\nGGGG\n",
            "4\n"
        ],
        [
            "3\nSSS\n",
            "0\n"
        ]
    ],
    "hint": "In the first example Vova has to swap trophies with indices $ 4 $ and $ 10 $ . Thus he will obtain the sequence \"GGGGGGGSGS\", the length of the longest subsegment of golden trophies is $ 7 $ .\n\nIn the second example Vova can make no swaps at all. The length of the longest subsegment of golden trophies in the sequence is $ 4 $ .\n\nIn the third example Vova cannot do anything to make the length of the longest subsegment of golden trophies in the sequence greater than $ 0 $ .",
    "translation": "### 题目描述\n\n你现在有 $n$ 枚奖牌，每枚奖牌为金牌或银牌。这些奖牌现在按顺序排成一排。现在你可以调换任意一对奖牌的位置，求金牌最长连续段。\n\n### 输入格式\n第一行一个整数 $n$ $(2\\le n\\le 10^5)$ .\n\n第二行一行字符串，表示你的奖牌。 ( $\\texttt{G}$ 表示金牌，$\\texttt{S}$ 表示银牌)\n\n### 输出格式\n输出一个整数表示答案。"
}