{
    "description": "Alice is a big fan of volleyball and especially of the very strong \"Team A\".\n\nVolleyball match consists of up to five sets. During each set teams score one point for winning a ball. The first four sets are played until one of the teams scores at least 25 points and the fifth set is played until one of the teams scores at least 15 points. Moreover, if one of the teams scores 25 (or 15 in the fifth set) points while the other team scores 24 (or 14 in the fifth set), the set is played until the absolute difference between teams' points becomes two. The match ends when one of the teams wins three sets. The match score is the number of sets won by each team.\n\nAlice found a book containing all the results of all matches played by \"Team A\". The book is old, and some parts of the book became unreadable. Alice can not read the information on how many sets each of the teams won, she can not read the information on how many points each of the teams scored in each set, she even does not know the number of sets played in a match. The only information she has is the total number of points scored by each of the teams in all the sets during a single match.\n\nAlice wonders what is the best match score \"Team A\" could achieve in each of the matches. The bigger is the difference between the number of sets won by \"Team A\" and their opponent, the better is the match score. Find the best match score or conclude that no match could end like that. If there is a solution, then find any possible score for each set that results in the best match score.",
    "inputFormat": "The first line contains a single integer $ m $ ( $ 1 \\le m \\le 50\\,000 $ ) — the number of matches found by Alice in the book.\n\nEach of the next $ m $ lines contains two integers $ a $ and $ b $ ( $ 0 \\le a, b \\le 200 $ ) — the number of points scored by \"Team A\" and the number of points scored by their opponents respectively.",
    "outputFormat": "Output the solution for every match in the same order as they are given in the input. If the teams could not score $ a $ and $ b $ points respectively, output \"Impossible\".\n\nOtherwise, output the match score formatted as \" $ x $ : $ y $ \", where $ x $ is the number of sets won by \"Team A\" and $ y $ is the number of sets won by their opponent.\n\nThe next line should contain the set scores in the order they were played. Each set score should be printed in the same format as the match score, with $ x $ being the number of points scored by \"Team A\" in this set, and $ y $ being the number of points scored by their opponent.",
    "samples": [
        [
            "6\n75 0\n90 90\n20 0\n0 75\n78 50\n80 100\n",
            "3:0\n25:0 25:0 25:0\n3:1\n25:22 25:22 15:25 25:21\nImpossible\n0:3\n0:25 0:25 0:25\n3:0\n25:11 28:26 25:13\n3:2\n25:17 0:25 25:22 15:25 15:11\n"
        ]
    ],
    "hint": "",
    "translation": "爱丽丝是排球的忠实粉丝，特别是非常强大的“A队”。\r\n\r\n排球比赛最多由五局组成。 在每局比赛中，球队每赢一球得`1`分。 在前四局比赛中，一旦一支球队得分至少为`25`分，本局比赛结束。而第五局比赛，一旦一支球队得分至少达到`15`分，则本局比赛结束。 此外，如果其中一支球队得分为`25`（或第五局为`15`分），而另一支球队得分为`24`（或第五局为`14`），则该局将继续下去，直到球队得分之间的绝对差异变为`2`。 当其中一支球队赢得三局时，比赛结束。比赛得分是每支球队赢得的局数。\r\n\r\n爱丽丝找到了一本书，其中包含“A队”所有比赛的所有结果。这本书很旧，书的某些部分变得难以理解。 爱丽丝无法阅读有关每支球队赢了多少局的信息，她无法阅读每局中每支球队得分多少的信息，她甚至不知道某一场比赛中的打了多少局。 她拥有的唯一信息是在一场比赛中每支球队在所有局比赛中得分的总数。\r\n\r\nAlice想知道“A队”在每场比赛中可以取得的最佳比赛得分是多少。 “A队”赢得的局数与对手之间的差异越大，比赛得分越高。 找到最佳比赛分数或者得出结论：没有比赛可能会得到这样结果。 \r\n\r\n如果有多种可能方案，输出任何一种方案即可。\r\n\r\n输入格式：$m$组数据，每组两个数$a,b$。\r\n分别代表'A队'和对手得分数总和。\r\n$1≤m≤50000,0≤a,b≤200$\r\n\r\n输出格式:\r\n如果无解输出`Impossible`,否则第一行输出比赛得分，第二行依次输出每场得分。\r\n\r\n具体格式请见样例。\r\n"
}