{
    "description": "A group of $ n $ dancers rehearses a performance for the closing ceremony. The dancers are arranged in a row, they've studied their dancing moves and can't change positions. For some of them, a white dancing suit is already bought, for some of them — a black one, and for the rest the suit will be bought in the future.\n\nOn the day when the suits were to be bought, the director was told that the participants of the olympiad will be happy if the colors of the suits on the scene will form a palindrome. A palindrome is a sequence that is the same when read from left to right and when read from right to left. The director liked the idea, and she wants to buy suits so that the color of the leftmost dancer's suit is the same as the color of the rightmost dancer's suit, the 2nd left is the same as 2nd right, and so on.\n\nThe director knows how many burls it costs to buy a white suit, and how many burls to buy a black suit. You need to find out whether it is possible to buy suits to form a palindrome, and if it's possible, what's the minimal cost of doing so. Remember that dancers can not change positions, and due to bureaucratic reasons it is not allowed to buy new suits for the dancers who already have suits, even if it reduces the overall spending.",
    "inputFormat": "The first line contains three integers $ n $ , $ a $ , and $ b $ ( $ 1 \\leq n \\leq 20 $ , $ 1 \\leq a, b \\leq 100 $ ) — the number of dancers, the cost of a white suit, and the cost of a black suit.\n\nThe next line contains $ n $ numbers $ c_i $ , $ i $ -th of which denotes the color of the suit of the $ i $ -th dancer. Number $ 0 $ denotes the white color, $ 1 $ — the black color, and $ 2 $ denotes that a suit for this dancer is still to be bought.",
    "outputFormat": "If it is not possible to form a palindrome without swapping dancers and buying new suits for those who have one, then output -1. Otherwise, output the minimal price to get the desired visual effect.",
    "samples": [
        [
            "5 100 1\n0 1 2 1 2\n",
            "101\n"
        ],
        [
            "3 10 12\n1 2 0\n",
            "-1\n"
        ],
        [
            "3 12 1\n0 1 0\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample, the cheapest way to obtain palindromic colors is to buy a black suit for the third from left dancer and a white suit for the rightmost dancer.\n\nIn the second sample, the leftmost dancer's suit already differs from the rightmost dancer's suit so there is no way to obtain the desired coloring.\n\nIn the third sample, all suits are already bought and their colors form a palindrome.",
    "translation": "### 题目大意\n给你一个序列，里面的元素只能是 $0,1$ 或 $2$，$2$ 可以通过代价换成 $1$ 或者 $0$，问形成**仅包含 $0,1$** 的回文串的最小代价。\n\n### 输入格式\n第一行 $3$ 个整数 $n,a,b$，分别代表了序列长度，换成 $0$ 的代价，换成 $1$ 的代价。\n\n第二行 $n$ 个整数，表示序列。\n\n### 输出格式\n如果能构成回文串，输出最小代价，否则输出 $-1$。"
}