{
    "description": "Zeyad wants to commit $ n $ crimes in Egypt and not be punished at the end. There are several types of crimes. For example, bribery is a crime but is not considered such when repeated twice. Therefore, bribery is not considered a crime when repeated an even number of times. Speeding is a crime, but is not considered such when repeated a number of times which is a multiple of five.\n\nMore specifically, $ c $ conditions on crime repetitions are known. Each condition describes the crime type $ t_{i} $ and its multiplicity $ m_{i} $ . If the number of times Zeyad committed the crime $ t_{i} $ is a multiple of $ m_{i} $ , Zeyad will not be punished for crime $ t_{i} $ . Some crimes may be listed more than once. In this case fulfilling at least one condition for this crime is enough to not be punished for it. Of course, if for certain crime the number of times Zeyad committed it is zero, he is innocent with respect to this crime.\n\nNow Zeyad is interested in a number of ways he can commit exactly $ n $ crimes without any punishment.\n\nThe order of commiting the crimes matters. More formally, two ways, sequences $ w1 $ and $ w2 $ , of committing $ n $ crimes are equal if $ w1_{i}=w2_{i} $ , for all $ 1<=i<=n $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ c $ ( $ 0<=n<=10^{18},0<=c<=1000 $ ) — the number of crimes Zeyad would like to commit and the number of conditions he is aware of.\n\nThen the definitions for $ c $ conditions follow. There are $ 26 $ types of crimes. Each crime definition consists of crime type — a capital Latin letter — and its multiplicity.\n\nThe multiplicity of each crime is a positive integer number and the product of all multiplicities does not exceed $ 123 $ . Some conditions may be repeated in the input more than once.\n\nCrime of multiplicity $ 1 $ is not yielding any punishment regardless of the number of times it was committed. The strictness of the law is compensated by the fact that it's non-mandatory.\n\nObviously, if some crime is not listed in the set of conditions, then Zeyad will not consider it, as committing it would unavoidably lead to the punishment.\n\nPlease, do not use the %lld specificator to read or write 64-bit integers in С++. It is preferred to use the cin stream (you may also use the %I64d specificator).",
    "outputFormat": "Output the number of different ways Zeyad can commit exactly $ n $ crimes with no punishment modulo $ 12345 $ .",
    "samples": [
        [
            "5 2\nA 1\nB 2\n",
            "16\n"
        ],
        [
            "6 3\nA 1\nB 2\nC 3\n",
            "113\n"
        ],
        [
            "8 3\nA 2\nA 3\nB 2\n",
            "128\n"
        ]
    ],
    "hint": "In the first test case, the 16 ways are: AAAAA, AAABB, AABAB, AABBA, ABAAB, ABABA, ABBAA, BAAAB, BAABA, BABAA, BBAAA, ABBBB, BABBB, BBABB, BBBAB, BBBBA.",
    "translation": "有一种长度为  $n$ 的字符串，给定  $m$ 种限制，即字符 $c$ 出现的次数为  $cnt$ 的倍数，若一个字符有多种限制，则满足任意一个即可，求这种字符串有多少个，所有的  $cnt$ 相乘小于等于  $123$，答案对  $12345$ 取模。\n\n数据范围： $0\\leq n\\leq 10^{18},0\\leq c\\leq 1000$。"
}