{
    "description": "Since astronauts from BubbleCup XI mission finished their mission on the Moon and are big fans of famous singer, they decided to spend some fun time before returning to the Earth and hence created a so called \"Moonwalk challenge\" game.\n\nTeams of astronauts are given the map of craters on the Moon and direct bidirectional paths from some craters to others that are safe for \"Moonwalking\". Each of those direct paths is colored in one color and there is unique path between each two craters. Goal of the game is to find two craters such that given array of colors appears most times as continuous subarray on the path between those two craters (overlapping appearances should be counted).\n\nTo help your favorite team win, you should make a program that, given the map, answers the queries of the following type: For two craters and array of colors answer how many times given array appears as continuous subarray on the path from the first crater to the second.\n\nColors are represented as lowercase English alphabet letters.",
    "inputFormat": "In the first line, integer $ N $ $ (2 \\leq N \\leq 10^5) $ — number of craters on the Moon. Craters are numerated with numbers $ 1 $ to $ N $ .\n\nIn next $ N-1 $ lines, three values $ u, v, L $ $ (1 \\leq u, v \\leq N, L \\in \\{a, ..., z\\}) $ — denoting that there is a direct path with color $ L $ between craters $ u $ and $ v $ .\n\nNext line contains integer $ Q $ $ (1 \\leq Q \\leq 10^5) $ — number of queries.\n\nNext $ Q $ lines contain three values $ u, v $ $ (1 \\leq u, v \\leq N) $ and $ S $ $ (|S| \\leq 100) $ , where $ u $ and $ v $ are the two cratersfor which you should find how many times array of colors $ S $ (represented as string) appears on the path from $ u $ to $ v $ .",
    "outputFormat": "For each query output one number that represents number of occurrences of array S on the path from $ u $ to $ v $ .",
    "samples": [
        [
            "6\n2 3 g\n3 4 n\n5 3 o\n6 1 n\n1 2 d\n7\n1 6 n\n6 4 dg\n6 4 n\n2 5 og\n1 2 d\n6 5 go\n2 3 g\n",
            "1\n1\n2\n0\n1\n1\n1\n"
        ]
    ],
    "hint": "",
    "translation": "给你一个 $n$ 个点的树，每条边上有一个小写字母。\r\n\r\n$q$ 次询问，每次给出 $x,y$ 和串 $S$，把点 $x$ 到点 $y$ 路径的边上的字母按顺序组成一个串，问串 $S$ 在这个串里出现多少次。"
}