{
    "description": "The average miner Vaganych took refresher courses. As soon as a miner completes the courses, he should take exams. The hardest one is a computer test called \"Testing Pants for Sadness\".\n\nThe test consists of $ n $ questions; the questions are to be answered strictly in the order in which they are given, from question $ 1 $ to question $ n $ . Question $ i $ contains $ a_{i} $ answer variants, exactly one of them is correct.\n\nA click is regarded as selecting any answer in any question. The goal is to select the correct answer for each of the $ n $ questions. If Vaganych selects a wrong answer for some question, then all selected answers become unselected and the test starts from the very beginning, from question $ 1 $ again. But Vaganych remembers everything. The order of answers for each question and the order of questions remain unchanged, as well as the question and answers themselves.\n\nVaganych is very smart and his memory is superb, yet he is unbelievably unlucky and knows nothing whatsoever about the test's theme. How many clicks will he have to perform in the worst case?",
    "inputFormat": "The first line contains a positive integer $ n $ ( $ 1<=n<=100 $ ). It is the number of questions in the test. The second line contains space-separated $ n $ positive integers $ a_{i} $ ( $ 1<=a_{i}<=10^{9} $ ), the number of answer variants to question $ i $ .",
    "outputFormat": "Print a single number — the minimal number of clicks needed to pass the test it the worst-case scenario.\n\nPlease do not use the %lld specificator to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specificator.",
    "samples": [
        [
            "2\n1 1\n",
            "2"
        ],
        [
            "2\n2 2\n",
            "5"
        ],
        [
            "1\n10\n",
            "10"
        ]
    ],
    "hint": "Note to the second sample. In the worst-case scenario you will need five clicks:\n\n- the first click selects the first variant to the first question, this answer turns out to be wrong.\n- the second click selects the second variant to the first question, it proves correct and we move on to the second question;\n- the third click selects the first variant to the second question, it is wrong and we go back to question 1;\n- the fourth click selects the second variant to the first question, it proves as correct as it was and we move on to the second question;\n- the fifth click selects the second variant to the second question, it proves correct, the test is finished.",
    "translation": "有个人要做$n$ 道选择题，必须按$1\\sim n$ 的顺序答题，第$i$ 题有$a_i$ 个选项。不幸的是，这些题这个人一道也不会，只能猜选项，但是他的记忆非常好，可以记住所有题曾经的正确选项。当他做错一道题时，他就必须从$1$ 重新开始选，假设题目的正确选项不会变，在最坏的情况下，若要做对所有题，他一共选了多少次选项？\n\n$1\\leq n\\leq 100,1\\leq a_i \\leq 10^9$ \n\n你若要用C++的超长整形请用%I64d\n\n感谢@Khassar 提供的翻译"
}