{
    "description": "In Disgaea as in most role-playing games, characters have skills that determine the character's ability to use certain weapons or spells. If the character does not have the necessary skill, he cannot use it. The skill level is represented as an integer that increases when you use this skill. Different character classes are characterized by different skills.\n\nUnfortunately, the skills that are uncommon for the given character's class are quite difficult to obtain. To avoid this limitation, there is the so-called transmigration.\n\nTransmigration is reincarnation of the character in a new creature. His soul shifts to a new body and retains part of his experience from the previous life.\n\nAs a result of transmigration the new character gets all the skills of the old character and the skill levels are reduced according to the $ k $ coefficient (if the skill level was equal to $ x $ , then after transmigration it becomes equal to $ [kx] $ , where $ [y] $ is the integral part of $ y $ ). If some skill's levels are strictly less than $ 100 $ , these skills are forgotten (the character does not have them any more). After that the new character also gains the skills that are specific for his class, but are new to him. The levels of those additional skills are set to $ 0 $ .\n\nThus, one can create a character with skills specific for completely different character classes via transmigrations. For example, creating a mage archer or a thief warrior is possible.\n\nYou are suggested to solve the following problem: what skills will the character have after transmigration and what will the levels of those skills be?",
    "inputFormat": "The first line contains three numbers $ n $ , $ m $ and $ k $ — the number of skills the current character has, the number of skills specific for the class into which the character is going to transmigrate and the reducing coefficient respectively; $ n $ and $ m $ are integers, and $ k $ is a real number with exactly two digits after decimal point ( $ 1<=n,m<=20 $ , $ 0.01<=k<=0.99 $ ).\n\nThen follow $ n $ lines, each of which describes a character's skill in the form \" $ name $ $ exp $ \" — the skill's name and the character's skill level: $ name $ is a string and $ exp $ is an integer in range from $ 0 $ to $ 9999 $ , inclusive.\n\nThen follow $ m $ lines each of which contains names of skills specific for the class, into which the character transmigrates.\n\nAll names consist of lowercase Latin letters and their lengths can range from $ 1 $ to $ 20 $ characters, inclusive. All character's skills have distinct names. Besides the skills specific for the class into which the player transmigrates also have distinct names.",
    "outputFormat": "Print on the first line number $ z $ — the number of skills the character will have after the transmigration. Then print $ z $ lines, on each of which print a skill's name and level, separated by a single space. The skills should be given in the lexicographical order.",
    "samples": [
        [
            "5 4 0.75\naxe 350\nimpaler 300\nionize 80\nmegafire 120\nmagicboost 220\nheal\nmegafire\nshield\nmagicboost\n",
            "6\naxe 262\nheal 0\nimpaler 225\nmagicboost 165\nmegafire 0\nshield 0\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目大意\n### 一个角色有n种技能，并且有相应的经验水平exp，在角色死亡后，出现新的角色能继承以前角色的技能经验，但只能有k的继承效能，并且是取整的值，小于100就不能继承下来，而新的角色可以学习新的技能，但初始经验为零，问在一次轮回后该角色所拥有的技能和经验值，并按字典序输出。"
}