{
    "description": "...Once upon a time a man came to the sea. The sea was stormy and dark. The man started to call for the little mermaid to appear but alas, he only woke up Cthulhu...\n\nWhereas on the other end of the world Pentagon is actively collecting information trying to predict the monster's behavior and preparing the secret super weapon. Due to high seismic activity and poor weather conditions the satellites haven't yet been able to make clear shots of the monster. The analysis of the first shot resulted in an undirected graph with $ n $ vertices and $ m $ edges. Now the world's best minds are about to determine whether this graph can be regarded as Cthulhu or not.\n\nTo add simplicity, let's suppose that Cthulhu looks from the space like some spherical body with tentacles attached to it. Formally, we shall regard as Cthulhu such an undirected graph that can be represented as a set of three or more rooted trees, whose roots are connected by a simple cycle.\n\nIt is guaranteed that the graph contains no multiple edges and self-loops.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF103B/33dc55a8762ea9a08fee5a98be66bd3670ec0fbb.png)",
    "inputFormat": "The first line contains two integers — the number of vertices $ n $ and the number of edges $ m $ of the graph ($1 \\le n \\le 100$, $0 \\le m \\le \\frac{n(n-1)}{2}$).\n\nEach of the following $ m $ lines contains a pair of integers $ x $ and $ y $, that show that an edge exists between vertices $ x $ and $ y $ ($1 \\le x, y \\le n, x \\ne y$). For each pair of vertices there will be at most one edge between them, no edge connects a vertex to itself.",
    "outputFormat": "Print \"NO\", if the graph is not Cthulhu and \"FHTAGN!\" if it is.",
    "samples": [
        [
            "6 6\n6 3\n6 4\n5 1\n2 5\n1 4\n5 4\n",
            "FHTAGN!"
        ],
        [
            "6 5\n5 6\n4 6\n3 1\n5 1\n1 2\n",
            "NO"
        ]
    ],
    "hint": "Let us denote as a simple cycle a set of $ v $ vertices that can be numbered so that the edges will only exist between vertices number $ 1 $ and $ 2 $ , $ 2 $ and $ 3 $ , ..., $ v-1 $ and $ v $ , $ v $ and $ 1 $ .\n\nA tree is a connected undirected graph consisting of $ n $ vertices and $ n-1 $ edges ( $ n&gt;0 $ ).\n\nA rooted tree is a tree where one vertex is selected to be the root.",
    "translation": "给定一个 $n$ 个点 $m$ 条边的无向图（不一定连通），判断其是否可以表示成至少三棵有根树，且所有根通过一个简单环连接。保证给定的图无自环、无重边。"
}