{
    "description": "Monocarp has decided to buy a new TV set and hang it on the wall in his flat. The wall has enough free space so Monocarp can buy a TV set with screen width not greater than $ a $ and screen height not greater than $ b $ . Monocarp is also used to TV sets with a certain aspect ratio: formally, if the width of the screen is $ w $ , and the height of the screen is $ h $ , then the following condition should be met: $ \\frac{w}{h} = \\frac{x}{y} $ .\n\nThere are many different TV sets in the shop. Monocarp is sure that for any pair of positive integers $ w $ and $ h $ there is a TV set with screen width $ w $ and height $ h $ in the shop.\n\nMonocarp isn't ready to choose the exact TV set he is going to buy. Firstly he wants to determine the optimal screen resolution. He has decided to try all possible variants of screen size. But he must count the number of pairs of positive integers $ w $ and $ h $ , beforehand, such that $ (w \\le a) $ , $ (h \\le b) $ and $ (\\frac{w}{h} = \\frac{x}{y}) $ .\n\nIn other words, Monocarp wants to determine the number of TV sets having aspect ratio $ \\frac{x}{y} $ , screen width not exceeding $ a $ , and screen height not exceeding $ b $ . Two TV sets are considered different if they have different screen width or different screen height.",
    "inputFormat": "The first line contains four integers $ a $ , $ b $ , $ x $ , $ y $ ( $ 1 \\le a, b, x, y \\le 10^{18} $ ) — the constraints on the screen width and height, and on the aspect ratio.",
    "outputFormat": "Print one integer — the number of different variants to choose TV screen width and screen height so that they meet the aforementioned constraints.",
    "samples": [
        [
            "17 15 5 3\n",
            "3\n"
        ],
        [
            "14 16 7 22\n",
            "0\n"
        ],
        [
            "4 2 6 4\n",
            "1\n"
        ],
        [
            "1000000000000000000 1000000000000000000 999999866000004473 999999822000007597\n",
            "1000000063\n"
        ]
    ],
    "hint": "In the first example, there are $ 3 $ possible variants: $ (5, 3) $ , $ (10, 6) $ , $ (15, 9) $ .\n\nIn the second example, there is no TV set meeting the constraints.\n\nIn the third example, there is only one variant: $ (3, 2) $ .",
    "translation": "### 题目大意：\n给你$a,b,c,d$，求满足$\\frac{x}{y}=\\frac{c}{d},x\\leq a,y\\leq b$的$x,y$的对数\n\n### 输入格式：\n一行$4$个整数$a,b,c,d$\n\n### 输出格式：\n一个整数，表示满足条件的对数"
}