{
    "description": "Awruk is taking part in elections in his school. It is the final round. He has only one opponent — Elodreip. The are $ n $ students in the school. Each student has exactly $ k $ votes and is obligated to use all of them. So Awruk knows that if a person gives $ a_i $ votes for Elodreip, than he will get exactly $ k - a_i $ votes from this person. Of course $ 0 \\le k - a_i $ holds.\n\nAwruk knows that if he loses his life is over. He has been speaking a lot with his friends and now he knows $ a_1, a_2, \\dots, a_n $ — how many votes for Elodreip each student wants to give. Now he wants to change the number $ k $ to win the elections. Of course he knows that bigger $ k $ means bigger chance that somebody may notice that he has changed something and then he will be disqualified.\n\nSo, Awruk knows $ a_1, a_2, \\dots, a_n $ — how many votes each student will give to his opponent. Help him select the smallest winning number $ k $ . In order to win, Awruk needs to get strictly more votes than Elodreip.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the number of students in the school.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\leq a_i \\leq 100 $ ) — the number of votes each student gives to Elodreip.",
    "outputFormat": "Output the smallest integer $ k $ ( $ k \\ge \\max a_i $ ) which gives Awruk the victory. In order to win, Awruk needs to get strictly more votes than Elodreip.",
    "samples": [
        [
            "5\n1 1 1 5 1\n",
            "5"
        ],
        [
            "5\n2 2 3 2 2\n",
            "5"
        ]
    ],
    "hint": "In the first example, Elodreip gets $ 1 + 1 + 1 + 5 + 1 = 9 $ votes. The smallest possible $ k $ is $ 5 $ (it surely can't be less due to the fourth person), and it leads to $ 4 + 4 + 4 + 0 + 4 = 16 $ votes for Awruk, which is enough to win.\n\nIn the second example, Elodreip gets $ 11 $ votes. If $ k = 4 $ , Awruk gets $ 9 $ votes and loses to Elodreip.",
    "translation": "有两个人小A和小B参加选举，共有n个人参与投票，每人可以投k票。小A通过暗箱操作知道了每个人一定会投ai票给小B。\n他很想赢，所以决定通过操作来改变每个人可以投的票数k。问k最小为多少时，小A能获胜。\n\n输入：第一行，包含一个整数n，投票的人数。\n\t 第二行，n个整数ai，ai为第i个人投给小B的票数。\n     \n输出：仅一行，包含一个整数k，每个人可投的票数。"
}