{
    "description": "Vasya has got a robot which is situated on an infinite Cartesian plane, initially in the cell $ (0, 0) $ . Robot can perform the following four kinds of operations:\n\n- U — move from $ (x, y) $ to $ (x, y + 1) $ ;\n- D — move from $ (x, y) $ to $ (x, y - 1) $ ;\n- L — move from $ (x, y) $ to $ (x - 1, y) $ ;\n- R — move from $ (x, y) $ to $ (x + 1, y) $ .\n\nVasya also has got a sequence of $ n $ operations. Vasya wants to modify this sequence so after performing it the robot will end up in $ (x, y) $ .\n\nVasya wants to change the sequence so the length of changed subsegment is minimum possible. This length can be calculated as follows: $ maxID - minID + 1 $ , where $ maxID $ is the maximum index of a changed operation, and $ minID $ is the minimum index of a changed operation. For example, if Vasya changes RRRRRRR to RLRRLRL, then the operations with indices $ 2 $ , $ 5 $ and $ 7 $ are changed, so the length of changed subsegment is $ 7 - 2 + 1 = 6 $ . Another example: if Vasya changes DDDD to DDRD, then the length of changed subsegment is $ 1 $ .\n\nIf there are no changes, then the length of changed subsegment is $ 0 $ . Changing an operation means replacing it with some operation (possibly the same); Vasya can't insert new operations into the sequence or remove them.\n\nHelp Vasya! Tell him the minimum length of subsegment that he needs to change so that the robot will go from $ (0, 0) $ to $ (x, y) $ , or tell him that it's impossible.",
    "inputFormat": "The first line contains one integer number $ n~(1 \\le n \\le 2 \\cdot 10^5) $ — the number of operations.\n\nThe second line contains the sequence of operations — a string of $ n $ characters. Each character is either U, D, L or R.\n\nThe third line contains two integers $ x, y~(-10^9 \\le x, y \\le 10^9) $ — the coordinates of the cell where the robot should end its path.",
    "outputFormat": "Print one integer — the minimum possible length of subsegment that can be changed so the resulting sequence of operations moves the robot from $ (0, 0) $ to $ (x, y) $ . If this change is impossible, print $ -1 $ .",
    "samples": [
        [
            "5\nRURUU\n-2 3\n",
            "3\n"
        ],
        [
            "4\nRULR\n1 1\n",
            "0\n"
        ],
        [
            "3\nUUU\n100 100\n",
            "-1\n"
        ]
    ],
    "hint": "In the first example the sequence can be changed to LULUU. So the length of the changed subsegment is $ 3 - 1 + 1 = 3 $ .\n\nIn the second example the given sequence already leads the robot to $ (x, y) $ , so the length of the changed subsegment is $ 0 $ .\n\nIn the third example the robot can't end his path in the cell $ (x, y) $ .",
    "translation": "**题目描述**\n\n在平面直角坐标系中，一个机器人处于$(0,0)$点。它能进行以下的移动操作。\n\n- $U~~$ 从$(x,y)$移动到$(x,y+1)$;\n\n- $D~~$ 从$(x,y)$移动到$(x,y-1)$;\n\n- $L~~$ 从$(x,y)$移动到$(x-1,y)$;\n\n- $R~~$ 从$(x,y)$移动到$(x+1,y)$.\n\n现在有一个长度为$n$的操作序列。Vasya想修改这个序列使机器人最终移动到$(x,y)$。其修改的花费为$maxID-minID+1$。$maxID$是修改的操作的下标的最大值，$minID$是修改的操作的下标的最小值。如果没有修改，则花费为$0$。\n\n**输入数据**\n\n第一行一个整数，为$n$, $(1≤n≤2×10^5)$ 。\n\n第二行一个长度为$n$的字符串，表示原来的操作序列。\n\n第三行两个整数，为$x,y$。\n\n**输出数据**\n\n共一行，如果最后能够移动到$(x,y)$，输出最小化的花费，否则，输出$-1$。"
}