{
    "description": "There are $ n $ TV shows you want to watch. Suppose the whole time is split into equal parts called \"minutes\". The $ i $ -th of the shows is going from $ l_i $ -th to $ r_i $ -th minute, both ends inclusive.\n\nYou need a TV to watch a TV show and you can't watch two TV shows which air at the same time on the same TV, so it is possible you will need multiple TVs in some minutes. For example, if segments $ [l_i, r_i] $ and $ [l_j, r_j] $ intersect, then shows $ i $ and $ j $ can't be watched simultaneously on one TV.\n\nOnce you start watching a show on some TV it is not possible to \"move\" it to another TV (since it would be too distracting), or to watch another show on the same TV until this show ends.\n\nThere is a TV Rental shop near you. It rents a TV for $ x $ rupees, and charges $ y $ ( $ y < x $ ) rupees for every extra minute you keep the TV. So in order to rent a TV for minutes $ [a; b] $ you will need to pay $ x + y \\cdot (b - a) $ .\n\nYou can assume, that taking and returning of the TV doesn't take any time and doesn't distract from watching other TV shows. Find the minimum possible cost to view all shows. Since this value could be too large, print it modulo $ 10^9 + 7 $ .",
    "inputFormat": "The first line contains integers $ n $ , $ x $ and $ y $ ( $ 1 \\le n \\le 10^5 $ , $ 1 \\le y < x \\le 10^9 $ ) — the number of TV shows, the cost to rent a TV for the first minute and the cost to rent a TV for every subsequent minute.\n\nEach of the next $ n $ lines contains two integers $ l_i $ and $ r_i $ ( $ 1 \\le l_i \\le r_i \\le 10^9 $ ) denoting the start and the end minute of the $ i $ -th TV show.",
    "outputFormat": "Print exactly one integer — the minimum cost to view all the shows taken modulo $ 10^9 + 7 $ .",
    "samples": [
        [
            "5 4 3\n1 2\n4 10\n2 4\n10 11\n5 9\n",
            "60"
        ],
        [
            "6 3 2\n8 20\n6 22\n4 15\n20 28\n17 25\n20 27\n",
            "142"
        ],
        [
            "2 1000000000 2\n1 2\n2 3\n",
            "999999997"
        ]
    ],
    "hint": "In the first example, the optimal strategy would be to rent $ 3 $ TVs to watch:\n\n- Show $ [1, 2] $ on the first TV,\n- Show $ [4, 10] $ on the second TV,\n- Shows $ [2, 4], [5, 9], [10, 11] $ on the third TV.\n\nThis way the cost for the first TV is $ 4 + 3 \\cdot (2 - 1) = 7 $ , for the second is $ 4 + 3 \\cdot (10 - 4) = 22 $ and for the third is $ 4 + 3 \\cdot (11 - 2) = 31 $ , which gives $ 60 $ int total.\n\nIn the second example, it is optimal watch each show on a new TV.\n\nIn third example, it is optimal to watch both shows on a new TV. Note that the answer is to be printed modulo $ 10^9 + 7 $ .",
    "translation": "有 $n$ 个区间 $[l_i,\\ r_i]$，现在要把区间分为 $m$ 组（$m$ 为 $[1,\\ n]$ 中的整数，任意选定），满足每组的区间互不相交。设在某一组的区间中，最小的 $l_i$ 等于 $a$，最大的 $r_i$ 等于 $b$，则该组的花费为 $x + y \\times (b - a)$。求最小总花费，答案对 $10^9 + 7$ 取模。"
}