{
    "description": "The heat during the last few days has been really intense. Scientists from all over the Berland study how the temperatures and weather change, and they claim that this summer is abnormally hot. But any scientific claim sounds a lot more reasonable if there are some numbers involved, so they have decided to actually calculate some value which would represent how high the temperatures are.\n\nMathematicians of Berland State University came up with a special heat intensity value. This value is calculated as follows:\n\nSuppose we want to analyze the segment of $ n $ consecutive days. We have measured the temperatures during these $ n $ days; the temperature during $ i $ -th day equals $ a_i $ .\n\nWe denote the average temperature of a segment of some consecutive days as the arithmetic mean of the temperature measures during this segment of days. So, if we want to analyze the average temperature from day $ x $ to day $ y $ , we calculate it as $ \\frac{\\sum \\limits_{i = x}^{y} a_i}{y - x + 1} $ (note that division is performed without any rounding). The heat intensity value is the maximum of average temperatures over all segments of not less than $ k $ consecutive days. For example, if analyzing the measures $ [3, 4, 1, 2] $ and $ k = 3 $ , we are interested in segments $ [3, 4, 1] $ , $ [4, 1, 2] $ and $ [3, 4, 1, 2] $ (we want to find the maximum value of average temperature over these segments).\n\nYou have been hired by Berland State University to write a program that would compute the heat intensity value of a given period of days. Are you up to this task?",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1 \\le k \\le n \\le 5000 $ ) — the number of days in the given period, and the minimum number of days in a segment we consider when calculating heat intensity value, respectively.\n\nThe second line contains $ n $ integers $ a_1 $ , $ a_2 $ , ..., $ a_n $ ( $ 1 \\le a_i \\le 5000 $ ) — the temperature measures during given $ n $ days.",
    "outputFormat": "Print one real number — the heat intensity value, i. e., the maximum of average temperatures over all segments of not less than $ k $ consecutive days.\n\nYour answer will be considered correct if the following condition holds: $ |res - res_0| < 10^{-6} $ , where $ res $ is your answer, and $ res_0 $ is the answer given by the jury's solution.",
    "samples": [
        [
            "4 3\n3 4 1 2\n",
            "2.666666666666667\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个含有 $n$ 个数的数组，以及 $k$，求所有长度大于等于 $k$ 的子串的平均数最大值。\n\n### 输入格式\n\n第一行两个整数，表示 $n$ 和 $k$。\n\n第二行 $n$ 个整数，表示给定的数组 $a_1,a_2,...,a_n$。\n\n### 输出格式\n\n一行一个小数（保留到小数点后至少 6 位），表示答案。"
}