{
    "description": "You have $ n $ sticks of the given lengths.\n\nYour task is to choose exactly four of them in such a way that they can form a rectangle. No sticks can be cut to pieces, each side of the rectangle must be formed by a single stick. No stick can be chosen multiple times. It is guaranteed that it is always possible to choose such sticks.\n\nLet $ S $ be the area of the rectangle and $ P $ be the perimeter of the rectangle.\n\nThe chosen rectangle should have the value $ \\frac{P^2}{S} $ minimal possible. The value is taken without any rounding.\n\nIf there are multiple answers, print any of them.\n\nEach testcase contains several lists of sticks, for each of them you are required to solve the problem separately.",
    "inputFormat": "The first line contains a single integer $ T $ ( $ T \\ge 1 $ ) — the number of lists of sticks in the testcase.\n\nThen $ 2T $ lines follow — lines $ (2i - 1) $ and $ 2i $ of them describe the $ i $ -th list. The first line of the pair contains a single integer $ n $ ( $ 4 \\le n \\le 10^6 $ ) — the number of sticks in the $ i $ -th list. The second line of the pair contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_j \\le 10^4 $ ) — lengths of the sticks in the $ i $ -th list.\n\nIt is guaranteed that for each list there exists a way to choose four sticks so that they form a rectangle.\n\nThe total number of sticks in all $ T $ lists doesn't exceed $ 10^6 $ in each testcase.",
    "outputFormat": "Print $ T $ lines. The $ i $ -th line should contain the answer to the $ i $ -th list of the input. That is the lengths of the four sticks you choose from the $ i $ -th list, so that they form a rectangle and the value $ \\frac{P^2}{S} $ of this rectangle is minimal possible. You can print these four lengths in arbitrary order.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "3\n4\n7 2 2 7\n8\n2 8 1 4 8 2 1 5\n5\n5 5 5 5 5\n",
            "2 7 7 2\n2 2 1 1\n5 5 5 5\n"
        ]
    ],
    "hint": "There is only one way to choose four sticks in the first list, they form a rectangle with sides $ 2 $ and $ 7 $ , its area is $ 2 \\cdot 7 = 14 $ , perimeter is $ 2(2 + 7) = 18 $ . $ \\frac{18^2}{14} \\approx 23.143 $ .\n\nThe second list contains subsets of four sticks that can form rectangles with sides $ (1, 2) $ , $ (2, 8) $ and $ (1, 8) $ . Their values are $ \\frac{6^2}{2} = 18 $ , $ \\frac{20^2}{16} = 25 $ and $ \\frac{18^2}{8} = 40.5 $ , respectively. The minimal one of them is the rectangle $ (1, 2) $ .\n\nYou can choose any four of the $ 5 $ given sticks from the third list, they will form a square with side $ 5 $ , which is still a rectangle with sides $ (5, 5) $ .",
    "translation": "你有 $n$ 根给定长度的木棍。\n\n你的任务是从它们中选择恰好四根木棍使得其能形成一个矩形。木棍不能被切割。矩形的每一条边都只能使用一根木棍。一根木棍只能被使用一次。保证方案存在。\n\n$S$ 表示矩形的面积， $P$ 表示矩形的周长。\n\n形成的矩形应使 $\\frac{P^2}{S}$ 尽可能小。该值没有任何舍入。\n\n如有多种答案，任意输出其中一种。\n\n单个测试样例中有多组测试数据。"
}