{
    "description": "You are given a tree (an undirected connected graph without cycles) and an integer $ s $ .\n\nVanya wants to put weights on all edges of the tree so that all weights are non-negative real numbers and their sum is $ s $ . At the same time, he wants to make the diameter of the tree as small as possible.\n\nLet's define the diameter of a weighed tree as the maximum sum of the weights of the edges lying on the path between two some vertices of the tree. In other words, the diameter of a weighed tree is the length of the longest simple path in the tree, where length of a path is equal to the sum of weights over all edges in the path.\n\nFind the minimum possible diameter that Vanya can get.",
    "inputFormat": "The first line contains two integer numbers $ n $ and $ s $ ( $ 2 \\leq n \\leq 10^5 $ , $ 1 \\leq s \\leq 10^9 $ ) — the number of vertices in the tree and the sum of edge weights.\n\nEach of the following $ n−1 $ lines contains two space-separated integer numbers $ a_i $ and $ b_i $ ( $ 1 \\leq a_i, b_i \\leq n $ , $ a_i \\neq b_i $ ) — the indexes of vertices connected by an edge. The edges are undirected.\n\nIt is guaranteed that the given edges form a tree.",
    "outputFormat": "Print the minimum diameter of the tree that Vanya can get by placing some non-negative real weights on its edges with the sum equal to $ s $ .\n\nYour answer will be considered correct if its absolute or relative error does not exceed $ 10^{-6} $ .\n\nFormally, let your answer be $ a $ , and the jury's answer be $ b $ . Your answer is considered correct if $ \\frac {|a-b|} {max(1, b)} \\leq 10^{-6} $ .",
    "samples": [
        [
            "4 3\n1 2\n1 3\n1 4\n",
            "2.000000000000000000"
        ],
        [
            "6 1\n2 1\n2 3\n2 5\n5 4\n5 6\n",
            "0.500000000000000000"
        ],
        [
            "5 5\n1 2\n2 3\n3 4\n3 5\n",
            "3.333333333333333333"
        ]
    ],
    "hint": "In the first example it is necessary to put weights like this:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1085D/c1a70d116ee899735bc4ecf7ff6c6bf75b292051.png)It is easy to see that the diameter of this tree is $ 2 $ . It can be proved that it is the minimum possible diameter.\n\nIn the second example it is necessary to put weights like this:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1085D/7a6a70a648e37d9e55f1bb9aed6b2be7637ee566.png)",
    "translation": "给你一棵N个点的树，和一个正整数s。\r\n\r\n现在让你在这棵树上给N-1条边分配边权，使得这棵树的直径最小。\r\n\r\n输出最小的直径。\r\n\r\n保证2<=n<=100000,1<=s<=10^9。\r\n\r\n你的答案是正确的当且仅当与标准答案的绝对误差或相对误差不超过10^-6。"
}