{
    "description": "Arkady's morning seemed to be straight of his nightmare. He overslept through the whole morning and, still half-asleep, got into the tram that arrived the first. Some time after, leaving the tram, he realized that he was not sure about the line number of the tram he was in.\n\nDuring his ride, Arkady woke up several times and each time he saw the tram stopping at some stop. For each stop he knows which lines of tram stop there. Given this information, can you help Arkady determine what are the possible lines of the tram he was in?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 100 $ ) — the number of stops Arkady saw.\n\nThe next $ n $ lines describe the stops. Each of them starts with a single integer $ r $ ( $ 1 \\le r \\le 100 $ ) — the number of tram lines that stop there. $ r $ distinct integers follow, each one between $ 1 $ and $ 100 $ , inclusive, — the line numbers. They can be in arbitrary order.\n\nIt is guaranteed that Arkady's information is consistent, i.e. there is at least one tram line that Arkady could take.",
    "outputFormat": "Print all tram lines that Arkady could be in, in arbitrary order.",
    "samples": [
        [
            "3\n3 1 4 6\n2 1 4\n5 10 5 6 4 1\n",
            "1 4 \n"
        ],
        [
            "5\n1 1\n10 10 9 8 7 100 5 4 3 99 1\n5 1 2 3 4 5\n5 4 1 3 2 5\n4 10 1 5 3\n",
            "1 \n"
        ]
    ],
    "hint": "Consider the first example. Arkady woke up three times. The first time he saw a stop with lines $ 1 $ , $ 4 $ , $ 6 $ . The second time he saw a stop with lines $ 1 $ , $ 4 $ . The third time he saw a stop with lines $ 10 $ , $ 5 $ , $ 6 $ , $ 4 $ and $ 1 $ . He can be in a tram of one of two lines: $ 1 $ or $ 4 $ .",
    "translation": "### 题目描述\n\nArkady半梦半醒坐上了一趟电车，在他下了电车后，发现他不知道自己坐的是几号电车。\n\n在他的旅程中，他醒了几次，每次都看到电车停靠在某个站点，并且他知道在这个站点停靠的电车都有哪些。\n\n他想让你帮他确认他可能坐的是几号电车。\n\n### 输入格式:\n\n第一行一个$n$（$1\\le n\\le 100$），他一共看到停靠了几次。\n\n以下$n$行，每行第一个数$r$（$1\\le r\\le 100$）,表示在该站点停靠的电车有多少个。\n\n接下来的$r$个数，表示在该站点停靠的电车编号。\n\n电车编号在$1$到$100$之间。\n\n### 输出格式\n\n以任意顺序输出他所有可能乘坐的电车编号。"
}