{
    "description": "Alice has written a program and now tries to improve its readability. One of the ways to improve readability is to give sensible names to the variables, so now Alice wants to rename some variables in her program. In her IDE there is a command called \"massive refactoring\", which can replace names of many variable in just one run. To use it, Alice needs to select two strings $ s $ and $ t $ and after that for each variable the following algorithm is performed: if the variable's name contains $ s $ as a substring, then the first (and only first) occurrence of $ s $ is replaced with $ t $ . If the name doesn't contain $ s $ , then this variable's name stays the same.\n\nThe list of variables is known and for each variable both the initial name and the name Alice wants this variable change to are known. Moreover, for each variable the lengths of the initial name and the target name are equal (otherwise the alignment of the code could become broken). You need to perform renaming of all variables in exactly one run of the massive refactoring command or determine that it is impossible.",
    "inputFormat": "The first line contains the only integer $ n $ ( $ 1 \\le n \\le 3000 $ ) — the number of variables in Alice's program.\n\nThe following $ n $ lines contain the initial names of variables $ w_1, w_2, \\ldots, w_n $ , one per line. After that, $ n $ more lines go, the $ i $ -th of them contains the target name $ w'_i $ for the $ i $ -th variable. It is guaranteed that $ 1 \\le |w_i| = |w'_i| \\le 3000 $ .\n\nIt is guaranteed that there is at least one variable having its target name different from the initial name. Both initial and target names consist of lowercase English letters only. For each variable the length of its initial name is equal to the length of its target name.",
    "outputFormat": "If it is impossible to rename all variables with one call of \"massive refactoring\", print \"NO\" (quotes for clarity).\n\nOtherwise, on the first line print \"YES\" (quotes for clarity) and on the following lines print $ s $ and $ t $ ( $ 1 \\le |s|, |t| \\le 5000 $ ), which should be used for replacement. Strings $ s $ and $ t $ should consist only of lowercase letters of English alphabet.\n\nIf there are multiple ways to perform a \"massive refactoring\", you can use any of them.",
    "samples": [
        [
            "1\ntopforces\ncodecoder\n",
            "YES\ntopforces\ncodecoder\n"
        ],
        [
            "3\nbab\ncac\ncdc\nbdb\ncdc\ncdc\n",
            "YES\na\nd\n"
        ],
        [
            "2\nyou\nshal\nnot\npass\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "## 题意简述\n\n给定 $n$ 个初始字符串与 $n$ 个目标字符串，问是否能找到字符串 $s,t$ ，使得将所有初始字符串中第一次出现的 $s$ 替换为 $t$ 后（如果没有 $s$ 则保持不变），所有的初始串变成目标串。\n\n## 输入格式\n\n第一行一个整数 $n$ ， 表示有 $n$ 个这样的字符串。\n\n接下来 $n$ 行里，第 $i$ 行表示第 $i$ 个初始字符串。\n\n接下来 $n$ 行里，第 $i$ 行表示第 $i$ 个目标字符串。\n\n保证对应的初始串与目标串长度一致。\n\n## 输入格式\n\n如果没有这样的 $s,t$ 输出 `NO` 。\n\n否则先一行输出 `YES` ， 接着分两行输出 $s,t$ 。"
}