{
    "description": "Palo Alto is an unusual city because it is an endless coordinate line. It is also known for the office of Lyft Level 5.\n\nLyft has become so popular so that it is now used by all $ m $ taxi drivers in the city, who every day transport the rest of the city residents — $ n $ riders.\n\nEach resident (including taxi drivers) of Palo-Alto lives in its unique location (there is no such pair of residents that their coordinates are the same).\n\nThe Lyft system is very clever: when a rider calls a taxi, his call does not go to all taxi drivers, but only to the one that is the closest to that person. If there are multiple ones with the same distance, then to taxi driver with a smaller coordinate is selected.\n\nBut one morning the taxi drivers wondered: how many riders are there that would call the given taxi driver if they were the first to order a taxi on that day? In other words, you need to find for each taxi driver $ i $ the number $ a_{i} $ — the number of riders that would call the $ i $ -th taxi driver when all drivers and riders are at their home?\n\nThe taxi driver can neither transport himself nor other taxi drivers.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n,m \\le 10^5 $ ) — number of riders and taxi drivers.\n\nThe second line contains $ n + m $ integers $ x_1, x_2, \\ldots, x_{n+m} $ ( $ 1 \\le x_1 < x_2 < \\ldots < x_{n+m} \\le 10^9 $ ), where $ x_i $ is the coordinate where the $ i $ -th resident lives.\n\nThe third line contains $ n + m $ integers $ t_1, t_2, \\ldots, t_{n+m} $ ( $ 0 \\le t_i \\le 1 $ ). If $ t_i = 1 $ , then the $ i $ -th resident is a taxi driver, otherwise $ t_i = 0 $ .\n\nIt is guaranteed that the number of $ i $ such that $ t_i = 1 $ is equal to $ m $ .",
    "outputFormat": "Print $ m $ integers $ a_1, a_2, \\ldots, a_{m} $ , where $ a_i $ is the answer for the $ i $ -th taxi driver. The taxi driver has the number $ i $ if among all the taxi drivers he lives in the $ i $ -th smallest coordinate (see examples for better understanding).",
    "samples": [
        [
            "3 1\n1 2 3 10\n0 0 1 0\n",
            "3 "
        ],
        [
            "3 2\n2 3 4 5 6\n1 0 0 0 1\n",
            "2 1 "
        ],
        [
            "1 4\n2 4 6 10 15\n1 1 1 1 0\n",
            "0 0 0 1 "
        ]
    ],
    "hint": "In the first example, we have only one taxi driver, which means an order from any of $ n $ riders will go to him.\n\nIn the second example, the first taxi driver lives at the point with the coordinate $ 2 $ , and the second one lives at the point with the coordinate $ 6 $ . Obviously, the nearest taxi driver to the rider who lives on the $ 3 $ coordinate is the first one, and to the rider who lives on the coordinate $ 5 $ is the second one. The rider who lives on the $ 4 $ coordinate has the same distance to the first and the second taxi drivers, but since the first taxi driver has a smaller coordinate, the call from this rider will go to the first taxi driver.\n\nIn the third example, we have one rider and the taxi driver nearest to him is the fourth one.",
    "translation": "【题面】\r\n\r\n在一个数轴上有 $m$ 个司机和 $n$ 个乘客\r\n\r\n每当一个乘客叫车时，距离他最近的司机会前往他所在处，如果有多个同样的最短距离的司机，坐标最小的会前往他所在处\r\n\r\n你需要求出 $a_i$ ，表示有多少乘客（假设他最早叫车）会叫坐标第 $i$ 小的司机\r\n\r\n司机不能叫车\r\n\r\n【输入】\r\n\r\n第一行两个整数 $n,m(1\\le n,m\\le 10^5)$，表示乘客和司机数量\r\n\r\n第二行 $n+m$ 个整数 $x_1,x_2,\\dots,x_{n+m}$，表示第 $i$ 个人的坐标\r\n\r\n第三行 $n+m$ 个整数 $t_1,t_2,\\dots,t_{n+m}$ 若 $t_i$ 为 $0$ 则第 $i$ 个人为乘客，否则为司机\r\n\r\n【输出】\r\n\r\n一行 $m$ 个整数，$a_1,a_2,\\dots,a_n$"
}