{
    "description": "Alice and Bob play a game on a grid with $ n $ rows and infinitely many columns. In each row, there are three tokens, blue, white and red one. Before the game starts and after every move, the following two conditions must hold:\n\n- Any two tokens are not in the same cell.\n- In each row, the blue token is to the left of the white token, and the red token is to the right of the white token.\n\nFirst, they pick a positive integer $ f $ , whose value is valid for the whole game. Second, the starting player is chosen and makes his or her first turn. Then players take alternating turns. The player who is unable to make a move loses.\n\nDuring a move, a player first selects an integer $ k $ that is either a prime number or a product of two (not necessarily distinct) primes. The smallest possible values of $ k $ are thus $ 2, 3, 4, 5, 6, 7, 9, 10, 11, 13, 14, 15, 17, 19, \\dots $ . Furthermore, $ k $ must not be equal to the previously picked integer $ f $ . Each turn, a move is performed in exactly one of the rows.\n\nIf it is Alice's turn, she chooses a single blue token and moves it $ k $ cells to the right. Alternatively, she may move both the blue and the white token in the same row by the same amount $ k $ to the right.\n\nOn the other hand, Bob selects a single red token and moves it $ k $ cells to the left. Similarly, he may also move the white and the red token in the corresponding row by $ k $ to the left.\n\nNote that Alice may never move a red token, while Bob may never move a blue one. Remember that after a move, the two conditions on relative positions of the tokens must still hold.\n\nBoth players play optimally. Given the initial state of the board, determine who wins for two games: if Alice starts and if Bob starts.",
    "inputFormat": "The first line contains a two integers $ n $ and $ f $ ( $ 1 \\leq n \\leq 10^5 $ , $ 2 \\leq f \\leq 2 \\cdot 10^5 $ ) — the number of rows and the forbidden move, respectively.\n\nEach of the next $ n $ lines contains three integers $ b_i $ , $ w_i $ , $ r_i $ ( $ -10^5 \\leq b_i < w_i < r_i \\leq 10^5 $ ) — the number of column in which the blue, white and red token lies in the $ i $ -th row, respectively.",
    "outputFormat": "Output two lines.\n\nThe first line should contain the name of the winner when Alice starts, and the second line should contain the name of the winner when Bob starts.",
    "samples": [
        [
            "1 6\n0 3 9\n",
            "Alice\nBob\n"
        ],
        [
            "1 2\n0 3 9\n",
            "Alice\nBob\n"
        ],
        [
            "10 133\n-248 -193 -187\n97 101 202\n-72 67 91\n23 89 215\n-129 -108 232\n-223 -59 236\n-99 86 242\n-137 -109 -45\n-105 173 246\n-44 228 243\n",
            "Bob\nAlice\n"
        ]
    ],
    "hint": "The first example is as follows:\n\nWhen Alice starts, she can win by moving the blue and white token to right by $ 2 $ cells, getting into position $ 2~5~9 $ . Regardless of what Bob does, Alice will have one more move and then the game is over. For instance, he can move both the red and white token by $ 2 $ cells to the left, reaching state $ 2~3~7 $ . Alice can then move blue and white token by $ 2 $ to move into $ 4~5~7 $ , where no more moves are possible.\n\nIf Bob starts, he gains enough advantage to win. For instance, he may move the red token by $ 3 $ to the left, getting into position $ 0~3~6 $ . Alice can, for example, move the blue token by $ 2 $ , which is countered by Bob by moving the red token by $ 2 $ . The game ends in position $ 2~3~4 $ .\n\nIn the second example, it is forbidden to move by $ 2 $ , but this doesn't stop Alice from winning! She can move the blue and white token by $ 4 $ , getting into position $ 4~7~9 $ . Now Bob has no move, since moving by $ 2 $ is forbidden.",
    "translation": "Alice和Bob玩游戏。给定$n,f$，表示有$n$行的棋盘，每行有三个棋子。Alice每次可以选择一行将该行左边的一个或两个棋子往右移动$d$步，Bob每次可以选择一行将该行右边的一个或两个棋子往左移动$d$步。\r\n\r\n要求移动时一个棋子不能跨越另一个棋子，且$d$是质数或两个质数的乘积，且$d\\neq f$。求出Alice和Bob分别作为先手时，谁能赢。\r\n\r\n$n\\leq10^5$，坐标绝对值$\\leq10^5$。"
}