{
    "description": "You are given a straight half-line divided into segments of unit length, which we will call positions. The positions are numbered by positive integers that start with $ 1 $ from the end of half-line, i. e. $ 1 $ , $ 2 $ , $ 3 $ and so on. The distance between the positions is the absolute difference between the respective numbers.\n\nLaharl, Etna and Flonne occupy some positions on the half-line and they want to get to the position with the largest possible number. They are originally placed in different positions.\n\nEach of the characters can perform each of the following actions no more than once:\n\n- Move a certain distance.\n- Grab another character and lift him above the head.\n- Throw the lifted character a certain distance.\n\nEach character has a movement range parameter. They can only move to free positions, assuming that distance between those positions doesn't exceed the movement range.\n\nOne character can lift another character if the distance between the two characters equals $ 1 $ , and no one already holds that another character. We can assume that the lifted character moves to the same position as the person who has lifted him, and the position in which he stood before becomes free. A lifted character cannot perform any actions and the character that holds him cannot walk.\n\nAlso, each character has a throwing range parameter. It is the distance at which this character can throw the one lifted above his head. He can only throw a character to a free position, and only when there is a lifted character.\n\nWe accept the situation when one person grabs another one who in his turn has the third character in his hands. This forms a \"column\" of three characters. For example, Laharl can hold Etna while Etna holds Flonne. In this case, Etna and the Flonne cannot perform any actions, and Laharl can only throw Etna (together with Flonne) at some distance.\n\nLaharl, Etna and Flonne perform actions in any order. They perform actions in turns, that is no two of them can do actions at the same time.\n\nDetermine the maximum number of position at least one of the characters can reach. That is, such maximal number $ x $ so that one of the characters can reach position $ x $ .",
    "inputFormat": "The first line contains three integers: Laharl's position, his movement range and throwing range. The second and the third lines describe Etna's and Flonne's parameters correspondingly in the similar form. It is guaranteed that the three characters occupy distinct positions. All numbers in the input are between $ 1 $ and $ 10 $ , inclusive.",
    "outputFormat": "Print a single number — the maximum ordinal number of position which either Laharl, Etna or Flonne can reach.",
    "samples": [
        [
            "9 3 3\n4 3 1\n2 3 3\n",
            "15"
        ]
    ],
    "hint": "Let us explain how to reach position $ 15 $ in the sample.\n\nInitially Laharl occupies position $ 9 $ , Etna — position $ 4 $ and Flonne — position $ 2 $ .\n\nFirst Laharl moves to position $ 6 $ .\n\nThen Flonne moves to position $ 5 $ and grabs Etna.\n\nLaharl grabs Flonne and throws to position $ 9 $ .\n\nFlonne throws Etna to position $ 12 $ .\n\nEtna moves to position $ 15 $ .",
    "translation": "### 题意\n3个朋友在玩一个游戏。他们站在标号从$1$  到$+∞$  的射线上，且一开始位置不相同，他们的目标是让其中一个人到达标号尽可能大的地方。\n\n现在有三种操作，这三种操作每个人只能执行最多一次。\n\n1. $move$  :移动一定的距离\n2. $lift$  :举起一个人\n3. $throw$  :将举起的人投出去\n\n对于$move$   操作，每个人可以移动到一个没有人的地方，并且这个地方距离原位置不超过移动者的 $movement\\ range$  。\n\n对于$lift$  操作，对于距离为$1$  的A，B两个人，若B没有被举起，则A可以举起B，然后B移动到A的位置上。**正被举起的人不可以进行任何操作，举起别人的人不可以$move$  **。\n\n对于$throw$  操作，一个正举起别人的人，可以将被举起的人投到一个没有人的地方，并且这个地方距离原位置不超过投掷者的$throwing\\ range$  。\n\n**※根据规则，可以存在A举起B而B举起C的情况，这种情况下只有A可以进行操作**\n\n现在分别给出$3$  个人的初始位置，$movement\\ range$  和$throwing\\ range$  ，问他们能到达的最远位置是多少？\n\n### 输入\n三行，每行三个正整数，第$i$  行的数表示第$i$  个人的初始位置、移动距离上限以及投掷距离上限，这些数都不超过$10$  。\n### 输出\n一个整数，表示他们中的某一个人能到达的最远距离\n\n感谢@C20191629 提供的翻译"
}