{
    "description": "Innopolis University scientists continue to investigate the periodic table. There are $ n·m $ known elements and they form a periodic table: a rectangle with $ n $ rows and $ m $ columns. Each element can be described by its coordinates $ (r,c) $ ( $ 1<=r<=n $ , $ 1<=c<=m $ ) in the table.\n\nRecently scientists discovered that for every four different elements in this table that form a rectangle with sides parallel to the sides of the table, if they have samples of three of the four elements, they can produce a sample of the fourth element using nuclear fusion. So if we have elements in positions $ (r_{1},c_{1}) $ , $ (r_{1},c_{2}) $ , $ (r_{2},c_{1}) $ , where $ r_{1}≠r_{2} $ and $ c_{1}≠c_{2} $ , then we can produce element $ (r_{2},c_{2}) $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1012B/a1ec2b34980f17dea8ef9d5c32f5d591ae712bba.png)Samples used in fusion are not wasted and can be used again in future fusions. Newly crafted elements also can be used in future fusions.\n\nInnopolis University scientists already have samples of $ q $ elements. They want to obtain samples of all $ n·m $ elements. To achieve that, they will purchase some samples from other laboratories and then produce all remaining elements using an arbitrary number of nuclear fusions in some order. Help them to find the minimal number of elements they need to purchase.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ , $ q $ ( $ 1<=n,m<=200000 $ ; $ 0<=q<=min(n·m,200000) $ ), the chemical table dimensions and the number of elements scientists already have.\n\nThe following $ q $ lines contain two integers $ r_{i} $ , $ c_{i} $ ( $ 1<=r_{i}<=n $ , $ 1<=c_{i}<=m $ ), each describes an element that scientists already have. All elements in the input are different.",
    "outputFormat": "Print the minimal number of elements to be purchased.",
    "samples": [
        [
            "2 2 3\n1 2\n2 2\n2 1\n",
            "0\n"
        ],
        [
            "1 5 3\n1 3\n1 1\n1 5\n",
            "2\n"
        ],
        [
            "4 3 6\n1 2\n1 3\n2 2\n2 3\n3 1\n3 3\n",
            "1\n"
        ]
    ],
    "hint": "For each example you have a picture which illustrates it.\n\nThe first picture for each example describes the initial set of element samples available. Black crosses represent elements available in the lab initially.\n\nThe second picture describes how remaining samples can be obtained. Red dashed circles denote elements that should be purchased from other labs (the optimal solution should minimize the number of red circles). Blue dashed circles are elements that can be produced with nuclear fusion. They are numbered in order in which they can be produced.\n\nTest 1\n\nWe can use nuclear fusion and get the element from three other samples, so we don't need to purchase anything.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1012B/d0188b7b484eed4ec50dd63bc64a04ce06b65611.png)Test 2\n\nWe cannot use any nuclear fusion at all as there is only one row, so we have to purchase all missing elements.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1012B/ba8b5c94cc17a4604dd0e58fb6a66f6e2487526e.png)Test 3\n\nThere are several possible solutions. One of them is illustrated below.\n\nNote that after purchasing one element marked as red it's still not possible to immidiately produce the middle element in the bottom row (marked as 4). So we produce the element in the left-top corner first (marked as 1), and then use it in future fusions.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1012B/5273513fe4bf0485a76591391c8b08a7edf8e9af.png)",
    "translation": "给你一个n*m的矩形，一开始有q个格子上被标记。对于任意两行两列，如果交汇的四个格子中有三个被标记，那么第4个会被自动标记。问你至少需要手动标记几个格子，使得整个矩形内的格子都被标记。"
}