{
    "description": "Vasya had an array of $ n $ integers, each element of the array was from $ 1 $ to $ n $ . He chose $ m $ pairs of different positions and wrote them down to a sheet of paper. Then Vasya compared the elements at these positions, and wrote down the results of the comparisons to another sheet of paper. For each pair he wrote either \"greater\", \"less\", or \"equal\".\n\nAfter several years, he has found the first sheet of paper, but he couldn't find the second one. Also he doesn't remember the array he had. In particular, he doesn't remember if the array had equal elements. He has told this sad story to his informatics teacher Dr Helen.\n\nShe told him that it could be the case that even if Vasya finds his second sheet, he would still not be able to find out whether the array had two equal elements.\n\nNow Vasya wants to find two arrays of integers, each of length $ n $ . All elements of the first array must be distinct, and there must be two equal elements in the second array. For each pair of positions Vasya wrote at the first sheet of paper, the result of the comparison must be the same for the corresponding elements of the first array, and the corresponding elements of the second array.\n\nHelp Vasya find two such arrays of length $ n $ , or find out that there are no such arrays for his sets of pairs.",
    "inputFormat": "The first line of input contains two integers $ n $ , $ m $ — the number of elements in the array and number of comparisons made by Vasya ( $ 1 \\le n \\le 100\\,000 $ , $ 0 \\le m \\le 100\\,000 $ ).\n\nEach of the following $ m $ lines contains two integers $ a_i $ , $ b_i $ — the positions of the $ i $ -th comparison ( $ 1 \\le a_i, b_i \\le n $ ; $ a_i \\ne b_i $ ). It's guaranteed that any unordered pair is given in the input at most once.",
    "outputFormat": "The first line of output must contain \"YES\" if there exist two arrays, such that the results of comparisons would be the same, and all numbers in the first one are distinct, and the second one contains two equal numbers. Otherwise it must contain \"NO\".\n\nIf the arrays exist, the second line must contain the array of distinct integers, the third line must contain the array, that contains at least one pair of equal elements. Elements of the arrays must be integers from $ 1 $ to $ n $ .",
    "samples": [
        [
            "1 0\n",
            "NO\n"
        ],
        [
            "3 1\n1 2\n",
            "YES\n1 3 2 \n1 3 1 \n"
        ],
        [
            "4 3\n1 2\n1 3\n2 4\n",
            "YES\n1 3 4 2 \n1 3 4 1 \n"
        ]
    ],
    "hint": "",
    "translation": "给定 $n,m$， $m$ 个无序对 $(a,b)$ 代表位置 $a$ 上的数字和位置 $b$ 上的数字进行比较。且这 $m$ 个无序对无重复。\r\n\r\n寻找两个序列，第一个序列由 $1$∼$n$ 组成，元素互不相同且唯一。第二个序列，要满足和第一个序列对于 $m$ 个比较的结果相同，且某一个数字要出现两次，其余则皆属于 $[1,n]$ 且互不相同且唯一。"
}