{
    "description": "The only difference between easy and hard versions is the constraints.\n\nVova likes pictures with kittens. The news feed in the social network he uses can be represented as an array of $ n $ consecutive pictures (with kittens, of course). Vova likes all these pictures, but some are more beautiful than the others: the $ i $ -th picture has beauty $ a_i $ .\n\nVova wants to repost exactly $ x $ pictures in such a way that:\n\n- each segment of the news feed of at least $ k $ consecutive pictures has at least one picture reposted by Vova;\n- the sum of beauty values of reposted pictures is maximum possible.\n\nFor example, if $ k=1 $ then Vova has to repost all the pictures in the news feed. If $ k=2 $ then Vova can skip some pictures, but between every pair of consecutive pictures Vova has to repost at least one of them.\n\nYour task is to calculate the maximum possible sum of values of reposted pictures if Vova follows conditions described above, or say that there is no way to satisfy all conditions.",
    "inputFormat": "The first line of the input contains three integers $ n, k $ and $ x $ ( $ 1 \\le k, x \\le n \\le 5000 $ ) — the number of pictures in the news feed, the minimum length of segment with at least one repost in it and the number of pictures Vova is ready to repost.\n\nThe second line of the input contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ), where $ a_i $ is the beauty of the $ i $ -th picture.",
    "outputFormat": "Print -1 if there is no way to repost some pictures to satisfy all the conditions in the problem statement.\n\nOtherwise print one integer — the maximum sum of values of reposted pictures if Vova follows conditions described in the problem statement.",
    "samples": [
        [
            "5 2 3\n5 1 3 10 1\n",
            "18\n"
        ],
        [
            "6 1 5\n10 30 30 70 10 10\n",
            "-1\n"
        ],
        [
            "4 3 1\n1 100 1 1\n",
            "100\n"
        ]
    ],
    "hint": "",
    "translation": "给你一个数列$a$，你需要选择$m$个元素，使得连续的$k$个元素都至少有一个被选中。\n\n需要你最大化选出来的所有数的和。"
}