{
    "description": "There are $ n $ cities in the country.\n\nTwo candidates are fighting for the post of the President. The elections are set in the future, and both candidates have already planned how they are going to connect the cities with roads. Both plans will connect all cities using $ n - 1 $ roads only. That is, each plan can be viewed as a tree. Both of the candidates had also specified their choice of the capital among $ n $ cities ( $ x $ for the first candidate and $ y $ for the second candidate), which may or may not be same.\n\nEach city has a potential of building a port (one city can have at most one port). Building a port in $ i $ -th city brings $ a_i $ amount of money. However, each candidate has his specific demands. The demands are of the form:\n\n- $ k $ $ x $ , which means that the candidate wants to build exactly $ x $ ports in the subtree of the $ k $ -th city of his tree (the tree is rooted at the capital of his choice).\n\nFind out the maximum revenue that can be gained while fulfilling all demands of both candidates, or print -1 if it is not possible to do.\n\nIt is additionally guaranteed, that each candidate has specified the port demands for the capital of his choice.",
    "inputFormat": "The first line contains integers $ n $ , $ x $ and $ y $ ( $ 1 \\le n \\le 500 $ , $ 1 \\le x, y \\le n $ ) — the number of cities, the capital of the first candidate and the capital of the second candidate respectively.\n\nNext line contains integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\le a_i \\le 100\\,000 $ ) — the revenue gained if the port is constructed in the corresponding city.\n\nEach of the next $ n - 1 $ lines contains integers $ u_i $ and $ v_i $ ( $ 1 \\le u_i, v_i \\le n $ , $ u_i \\ne v_i $ ), denoting edges between cities in the tree of the first candidate.\n\nEach of the next $ n - 1 $ lines contains integers $ u'_i $ and $ v'_i $ ( $ 1 \\le u'_i, v'_i \\le n $ , $ u'_i \\ne v'_i $ ), denoting edges between cities in the tree of the second candidate.\n\nNext line contains an integer $ q_1 $ ( $ 1 \\le q_1 \\le n $ ), denoting the number of demands of the first candidate.\n\nEach of the next $ q_1 $ lines contains two integers $ k $ and $ x $ ( $ 1 \\le k \\le n $ , $ 1 \\le x \\le n $ ) — the city number and the number of ports in its subtree.\n\nNext line contains an integer $ q_2 $ ( $ 1 \\le q_2 \\le n $ ), denoting the number of demands of the second candidate.\n\nEach of the next $ q_2 $ lines contain two integers $ k $ and $ x $ ( $ 1 \\le k \\le n $ , $ 1 \\le x \\le n $ ) — the city number and the number of ports in its subtree.\n\nIt is guaranteed, that given edges correspond to valid trees, each candidate has given demand about each city at most once and that each candidate has specified the port demands for the capital of his choice. That is, the city $ x $ is always given in demands of the first candidate and city $ y $ is always given in the demands of the second candidate.",
    "outputFormat": "Print exactly one integer — the maximum possible revenue that can be gained, while satisfying demands of both candidates, or -1 if it is not possible to satisfy all of the demands.",
    "samples": [
        [
            "4 1 2\n1 2 3 4\n1 2\n1 3\n3 4\n1 2\n2 3\n1 4\n2\n1 3\n4 1\n1\n2 3\n",
            "9"
        ],
        [
            "5 1 1\n3 99 99 100 2\n1 2\n1 3\n3 4\n3 5\n1 3\n1 2\n2 4\n2 5\n2\n1 2\n3 1\n2\n1 2\n2 1\n",
            "198"
        ],
        [
            "4 1 2\n1 2 3 4\n1 2\n1 3\n3 4\n2 1\n2 4\n4 3\n1\n1 4\n2\n4 1\n2 4\n",
            "-1"
        ]
    ],
    "hint": "In the first example, it is optimal to build ports in cities $ 2 $ , $ 3 $ and $ 4 $ , which fulfills all demands of both candidates and gives revenue equal to $ 2 + 3 + 4 = 9 $ .\n\nIn the second example, it is optimal to build ports in cities $ 2 $ and $ 3 $ , which fulfills all demands of both candidates and gives revenue equal to $ 99 + 99 = 198 $ .\n\nIn the third example, it is not possible to build ports in such way, that all demands of both candidates are specified, hence the answer is -1.",
    "translation": "两颗有根树，给定各个树的根。\r\n\r\n这两颗树都有$n$个点，依次编号。\r\n\r\n给定每个编号的价值，你可以标记某些编号。\r\n\r\n两颗树都有若干条件：在那棵树上，某个编号对应节点的子树内有给定个数的编号被标记\r\n\r\n求满足条件的最大的标记编号的价值和"
}