{
    "description": "Vasya has got a magic matrix $ a $ of size $ n \\times m $ . The rows of the matrix are numbered from $ 1 $ to $ n $ from top to bottom, the columns are numbered from $ 1 $ to $ m $ from left to right. Let $ a_{ij} $ be the element in the intersection of the $ i $ -th row and the $ j $ -th column.\n\nVasya has also got a chip. Initially, the chip is in the intersection of the $ r $ -th row and the $ c $ -th column (that is, in the element $ a_{rc} $ ). Vasya performs the following process as long as possible: among all elements of the matrix having their value less than the value of the element with the chip in it, Vasya randomly and equiprobably chooses one element and moves his chip to this element.\n\nAfter moving the chip, he adds to his score the square of the Euclidean distance between these elements (that is, between the element in which the chip is now and the element the chip was moved from). The process ends when there are no elements having their values less than the value of the element with the chip in it.\n\nEuclidean distance between matrix elements with coordinates $ (i_1, j_1) $ and $ (i_2, j_2) $ is equal to $ \\sqrt{(i_1-i_2)^2 + (j_1-j_2)^2} $ .\n\nCalculate the expected value of the Vasya's final score.\n\nIt can be shown that the answer can be represented as $ \\frac{P}{Q} $ , where $ P $ and $ Q $ are coprime integer numbers, and $ Q \\not\\equiv 0~(mod ~ 998244353) $ . Print the value $ P \\cdot Q^{-1} $ modulo $ 998244353 $ .",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ $ (1 \\le n, m \\le 1\\,000) $ — the number of rows and the number of columns in the matrix $ a $ .\n\nThe following $ n $ lines contain description of the matrix $ a $ . The $ i $ -th line contains $ m $ integers $ a_{i1}, a_{i2}, \\dots, a_{im} ~ (0 \\le a_{ij} \\le 10^9) $ .\n\nThe following line contains two integers $ r $ and $ c $ $ (1 \\le r \\le n, 1 \\le c \\le m) $ — the index of row and the index of column where the chip is now.",
    "outputFormat": "Print the expected value of Vasya's final score in the format described in the problem statement.",
    "samples": [
        [
            "1 4\n1 1 2 1\n1 3\n",
            "2\n"
        ],
        [
            "2 3\n1 5 7\n2 3 1\n1 2\n",
            "665496238\n"
        ]
    ],
    "hint": "In the first example, Vasya will move his chip exactly once. The expected value of the final score is equal to $ \\frac{1^2 + 2^2+ 1^2}{3} = 2 $ .",
    "translation": "一个$n$行$m$列的矩阵,每个位置有权值$a_{i,j}$\n\n给定一个出发点,每次可以等概率的移动到一个权值小于当前点权值的点,同时得分加上两个点之间欧几里得距离的平方(欧几里得距离:$\\sqrt{(x_1-x_2)^2+(y_1-y_2)^2}$)),问得分的期望"
}