{
    "description": "Misha didn't do his math homework for today's lesson once again. As a punishment, his teacher Dr. Andrew decided to give him a hard, but very useless task.\n\nDr. Andrew has written two strings $ s $ and $ t $ of lowercase English letters at the blackboard. He reminded Misha that prefix of a string is a string formed by removing several (possibly none) of its last characters, and a concatenation of two strings is a string formed by appending the second string to the right of the first string.\n\nThe teacher asked Misha to write down on the blackboard all strings that are the concatenations of some non-empty prefix of $ s $ and some non-empty prefix of $ t $ . When Misha did it, Dr. Andrew asked him how many distinct strings are there. Misha spent almost the entire lesson doing that and completed the task.\n\nNow he asks you to write a program that would do this task automatically.",
    "inputFormat": "The first line contains the string $ s $ consisting of lowercase English letters. The second line contains the string $ t $ consisting of lowercase English letters.\n\nThe lengths of both string do not exceed $ 10^{5} $ .",
    "outputFormat": "Output a single integer — the number of distinct strings that are concatenations of some non-empty prefix of $ s $ with some non-empty prefix of $ t $ .",
    "samples": [
        [
            "aba\naa\n",
            "5\n"
        ],
        [
            "aaaaa\naaaa\n",
            "8\n"
        ]
    ],
    "hint": "In the first example, the string $ s $ has three non-empty prefixes: {a, ab, aba}. The string $ t $ has two non-empty prefixes: {a, aa}. In total, Misha has written five distinct strings: {aa, aaa, aba, abaa, abaaa}. The string abaa has been written twice.\n\nIn the second example, Misha has written eight distinct strings: {aa, aaa, aaaa, aaaaa, aaaaaa, aaaaaaa, aaaaaaaa, aaaaaaaaa}.",
    "translation": "给定两个字符串s、t，求s的非空前缀后接上t的非空前缀形成的本质不同字符串种类数"
}