{
    "description": "You are given an acyclic directed graph, consisting of $ n $ vertices and $ m $ edges. The graph contains no multiple edges and no self-loops.\n\nThe vertex is called a source if it has no incoming edges. The vertex is called a sink if it has no outgoing edges. These definitions imply that some vertices can be both source and sink.\n\nThe number of sources in the given graph is equal to the number of sinks in it, and each of these numbers doesn't exceed $ 20 $ .\n\nThe following algorithm is applied to the graph:\n\n1. if the graph has no sources and sinks then quit;\n2. choose arbitrary source $ s $ , arbitrary sink $ t $ , add an edge from $ t $ to $ s $ to the graph and go to step $ 1 $ (that operation pops $ s $ out of sources and $ t $ out of sinks). Note that $ s $ and $ t $ may be the same vertex, then a self-loop is added.\n\nAt the end you check if the graph becomes strongly connected (that is, any vertex is reachable from any other vertex).\n\nYour task is to check that the graph becomes strongly connected no matter the choice of sources and sinks on the second step of the algorithm.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 10^6 $ ) — the number of vertices and the number of edges in the graph, respectively.\n\nEach of the next $ m $ lines contains two integers $ v_i, u_i $ ( $ 1 \\le v_i, u_i \\le n $ , $ v_i \\ne u_i $ ) — the description of the $ i $ -th edge of the original graph.\n\nIt is guaranteed that the number of sources and the number of sinks in the graph are the same and they don't exceed $ 20 $ . It is guaranteed that the given graph contains no multiple edges. It is guaranteed that the graph contains no cycles.",
    "outputFormat": "Print \"YES\" if the graph becomes strongly connected no matter the choice of sources and sinks on the second step of the algorithm. Otherwise print \"NO\".",
    "samples": [
        [
            "3 1\n1 2\n",
            "NO\n"
        ],
        [
            "3 3\n1 2\n1 3\n2 3\n",
            "YES\n"
        ],
        [
            "4 4\n1 2\n1 3\n4 2\n4 3\n",
            "YES\n"
        ]
    ],
    "hint": "",
    "translation": "## 题意翻译\n\n给出一张 DAG（$1\\leq n, m\\leq 10^6$，其中 $n$ 为结点数，$m$ 为边数）\n\n称无入边的结点为 “源点”；无出边的结点为 “汇点”。我们还保证这张 DAG 的源点数量与汇点数量相等，且均不超过 $20$ 个\n\n现在我们对这张 DAG 重复以下操作：\n\n1. 选择**任意**一对源点与汇点 $s, t$\n2. 添加一条（有向）边 $(t, s)$；如果仍还有源点与汇点，就再回到操作 $1$。可以发现该次操作将会导致 $s$ 不再是一个源点，$t$ 不再是一个汇点；并且该次操作还有可能添加一个**自环**\n\n现在问，无论操作中的具体选择如何，该图在所有操作结束后，是否**总是**成为**一个**强联通分量（即任意一对结点间都可以相互到达）\n\n## 输入格式\n\n第一行两个整数 $n, m$（$1\\leq n, m\\leq 10^6$）\n\n接下来 $m$ 每行两个整数 $v_i, u_i$（$1\\leq v_i, u_i\\leq n, v_i\\not=u_i$），描述图中的一条有向边 $(v_i, u_i)$\n\n## 输出格式\n\n若所有操作结束后，该图总是成为一个强联通分量，就输出 `YES`；反之输出 `NO`"
}