{
    "description": "One Saturday afternoon Egor was playing his favorite RPG game. While discovering new lands and territories, he came across the following sign:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1097E/df94bb5d4c39c284d7b52c8262a6df039924a844.png)Egor is a passionate player, but he is an algorithmician as well. That's why he instantly spotted four common letters in two words on the sign above — if we permute the letters \"R\", \"E\", \"G\", \"O\" from the first word, we can obtain the letters \"O\", \"G\", \"R\", \"E\". Egor got inspired by the sign and right away he came up with a problem about permutations.\n\nYou are given a permutation of length $ n $ . You have to split it into some non-empty subsequences so that each element of the permutation belongs to exactly one subsequence. Each subsequence must be monotonic — that is, either increasing or decreasing.\n\nSequence is called to be a subsequence if it can be derived from permutation by deleting some (possibly none) elements without changing the order of the remaining elements.\n\nThe number of subsequences should be small enough — let $ f(n) $ be the minimum integer $ k $ such that every permutation of length $ n $ can be partitioned into at most $ k $ monotonic subsequences.\n\nYou need to split the permutation into at most $ f(n) $ monotonic subsequences.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 10^5 $ ) — the number of test cases.\n\nYou can only use $ t = 1 $ in hacks.\n\nNext, descriptions of $ t $ test cases come, each of them in the following format.\n\nThe first line of a single test case contains one integer $ n $ ( $ 1 \\leq n \\leq 10^5 $ ) — the length of the permutation. The second line contains $ n $ distinct integers $ a_i $ ( $ 1 \\leq a_i \\leq n $ ) — the permutation itself.\n\nThe sum of the values of $ n $ over all test cases doesn't exceed $ 10^5 $ .",
    "outputFormat": "For each test case print the answer in the following format:\n\nIn the first line print $ k $ ( $ 1 \\leq k \\leq f(n) $ ) — the number of the subsequences in the partition. In the next $ k $ lines, print the descriptions of found subsequences. Each description should start with a number $ l_i $ ( $ 1 \\leq l_i \\leq n $ ) — the length of the corresponding subsequence, followed by $ l_i $ integers — the values of this subsequence in the order in which they occur in the permutation.\n\nEach subsequence you output must be either increasing or decreasing.\n\nIn case there are multiple possible answers, print any of them.",
    "samples": [
        [
            "3\n4\n4 3 1 2\n6\n4 5 6 1 3 2\n10\n1 2 3 4 5 6 7 8 9 10\n",
            "2\n3 4 3 1\n1 2\n3\n2 4 1\n2 5 6\n2 3 2\n1\n10 1 2 3 4 5 6 7 8 9 10\n"
        ]
    ],
    "hint": "In the example, we can split:\n\n- $ [4, 3, 1, 2] $ into $ [4, 3, 1] $ , $ [2] $\n- $ [4, 5, 6, 1, 3, 2] $ into $ [4, 1] $ , $ [5, 6] $ and $ [3, 2] $\n- $ [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] $ into $ [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] $\n\nSurely, there are many more answers possible.",
    "translation": "设$f(n)$表示满足所有长度为$n$的排列都能被划分成$k$个不相交的单调上升/单调下降子序列的$k$的最小值。\r\n\r\n多组数据，给定长为$n$的排列，输出一种单调序列个数不超过$f(n)$的划分方案。"
}