{
    "description": "In the last mission, MDCS has successfully shipped $ N $ AI robots to Mars. Before they start exploring, system initialization is required so they are arranged in a line. Every robot can be described with three numbers: position ( $ x_i $ ), radius of sight ( $ r_i $ ) and IQ ( $ q_i $ ).\n\nSince they are intelligent robots, some of them will talk if they see each other. Radius of sight is inclusive, so robot can see other all robots in range $ [x_i - r_i, x_i + r_i] $ . But they don't walk to talk with anybody, but only with robots who have similar IQ. By similar IQ we mean that their absolute difference isn't more than $ K $ .\n\n Help us and calculate how many pairs of robots are going to talk with each other, so we can timely update their software and avoid any potential quarrel.",
    "inputFormat": "The first line contains two integers, numbers $ N (1 \\leq N \\leq 10^5)  $ and $ K (0 \\leq K \\leq 20) $ .\n\nNext $ N $ lines contain three numbers each $ x_i, r_i, q_i (0 \\leq x_i,r_i,q_i \\leq 10^9) $ — position, radius of sight and IQ of every robot respectively.",
    "outputFormat": "Output contains only one number — solution to the problem.",
    "samples": [
        [
            "3 2\n3 6 1\n7 3 10\n10 5 8\n",
            "1"
        ]
    ],
    "hint": "The first robot can see the second, but not vice versa. The first robot can't even see the third. The second and the third robot can see each other and their IQs don't differ more than 2 so only one conversation will happen.",
    "translation": "火星上有$N$个机器人排成一行，第$i$个机器人的位置为$x_{i}$，视野为$r_{i}$，智商为$q_{i}$。我们认为第$i$个机器人可以看到的位置是$[x_{i}-r_{i},x_{i}+r_{i}]$。\t\n如果一对机器人相互可以看到，且它们的智商$q_{i}$的差距**不大于**$K$，那么它们会开始聊天。\t\n为了防止它们吵起来，请计算有多少对机器人可能会聊天。\t\n"
}