{
    "description": "The king of some country $ N $ decided to completely rebuild the road network. There are $ n $ people living in the country, they are enumerated from $ 1 $ to $ n $ . It is possible to construct a road between the house of any citizen $ a $ to the house of any other citizen $ b $ . There should not be more than one road between any pair of citizens. The road network must be connected, i.e. it should be possible to reach every citizen starting from anyone using roads. To save funds, it was decided to build exactly $ n-1 $ road, so the road network should be a tree.\n\nHowever, it is not that easy as it sounds, that's why the king addressed you for help. There are $ m $ secret communities in the country, each of them unites a non-empty subset of citizens. The king does not want to conflict with any of the communities, so he wants to build the network such that the houses of members of each society form a connected subtree in network. A set of vertices forms a connected subtree if and only if the graph remains connected when we delete all the other vertices and all edges but ones that connect the vertices from the set.\n\nHelp the king to determine if it is possible to build the desired road network, and if it is, build it.",
    "inputFormat": "Each test consists of one or more test cases.\n\nThe first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 2000 $ ) — the number of test cases.\n\nThe following lines describe the test cases, each in the following format.\n\nThe first line contains two integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 2000 $ ) — the number of citizens and the number of secret communities.\n\nThe next $ m $ lines contain the description of the communities. The $ i $ -th of these lines contains a string $ s_i $ of length $ n $ , consisting of characters '0' and '1'. The citizen with number $ j $ is a member of the $ i $ -th community if and only if $ s_{{i}{j}}=1 $ . It is guaranteed that the string $ s_i $ contains at least one character '1' for each $ 1 \\leq i \\leq m $ .\n\nIt is guaranteed that the sum of $ n $ for all test cases does not exceed $ 2000 $ and the sum of $ m $ for all test cases does not exceed $ 2000 $ .",
    "outputFormat": "Print the answer for all test cases in the order they are given in the input, each in the following format.\n\nIf there is no way to build the desired road network, print \"NO\" (without quotes).\n\nOtherwise in the first line print \"YES\" (without quotes).\n\nIn the next $ n-1 $ lines print the description of the road network: each line should contain two integers $ a $ and $ b $ ( $ 1 \\leq a, b \\leq n $ , $ a \\neq b $ ) that denote you build a road between houses of citizens $ a $ and $ b $ .\n\nThe roads should form a connected tree, and each community should form a connected subtree.",
    "samples": [
        [
            "2\n4 3\n0011\n1110\n0111\n3 3\n011\n101\n110\n",
            "YES\n1 3\n2 3\n3 4\nNO\n"
        ]
    ],
    "hint": "In the first example you can build the following network:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1054G/2c9fa0f78ef5d14cd2be80686c4e7e4ee5036e9e.png)It is easy to see that for each community all the houses of its members form a connected subtree. For example, the $ 2 $ -nd community unites the citizens $ 1 $ , $ 2 $ , $ 3 $ . They form a connected subtree, because if we delete everything except the houses $ 1 $ , $ 2 $ , $ 3 $ and the roads between them, two roads will remain: between $ 1 $ and $ 3 $ and between $ 2 $ and $ 3 $ , forming a connected graph.\n\nThere is no network in the second example suitable for the king.",
    "translation": "### 题目描述\n\n有 $n$ 个点和 $m$ 个集合，需要构造出一棵树使得对于 $1\\leq i\\leq m$，属于集合 $i$ 的所有点构成一个连通块。如果方案存在输出 `YES` 并给出方案，否则输出 `NO`。\n\n### 输入格式\n\n第一行一个整数 $T$ 表示数据组数。\n\n每组数据的第一行为两个整数 $n,m$，表示点数和集合数。\n\n接下来 $m$ 行，每行一个长度为 $n$ 的 $01$ 串，表示第 $i$ 个集合的信息。如果第 $i$ 行的第 $j$ 个字符为 $1$ 则表示点 $j$ 属于集合 $i$，为 $0$ 则表示不属于。\n\n### 输出格式\n\n对于每组测试数据，如果能构造出一组方案，输出 `YES` 和一组合法方案，否则输出 `NO`。\n\nTranslated By Karry5307"
}