{
    "description": "A plane is flying at a constant height of $ h $ meters above the ground surface. Let's consider that it is flying from the point $ (-10^9, h) $ to the point $ (10^9, h) $ parallel with $ Ox $ axis.\n\nA glider is inside the plane, ready to start his flight at any moment (for the sake of simplicity let's consider that he may start only when the plane's coordinates are integers). After jumping from the plane, he will fly in the same direction as the plane, parallel to $ Ox $ axis, covering a unit of distance every second. Naturally, he will also descend; thus his second coordinate will decrease by one unit every second.\n\nThere are ascending air flows on certain segments, each such segment is characterized by two numbers $ x_1 $ and $ x_2 $ ( $ x_1 < x_2 $ ) representing its endpoints. No two segments share any common points. When the glider is inside one of such segments, he doesn't descend, so his second coordinate stays the same each second. The glider still flies along $ Ox $ axis, covering one unit of distance every second.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1041D/1d4e61ed6ab8ed789053bd3eb0ac4d4f26b6fd54.png)If the glider jumps out at $ 1 $ , he will stop at $ 10 $ . Otherwise, if he jumps out at $ 2 $ , he will stop at $ 12 $ .Determine the maximum distance along $ Ox $ axis from the point where the glider's flight starts to the point where his flight ends if the glider can choose any integer coordinate to jump from the plane and start his flight. After touching the ground the glider stops altogether, so he cannot glide through an ascending airflow segment if his second coordinate is $ 0 $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ h $ $ (1 \\le n \\le 2\\cdot10^{5}, 1 \\le h \\le 10^{9}) $ — the number of ascending air flow segments and the altitude at which the plane is flying, respectively.\n\nEach of the next $ n $ lines contains two integers $ x_{i1} $ and $ x_{i2} $ $ (1 \\le x_{i1} < x_{i2} \\le 10^{9}) $ — the endpoints of the $ i $ -th ascending air flow segment. No two segments intersect, and they are given in ascending order.",
    "outputFormat": "Print one integer — the maximum distance along $ Ox $ axis that the glider can fly from the point where he jumps off the plane to the point where he lands if he can start his flight at any integer coordinate.",
    "samples": [
        [
            "3 4\n2 5\n7 9\n10 11\n",
            "10\n"
        ],
        [
            "5 10\n5 7\n11 12\n16 20\n25 26\n30 33\n",
            "18\n"
        ],
        [
            "1 1000000000\n1 1000000000\n",
            "1999999999\n"
        ]
    ],
    "hint": "In the first example if the glider can jump out at $ (2, 4) $ , then the landing point is $ (12, 0) $ , so the distance is $ 12-2 = 10 $ .\n\nIn the second example the glider can fly from $ (16,10) $ to $ (34,0) $ , and the distance is $ 34-16=18 $ .\n\nIn the third example the glider can fly from $ (-100,1000000000) $ to $ (1999999899,0) $ , so the distance is $ 1999999899-(-100)=1999999999 $ .",
    "translation": "```\n你在玩一个吃鸡游戏，你现在要跳伞。你的飞机现在在高度为$h$的空中飞行，你每飞一个单位长度的距离，你就会下落一个单位长度的高度，当然，有些地方是上升气流，你不会下落，你会往前直飞，由于你想在空中就被人打死，求你最远的飞行距离\n\n输入格式：\n第一行两个正整数$n$，$h$，代表有$n$段上升气流，飞机的高度为$h$。\n\n接下来$n$行，每行两个数$x_{i1}$，$x_{i2}$。代表$x_{i1}$至$x_{i2}$这段区间为上升气流。\n\n输出格式：\n一个整数，代表你最远的飞行距离\n```"
}