{
    "description": "Natasha is going to fly to Mars. She needs to build a rocket, which consists of several stages in some order. Each of the stages is defined by a lowercase Latin letter. This way, the rocket can be described by the string — concatenation of letters, which correspond to the stages.\n\nThere are $ n $ stages available. The rocket must contain exactly $ k $ of them. Stages in the rocket should be ordered by their weight. So, after the stage with some letter can go only stage with a letter, which is at least two positions after in the alphabet (skipping one letter in between, or even more). For example, after letter 'c' can't go letters 'a', 'b', 'c' and 'd', but can go letters 'e', 'f', ..., 'z'.\n\nFor the rocket to fly as far as possible, its weight should be minimal. The weight of the rocket is equal to the sum of the weights of its stages. The weight of the stage is the number of its letter in the alphabet. For example, the stage 'a 'weighs one ton,' b 'weighs two tons, and' z' — $ 26 $ tons.\n\nBuild the rocket with the minimal weight or determine, that it is impossible to build a rocket at all. Each stage can be used at most once.",
    "inputFormat": "The first line of input contains two integers — $ n $ and $ k $ ( $ 1 \\le k \\le n \\le 50 $ ) – the number of available stages and the number of stages to use in the rocket.\n\nThe second line contains string $ s $ , which consists of exactly $ n $ lowercase Latin letters. Each letter defines a new stage, which can be used to build the rocket. Each stage can be used at most once.",
    "outputFormat": "Print a single integer — the minimal total weight of the rocket or -1, if it is impossible to build the rocket at all.",
    "samples": [
        [
            "5 3\nxyabd\n",
            "29"
        ],
        [
            "7 4\nproblem\n",
            "34"
        ],
        [
            "2 2\nab\n",
            "-1"
        ],
        [
            "12 1\nabaabbaaabbb\n",
            "1"
        ]
    ],
    "hint": "In the first example, the following rockets satisfy the condition:\n\n- \"adx\" (weight is $ 1+4+24=29 $ );\n- \"ady\" (weight is $ 1+4+25=30 $ );\n- \"bdx\" (weight is $ 2+4+24=30 $ );\n- \"bdy\" (weight is $ 2+4+25=31 $ ).\n\nRocket \"adx\" has the minimal weight, so the answer is $ 29 $ .\n\nIn the second example, target rocket is \"belo\". Its weight is $ 2+5+12+15=34 $ .\n\nIn the third example, $ n=k=2 $ , so the rocket must have both stages: 'a' and 'b'. This rocket doesn't satisfy the condition, because these letters are adjacent in the alphabet. Answer is -1.",
    "translation": "定义一个长度为 $n$ 的字符串 $s$ 的价值为 $\\sum\\limits_{i=1}^n(s_i-\\texttt{'a'})$。\n\n定义一个长度为 $n$ 的字符串 $s$ 是优秀的，当且仅当 $\\forall x\\in[1,n-1], (s_x-\\texttt{'a'})<(s_{x+1}-\\texttt{'a'} - 1)$。\n\n再给出一个长度为 $n$ 的字符串 $t$，求在 $t$ 中选 $k$ 个字符能够组成的所有优秀的字符串中的最少价值。如果不能构造出优秀的字符串，请输出 $-1$。"
}