{
    "description": "You are given an array $ a $ consisting of $ n $ integers. You can perform the following operations with it:\n\n1. Choose some positions $ i $ and $ j $ ( $ 1 \\le i, j \\le n, i \\ne j $ ), write the value of $ a_i \\cdot a_j $ into the $ j $ -th cell and remove the number from the $ i $ -th cell;\n2. Choose some position $ i $ and remove the number from the $ i $ -th cell (this operation can be performed no more than once and at any point of time, not necessarily in the beginning).\n\nThe number of elements decreases by one after each operation. However, the indexing of positions stays the same. Deleted numbers can't be used in the later operations.\n\nYour task is to perform exactly $ n - 1 $ operations with the array in such a way that the only number that remains in the array is maximum possible. This number can be rather large, so instead of printing it you need to print any sequence of operations which leads to this maximum number. Read the output format to understand what exactly you need to print.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — the number of elements in the array.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ -10^9 \\le a_i \\le 10^9 $ ) — the elements of the array.",
    "outputFormat": "Print $ n - 1 $ lines. The $ k $ -th line should contain one of the two possible operations.\n\nThe operation of the first type should look like this: $ 1~ i_k~ j_k $ , where $ 1 $ is the type of operation, $ i_k $ and $ j_k $ are the positions of the chosen elements.\n\nThe operation of the second type should look like this: $ 2~ i_k $ , where $ 2 $ is the type of operation, $ i_k $ is the position of the chosen element. Note that there should be no more than one such operation.\n\nIf there are multiple possible sequences of operations leading to the maximum number — print any of them.",
    "samples": [
        [
            "5\n5 -2 0 1 -3\n",
            "2 3\n1 1 2\n1 2 4\n1 4 5\n"
        ],
        [
            "5\n5 2 0 4 0\n",
            "1 3 5\n2 5\n1 1 2\n1 2 4\n"
        ],
        [
            "2\n2 -1\n",
            "2 2\n"
        ],
        [
            "4\n0 -10 0 0\n",
            "1 1 2\n1 2 3\n1 3 4\n"
        ],
        [
            "4\n0 0 0 0\n",
            "1 1 2\n1 2 3\n1 3 4\n"
        ]
    ],
    "hint": "Let X be the removed number in the array. Let's take a look at all the examples:\n\nThe first example has, for example, the following sequence of transformations of the array: $ [5, -2, 0, 1, -3] \\to [5, -2, X, 1, -3] \\to [X, -10, X, 1, -3] \\to $ $ [X, X, X, -10, -3] \\to [X, X, X, X, 30] $ . Thus, the maximum answer is $ 30 $ . Note, that other sequences that lead to the answer $ 30 $ are also correct.\n\nThe second example has, for example, the following sequence of transformations of the array: $ [5, 2, 0, 4, 0] \\to [5, 2, X, 4, 0] \\to [5, 2, X, 4, X] \\to [X, 10, X, 4, X] \\to $ $ [X, X, X, 40, X] $ . The following answer is also allowed:\n\n`<br></br>1 5 3<br></br>1 4 2<br></br>1 2 1<br></br>2 3<br></br>`Then the sequence of transformations of the array will look like this: $ [5, 2, 0, 4, 0] \\to [5, 2, 0, 4, X] \\to [5, 8, 0, X, X] \\to [40, X, 0, X, X] \\to $ $ [40, X, X, X, X] $ .\n\nThe third example can have the following sequence of transformations of the array: $ [2, -1] \\to [2, X] $ .\n\nThe fourth example can have the following sequence of transformations of the array: $ [0, -10, 0, 0] \\to [X, 0, 0, 0] \\to [X, X, 0, 0] \\to [X, X, X, 0] $ .\n\nThe fifth example can have the following sequence of transformations of the array: $ [0, 0, 0, 0] \\to [X, 0, 0, 0] \\to [X, X, 0, 0] \\to [X, X, X, 0] $ .",
    "translation": "给你一个长度为 $n$ 的整数序列，你可以对其做两种操作:\n\n1. 选 $0<i,j \\leq n,i \\ne j$，将 $a_j$ 替换为 $a_i \\cdot a_j$，删除 $a_i$。\n\n2. 选一个未被删除的 $a_i$，将其删除。**该操作在任意时刻均可执行，最多执行一次**。\n\n你需要操作 $n-1$ 次，剩下一个数，使其最大。由于剩下的数可能会很大，你需要输出得到它的操作序列。\n\n**输出任意能得到最大数的操作序列均可。**"
}