{
    "description": "You received a notebook which is called Death Note. This notebook has infinite number of pages. A rule is written on the last page (huh) of this notebook. It says: \"You have to write names in this notebook during $ n $ consecutive days. During the $ i $ -th day you have to write exactly $ a_i $ names.\". You got scared (of course you got scared, who wouldn't get scared if he just receive a notebook which is named Death Note with a some strange rule written in it?).\n\nOf course, you decided to follow this rule. When you calmed down, you came up with a strategy how you will write names in the notebook. You have calculated that each page of the notebook can contain exactly $ m $ names. You will start writing names from the first page. You will write names on the current page as long as the limit on the number of names on this page is not exceeded. When the current page is over, you turn the page. Note that you always turn the page when it ends, it doesn't matter if it is the last day or not. If after some day the current page still can hold at least one name, during the next day you will continue writing the names from the current page.\n\nNow you are interested in the following question: how many times will you turn the page during each day? You are interested in the number of pages you will turn each day from $ 1 $ to $ n $ .",
    "inputFormat": "The first line of the input contains two integers $ n $ , $ m $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ , $ 1 \\le m \\le 10^9 $ ) — the number of days you will write names in the notebook and the number of names which can be written on each page of the notebook.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ), where $ a_i $ means the number of names you will write in the notebook during the $ i $ -th day.",
    "outputFormat": "Print exactly $ n $ integers $ t_1, t_2, \\dots, t_n $ , where $ t_i $ is the number of times you will turn the page during the $ i $ -th day.",
    "samples": [
        [
            "3 5\n3 7 9\n",
            "0 2 1 \n"
        ],
        [
            "4 20\n10 9 19 2\n",
            "0 0 1 1 \n"
        ],
        [
            "1 100\n99\n",
            "0 \n"
        ]
    ],
    "hint": "In the first example pages of the Death Note will look like this $ [1, 1, 1, 2, 2], [2, 2, 2, 2, 2], [3, 3, 3, 3, 3], [3, 3, 3, 3] $ . Each number of the array describes during which day name on the corresponding position will be written. It is easy to see that you should turn the first and the second page during the second day and the third page during the third day.",
    "translation": "你收到了一本死亡笔记 。。。\n\nΣ(;ﾟдﾟ)（\n\n然后你可以在一页上面最多写上 m 个名字，一共写 n 天。但是实际你每天写上 Ai 个名字，那么问你每天要翻几页。（在昨天的基础上又写了几页）注意每天的名字紧接上一天的，**没写完的一页继续写**。\n\n输出 i 个数字表示第 i 天又写了几页。**数据范围rt。**"
}