{
    "description": "This is an interactive problem.\n\nIn good old times dwarves tried to develop extrasensory abilities:\n\n- Exactly $ n $ dwarves entered completely dark cave.\n- Each dwarf received a hat — white or black. While in cave, none of the dwarves was able to see either his own hat or hats of other Dwarves.\n- Dwarves went out of the cave to the meadow and sat at an arbitrary place one after the other. When a dwarf leaves the cave, he sees the colors of all hats of all dwarves that are seating on the meadow (i.e. left the cave before him). However, he is not able to see the color of his own hat and none of the dwarves can give him this information.\n- The task for dwarves was to got diverged into two parts — one with dwarves with white hats and one with black hats.\n\nAfter many centuries, dwarves finally managed to select the right place on the meadow without error. Will you be able to repeat their success?\n\nYou are asked to successively name $ n $ different integer points on the plane. After naming each new point you will be given its color — black or white. Your task is to ensure that the named points can be split by a line in such a way that all points of one color lie on the same side from the line and points of different colors lie on different sides. Moreover, no points can belong to the line. Also, you need to report any such line at the end of the process.\n\nIn this problem, the interactor is adaptive — the colors of the points in the tests are not fixed beforehand and the jury program can select them arbitrarily, in particular, depending on your program output.",
    "inputFormat": "",
    "outputFormat": "The first line of the standard input stream contains an integer $ n $ ( $ 1<=n<=30 $ ) — the number of points your program should name.\n\nThen $ n $ times your program must print two integer coordinates $ x $ and $ y $ ( $ 0<=x<=10^{9} $ , $ 0<=y<=10^{9} $ ). All points you print must be distinct.\n\nIn response to each coordinate pair your program will receive the string \"black\", if the point is black, or \"white\", if the point is white.\n\nWhen all $ n $ points are processed, you need to print four integers $ x_{1} $ , $ y_{1} $ , $ x_{2} $ and $ y_{2} $ ( $ 0<=x_{1},y_{1}<=10^{9} $ , $ 0<=x_{2},y_{2}<=10^{9} $ ) — coordinates of points $ (x_{1},y_{1}) $ and $ (x_{2},y_{2}) $ , which form a line, which separates $ n $ points into black and white. Points $ (x_{1},y_{1}) $ and $ (x_{2},y_{2}) $ should not coincide.\n\nHacks\n\nTo hack solution use the following format. The first line must contain word \"hack\", the second line should contain the number $ n $ and the last line should contain the sequence of $ 0 $ and $ 1 $ — colors of points, which will be reported to the solution. Unlike the jury tests, colors of points in hacks are always fixed in advance. Of course, the hacked solution wouldn't be able to get the information about the colors in advance.\n\nFor example, the hack corresponding to sample test will look like this:\n\n```\nhack\n5\n0 0 1 1 0\n```",
    "samples": [
        [
            "5\n\nblack\n\nblack\n\nwhite\n\nwhite\n\nblack",
            "\n0 0\n\n3 1\n\n2 3\n\n4 4\n\n0 2\n\n1 3 4 1"
        ]
    ],
    "hint": "In the sample input and output values are aligned only for simplicity of interpreting them chronologically. In real interaction no \"extra\" line breaks should appear.\n\nThe following picture illustrates the first test.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1063C/8b02508632dfd30b29a40bae68412cf975775dd4.png)",
    "translation": "这是一道交互题：\n\n\n------------\n\n首先题目会给出 $n$ ，表示要输入多少点。\n\n然后你输出 $n$ 个点的坐标，每输出一个点会告诉你这个点的颜色是黑色或者白色。\n最后你需要输出两个点的坐标代表一条直线，这条直线能够将你刚刚给出的点分成两份，一份全都是黑色的点，另一份全都是白色的点。\n\n------------\n所有的点不能重叠，所有点不能和最后输出的直线重叠，每个点的黑白是随机给出的，你需要保证你输出的数据有解并输出解。\n"
}