{
    "description": "Alice and Bob are playing a game on strings.\n\nInitially, they have some string $ t $ . In one move the first player selects the character $ c $ present in $ t $ and erases all it's occurrences in $ t $ , thus splitting $ t $ into many smaller strings. The game then goes independently with each of the strings — to make the move player selects one of the strings and one of the characters there, deletes all occurrences and adds the remaining string back to the game.\n\nAlice always starts the game, and then Alice and Bob take turns making moves. The player who is unable to make a move (because there is no string left) loses.\n\nAlice and Bob used to always start with a string $ s $ , but recently they found out that this became too boring. Now before each game they choose two integers $ l $ and $ r $ such that $ 1 \\le l \\le r \\le |s| $ and play the game with the string $ s_{l} s_{l+1} s_{l+2} \\ldots s_{r} $ instead.\n\nGiven the string $ s $ and integers $ l $ , $ r $ for each game. Find who is going to win each game assuming they are smart and are playing optimally.",
    "inputFormat": "The first line contains the string $ s $ ( $ 1 \\le |s| \\le 10^5 $ ) consisting of lowercase English letters. This is the string Alice and Bob used to start with.\n\nThe second line contains a single integer $ m $ ( $ 1 \\le m \\le 10^5 $ ) — the number of games to analyze.\n\nEach of the next $ m $ lines contains two integers $ l $ and $ r $ ( $ 1 \\le l \\le r \\le |s| $ ) — the bounds of the starting substring in the string $ s $ .",
    "outputFormat": "For each game output a single line containing the name of the winner — \"Alice\" or \"Bob\" respectively.",
    "samples": [
        [
            "aaab\n2\n1 2\n1 4\n",
            "Alice\nBob\n"
        ],
        [
            "aaccbdb\n2\n5 7\n1 7\n",
            "Alice\nAlice\n"
        ]
    ],
    "hint": "In the first example,\n\n1. In the first game the string \"aa\" is selected. Alice deletes character 'a' and Bob is unable to move.\n2. In the second game the string \"aaab\" is selected. No matter what character Alice will delete, Bob deletes the other one and Alice is unable to move.\n\nIn the second example Alice wins both game \"bdb\" and \"aaccbdb\".\n\nTo win game \"bdb\" Alice can erase symbol 'd', the game then goes independently on strings \"b\" and \"b\". Bob deletes one of this strings and the Alice deletes the other one and Bob is unable to move.\n\nTo win game \"aaccbdb\" Alice can erase symbol 'd', the game then goes independently on strings \"aaccb\" and \"b\". It is possible to show, that no matter what are the moves, the remaining game can only finish in exactly $ 4 $ moves, so the Bob will be unable to move after that.",
    "translation": "Alice和Bob正在玩一个字符串游戏。初始时他们有一个字符串$t$，只包含小写字母，然后不断进行如下操作直到无字符串：\r\n\r\n选定一个字符串，从中任选一个字母，把该字符串按照该字母分成若干段，并删去所有该字母。每一段都成为一个新的字符串，轮换到下一个人继续这一步。\r\n\r\n题目给定一个字符串$t$，接下来有$m$个询问，每个询问包含两个数$l,r$，表示初始字符串为$[l,r]$中的子串。请问谁有必胜策略。"
}