{
    "description": "Enough is enough. Too many times it happened that Vasya forgot to dispose of garbage and his apartment stank afterwards. Now he wants to create a garbage disposal plan and stick to it.\n\nFor each of next $ n $ days Vasya knows $ a_i $ — number of units of garbage he will produce on the $ i $ -th day. Each unit of garbage must be disposed of either on the day it was produced or on the next day. Vasya disposes of garbage by putting it inside a bag and dropping the bag into a garbage container. Each bag can contain up to $ k $ units of garbage. It is allowed to compose and drop multiple bags into a garbage container in a single day.\n\nBeing economical, Vasya wants to use as few bags as possible. You are to compute the minimum number of bags Vasya needs to dispose of all of his garbage for the given $ n $ days. No garbage should be left after the $ n $ -th day.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 1 \\le n \\le 2\\cdot10^5, 1 \\le k \\le 10^9 $ ) — number of days to consider and bag's capacity. The second line contains $ n $ space separated integers $ a_i $ ( $ 0 \\le a_i \\le 10^9 $ ) — the number of units of garbage produced on the $ i $ -th day.",
    "outputFormat": "Output a single integer — the minimum number of bags Vasya needs to dispose of all garbage. Each unit of garbage should be disposed on the day it was produced or on the next day. No garbage can be left after the $ n $ -th day. In a day it is allowed to compose and drop multiple bags.",
    "samples": [
        [
            "3 2\n3 2 1\n",
            "3\n"
        ],
        [
            "5 1\n1000000000 1000000000 1000000000 1000000000 1000000000\n",
            "5000000000\n"
        ],
        [
            "3 2\n1 0 1\n",
            "2\n"
        ],
        [
            "4 4\n2 8 4 1\n",
            "4\n"
        ]
    ],
    "hint": "",
    "translation": "Vasya已经很多次忘记将垃圾从公寓里扔出去。现在他想制定一个计划并遵守它。\n对于接下来的n天Vasya知道他每天会制造ai的垃圾。Vasya会将垃圾放在垃圾袋中并扔掉垃圾袋每个袋子能装k的垃圾，一天可以扔掉或使用多个垃圾袋。\nVasya想要使用最少的垃圾袋，你需要输出最少的垃圾袋数量。\n\n当天生产的垃圾是可以留到第二天的，但最多留到第二天。"
}