{
    "description": "You came to the exhibition and one exhibit has drawn your attention. It consists of $ n $ stacks of blocks, where the $ i $ -th stack consists of $ a_i $ blocks resting on the surface.\n\nThe height of the exhibit is equal to $ m $ . Consequently, the number of blocks in each stack is less than or equal to $ m $ .\n\nThere is a camera on the ceiling that sees the top view of the blocks and a camera on the right wall that sees the side view of the blocks.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1061B/f0bac26a304f5339f8800747dc3cc95aa0eba485.png)Find the maximum number of blocks you can remove such that the views for both the cameras would not change.\n\nNote, that while originally all blocks are stacked on the floor, it is not required for them to stay connected to the floor after some blocks are removed. There is no gravity in the whole exhibition, so no block would fall down, even if the block underneath is removed. It is not allowed to move blocks by hand either.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n \\le 100\\,000 $ , $ 1 \\le m \\le 10^9 $ ) — the number of stacks and the height of the exhibit.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\le a_i \\le m $ ) — the number of blocks in each stack from left to right.",
    "outputFormat": "Print exactly one integer — the maximum number of blocks that can be removed.",
    "samples": [
        [
            "5 6\n3 3 3 3 3\n",
            "10"
        ],
        [
            "3 5\n1 2 4\n",
            "3"
        ],
        [
            "5 5\n2 3 1 4 4\n",
            "9"
        ],
        [
            "1 1000\n548\n",
            "0"
        ],
        [
            "3 3\n3 1 1\n",
            "1"
        ]
    ],
    "hint": "The following pictures illustrate the first example and its possible solution.\n\nBlue cells indicate removed blocks. There are $ 10 $ blue cells, so the answer is $ 10 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1061B/5c39371a94179ca28ceb7e2172bc3ac014dca01f.png)",
    "translation": "在长 $n$ 高 $m$ 的二维空间中，第 $i$ 列搭有 $a_i$ 个方块。求最多能移走多少方块，使从上往下看和从右往左看不变。\r\n\r\n由于该二维空间失重，移除方块不会导致其他任何方块掉落。"
}