{
    "description": "You are managing a mobile phone network, and want to offer competitive prices to connect a network.\n\nThe network has $ n $ nodes.\n\nYour competitor has already offered some connections between some nodes, with some fixed prices. These connections are bidirectional. There are initially $ m $ connections the competitor is offering. The $ i $ -th connection your competitor is offering will connect nodes $ fa_i $ and $ fb_i $ and costs $ fw_i $ .\n\nYou have a list of $ k $ connections that you want to offer. It is guaranteed that this set of connection does not form any cycle. The $ j $ -th of these connections will connect nodes $ ga_j $ and $ gb_j $ . These connections are also bidirectional. The cost of these connections have not been decided yet.\n\nYou can set the prices of these connections to any arbitrary integer value. These prices are set independently for each connection. After setting the prices, the customer will choose such $ n - 1 $ connections that all nodes are connected in a single network and the total cost of chosen connections is minimum possible. If there are multiple ways to choose such networks, the customer will choose an arbitrary one that also maximizes the number of your connections in it.\n\nYou want to set prices in such a way such that all your $ k $ connections are chosen by the customer, and the sum of prices of your connections is maximized.\n\nPrint the maximum profit you can achieve, or $ -1 $ if it is unbounded.",
    "inputFormat": "The first line of input will contain three integers $ n $ , $ k $ and $ m $ ( $ 1 \\leq n, k, m \\leq 5 \\cdot 10^5, k \\leq n-1 $ ), the number of nodes, the number of your connections, and the number of competitor connections, respectively.\n\nThe next $ k $ lines contain two integers $ ga_i $ and $ gb_i $ ( $ 1 \\leq ga_i, gb_i \\leq n $ , $ ga_i \\not= gb_i $ ), representing one of your connections between nodes $ ga_i $ and $ gb_i $ . Your set of connections is guaranteed to be acyclic.\n\nThe next $ m $ lines contain three integers each, $ fa_i $ , $ fb_i $ and $ fw_i $ ( $ 1 \\leq fa_i, fb_i \\leq n $ , $ fa_i \\not= fb_i $ , $ 1 \\leq fw_i \\leq 10^9 $ ), denoting one of your competitor's connections between nodes $ fa_i $ and $ fb_i $ with cost $ fw_i $ . None of these connections connects a node to itself, and no pair of these connections connect the same pair of nodes. In addition, these connections are given by non-decreasing order of cost (that is, $ fw_{i-1} \\leq fw_i $ for all valid $ i $ ).\n\nNote that there may be some connections that appear in both your set and your competitor's set (though no connection will appear twice in one of this sets).\n\nIt is guaranteed that the union of all of your connections and your competitor's connections form a connected network.",
    "outputFormat": "Print a single integer, the maximum possible profit you can achieve if you set the prices on your connections appropriately. If the profit is unbounded, print $ -1 $ .",
    "samples": [
        [
            "4 3 6\n1 2\n3 4\n1 3\n2 3 3\n3 1 4\n1 2 4\n4 2 8\n4 3 8\n4 1 10\n",
            "14\n"
        ],
        [
            "3 2 1\n1 2\n2 3\n1 2 30\n",
            "-1\n"
        ],
        [
            "4 3 3\n1 2\n1 3\n1 4\n4 1 1000000000\n4 2 1000000000\n4 3 1000000000\n",
            "3000000000\n"
        ]
    ],
    "hint": "In the first sample, it's optimal to give connection $ 1-3 $ cost $ 3 $ , connection $ 1-2 $ cost $ 3 $ , and connection $ 3-4 $ cost $ 8 $ . In this case, the cheapest connected network has cost $ 14 $ , and the customer will choose one that chooses all of your connections.\n\nIn the second sample, as long as your first connection costs $ 30 $ or less, the customer chooses both your connections no matter what is the cost of the second connection, so you can get unbounded profit in this case.",
    "translation": "网络有 $n$ 个节点。  \r\n你的竞争者在一些节点之间提供了连接。竞争者提供了 $m$ 个连接，对于提供的第 $i$ 个连接，联通了 $fa_i$ 和 $fb_i$ ，价格为 $fw_i$ 。  \r\n你想提供 $k$ 个连接。（保证这些连接不成环。）第 $j$ 个连接联通了 $ga_j$ 和 $gb_j$ ，它们的价格还没有决定。  \r\n你想设置合适的价格，使得：\r\n- 你的 $k$ 个连接都会被顾客选择。\r\n-  $k$ 个连接的价格总和最大。  \r\n\r\n所有连接都是双向的。  \r\n输出这个最大值。如果最大值无穷大，输出 $-1$ 。\r\n\r\n翻译by评论区 @callG"
}