{
    "description": "One day, Yuhao came across a problem about checking if some bracket sequences are correct bracket sequences.\n\nA bracket sequence is any non-empty sequence of opening and closing parentheses. A bracket sequence is called a correct bracket sequence if it's possible to obtain a correct arithmetic expression by inserting characters \"+\" and \"1\" into this sequence. For example, the sequences \"(())()\", \"()\" and \"(()(()))\" are correct, while the bracket sequences \")(\", \"(()\" and \"(()))(\" are not correct.\n\nYuhao found this problem too simple for him so he decided to make the problem harder. You are given many (not necessarily correct) bracket sequences. The task is to connect some of them into ordered pairs so that each bracket sequence occurs in at most one pair and the concatenation of the bracket sequences in each pair is a correct bracket sequence. The goal is to create as many pairs as possible.\n\nThis problem unfortunately turned out to be too difficult for Yuhao. Can you help him and solve it?",
    "inputFormat": "The first line contains one integer $ n $ ( $ 1 \\leq n \\leq 10^5 $ ) — the number of bracket sequences.\n\nEach of the following $ n $ lines contains one bracket sequence — a non-empty string which consists only of characters \"(\" and \")\".\n\nThe sum of lengths of all bracket sequences in the input is at most $ 5 \\cdot 10^5 $ .\n\nNote that a bracket sequence may appear in the input multiple times. In this case, you can use each copy of the sequence separately. Also note that the order in which strings appear in the input doesn't matter.",
    "outputFormat": "Print a single integer — the maximum number of pairs which can be made, adhering to the conditions in the statement.",
    "samples": [
        [
            "7\n)())\n)\n((\n((\n(\n)\n)\n",
            "2\n"
        ],
        [
            "4\n(\n((\n(((\n(())\n",
            "0\n"
        ],
        [
            "2\n(())\n()\n",
            "1\n"
        ]
    ],
    "hint": "In the first example, it's optimal to construct two pairs: \"(( )())\" and \"( )\".",
    "translation": "有 $n$ 组不一定合法的括号序列，要使这 $n$ 个括号序列两两配对，成为合法括号序列。求最多能配对出多少对。\n\n### 数据范围\n\n- $1\\leq n \\leq 10^5$\n- 所有括号序列的长度之和不超过 $5\\cdot 10^5$。"
}