{
    "description": "There is a strange peculiarity: if you connect the cities of Rostov, Taganrog and Shakhty, peculiarly, you get a triangle\n\n«Unbelievable But True»\n\n\n\nStudents from many different parts of Russia and abroad come to Summer Informatics School. You marked the hometowns of the SIS participants on a map.\n\nNow you decided to prepare an interesting infographic based on this map. The first thing you chose to do is to find three cities on this map, such that they form a triangle with area $ S $ .",
    "inputFormat": "The first line of input contains two integers $ n $ and $ S $ ( $ 3 \\le n \\le 2000 $ , $ 1 \\le S \\le 2 \\cdot 10^{18} $ ) — the number of cities on the map and the area of the triangle to be found.\n\nThe next $ n $ lines contain descriptions of the cities, one per line. Each city is described by its integer coordinates $ x_i $ , $ y_i $ ( $ -10^9 \\le x_i, y_i \\le 10^9 $ ).\n\nIt is guaranteed that all cities are located at distinct points. It is also guaranteed that no three cities lie on the same line.",
    "outputFormat": "If the solution doesn't exist — print «No».\n\nOtherwise, print «Yes», followed by three pairs of coordinates $ (x, y) $ — the locations of the three cities, which form the triangle of area $ S $ .",
    "samples": [
        [
            "3 7\n0 0\n3 0\n0 4\n",
            "No\n"
        ],
        [
            "4 3\n0 0\n2 0\n1 2\n1 3\n",
            "Yes\n0 0\n1 3\n2 0\n"
        ]
    ],
    "hint": "",
    "translation": "题意简述\r\n\r\n给出$N$个点，是否存在$3$个点，它们组成的三角形面积为$S$。\r\n\r\n输入数据\r\n\r\n第一行两个正整数$N,S(3 \\leq N \\leq 2000 , 1 \\leq S \\leq 2 \\times 10^{18})$\r\n\r\n接下来$N$行每行$2$个整数$x_i,y_i(-10^9 \\leq x_i,y_i \\leq 10^9)$描述一个点。保证不存在两点坐标相同，不存在三点共线\r\n\r\n输出数据\r\n\r\n如果存在，第一行输出```Yes```，接下来三行每行两个整数表示你找到的三角形的三个顶点。如果不存在，输出一行```No```"
}