{
    "description": "Vova plans to go to the conference by train. Initially, the train is at the point $ 1 $ and the destination point of the path is the point $ L $ . The speed of the train is $ 1 $ length unit per minute (i.e. at the first minute the train is at the point $ 1 $ , at the second minute — at the point $ 2 $ and so on).\n\nThere are lanterns on the path. They are placed at the points with coordinates divisible by $ v $ (i.e. the first lantern is at the point $ v $ , the second is at the point $ 2v $ and so on).\n\nThere is also exactly one standing train which occupies all the points from $ l $ to $ r $ inclusive.\n\nVova can see the lantern at the point $ p $ if $ p $ is divisible by $ v $ and there is no standing train at this position ( $ p \\not\\in [l; r] $ ). Thus, if the point with the lantern is one of the points covered by the standing train, Vova can't see this lantern.\n\nYour problem is to say the number of lanterns Vova will see during the path. Vova plans to go to $ t $ different conferences, so you should answer $ t $ independent queries.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of queries.\n\nThen $ t $ lines follow. The $ i $ -th line contains four integers $ L_i, v_i, l_i, r_i $ ( $ 1 \\le L, v \\le 10^9 $ , $ 1 \\le l \\le r \\le L $ ) — destination point of the $ i $ -th path, the period of the lantern appearance and the segment occupied by the standing train.",
    "outputFormat": "Print $ t $ lines. The $ i $ -th line should contain one integer — the answer for the $ i $ -th query.",
    "samples": [
        [
            "4\n10 2 3 7\n100 51 51 51\n1234 1 100 199\n1000000000 1 1 1000000000\n",
            "3\n0\n1134\n0\n"
        ]
    ],
    "hint": "For the first example query, the answer is $ 3 $ . There are lanterns at positions $ 2 $ , $ 4 $ , $ 6 $ , $ 8 $ and $ 10 $ , but Vova didn't see the lanterns at positions $ 4 $ and $ 6 $ because of the standing train.\n\nFor the second example query, the answer is $ 0 $ because the only lantern is at the point $ 51 $ and there is also a standing train at this point.\n\nFor the third example query, the answer is $ 1134 $ because there are $ 1234 $ lanterns, but Vova didn't see the lanterns from the position $ 100 $ to the position $ 199 $ inclusive.\n\nFor the fourth example query, the answer is $ 0 $ because the standing train covers the whole path.",
    "translation": "## 题意描述：\n\n$Vova$先生要乘火车去旅行，火车一开始位于$1$点，以每秒1个单位的速度向前行驶，最终到达$L$处。（也就是说，火车在第$1min$时在$1$处,在$2min$时在2处）\n\n铁路沿线挂着一些灯笼，这些灯笼的位于坐标是$v$的倍数的地方，第一个灯笼位于$v$处\n\n同时，有另一列火车停在另一侧的轨道上，这列火车的左右端点位于$l$和$r$处\n\n当$Vova$先生经过一个地点，这个地点既有灯笼，又没有被另一列火车挡住时，我们称$Vova$先生可以看到灯笼，现在，我们需要你求出一路上$Vova$先生能看到几盏灯笼。本题有多组数据。\n\n## 输入输出格式：\n### 输入格式：\n第一行：一个整数$t(1≤t≤10^4$)，表示数据组数\n\n下面$t$行，每行4个整数$L_i$，$v_i$，$l_i$，$r_i$,$(1≤L,v≤10^9,1≤l≤r≤L)$,各个字母的含义上文已经给出\n\n### 输出格式：\n$t$行，每$1$个整数，表示$Vova$先生能看到的灯笼数"
}