{
    "description": "Berland forest was planted several decades ago in a formation of an infinite grid with a single tree in every cell. Now the trees are grown up and they form a pretty dense structure.\n\nSo dense, actually, that the fire became a real danger for the forest. This season had been abnormally hot in Berland and some trees got caught on fire!\n\nThe second fire started is considered the second $ 0 $ . Every second fire lit up all intact neightbouring trees to every currently burning tree. The tree is neighbouring if it occupies adjacent by side or by corner cell. Luckily, after $ t $ seconds Berland fire department finally reached the location of fire and instantaneously extinguished it all.\n\nNow they want to calculate the destructive power of the fire. Let $ val_{x, y} $ be the second the tree in cell $ (x, y) $ got caught on fire. The destructive power is the sum of $ val_{x, y} $ over all $ (x, y) $ of burnt trees.\n\nClearly, all the workers of fire department are firefighters, not programmers, thus they asked you to help them calculate the destructive power of the fire.\n\nThe result can be rather big, so print it modulo $ 998244353 $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ t $ ( $ 1 \\le n \\le 50 $ , $ 0 \\le t \\le 10^8 $ ) — the number of trees that initially got caught on fire and the time fire department extinguished the fire, respectively.\n\nEach of the next $ n $ lines contains two integers $ x $ and $ y $ ( $ -10^8 \\le x, y \\le 10^8 $ ) — the positions of trees that initially got caught on fire.\n\nObviously, the position of cell $ (0, 0) $ on the grid and the directions of axes is irrelevant as the grid is infinite and the answer doesn't depend on them.\n\nIt is guaranteed that all the given tree positions are pairwise distinct.\n\nThe grid is infinite so the fire doesn't stop once it reaches $ -10^8 $ or $ 10^8 $ . It continues beyond these borders.",
    "outputFormat": "Print a single integer — the sum of $ val_{x, y} $ over all $ (x, y) $ of burnt trees modulo $ 998244353 $ .",
    "samples": [
        [
            "1 2\n10 11\n",
            "40"
        ],
        [
            "4 1\n2 2\n1 3\n0 2\n2 4\n",
            "18"
        ],
        [
            "3 0\n0 0\n-2 1\n1 1\n",
            "0"
        ]
    ],
    "hint": "Here are the first three examples. The grey cells have $ val = 0 $ , the orange cells have $ val = 1 $ and the red cells have $ val = 2 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1086F/cb9e62b1e70abf36d285ed071b42fbdd39834039.png)",
    "translation": "有一个无限大的网格图，在第0秒的时候，有$n$个格子会着火，每隔一秒，一个着火的格子会导致和它**八连通**的未着火的格子着火，定义一个着火格子的权值为它最早着火的时间，求$t$秒之后所有着火格子的权值和。\r\n\r\n$n<=50$\r\n\r\n$-10^8<=x_i,y_i<=10^8$\r\n\r\n$0<=t<=10^8$"
}