{
    "description": "Masha has three sticks of length $ a $ , $ b $ and $ c $ centimeters respectively. In one minute Masha can pick one arbitrary stick and increase its length by one centimeter. She is not allowed to break sticks.\n\nWhat is the minimum number of minutes she needs to spend increasing the stick's length in order to be able to assemble a triangle of positive area. Sticks should be used as triangle's sides (one stick for one side) and their endpoints should be located at triangle's vertices.",
    "inputFormat": "The only line contains tree integers $ a $ , $ b $ and $ c $ ( $ 1 \\leq a, b, c \\leq 100 $ ) — the lengths of sticks Masha possesses.",
    "outputFormat": "Print a single integer — the minimum number of minutes that Masha needs to spend in order to be able to make the triangle of positive area from her sticks.",
    "samples": [
        [
            "3 4 5\n",
            "0\n"
        ],
        [
            "2 5 3\n",
            "1\n"
        ],
        [
            "100 10 10\n",
            "81\n"
        ]
    ],
    "hint": "In the first example, Masha can make a triangle from the sticks without increasing the length of any of them.\n\nIn the second example, Masha can't make a triangle of positive area from the sticks she has at the beginning, but she can spend one minute to increase the length $ 2 $ centimeter stick by one and after that form a triangle with sides $ 3 $ , $ 3 $ and $ 5 $ centimeters.\n\nIn the third example, Masha can take $ 33 $ minutes to increase one of the $ 10 $ centimeters sticks by $ 33 $ centimeters, and after that take $ 48 $ minutes to increase another $ 10 $ centimeters stick by $ 48 $ centimeters. This way she can form a triangle with lengths $ 43 $ , $ 58 $ and $ 100 $ centimeters in $ 81 $ minutes. One can show that it is impossible to get a valid triangle faster.",
    "translation": "## 题目描述  \nMasha有三根长度分别为a,b,c厘米的小棒。每一分钟，Masha可以选择一根小棒并将它的长度增加一厘米，但他不可以折断小棒。\n现在他要你求出他最少需要多少时间使得这三根小棒可以构成一个三角形。\n## 输入格式  \n三个数，分别为a,b,c\n## 输出格式  \n一个数，为Masha最少需要的时间\n"
}