{
    "description": "There are $ n $ cities and $ m $ two-way roads in Berland, each road connecting two distinct cities.\n\nRecently the Berland government has made a tough decision to transfer ownership of the roads to private companies. In total, there are $ 100500 $ private companies in Berland, numbered by integers from $ 1 $ to $ 100500 $ . After the privatization, every road should belong to exactly one company.\n\nThe anti-monopoly committee demands that after the privatization each company can own at most two roads. The urbanists of Berland also stated their opinion: each city should be adjacent to the roads owned by at most $ k $ companies.\n\nHelp the government to distribute the roads between the companies so that both conditions are satisfied. That is, each company gets at most two roads, and each city has roads of at most $ k $ distinct companies adjacent to it.",
    "inputFormat": "Input contains one or several test cases. The first line contains an integer $ t $ ( $ 1 \\le t \\le 300 $ ) — the number of test cases in the input. Solve test cases separately, test cases are completely independent and do not affect each other.\n\nThe following lines describe the test cases. Each case starts with a line consisting of three space-separated integers $ n $ , $ m $ and $ k $ ( $ 2 \\le n \\le 600 $ , $ 1 \\le m \\le 600 $ , $ 1 \\le k \\le n - 1 $ ) — the number of cities, the number of roads and the maximum diversity of the roads adjacent to a city.\n\nThen $ m $ lines follow, each having a pair of space-separated integers $ a_i $ , $ b_i $ ( $ 1 \\le a_i, b_i \\le n $ ; $ a_i \\ne b_i $ ). It means that the $ i $ -th road connects cities $ a_i $ and $ b_i $ . All roads are two-way. There is at most one road between a pair of the cities.\n\nThe sum of $ n $ values for all test cases doesn't exceed $ 600 $ . The sum of $ m $ values for all test cases doesn't exceed $ 600 $ .",
    "outputFormat": "Print $ t $ lines: the $ i $ -th line should contain the answer for the $ i $ -th test case. For a test case, print a sequence of integers $ c_1, c_2, \\dots, c_m $ separated by space, where $ c_i $ ( $ 1 \\le c_i \\le 100500 $ ) is the company which owns the $ i $ -th road in your plan. If there are multiple solutions, output any of them. If there is no solution for a test case, print $ c_1=c_2=\\ldots=c_m=0 $ .",
    "samples": [
        [
            "3\n3 3 2\n1 2\n2 3\n3 1\n4 5 2\n1 2\n1 3\n1 4\n2 3\n2 4\n4 6 2\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4\n",
            "1 2 3 \n2 1 1 2 3 \n0 0 0 0 0 0 \n"
        ]
    ],
    "hint": "",
    "translation": "给一个 $n$ 个点 $m$ 条边的无向图和一个参数 $k$，现在需要对图上的所有边染色，满足：\r\n\r\n- 所有颜色为 $1$ 至 $100500$ 间的整数；\r\n- 同种颜色的边最多两条；\r\n- 每个点周围所有边的不同颜色数 $\\le k$。\r\n\r\n构造染色方案，若无解输出 $m$ 个 $0$。"
}