{
    "description": "The only difference between easy and hard versions is the constraints.\n\nPolycarp has to write a coursework. The coursework consists of $ m $ pages.\n\nPolycarp also has $ n $ cups of coffee. The coffee in the $ i $ -th cup has $ a_i $ caffeine in it. Polycarp can drink some cups of coffee (each one no more than once). He can drink cups in any order. Polycarp drinks each cup instantly and completely (i.e. he cannot split any cup into several days).\n\nSurely, courseworks are not usually being written in a single day (in a perfect world of Berland, at least). Some of them require multiple days of hard work.\n\nLet's consider some day of Polycarp's work. Consider Polycarp drinks $ k $ cups of coffee during this day and caffeine dosages of cups Polycarp drink during this day are $ a_{i_1}, a_{i_2}, \\dots, a_{i_k} $ . Then the first cup he drinks gives him energy to write $ a_{i_1} $ pages of coursework, the second cup gives him energy to write $ max(0, a_{i_2} - 1) $ pages, the third cup gives him energy to write $ max(0, a_{i_3} - 2) $ pages, ..., the $ k $ -th cup gives him energy to write $ max(0, a_{i_k} - k + 1) $ pages.\n\nIf Polycarp doesn't drink coffee during some day, he cannot write coursework at all that day.\n\nPolycarp has to finish his coursework as soon as possible (spend the minimum number of days to do it). Your task is to find out this number of days or say that it is impossible.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1 \\le n \\le 100 $ , $ 1 \\le m \\le 10^4 $ ) — the number of cups of coffee and the number of pages in the coursework.\n\nThe second line of the input contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 100 $ ), where $ a_i $ is the caffeine dosage of coffee in the $ i $ -th cup.",
    "outputFormat": "If it is impossible to write the coursework, print -1. Otherwise print the minimum number of days Polycarp needs to do it.",
    "samples": [
        [
            "5 8\n2 3 1 1 2\n",
            "4\n"
        ],
        [
            "7 10\n1 3 4 2 1 4 2\n",
            "2\n"
        ],
        [
            "5 15\n5 5 5 5 5\n",
            "1\n"
        ],
        [
            "5 16\n5 5 5 5 5\n",
            "2\n"
        ],
        [
            "5 26\n5 5 5 5 5\n",
            "-1\n"
        ]
    ],
    "hint": "In the first example Polycarp can drink fourth cup during first day (and write $ 1 $ page), first and second cups during second day (and write $ 2 + (3 - 1) = 4 $ pages), fifth cup during the third day (and write $ 2 $ pages) and third cup during the fourth day (and write $ 1 $ page) so the answer is $ 4 $ . It is obvious that there is no way to write the coursework in three or less days in this test.\n\nIn the second example Polycarp can drink third, fourth and second cups during first day (and write $ 4 + (2 - 1) + (3 - 2) = 6 $ pages) and sixth cup during second day (and write $ 4 $ pages) so the answer is $ 2 $ . It is obvious that Polycarp cannot write the whole coursework in one day in this test.\n\nIn the third example Polycarp can drink all cups of coffee during first day and write $ 5 + (5 - 1) + (5 - 2) + (5 - 3) + (5 - 4) = 15 $ pages of coursework.\n\nIn the fourth example Polycarp cannot drink all cups during first day and should drink one of them during the second day. So during first day he will write $ 5 + (5 - 1) + (5 - 2) + (5 - 3) = 14 $ pages of coursework and during second day he will write $ 5 $ pages of coursework. This is enough to complete it.\n\nIn the fifth example Polycarp cannot write the whole coursework at all, even if he will drink one cup of coffee during each day, so the answer is -1.",
    "translation": "#### 题意\n\nPolycarp 有 $n$ 杯咖啡，每一杯咖啡都有一个对应的权值 $a_i$。\n\n同时，他还有 $m$ 个任务：\n\n每一天可以选择喝任意杯咖啡  $i_1,i_2,i_3,\\cdots，i_{k-1},i_k$。其中，喝掉第一杯可以完成第 $a_{i_1}$ 个任务，喝掉第二杯可以完成第 $\\max\\{a_{i_2}-1,0\\}$ 个任务……喝掉第 $k$ 杯可以完成第 $\\max\\{a_{i_k}-k+1,0\\}$ 个任务 。\n\nPolycarp 想知道，至少需要多少天他才能完成这所有的 $m$ 个任务；如若他不能完成，则输出 $-1$。\n\n#### 输入\n第一行，两个整数 $n$ 和 $m$;\n\n第二行，共 $n$ 个整数，第 $i$ 个整数表示第 $i$ 杯咖啡的权值 $a_i$。\n\n#### 输出\n共一行，若可以完成所有任务，输出最少所需要的天数；反之，输出 $-1$。\n\n#### 数据范围\n\n$1 \\leq n \\leq 100 , 1 \\leq m \\leq n^4 , 1 \\leq a_i \\leq 100$"
}