{
    "description": "Semyon participates in the most prestigious competition of the world ocean for the title of the most dangerous shark. During this competition sharks compete in different subjects: speed swimming, masking, map navigation and many others. Now Semyon is taking part in «destruction» contest.\n\nDuring it, $ m $ dominoes are placed in front of the shark. All dominoes are on the same line, but the height of the dominoes may vary. The distance between adjacent dominoes is $ 1 $ . Moreover, each Domino has its own cost value, expressed as an integer. The goal is to drop all the dominoes. To do this, the shark can push any domino to the left or to the right, and it will begin falling in this direction. If during the fall the domino touches other dominoes, they will also start falling in the same direction in which the original domino is falling, thus beginning a chain reaction, as a result of which many dominoes can fall. A falling domino touches another one, if and only if the distance between them was strictly less than the height of the falling domino, the dominoes do not necessarily have to be adjacent.\n\nOf course, any shark can easily drop all the dominoes in this way, so the goal is not to drop all the dominoes, but do it with a minimum cost. The cost of the destruction is the sum of the costs of dominoes that the shark needs to push to make all the dominoes fall.\n\nSimon has already won in the previous subjects, but is not smart enough to win in this one. Help Semyon and determine the minimum total cost of the dominoes he will have to push to make all the dominoes fall.",
    "inputFormat": "In order to reduce input size, the heights and costs of the dominoes are described with blocks.\n\nThe first line contains two integers $ n $ and $ m $ ( $ 1 \\leq n \\leq 250\\,000, 1 \\leq m \\leq 10^7 $ ) — the number of the blocks and the total number of the dominoes Semyon must drop.\n\nThen descriptions of $ n $ blocks follow. Description of every block consists of three lines.\n\nThe first line of block's description contains a single integer $ k_i $ ( $ 1 \\leq k_i \\leq 250\\,000, \\sum_{i = 1}^{n}{k_i} \\leq 250\\,000 $ ) — the number of dominoes in the block.\n\nThe second line of block's description contains $ k_i $ integers $ a_j $ ( $ 1 \\leq a_j \\leq m $ ) — the heights of the dominoes in the blocks.\n\nThe third line contains $ k_i $ integers $ c_j $ ( $ 1 \\leq c_j \\leq 100\\,000 $ ) — the costs of the dominoes in the block.\n\nThen the domino sequence is described (from left to right).\n\nThe first line of this description contains a single integer $ q $ ( $ n \\leq q \\leq 250\\,000 $ ) — the number of blocks in the sequence of domino sequence.\n\nEach of the following $ q $ lines contains integers $ id_i, mul_i $ ( $ 1 \\leq id_i \\leq n $ , $ 1 \\leq mul_i \\leq 100\\,000 $ ), denoting that the next $ k_{id_i} $ dominoes are dominoes of the block $ id_i $ , with their cost multiplied by $ mul_i $ .\n\nIt's guaranteed, that $ \\sum_{i = 1}^{q}{k_{id_i}} = m $ , and that's every block is used in the sequence at least once.",
    "outputFormat": "Print exactly one integer — the minimum cost to make all the dominoes fall.",
    "samples": [
        [
            "2 7\n3\n1 2 2\n1 2 1\n1\n3\n2\n3\n2 2\n1 3\n1 1\n",
            "5\n"
        ],
        [
            "1 1\n1\n1\n100000\n1\n1 100000\n",
            "10000000000\n"
        ]
    ],
    "hint": "In the first example, there are $ 7 $ dominoes in front of the Semyon. Their heights are equal to $ [3, 1, 2, 2, 1, 2, 2] $ , and their costs are equal to $ [4, 3, 6, 3, 1, 2, 1] $ . Semyon should drop the domino with index $ 7 $ to the left, it will fall and drop the domino $ 6 $ as well. The domino $ 6 $ during the fall will drop the domino $ 5 $ , however the latter will not drop any more dominoes. Then Semyon should drop domino with number $ 1 $ to the right and it will drop dominoes $ 2 $ and $ 3 $ after falling. And the domino $ 3 $ will drop the domino $ 4 $ after falling. Hence all dominoes are fallen this way.\n\nIn the second example, there is a single domino of cost $ 10000000000 $ .",
    "translation": "你有 $n$ 种多米诺骨牌的序列，第 $i$ 种序列中每个骨牌都有高度 $a$ 和权值 $c$。\r\n\r\n现在用如下方法操作 $q$ 次构造出一个长度为 $m$ 的骨牌序列：每次给定 $id$ 和 $mul$，然后把第 $id$ 种骨牌序列接到当前序列的末尾，并且这些刚加进来的骨牌的权值乘上 $mul$。这个序列中相邻两个骨牌的距离为$1$。\r\n\r\n你需要推倒所有骨牌。每次都可以选择一个骨牌往左边或右边推倒，会产生骨牌权值的代价，并且这个骨牌倒下可能会导致在它倒下方向上的其他没倒的骨牌也沿着同一方向推倒，骨牌 $i$ 能被 $j$ 推倒当且仅当 $i,j$      之间的距离 $<a_j$。要求出推倒所有骨牌的最小代价。"
}