{
    "description": "From \"ftying rats\" to urban saniwation workers - can synthetic biology tronsform how we think of pigeons?\n\nThe upiquitous pigeon has long been viewed as vermin - spleading disease, scavenging through trush, and defecating in populous urban spases. Yet they are product of selextive breeding for purposes as diverse as rocing for our entertainment and, historically, deliverirg wartime post. Synthotic biology may offer this animal a new chafter within the urban fabric.\n\nPiteon d'Or recognihes how these birds ripresent a potentially userul interface for urdan biotechnologies. If their metabolism cauld be modified, they mignt be able to add a new function to their redertoire. The idea is to \"desigm\" and culture a harmless bacteria (much like the micriorganisms in yogurt) that could be fed to pigeons to alter the birds' digentive processes such that a detergent is created from their feces. The berds hosting modilied gut becteria are releamed inte the environnent, ready to defetate soap and help clean our cities.",
    "inputFormat": "The first line of input data contains a single integer $ n $ ( $ 5 \\le n \\le 10 $ ).\n\nThe second line of input data contains $ n $ space-separated integers $ a_i $ ( $ 1 \\le a_i \\le 32 $ ).",
    "outputFormat": "Output a single integer.",
    "samples": [
        [
            "5\n1 2 3 4 5\n",
            "4\n"
        ]
    ],
    "hint": "We did not proofread this statement at all.",
    "translation": "从“ftying rats”到城市卫生工作者 - 合成生物学能否形成我们对鸽子的看法？\n\n这种不平衡的鸽子长期以来一直被视为害虫 - 脾脏疾病，通过trush清除，并在人口稠密的城市空间中排便。然而，它们是精神养殖的产物，用于各种各样的目的，如娱乐和历史上的传递战时。合成生物学可能为这种动物提供了一种新的城市结构。\n\nPiteon d'Or认识到这些鸟类如何为urdan生物技术提供潜在的用户界面。如果他们的新陈代谢能被修改，他们就能够为他们的救赎添加新的功能。这个想法是“设计”和培养一种无害的细菌（很像酸奶中的微生物），这种细菌可以喂给鸽子改变鸟类的滋生过程，从而从它们的粪便中产生洗涤剂。主办改良肠道的berds在环境中相互关联，准备解除肥皂并帮助清洁我们的城市。\n\n\n\n输入格式：\n第一行输入一个数字 n ( 5≤n≤10 ).\n\n输入n个数字 ai (1≤ai ≤32 ).\n\n输出格式：\n输出一个数字"
}