{
    "description": "In the year of 3000 travelling around parallel realities became a routine thing. However one has to take into consideration that travelling like that is highly dangerous as you never know beforehand where you're gonna get...\n\nLittle Vasya, for instance, found himself in a gaming reality and now he has to successfully complete all levels of a very weird game to get back. The gaming reality is a three-dimensional space where $ n $ points are given. The game has $ m $ levels and at the beginning of the $ i $ -th level the player is positioned at some plane $ Q_{i} $ that passes through the origin. On each level Vasya has to use special robots to construct and activate $ n $ powerful energy spheres of the equal radius with centers at the given points. The player chooses the radius of the spheres himself. The player has to spend $ R $ units of money to construct spheres whose radius equals $ R $ (consequently, one can construct spheres whose radius equals zero for free). Besides, once for each level a player can choose any point in space and release a laser ray from there, perpendicular to plane $ Q_{i} $ (this action costs nothing). The ray can either be directed towards the plane or from the plane. The spheres that share at least one point with the ray will be immediately activated. The level is considered completed if the player has managed to activate all spheres. Note that the centers of the spheres are the same for all $ m $ levels but the spheres do not remain: the player should construct them anew on each new level.\n\nHelp Vasya find out what minimum sum of money will be enough to complete each level.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n<=900,1<=m<=100 $ ) — the number of energetic spheres and the number of levels in the game correspondingly.\n\nEach of the following $ n $ lines contains three integers $ x_{i} $ , $ y_{i} $ , $ z_{i} $ ( $ 0<=x_{i},y_{i},z_{i}<=10^{4} $ ) — the coordinates of the center of the $ i $ -th sphere. Assume that these points do not change their positions throughout the game.\n\nThen follow $ m $ lines, each containing three integers $ a_{i} $ , $ b_{i} $ , $ c_{i} $ ( $ 0<=a_{i},b_{i},c_{i}<=100 $ , $ a_{i}^{2}+b_{i}^{2}+c_{i}^{2}&gt;0 $ ). These numbers are the coefficients in the equation of plane $ Q_{i} $ ( $ a_{i}x+b_{i}y+c_{i}z=0 $ ), where the player is positioned at the beginning of the $ i $ -th level.",
    "outputFormat": "Print $ m $ numbers, one per line: the $ i $ -th line should contain the minimum sum of money needed to complete the $ i $ -th level. The absolute or relative error should not exceed $ 10^{-6} $ .",
    "samples": [
        [
            "4 1\n0 0 0\n0 1 0\n1 0 0\n1 1 0\n0 0 1\n",
            "0.7071067812\n"
        ],
        [
            "5 3\n0 1 0\n1 0 1\n1 2 1\n2 0 1\n1 3 0\n1 1 1\n1 2 3\n3 0 3\n",
            "1.6329931619\n1.6366341768\n1.5411035007\n"
        ],
        [
            "2 1\n0 20 0\n0 0 0\n0 10 0\n",
            "0.0000000000\n"
        ]
    ],
    "hint": ""
}