{
    "description": "Kilani is playing a game with his friends. This game can be represented as a grid of size $ n \\times m $ , where each cell is either empty or blocked, and every player has one or more castles in some cells (there are no two castles in one cell).\n\nThe game is played in rounds. In each round players expand turn by turn: firstly, the first player expands, then the second player expands and so on. The expansion happens as follows: for each castle the player owns now, he tries to expand into the empty cells nearby. The player $ i $ can expand from a cell with his castle to the empty cell if it's possible to reach it in at most $ s_i $ (where $ s_i $ is player's expansion speed) moves to the left, up, right or down without going through blocked cells or cells occupied by some other player's castle. The player examines the set of cells he can expand to and builds a castle in each of them at once. The turned is passed to the next player after that.\n\nThe game ends when no player can make a move. You are given the game field and speed of the expansion for each player. Kilani wants to know for each player how many cells he will control (have a castle their) after the game ends.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ p $ ( $ 1 \\le n, m \\le 1000 $ , $ 1 \\le p \\le 9 $ ) — the size of the grid and the number of players.\n\nThe second line contains $ p $ integers $ s_i $ ( $ 1 \\le s \\le 10^9 $ ) — the speed of the expansion for every player.\n\nThe following $ n $ lines describe the game grid. Each of them consists of $ m $ symbols, where '.' denotes an empty cell, '\\#' denotes a blocked cell and digit $ x $ ( $ 1 \\le x \\le p $ ) denotes the castle owned by player $ x $ .\n\nIt is guaranteed, that each player has at least one castle on the grid.",
    "outputFormat": "Print $ p $ integers — the number of cells controlled by each player after the game ends.",
    "samples": [
        [
            "3 3 2\n1 1\n1..\n...\n..2\n",
            "6 3 \n"
        ],
        [
            "3 4 4\n1 1 1 1\n....\n#...\n1234\n",
            "1 4 3 3 \n"
        ]
    ],
    "hint": "The picture below show the game before it started, the game after the first round and game after the second round in the first example:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1105D/f319fcf8ae2c7e81c13be67f0686992b1b32ad55.png)In the second example, the first player is \"blocked\" so he will not capture new cells for the entire game. All other player will expand up during the first two rounds and in the third round only the second player will move to the left.",
    "translation": "有一个n行m列的棋盘和k个玩家，玩家从1到k编号。棋盘上每一格有可能是空格（用'.'表示）、墙（用'#'表示）或者某个玩家的城堡（用该玩家的编号表示）。从一个格子可以到任意一个与它有公共边的格子。\r\n玩家i在一步操作内可以这样做：\r\n\r\n1.找到所有与自己的任意一个城堡中间有一条长度不大于a[i]路线的空格（该路线上只能有空格和自己的城堡）。\r\n\r\n2.把所有这样的格子都建成自己的城堡。\r\n从玩家1开始，大家轮流操作。当任何人都无法执行操作时，游戏结束。\r\n问：当游戏结束时，每个玩家分别有几座城堡？\r\n\r\n输入格式:\r\n第一行输入n,m,k,分别为：棋盘行数，棋盘列数和玩家个数。\r\n第二行输入k个数，分别为第1~k个玩家对应的a[i]值。\r\n下面n行，输入棋盘。\r\n\r\n输出格式：\r\n输出k个数，分别为k个玩家在游戏结束时拥有的城堡数。"
}