{
    "description": "[The Duck song](https://www.youtube.com/watch?v=MtN1YnoL46Q)\n\n\n\nFor simplicity, we'll assume that there are only three types of grapes: green grapes, purple grapes and black grapes.\n\nAndrew, Dmitry and Michal are all grapes' lovers, however their preferences of grapes are different. To make all of them happy, the following should happen:\n\n- Andrew, Dmitry and Michal should eat at least $ x $ , $ y $ and $ z $ grapes, respectively.\n- Andrew has an extreme affinity for green grapes, thus he will eat green grapes and green grapes only.\n- On the other hand, Dmitry is not a fan of black grapes — any types of grapes except black would do for him. In other words, Dmitry can eat green and purple grapes.\n- Michal has a common taste — he enjoys grapes in general and will be pleased with any types of grapes, as long as the quantity is sufficient.\n\nKnowing that his friends are so fond of grapes, Aki decided to host a grape party with them. He has prepared a box with $ a $ green grapes, $ b $ purple grapes and $ c $ black grapes.\n\nHowever, Aki isn't sure if the box he prepared contains enough grapes to make everyone happy. Can you please find out whether it's possible to distribute grapes so that everyone is happy or Aki has to buy some more grapes?\n\nIt is not required to distribute all the grapes, so it's possible that some of them will remain unused.",
    "inputFormat": "The first line contains three integers $ x $ , $ y $ and $ z $ ( $ 1 \\le x, y, z \\le 10^5 $ ) — the number of grapes Andrew, Dmitry and Michal want to eat.\n\nThe second line contains three integers $ a $ , $ b $ , $ c $ ( $ 1 \\le a, b, c \\le 10^5 $ ) — the number of green, purple and black grapes in the box.",
    "outputFormat": "If there is a grape distribution that allows everyone to be happy, print \"YES\", otherwise print \"NO\".",
    "samples": [
        [
            "1 6 2\n4 3 3\n",
            "YES\n"
        ],
        [
            "5 1 1\n4 3 2\n",
            "NO\n"
        ]
    ],
    "hint": "In the first example, there is only one possible distribution:\n\nAndrew should take $ 1 $ green grape, Dmitry should take $ 3 $ remaining green grapes and $ 3 $ purple grapes, and Michal will take $ 2 $ out of $ 3 $ available black grapes.\n\nIn the second test, there is no possible distribution, since Andrew is not be able to eat enough green grapes. :(",
    "translation": "现在有绿葡萄，紫葡萄，黑葡萄三种葡萄\n\n$Andrew$只吃绿葡萄，$Dmitry$吃紫葡萄和绿葡萄，$Michal$三种葡萄都吃\n\n第一行给出$Andrew$、$Dmitry$ 、$Michal$ 需要吃的葡萄数\n\n第二行给出将依此给出绿葡萄、紫葡萄、黑葡萄的个数\n\n若可以满足他们的需求，则输出YES，否则输出NO"
}