{
    "description": "You are given $ n $ words, each of which consists of lowercase alphabet letters. Each word contains at least one vowel. You are going to choose some of the given words and make as many beautiful lyrics as possible.\n\nEach lyric consists of two lines. Each line consists of two words separated by whitespace.\n\nA lyric is beautiful if and only if it satisfies all conditions below.\n\n- The number of vowels in the first word of the first line is the same as the number of vowels in the first word of the second line.\n- The number of vowels in the second word of the first line is the same as the number of vowels in the second word of the second line.\n- The last vowel of the first line is the same as the last vowel of the second line. Note that there may be consonants after the vowel.\n\nAlso, letters \"a\", \"e\", \"o\", \"i\", and \"u\" are vowels. Note that \"y\" is never vowel.\n\nFor example of a beautiful lyric,\n\n \"hello hellooowww\" \"whatsup yowowowow\"\n\n is a beautiful lyric because there are two vowels each in \"hello\" and \"whatsup\", four vowels each in \"hellooowww\" and \"yowowowow\" (keep in mind that \"y\" is not a vowel), and the last vowel of each line is \"o\".For example of a not beautiful lyric,\n\n \"hey man\"\"iam mcdic\"\n\n is not a beautiful lyric because \"hey\" and \"iam\" don't have same number of vowels and the last vowels of two lines are different (\"a\" in the first and \"i\" in the second).How many beautiful lyrics can you write from given words? Note that you cannot use a word more times than it is given to you. For example, if a word is given three times, you can use it at most three times.",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1 \\le n \\le 10^{5} $ ) — the number of words.\n\nThe $ i $ -th of the next $ n $ lines contains string $ s_{i} $ consisting lowercase alphabet letters — the $ i $ -th word. It is guaranteed that the sum of the total word length is equal or less than $ 10^{6} $ . Each word contains at least one vowel.",
    "outputFormat": "In the first line, print $ m $ — the number of maximum possible beautiful lyrics.\n\nIn next $ 2m $ lines, print $ m $ beautiful lyrics (two lines per lyric).\n\nIf there are multiple answers, print any.",
    "samples": [
        [
            "14\nwow\nthis\nis\nthe\nfirst\nmcdics\ncodeforces\nround\nhooray\ni\nam\nproud\nabout\nthat\n",
            "3\nabout proud\nhooray round\nwow first\nthis is\ni that\nmcdics am\n"
        ],
        [
            "7\narsijo\nsuggested\nthe\nidea\nfor\nthis\nproblem\n",
            "0\n"
        ],
        [
            "4\nsame\nsame\nsame\ndiffer\n",
            "1\nsame differ\nsame same\n"
        ]
    ],
    "hint": "In the first example, those beautiful lyrics are one of the possible answers. Let's look at the first lyric on the sample output of the first example. \"about proud hooray round\" forms a beautiful lyric because \"about\" and \"hooray\" have same number of vowels, \"proud\" and \"round\" have same number of vowels, and both lines have same last vowel. On the other hand, you cannot form any beautiful lyric with the word \"codeforces\".\n\nIn the second example, you cannot form any beautiful lyric from given words.\n\nIn the third example, you can use the word \"same\" up to three times.",
    "translation": "定义“优美的歌词”如下：\r\n\r\n- 由两行四个单词组成，每行两个，用空格隔开\r\n\r\n- 第一行第一个单词的元音数等于第二行第一个单词的元音数\r\n\r\n- 第一行第二个单词的元音数等于第二行第二个单词的元音数\r\n\r\n- 每行的最后一个出现的元音相同\r\n\r\n给定$n$个单词，保证每个单词含有至少一个元音。每个输入的单词只能使用一次，重复输入按输入次数记。\r\n\r\n请找到最大的$m$，并构造一个含有$m$段“优美的歌词”方案。"
}