{
    "description": "You have a garland consisting of $ n $ lamps. Each lamp is colored red, green or blue. The color of the $ i $ -th lamp is $ s_i $ ('R', 'G' and 'B' — colors of lamps in the garland).\n\nYou have to recolor some lamps in this garland (recoloring a lamp means changing its initial color to another) in such a way that the obtained garland is diverse.\n\nA garland is called diverse if any two adjacent (consecutive) lamps (i. e. such lamps that the distance between their positions is $ 1 $ ) have distinct colors.\n\nIn other words, if the obtained garland is $ t $ then for each $ i $ from $ 1 $ to $ n-1 $ the condition $ t_i \\ne t_{i + 1} $ should be satisfied.\n\nAmong all ways to recolor the initial garland to make it diverse you have to choose one with the minimum number of recolored lamps. If there are multiple optimal solutions, print any of them.",
    "inputFormat": "The first line of the input contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of lamps.\n\nThe second line of the input contains the string $ s $ consisting of $ n $ characters 'R', 'G' and 'B' — colors of lamps in the garland.",
    "outputFormat": "In the first line of the output print one integer $ r $ — the minimum number of recolors needed to obtain a diverse garland from the given one.\n\nIn the second line of the output print one string $ t $ of length $ n $ — a diverse garland obtained from the initial one with minimum number of recolors. If there are multiple optimal solutions, print any of them.",
    "samples": [
        [
            "9\nRBGRRBRGG\n",
            "2\nRBGRGBRGR\n"
        ],
        [
            "8\nBBBGBRRR\n",
            "2\nBRBGBRGR\n"
        ],
        [
            "13\nBBRRRRGGGGGRR\n",
            "6\nBGRBRBGBGBGRG\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述:\n给一串字符，只有`R`和`G`和`B`。问如果要让相邻$2$个字符都不同，最少要改几个?\n## 输入格式：\n第一行：字符串的长度$n$。$(1\\leq n\\leq2*10^5)$\n\n第二行：$n$个字符，是给的字符串。\n## 输出格式：\n第一行：最少要改动几个字符。\n\n第二行：改后的字符串。（注：有$spj$）"
}