{
    "description": "You are given a string, consisting of lowercase Latin letters.\n\nA pair of neighbouring letters in a string is considered ugly if these letters are also neighbouring in a alphabet. For example, string \"abaca\" contains ugly pairs at positions $ (1, 2) $ — \"ab\" and $ (2, 3) $ — \"ba\". Letters 'a' and 'z' aren't considered neighbouring in a alphabet.\n\nCan you rearrange the letters of a given string so that there are no ugly pairs? You can choose any order of the letters of the given string but you can't add any new letters or remove the existing ones. You can also leave the order the same.\n\nIf there are multiple answers, print any of them.\n\nYou also have to answer $ T $ separate queries.",
    "inputFormat": "The first line contains a single integer $ T $ ( $ 1 \\le T \\le 100 $ ) — the number of queries.\n\nEach of the next $ T $ lines contains string $ s $ $ (1 \\le |s| \\le 100) $ — the string for the next query. It is guaranteed that it contains only lowercase Latin letters.\n\nNote that in hacks you have to set $ T = 1 $ .",
    "outputFormat": "Print $ T $ lines. The $ i $ -th line should contain the answer to the $ i $ -th query.\n\nIf the answer for the $ i $ -th query exists, then print such a rearrangment of letters of the given string that it contains no ugly pairs. You can choose any order of the letters of the given string but you can't add any new letters or remove the existing ones. You can also leave the order the same.\n\nIf there are multiple answers, print any of them.\n\nOtherwise print \"No answer\" for that query.",
    "samples": [
        [
            "4\nabcd\ngg\ncodeforces\nabaca\n",
            "cadb\ngg\ncodfoerces\nNo answer\n"
        ]
    ],
    "hint": "In the first example answer \"bdac\" is also correct.\n\nThe second example showcases the fact that only neighbouring in alphabet letters are not allowed. The same letter is ok.\n\nThere are lots of valid answers for the third example.",
    "translation": "## 题意\n你有一个字符串，请将这个字符串进行排序，使得字符串中相邻的字母在字母表中不相邻（a 与 z 在字母表中不相邻）\n## 输入\n共 t(t≤100) 组数据，每一个数据包含一个长度不超过 100 的字符串\n## 输出\n对于每一组数据，如果可以完成任务，输出任意一个排序后的字符串；如果无法完成任务，请输出 `No answer`"
}