{
    "description": "Vova is playing a computer game. There are in total $ n $ turns in the game and Vova really wants to play all of them. The initial charge of his laptop battery (i.e. the charge before the start of the game) is $ k $ .\n\nDuring each turn Vova can choose what to do:\n\n- If the current charge of his laptop battery is strictly greater than $ a $ , Vova can just play, and then the charge of his laptop battery will decrease by $ a $ ;\n- if the current charge of his laptop battery is strictly greater than $ b $ ( $ b<a $ ), Vova can play and charge his laptop, and then the charge of his laptop battery will decrease by $ b $ ;\n- if the current charge of his laptop battery is less than or equal to $ a $ and $ b $ at the same time then Vova cannot do anything and loses the game.\n\nVova wants to complete the game (Vova can complete the game if after each of $ n $ turns the charge of the laptop battery is strictly greater than $ 0 $ ). Among all possible ways to complete the game, Vova wants to choose the one where the number of turns when he just plays is the maximum possible. It is possible that Vova cannot complete the game at all.\n\nYour task is to find out the maximum possible number of turns Vova can just play or report that Vova cannot complete the game.\n\nYou have to answer $ q $ independent queries.",
    "inputFormat": "The first line of the input contains one integer $ q $ ( $ 1 \\le q \\le 10^5 $ ) — the number of queries. Each query is presented by a single line.\n\nThe only line of the query contains four integers $ k, n, a $ and $ b $ ( $ 1 \\le k, n \\le 10^9, 1 \\le b < a \\le 10^9 $ ) — the initial charge of Vova's laptop battery, the number of turns in the game and values $ a $ and $ b $ , correspondingly.",
    "outputFormat": "For each query print one integer: -1 if Vova cannot complete the game or the maximum number of turns Vova can just play otherwise.",
    "samples": [
        [
            "6\n15 5 3 2\n15 5 4 3\n15 5 2 1\n15 5 5 1\n16 7 5 2\n20 5 7 3\n",
            "4\n-1\n5\n2\n0\n1\n"
        ]
    ],
    "hint": "In the first example query Vova can just play $ 4 $ turns and spend $ 12 $ units of charge and then one turn play and charge and spend $ 2 $ more units. So the remaining charge of the battery will be $ 1 $ .\n\nIn the second example query Vova cannot complete the game because even if he will play and charge the battery during each turn then the charge of the notebook battery will be $ 0 $ after the last turn.",
    "translation": "给你$q$次查询（$q \\leq 10^5$）：  \n每一次查询给出四个数字：$k$，$n$，$a$，$b$。（$1 \\leq k,n \\leq 10^9$，$1 \\leq b \\leq a \\leq 10^9$）  \n你在一个回合里面可以选择以下两种操作：\n- 让$k$-$a$，并让最终答案+$1$；\n- 让$k$-$b$，最终答案不变。   \n问在完成了$n$个回合之后，且$k>0$的前提下，最终答案的最大值。\n## 注意：如果无论如何都无法做到在完成了$n$个回合之后$k>0$，则输出$-1$。"
}