{
    "description": "Nauuo is a girl who loves writing comments.\n\nOne day, she posted a comment on Codeforces, wondering whether she would get upvotes or downvotes.\n\nIt's known that there were $ x $ persons who would upvote, $ y $ persons who would downvote, and there were also another $ z $ persons who would vote, but you don't know whether they would upvote or downvote. Note that each of the $ x+y+z $ people would vote exactly one time.\n\nThere are three different results: if there are more people upvote than downvote, the result will be \"+\"; if there are more people downvote than upvote, the result will be \"-\"; otherwise the result will be \"0\".\n\nBecause of the $ z $ unknown persons, the result may be uncertain (i.e. there are more than one possible results). More formally, the result is uncertain if and only if there exist two different situations of how the $ z $ persons vote, that the results are different in the two situations.\n\nTell Nauuo the result or report that the result is uncertain.",
    "inputFormat": "The only line contains three integers $ x $ , $ y $ , $ z $ ( $ 0\\le x,y,z\\le100 $ ), corresponding to the number of persons who would upvote, downvote or unknown.",
    "outputFormat": "If there is only one possible result, print the result : \"+\", \"-\" or \"0\".\n\nOtherwise, print \"?\" to report that the result is uncertain.",
    "samples": [
        [
            "3 7 0\n",
            "-"
        ],
        [
            "2 0 1\n",
            "+"
        ],
        [
            "1 1 0\n",
            "0"
        ],
        [
            "0 0 1\n",
            "?"
        ]
    ],
    "hint": "In the first example, Nauuo would definitely get three upvotes and seven downvotes, so the only possible result is \"-\".\n\nIn the second example, no matter the person unknown downvotes or upvotes, Nauuo would get more upvotes than downvotes. So the only possible result is \"+\".\n\nIn the third example, Nauuo would definitely get one upvote and one downvote, so the only possible result is \"0\".\n\nIn the fourth example, if the only one person upvoted, the result would be \"+\", otherwise, the result would be \"-\". There are two possible results, so the result is uncertain.",
    "translation": "### 【题意】\n\n$\\texttt{Nauuo}$是一个喜欢写评论的女孩。\n\n有一天，她发表了对$\\mathrm{Codeforces}$的评论，想知道她是否会得到“赞”或“踩”。\n\n有$x$人给了“赞”，有$y$人给了“踩”，还有$z$个人的评论是不确定的。请注意，每个人有且只有一次评论。\n\n评论结果有以下可能：\n\n- 如果有“赞”的人数一定多于“踩”的人数，结果将是“+”；\n\n- 如果有“踩”的人数一定多于“赞”的人数，结果将是“ - ”；\n\n- 否则结果将为“0”。\n\n- 由于$z$个未知的评论，结果可能是不确定的（即，存在多于一个可能的结果），此时结果为“?”（英文的问号）\n\n告诉$\\texttt{Nauuo}$评论结果。\n\n【翻译 By @[HyyypRtf06](https://www.luogu.org/space/show?uid=80049)】"
}