{
    "description": "Lena is playing with matches. The natural question arising in the head of any child playing with matches is whether it's possible to set a tree on fire with a matches, or not.\n\nLet's say, that the tree is a connected graph without cycles and the vertices are labeled with integers $ 1, 2, \\ldots, n $ . Also every vertex $ v $ has some integer priority $ p_v $ associated with it. All priorities are distinct.\n\nIt turns out, that if you set a tree on fire, it will burn to nothing. However, this process doesn't happen instantly. At the beginning, burns out the leaf (a vertex is called to be a leaf if it has only one adjacent vertex) of the tree of the minimum priority. Then burns out the leaf of the minimal priority of the remaining tree, and so on. This way, the vertices turn into the leaves and burn out until only one vertex remains. Then this vertex burns out as well.\n\nLena has prepared a tree of $ n $ vertices and every vertex in it has a priority $ p_v = v $ . Lena is very curious about burning out this tree. However, she understands, that if she will burn the tree now, then it will disappear completely. Lena is a kind girl and she will feel bad for the burned tree, so she wants to study the process of burning the tree only in her mind. Lena wants to process $ q $ queries, each of them is one of three following types:\n\n- \"up $ v $ \", assign the vertex $ v $ priority $ 1 + \\max\\{p_1, p_2, \\ldots, p_n\\} $ ;\n- \"when $ v $ \", find the step at which the vertex $ v $ will burn out, if the tree would be set on fire now;\n- \"compare $ v $ $ u $ \", find out which of the vertices $ v $ and $ u $ will burn out first, if the tree would be set on fire now.\n\nNotice, that if all priorities would be distinct, then after the \"up\" query they will stay distinct as well. Initially all priorities are distinct, hence during any (purely hypothetical of course) burning of the tree, all leafs would have distinct priorities.",
    "inputFormat": "The first line contains two integers $ n $ and $ q $ ( $ 2 \\le n \\le 200\\,000 $ , $ 1 \\le q \\le 200\\,000 $ ) — the number of vertices in the tree and the number of queries.\n\nThe $ i $ -th of the following $ n - 1 $ lines contains two integers $ v_i $ , $ u_i $ ( $ 1 \\le v_i, u_i \\le n $ ), denoting the endpoints of the $ i $ -th edge.\n\nEach of the remaining $ q $ lines contains a query of one of the following three types:\n\n- \"up $ v $ \" ( $ 1 \\le v \\le n $ ) — change the priority of vertex $ v $ ;\n- \"when $ v $ \" ( $ 1 \\le v \\le n $ ) — determine the step at which the vertex $ v $ will burn out;\n- \"compare $ v $ $ u $ \" ( $ 1 \\le v, u \\le n $ , $ v \\ne u $ ) — determine which of vertices $ v $ and $ u $ will burn out earlier in the current tree.\n\nIt's guaranteed, that there is at least one query of type \"when\" or \"compare\".",
    "outputFormat": "For every query of type \"when\" print one integer in range from $ 1 $ to $ n $ — the step at which the vertex $ v $ will burn out.\n\nFor every query of type \"compare\" print either $ v $ or $ u $ , depending on which one will burn out earlier.",
    "samples": [
        [
            "5 7\n1 5\n1 2\n1 3\n4 3\nwhen 1\nwhen 2\nwhen 3\nwhen 4\nwhen 5\ncompare 2 3\ncompare 3 4\n",
            "4\n1\n3\n2\n5\n2\n4\n"
        ],
        [
            "5 5\n1 5\n1 2\n1 3\n4 3\nup 1\ncompare 2 4\ncompare 4 3\ncompare 3 1\ncompare 1 5\n",
            "2\n4\n3\n5\n"
        ]
    ],
    "hint": "In the first example, the process of burning of the tree is illustrated on the following picture:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1137F/bc0d9649c17373120f77a2c7a539e99bc4a36a66.png)In particular, the vertices of the tree will burn out in the following order: $ [2, 4, 3, 1, 5] $ .\n\nIn the second example, after applying the \"up\" operation, the order of vertices will change to: $ [2, 4, 3, 5, 1] $ .",
    "translation": "### 题目描述\r\n\r\n我们定义一棵树的删除序列为：每一次将树中编号最小的叶子删掉，将该节点编号加入到当前序列的最末端，最后只剩下一个节点时将该节点的编号加入到结尾。\r\n\r\n![](https://cdn.luogu.org/upload/vjudge_pic/CF1137F/bc0d9649c17373120f77a2c7a539e99bc4a36a66.png)\r\n\r\n例如对于上图中的树，它的删除序列为：2 4 3 1 5\r\n\r\n现在给出一棵$n$个节点的树，有$m$次操作：\r\n\r\n`up v`：将$v$号节点的编号变为当前所有节点编号的$\\max + 1$\r\n\r\n`when v`：查询$v$在当前树的删除序列中是第几号元素\r\n\r\n`compare u v`：查询$u$和$v$在当前树的删除序列中谁更靠前\r\n\r\n### 输入格式\r\n\r\n第一行两个正整数$n,q(1 \\leq n , q \\leq 200000)$表示树的点数和操作数\r\n\r\n接下来$n-1$行每行$2$个正整数$u,v(1 \\leq u,v \\leq n)$表示树上的一条边\r\n\r\n接下来$q$行每行描述一个操作\r\n\r\n### 输出格式\r\n\r\n每一个询问输出一行\r\n\r\n对于`when v`询问，输出一个正整数表示$v$是当前删除序列的哪一个元素\r\n\r\n对于`compare u v`询问，如果$u$在删除序列中更靠前则输出$u$，否则输出$v$"
}