{
    "description": "Vasya likes to travel by train, but doesn't like when the car he travels in is located in the tail of the train.\n\nVasya gets on the train at the station. The train consists of $ n $ cars indexed from $ 1 $ to $ n $ counting from the locomotive (head of the train). Three types of events occur while the train is moving:\n\n1. Some number of cars are added to the head of the train;\n2. Some number of cars are added to the tail of the train;\n3. Vasya recalculates the values of the convenience of the cars (read more about it below).\n\nAt each moment of time we will index the cars from the head of the train, starting from $ 1 $ . Note that when adding new cars to the head of the train, the indexing of the old ones may shift.\n\nTo choose which car to go in, Vasya will use the value $ A_i $ for each car (where $ i $ is a car index), which is calculated as follows:\n\n- At the beginning of the trip $ A_i=0 $ , as well as for the new cars at the time of their addition.\n- During the next recalculation Vasya chooses some positive integers $ b $ and $ s $ and adds to all $ A_i $ value $ b + (i - 1) \\cdot s $ .\n\nVasya hasn't decided yet where he will get on the train and where will get off the train, so after each event of one of the three types he wants to know the least index of the car, such that its value $ A_i $ is minimal. Since there is a lot of cars, Vasya asked you to write a program that answers his question.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\leq n \\leq 10^9 $ , $ 1 \\leq m \\leq 300\\,000 $ ), the number of cars in the train at the time of departure from the station and the number of stations, respectively.\n\nNext $ m $ lines contain the descriptions of events. Each event is one of the following three types:\n\n- \" $ 1 $ $ k $ \" ( $ 1 \\le k \\le 10^9 $ ), add $ k $ cars to the head of the train\n- \" $ 2 $ $ k $ \" ( $ 1 \\le k \\le 10^9 $ ), add $ k $ cars to the tail of the train\n- \" $ 3 $ $ b $ $ s $ \" ( $ 1 \\le b, s \\le 10^9 $ ), recalculate the convenience of all train cars.\n\nIt is guaranteed that at any time the train length does not exceed $ 10^9 $ . Also it's guaranteed that the integers $ A_i $ will not grow too high. Formally, it's guaranteed that if we sum the largest addition over all events of the $ 3 $ -rd type (that is, $ b + (n - 1) \\cdot s $ , where $ n $ is the number of cars at that moment) then the acquired sum would be at most $ 10^{18} $ .",
    "outputFormat": "After each of the $ m $ queries print two integers: $ j $ and $ A_j $ — the number of the car closest to the head of the train, such that its value $ A_j $ is minimal, and the value $ A_j $ itself.",
    "samples": [
        [
            "1 8\n1 1\n3 1 1\n3 1 1\n2 1\n2 1\n3 1 1\n2 1\n3 1 5\n",
            "1 0\n1 1\n1 2\n3 0\n3 0\n1 3\n5 0\n1 4\n"
        ]
    ],
    "hint": "- Initially the train consists of one car with $ A_1 = 0 $ , let's denote train as $ [0] $ for simplicity.\n- After adding one car to the head, train is $ [0, 0] $ .\n- After recalculation of values with parameters $ b=1, s=1 $ , train is $ [1, 2] $ .\n- After another recalculation of values with the parameters $ b=1, s=1 $ , train is $ [2, 4] $ .\n- After adding one car to the end, train is $ [2, 4, 0] $ .\n- After another adding one car to the end, train is $ [2, 4, 0, 0] $ .\n- After recalculation of values with parameters $ b=1 $ , $ s=1 $ , train is $ [3, 6, 3, 4] $ .\n- After adding one car to the end, train is $ [3, 6, 3, 4, 0] $ .\n- After recalculation of values with parameters $ b=1 $ , $ s=5 $ , train is $ [4, 12, 14, 20, 21] $ .",
    "translation": "### 题目描述\r\n\r\n给出一个序列$a_i$，初始有$n$个$0$。$m$次操作，操作有$3$种：\r\n\r\n$1\\ k(1 \\leq k \\leq 10^9)$：在序列开头加入$k$个$0$\r\n\r\n$2\\ k(1 \\leq k \\leq 10^9)$：在序列末尾加入$k$个$0$\r\n\r\n$3\\ b\\ s(1 \\leq b , s \\leq 10^9)$：对序列的所有元素做加法，给序列的第$i$个元素加上$b + s(i-1)$\r\n\r\n你需要在每一次操作过后输出当前序列中最小值位置和它的值。如果存在多个最小值则只考虑位置最靠前的。\r\n\r\n### 输入格式\r\n\r\n第一行两个正整数$n(1 \\leq n \\leq 10^9) , m(1 \\leq m \\leq 300000)$\r\n\r\n接下来$m$行每行$2$到$3$个正整数描述一个操作\r\n\r\n### 输出格式\r\n\r\n对于每一次操作输出一行两个正整数分别表示最小值位置和最小值。"
}