{
    "description": "Nick had received an awesome array of integers $ a=[a_1, a_2, \\dots, a_n] $ as a gift for his $ 5 $ birthday from his mother. He was already going to explore its various properties but after unpacking he was disappointed a lot because the product $ a_1 \\cdot a_2 \\cdot \\dots a_n $ of its elements seemed to him not large enough.\n\nHe was ready to throw out the array, but his mother reassured him. She told him, that array would not be spoiled after the following operation: choose any index $ i $ ( $ 1 \\le i \\le n $ ) and do $ a_i := -a_i - 1 $ .\n\nFor example, he can change array $ [3, -1, -4, 1] $ to an array $ [-4, -1, 3, 1] $ after applying this operation to elements with indices $ i=1 $ and $ i=3 $ .\n\nKolya had immediately understood that sometimes it's possible to increase the product of integers of the array a lot. Now he has decided that he wants to get an array with the maximal possible product of integers using only this operation with its elements (possibly zero, one or more times, as many as he wants), it is not forbidden to do this operation several times for the same index.\n\nHelp Kolya and print the array with the maximal possible product of elements $ a_1 \\cdot a_2 \\cdot \\dots a_n $ which can be received using only this operation in some order.\n\nIf there are multiple answers, print any of them.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1 \\leq n \\leq 10^{5} $ ) — number of integers in the array.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ -10^{6} \\leq a_i \\leq 10^{6} $ ) — elements of the array",
    "outputFormat": "Print $ n $ numbers — elements of the array with the maximal possible product of elements which can be received using only this operation in some order from the given array.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "4\n2 2 2 2\n",
            "-3 -3 -3 -3 "
        ],
        [
            "1\n0\n",
            "0 "
        ],
        [
            "3\n-3 -3 2\n",
            "-3 -3 2 "
        ]
    ],
    "hint": "",
    "translation": "你有一个长度为 $n$ 的数组 $a$，定义这个数组的价值为$\\prod a_i=a_1\\times a_2\\times \\cdots\\times a_n$。\n\n你可以进行任意次操作，每一次可以选择一个数 $a_i$，并让$a_i\\gets -a_i-1$。\n\n你的目标是使得总价值最大，输出这个最大的价值。"
}