{
    "description": "Polycarp has an array $ a $ consisting of $ n $ integers.\n\nHe wants to play a game with this array. The game consists of several moves. On the first move he chooses any element and deletes it (after the first move the array contains $ n-1 $ elements). For each of the next moves he chooses any element with the only restriction: its parity should differ from the parity of the element deleted on the previous move. In other words, he alternates parities (even-odd-even-odd-... or odd-even-odd-even-...) of the removed elements. Polycarp stops if he can't make a move.\n\nFormally:\n\n- If it is the first move, he chooses any element and deletes it;\n- If it is the second or any next move: \n  - if the last deleted element was odd, Polycarp chooses any even element and deletes it;\n  - if the last deleted element was even, Polycarp chooses any odd element and deletes it.\n- If after some move Polycarp cannot make a move, the game ends.\n\nPolycarp's goal is to minimize the sum of non-deleted elements of the array after end of the game. If Polycarp can delete the whole array, then the sum of non-deleted elements is zero.\n\nHelp Polycarp find this value.",
    "inputFormat": "The first line of the input contains one integer $ n $ ( $ 1 \\le n \\le 2000 $ ) — the number of elements of $ a $ .\n\nThe second line of the input contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 0 \\le a_i \\le 10^6 $ ), where $ a_i $ is the $ i $ -th element of $ a $ .",
    "outputFormat": "Print one integer — the minimum possible sum of non-deleted elements of the array after end of the game.",
    "samples": [
        [
            "5\n1 5 7 8 2\n",
            "0\n"
        ],
        [
            "6\n5 1 2 4 6 3\n",
            "0\n"
        ],
        [
            "2\n1000000 1000000\n",
            "1000000\n"
        ]
    ],
    "hint": "",
    "translation": "$Polycarp$有一个有$n$个数的数组，他会轮流从中删去数，比如：奇数-偶数-奇数-偶数-奇数-偶数-奇数-偶数···$\\ \\ \\ $或：偶数-奇数-偶数-奇数-偶数-奇数-偶数-奇数···直到无法删除。\n\n### 输入格式：\n\n第一行:一个数字$n( 1 \\le n \\le 2000 1≤n≤2000 )$表示数组大小。\n\n第二行：$n$个数，表示$a_{1},a_{2},a_{3}...a_{n} (0\\le a_{i} \\le 10^{6})$中的数。\n\n### 输出格式：\n\n一个数，表示数组中剩余数的**最小和**。\n\n若整个数组可以删除，**输出$0$**"
}