{
    "description": "This morning Tolik has understood that while he was sleeping he had invented an incredible problem which will be a perfect fit for Codeforces! But, as a \"Discuss tasks\" project hasn't been born yet (in English, well), he decides to test a problem and asks his uncle.\n\nAfter a long time thinking, Tolik's uncle hasn't any ideas on how to solve it. But, he doesn't want to tell Tolik about his inability to solve it, so he hasn't found anything better than asking you how to solve this task.\n\nIn this task you are given a cell field $ n \\cdot m $ , consisting of $ n $ rows and $ m $ columns, where point's coordinates $ (x, y) $ mean it is situated in the $ x $ -th row and $ y $ -th column, considering numeration from one ( $ 1 \\leq x \\leq n, 1 \\leq y \\leq m $ ). Initially, you stand in the cell $ (1, 1) $ . Every move you can jump from cell $ (x, y) $ , which you stand in, by any non-zero vector $ (dx, dy) $ , thus you will stand in the $ (x+dx, y+dy) $ cell. Obviously, you can't leave the field, but also there is one more important condition — you're not allowed to use one vector twice. Your task is to visit each cell of the field exactly once (the initial cell is considered as already visited).\n\nTolik's uncle is a very respectful person. Help him to solve this task!",
    "inputFormat": "The first and only line contains two positive integers $ n, m $ ( $ 1 \\leq n \\cdot m \\leq 10^{6} $ ) — the number of rows and columns of the field respectively.",
    "outputFormat": "Print \"-1\" (without quotes) if it is impossible to visit every cell exactly once.\n\nElse print $ n \\cdot m $ pairs of integers, $ i $ -th from them should contain two integers $ x_i, y_i $ ( $ 1 \\leq x_i \\leq n, 1 \\leq y_i \\leq m $ ) — cells of the field in order of visiting, so that all of them are distinct and vectors of jumps between them are distinct too.\n\nNotice that the first cell should have $ (1, 1) $ coordinates, according to the statement.",
    "samples": [
        [
            "2 3\n",
            "1 1\n1 3\n1 2\n2 2\n2 3\n2 1"
        ],
        [
            "1 1\n",
            "1 1\n"
        ]
    ],
    "hint": "The vectors from the first example in the order of making jumps are $ (0, 2), (0, -1), (1, 0), (0, 1), (0, -2) $ .",
    "translation": "有一天，_rqy想出来了一道构造题，出给了wqy去做。然而wqy不会做，于是就来找你。\n\n你有一个$n$行$m$列的棋盘，其中第$i$行第$j$列的格子标号为$(i,j)$。你需要从$(1,1)$开始遍历这个棋盘。每一次，如果你在$(x,y)$，你可以选择一个向量$(\\text{d}x,\\text{d}y)$，并且移动到$(x+\\text{d}x,y+\\text{d}y)$这个格子上。\n\n你不能离开这个棋盘，同时每一个向量只能使用一次。你的任务是合理安排自己的行走路线，使得每一个格子都只被经过一次。输出这个方案。\n\nwqy翻译了那么多题面，你一定要帮他解出来！"
}