{
    "description": "Mr. Apple, a gourmet, works as editor-in-chief of a gastronomic periodical. He travels around the world, tasting new delights of famous chefs from the most fashionable restaurants. Mr. Apple has his own signature method of review — in each restaurant Mr. Apple orders two sets of dishes on two different days. All the dishes are different, because Mr. Apple doesn't like to eat the same food. For each pair of dishes from different days he remembers exactly which was better, or that they were of the same quality. After this the gourmet evaluates each dish with a positive integer.\n\nOnce, during a revision of a restaurant of Celtic medieval cuisine named «Poisson», that serves chestnut soup with fir, warm soda bread, spicy lemon pie and other folk food, Mr. Apple was very pleasantly surprised the gourmet with its variety of menu, and hence ordered too much. Now he's confused about evaluating dishes.\n\nThe gourmet tasted a set of $ n $ dishes on the first day and a set of $ m $ dishes on the second day. He made a table $ a $ of size $ n \\times m $ , in which he described his impressions. If, according to the expert, dish $ i $ from the first set was better than dish $ j $ from the second set, then $ a_{ij} $ is equal to \">\", in the opposite case $ a_{ij} $ is equal to \"<\". Dishes also may be equally good, in this case $ a_{ij} $ is \"=\".\n\nNow Mr. Apple wants you to help him to evaluate every dish. Since Mr. Apple is very strict, he will evaluate the dishes so that the maximal number used is as small as possible. But Mr. Apple also is very fair, so he never evaluates the dishes so that it goes against his feelings. In other words, if $ a_{ij} $ is \"<\", then the number assigned to dish $ i $ from the first set should be less than the number of dish $ j $ from the second set, if $ a_{ij} $ is \">\", then it should be greater, and finally if $ a_{ij} $ is \"=\", then the numbers should be the same.\n\nHelp Mr. Apple to evaluate each dish from both sets so that it is consistent with his feelings, or determine that this is impossible.",
    "inputFormat": "The first line contains integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 1000 $ ) — the number of dishes in both days.\n\nEach of the next $ n $ lines contains a string of $ m $ symbols. The $ j $ -th symbol on $ i $ -th line is $ a_{ij} $ . All strings consist only of \"<\", \">\" and \"=\".",
    "outputFormat": "The first line of output should contain \"Yes\", if it's possible to do a correct evaluation for all the dishes, or \"No\" otherwise.\n\nIf case an answer exist, on the second line print $ n $ integers — evaluations of dishes from the first set, and on the third line print $ m $ integers — evaluations of dishes from the second set.",
    "samples": [
        [
            "3 4\n>>>>\n>>>>\n>>>>",
            "Yes\n2 2 2 \n1 1 1 1 \n"
        ],
        [
            "3 3\n>>>\n<<<\n>>>",
            "Yes\n3 1 3 \n2 2 2 \n"
        ],
        [
            "3 2\n==\n=<\n==",
            "No\n"
        ]
    ],
    "hint": "In the first sample, all dishes of the first day are better than dishes of the second day. So, the highest score will be $ 2 $ , for all dishes of the first day.\n\nIn the third sample, the table is contradictory — there is no possible evaluation of the dishes that satisfies it.",
    "translation": "有两个正整数序列 $a,b$，长度分别为 $n,m$。给出所有 $a_i$ 和 $b_j(1\\le i\\le n,1\\le j\\le m)$ 的大小关系（大于，小于或者等于），请构造出符合条件的 $a$ 和 $b$。如果无解，输出NO。如果有多个解，输出 $a,b$ 中最大元素最小的方案。\n\n$1\\le n,m\\le 1000$。"
}