{
    "description": "This problem is same as the next one, but has smaller constraints.\n\nIt was a Sunday morning when the three friends Selena, Shiro and Katie decided to have a trip to the nearby power station (do not try this at home). After arriving at the power station, the cats got impressed with a large power transmission system consisting of many chimneys, electric poles, and wires. Since they are cats, they found those things gigantic.\n\nAt the entrance of the station, there is a map describing the complicated wiring system. Selena is the best at math among three friends. He decided to draw the map on the Cartesian plane. Each pole is now a point at some coordinates $ (x_i, y_i) $ . Since every pole is different, all of the points representing these poles are distinct. Also, every two poles are connected with each other by wires. A wire is a straight line on the plane infinite in both directions. If there are more than two poles lying on the same line, they are connected by a single common wire.\n\nSelena thinks, that whenever two different electric wires intersect, they may interfere with each other and cause damage. So he wonders, how many pairs are intersecting? Could you help him with this problem?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 50 $ ) — the number of electric poles.\n\nEach of the following $ n $ lines contains two integers $ x_i $ , $ y_i $ ( $ -10^4 \\le x_i, y_i \\le 10^4 $ ) — the coordinates of the poles.\n\nIt is guaranteed that all of these $ n $ points are distinct.",
    "outputFormat": "Print a single integer — the number of pairs of wires that are intersecting.",
    "samples": [
        [
            "4\n0 0\n1 1\n0 3\n1 2\n",
            "14\n"
        ],
        [
            "4\n0 0\n0 2\n0 4\n2 0\n",
            "6\n"
        ],
        [
            "3\n-1 -1\n1 0\n3 1\n",
            "0\n"
        ]
    ],
    "hint": "In the first example:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1163C1/2317b27306c4c65175012212cdceb02039be0972.png)In the second example:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1163C1/0792ee139dbdc603551bd0c872a1bea92551eac5.png)Note that the three poles $ (0, 0) $ , $ (0, 2) $ and $ (0, 4) $ are connected by a single wire.\n\nIn the third example:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1163C1/9e20f52f47cf7b9d491a8675d81506c0f862a971.png)",
    "translation": "## 题目翻译\r\n在一个平面直角坐标系中，给你$n(2≤n≤50)$个点的坐标。这$n$个点中，每两个点之间都有一条**直线（注意不是线段）** 相连。求：这些直线中，有多少对直线相交。\r\n#### 注意事项：\r\n1. 当多点共线时，不认为由这几个点产生的直线有交点；\r\n2. 多条直线交于一点时，**并不代表这几条直线在这个点相交时只产生一个交点**，而是每两条直线都要统计一次。"
}