{
    "description": " $ n $ robots have escaped from your laboratory! You have to find them as soon as possible, because these robots are experimental, and their behavior is not tested yet, so they may be really dangerous!\n\nFortunately, even though your robots have escaped, you still have some control over them. First of all, you know the location of each robot: the world you live in can be modeled as an infinite coordinate plane, and the $ i $ -th robot is currently located at the point having coordinates ( $ x_i $ , $ y_i $ ). Furthermore, you may send exactly one command to all of the robots. The command should contain two integer numbers $ X $ and $ Y $ , and when each robot receives this command, it starts moving towards the point having coordinates ( $ X $ , $ Y $ ). The robot stops its movement in two cases:\n\n- either it reaches ( $ X $ , $ Y $ );\n- or it cannot get any closer to ( $ X $ , $ Y $ ).\n\nNormally, all robots should be able to get from any point of the coordinate plane to any other point. Each robot usually can perform four actions to move. Let's denote the current coordinates of the robot as ( $ x_c $ , $ y_c $ ). Then the movement system allows it to move to any of the four adjacent points:\n\n1. the first action allows it to move from ( $ x_c $ , $ y_c $ ) to ( $ x_c - 1 $ , $ y_c $ );\n2. the second action allows it to move from ( $ x_c $ , $ y_c $ ) to ( $ x_c $ , $ y_c + 1 $ );\n3. the third action allows it to move from ( $ x_c $ , $ y_c $ ) to ( $ x_c + 1 $ , $ y_c $ );\n4. the fourth action allows it to move from ( $ x_c $ , $ y_c $ ) to ( $ x_c $ , $ y_c - 1 $ ).\n\nUnfortunately, it seems that some movement systems of some robots are malfunctioning. For each robot you know which actions it can perform, and which it cannot perform.\n\nYou want to send a command so all robots gather at the same point. To do so, you have to choose a pair of integer numbers $ X $ and $ Y $ so that each robot can reach the point ( $ X $ , $ Y $ ). Is it possible to find such a point?",
    "inputFormat": "The first line contains one integer $ q $ ( $ 1 \\le q \\le 10^5 $ ) — the number of queries.\n\nThen $ q $ queries follow. Each query begins with one line containing one integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the number of robots in the query. Then $ n $ lines follow, the $ i $ -th of these lines describes the $ i $ -th robot in the current query: it contains six integer numbers $ x_i $ , $ y_i $ , $ f_{i, 1} $ , $ f_{i, 2} $ , $ f_{i, 3} $ and $ f_{i, 4} $ ( $ -10^5 \\le x_i, y_i \\le 10^5 $ , $ 0 \\le f_{i, j} \\le 1 $ ). The first two numbers describe the initial location of the $ i $ -th robot, and the following four numbers describe which actions the $ i $ -th robot can use to move ( $ f_{i, j} = 1 $ if the $ i $ -th robot can use the $ j $ -th action, and $ f_{i, j} = 0 $ if it cannot use the $ j $ -th action).\n\nIt is guaranteed that the total number of robots over all queries does not exceed $ 10^5 $ .",
    "outputFormat": "You should answer each query independently, in the order these queries appear in the input.\n\nTo answer a query, you should do one of the following:\n\n- if it is impossible to find a point that is reachable by all $ n $ robots, print one number $ 0 $ on a separate line;\n- if it is possible to find a point that is reachable by all $ n $ robots, print three space-separated integers on the same line: $ 1 $ $ X $ $ Y $ , where $ X $ and $ Y $ are the coordinates of the point reachable by all $ n $ robots. Both $ X $ and $ Y $ should not exceed $ 10^5 $ by absolute value; it is guaranteed that if there exists at least one point reachable by all robots, then at least one of such points has both coordinates not exceeding $ 10^5 $ by absolute value.",
    "samples": [
        [
            "4\n2\n-1 -2 0 0 0 0\n-1 -2 0 0 0 0\n3\n1 5 1 1 1 1\n2 5 0 1 0 1\n3 5 1 0 0 0\n2\n1337 1337 0 1 1 1\n1336 1337 1 1 0 1\n1\n3 5 1 1 1 1\n",
            "1 -1 -2\n1 2 5\n0\n1 -100000 -100000\n"
        ]
    ],
    "hint": "",
    "translation": "## 题面翻译\n\n有 $n$ 个机器人在一个平面上，第 $i$ 个机器人的位置是 $(X_i,Y_i)$。\n\n\n在设计的时候，第 $i$ 个机器人可以执行的操作：\n\n1. 位置从 $(X_i,Y_i)$ 变为 $(X_i-1,Y_i)$。\n\n2. 位置从 $(X_i,Y_i)$ 变为 $(X_i,Y_i+1)$。\n\n3. 位置从 $(X_i,Y_i)$ 变为 $(X_i+1,Y_i)$。\n\n4. 位置从 $(X_i,Y_i)$ 变为 $(X_i,Y_i-1)$。\n\n但设计出现了缺陷，某些机器人可能不能执行上述的某些操作。\n\n你需要找一个点 $(A,H)$，使得 $n$ 个机器人都可以到达 $(A,H)$ 。注意，一开始的位置在 $(A,H)$ 也算到达，且对于 $A,H$ 的范围有限制 —— $-10^5\\leq A,H \\leq 10^5$。\n\n### 输入格式\n\n该题有多组数据。\n\n整个输入的第一行，是一个整数 $q (1\\leq q \\leq 10^5)$ ，表示数据组数。\n\n对于每组数据，第一行有一个整数 $n$ ，表示机器人的数量。\n\n接下来 $n$ 行，每行 $6$ 个整数 $X_i,Y_i,f_1,f_2,f_3,f_4( - 10^ 5 \\leq X_i,Y_i \\leq 10^ 5,0 \\leq f_1,f_2,f_3,f_4 \\leq 1)$。$X_i,Y_i$ 表示这个机器人的坐标，$f_1,f_2,f_3,f_4$ 分别表示第 $i$ 个机器人的上述 $4$ 个功能是否可用。如果$f_{ahak} = 1 (1\\leq ahak \\leq 4)$，则表示第 $ahak$ 个功能可用，否则不可用。\n\n### 输出格式\n\n对于每组数据，如果无解，输出 $0$。\n\n否则，输出 $1, A, H$，表示所有机器人都可以到达 $(A,H)$。\n\nCF1196C 翻译贡献者 @兹磁洛谷"
}