{
    "description": "Getting closer and closer to a mathematician, Serval becomes a university student on math major in Japari University. On the Calculus class, his teacher taught him how to calculate the expected length of a random subsegment of a given segment. Then he left a bonus problem as homework, with the award of a garage kit from IOI. The bonus is to extend this problem to the general case as follows.\n\nYou are given a segment with length $ l $ . We randomly choose $ n $ segments by choosing two points (maybe with non-integer coordinates) from the given segment equiprobably and the interval between the two points forms a segment. You are given the number of random segments $ n $ , and another integer $ k $ . The $ 2n $ endpoints of the chosen segments split the segment into $ (2n+1) $ intervals. Your task is to calculate the expected total length of those intervals that are covered by at least $ k $ segments of the $ n $ random segments.\n\nYou should find the answer modulo $ 998244353 $ .",
    "inputFormat": "First line contains three space-separated positive integers $ n $ , $ k $ and $ l $ ( $ 1\\leq k \\leq n \\leq 2000 $ , $ 1\\leq l\\leq 10^9 $ ).",
    "outputFormat": "Output one integer — the expected total length of all the intervals covered by at least $ k $ segments of the $ n $ random segments modulo $ 998244353 $ .\n\nFormally, let $ M = 998244353 $ . It can be shown that the answer can be expressed as an irreducible fraction $ \\frac{p}{q} $ , where $ p $ and $ q $ are integers and $ q \\not \\equiv 0 \\pmod{M} $ . Output the integer equal to $ p \\cdot q^{-1} \\bmod M $ . In other words, output such an integer $ x $ that $ 0 \\le x < M $ and $ x \\cdot q \\equiv p \\pmod{M} $ .",
    "samples": [
        [
            "1 1 1\n",
            "332748118\n"
        ],
        [
            "6 2 1\n",
            "760234711\n"
        ],
        [
            "7 5 3\n",
            "223383352\n"
        ],
        [
            "97 31 9984524\n",
            "267137618\n"
        ]
    ],
    "hint": "In the first example, the expected total length is $ \\int_0^1 \\int_0^1 |x-y| \\,\\mathrm{d}x\\,\\mathrm{d}y = {1\\over 3} $ , and $ 3^{-1} $ modulo $ 998244353 $ is $ 332748118 $ .",
    "translation": "有一段长为$l$的线段，有$n$个区间，左右端点在$[0,l)$间均匀随机（可能不是整数）\n\n求期望被至少$k$段区间覆盖的长度，对998244353取膜"
}