{
    "description": "Finished her homework, Nastya decided to play computer games. Passing levels one by one, Nastya eventually faced a problem. Her mission is to leave a room, where a lot of monsters live, as quickly as possible.\n\nThere are $ n $ manholes in the room which are situated on one line, but, unfortunately, all the manholes are closed, and there is one stone on every manhole. There is exactly one coin under every manhole, and to win the game Nastya should pick all the coins. Initially Nastya stands near the $ k $ -th manhole from the left. She is thinking what to do.\n\nIn one turn, Nastya can do one of the following:\n\n- if there is at least one stone on the manhole Nastya stands near, throw exactly one stone from it onto any other manhole (yes, Nastya is strong).\n- go to a neighboring manhole;\n- if there are no stones on the manhole Nastya stays near, she can open it and pick the coin from it. After it she must close the manhole immediately (it doesn't require additional moves).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1136B/3ed5e40d396c136735a8bacab02d518fbb9c87e8.png)The figure shows the intermediate state of the game. At the current position Nastya can throw the stone to any other manhole or move left or right to the neighboring manholes. If she were near the leftmost manhole, she could open it (since there are no stones on it).Nastya can leave the room when she picks all the coins. Monsters are everywhere, so you need to compute the minimum number of moves Nastya has to make to pick all the coins.\n\nNote one time more that Nastya can open a manhole only when there are no stones onto it.",
    "inputFormat": "The first and only line contains two integers $ n $ and $ k $ , separated by space ( $ 2 \\leq n \\leq 5000 $ , $ 1 \\leq k \\leq n $ ) — the number of manholes and the index of manhole from the left, near which Nastya stays initially. Initially there is exactly one stone near each of the $ n $ manholes.",
    "outputFormat": "Print a single integer — minimum number of moves which lead Nastya to pick all the coins.",
    "samples": [
        [
            "2 2\n",
            "6\n"
        ],
        [
            "4 2\n",
            "13\n"
        ],
        [
            "5 1\n",
            "15\n"
        ]
    ],
    "hint": "Let's consider the example where $ n = 2 $ , $ k = 2 $ . Nastya should play as follows:\n\n- At first she throws the stone from the second manhole to the first. Now there are two stones on the first manhole.\n- Then she opens the second manhole and pick the coin from it.\n- Then she goes to the first manhole, throws two stones by two moves to the second manhole and then opens the manhole and picks the coin from it.\n\nSo, $ 6 $ moves are required to win.",
    "translation": "## 题目描述\r\n完成了她的家庭作业，Nastya决定玩一会儿电脑游戏。Nastya一个接一个地通过关卡，最终遇到了一个问题问题。她的任务是尽快离开许多怪物居住的房间。\r\n有$n$个下水道检修孔其中坐落在一条线，但不幸的是所有的检修孔被关闭，并且每个检修孔上有一块石。每个检修孔下面都有一枚硬币，为了赢得比赛，Nastya应该选择所有的硬币。最初Nastya站在从左边数第$k$个检修孔。她正在考虑该怎么做。\r\n在一个回合中，Nastya可以执行以下操作之一：\r\n1. 如果在检修孔上至少有一块石头，并且Nastya站在附近，从它扔出一块石头到任何其他检修孔(是的，Nastya很强)。\r\n2. 去相邻的检修孔;\r\n3. 如果Nastya所在的检修孔上没有石头，她可以打开它并从中取出硬币。之后，她必须立即关闭检修孔(不需要额外的移动)。\r\n## 图片示意\r\n该图显示了游戏的中间状态。在当前位置，Nastya可以将石头扔到任何其他检修孔，或向左或向右移动到邻近的检修孔。如果她靠近最左边的检修孔，她可以打开它(因为它上面没有石头).Nastya可以在拿到所有硬币时离开房间。怪物无处不在，所以你需要计算Nastya必须采取的拿到所有硬币的最小移动次数。\r\n**请注意，只有在没有石头的情况下，Nastya才能打开一个检修孔。**\r\n## 输入输出格式\r\n### 输入格式：\r\n第一行也是唯一一行包含两个整数$n$和$k$，以空格分隔（$2 ≤ N ≤ 5000$， $1≤ k ≤ N$） -检修孔的数目和从左侧数Nastya最初所站的检修孔的编号。最初每个检修井附近都有一块石头\r\n### 输出格式：\r\n打印一个整数 - 使得Nastya得到所有硬币最小的移动次数。\r\n## 说明\r\n让我们考虑一下这个例子$ n = 2$，$k = 2$。\r\nNastya应该如下操作：\r\n起初，她将石头从第二个检修孔扔到第一个检修孔。现在第一个检修孔上有两块石头。\r\n然后她打开第二个检修孔并从中取出硬币。\r\n然后她去了第一个检修孔，通过两次移动将两块石头扔到第二个检修孔，然后打开检修孔并从中取出硬币。\r\n所以，获胜需要$6$个动作。\r\n"
}