{
    "description": "Polycarp decided to relax on his weekend and visited to the performance of famous ropewalkers: Agafon, Boniface and Konrad.\n\nThe rope is straight and infinite in both directions. At the beginning of the performance, Agafon, Boniface and Konrad are located in positions $ a $ , $ b $ and $ c $ respectively. At the end of the performance, the distance between each pair of ropewalkers was at least $ d $ .\n\nRopewalkers can walk on the rope. In one second, only one ropewalker can change his position. Every ropewalker can change his position exactly by $ 1 $ (i. e. shift by $ 1 $ to the left or right direction on the rope). Agafon, Boniface and Konrad can not move at the same time (Only one of them can move at each moment). Ropewalkers can be at the same positions at the same time and can \"walk past each other\".\n\nYou should find the minimum duration (in seconds) of the performance. In other words, find the minimum number of seconds needed so that the distance between each pair of ropewalkers can be greater or equal to $ d $ .\n\nRopewalkers can walk to negative coordinates, due to the rope is infinite to both sides.",
    "inputFormat": "The only line of the input contains four integers $ a $ , $ b $ , $ c $ , $ d $ ( $ 1 \\le a, b, c, d \\le 10^9 $ ). It is possible that any two (or all three) ropewalkers are in the same position at the beginning of the performance.",
    "outputFormat": "Output one integer — the minimum duration (in seconds) of the performance.",
    "samples": [
        [
            "5 2 6 3\n",
            "2\n"
        ],
        [
            "3 1 5 6\n",
            "8\n"
        ],
        [
            "8 3 3 2\n",
            "2\n"
        ],
        [
            "2 3 10 4\n",
            "3\n"
        ]
    ],
    "hint": "In the first example: in the first two seconds Konrad moves for 2 positions to the right (to the position $ 8 $ ), while Agafon and Boniface stay at their positions. Thus, the distance between Agafon and Boniface will be $ |5 - 2| = 3 $ , the distance between Boniface and Konrad will be $ |2 - 8| = 6 $ and the distance between Agafon and Konrad will be $ |5 - 8| = 3 $ . Therefore, all three pairwise distances will be at least $ d=3 $ , so the performance could be finished within 2 seconds.",
    "translation": "【题目描述】\n\n数轴上有3个整点A,B,C，分别分布在数a,b,c的地方。现需要让三个点之间两两距离不小于d。每秒钟有且仅有一个点可以移动一步，每步可以向左或向右移动恰好1个单位长度。我们想知道：为了达成目标，至少需要多少秒？\n\n【输入格式】\n\n一行，四个正整数a,b,c,d，含义如题所示。\n\n【输出格式】\n\n一行，一个整数，表示答案。\n\n【数据范围与约定】\n\n对于100%的数据，保证1<=a,b,c,d<=10^9。"
}