{
    "description": "Asya loves animals very much. Recently, she purchased $ n $ kittens, enumerated them from $ 1 $ and $ n $ and then put them into the cage. The cage consists of one row of $ n $ cells, enumerated with integers from $ 1 $ to $ n $ from left to right. Adjacent cells had a partially transparent partition wall between them, hence there were $ n - 1 $ partitions originally. Initially, each cell contained exactly one kitten with some number.\n\nObserving the kittens, Asya noticed, that they are very friendly and often a pair of kittens in neighboring cells wants to play together. So Asya started to remove partitions between neighboring cells. In particular, on the day $ i $ , Asya:\n\n- Noticed, that the kittens $ x_i $ and $ y_i $ , located in neighboring cells want to play together.\n- Removed the partition between these two cells, efficiently creating a single cell, having all kittens from two original cells.\n\nSince Asya has never putted partitions back, after $ n - 1 $ days the cage contained a single cell, having all kittens.\n\nFor every day, Asya remembers numbers of kittens $ x_i $ and $ y_i $ , who wanted to play together, however she doesn't remember how she placed kittens in the cage in the beginning. Please help her and find any possible initial arrangement of the kittens into $ n $ cells.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 150\\,000 $ ) — the number of kittens.\n\nEach of the following $ n - 1 $ lines contains integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le n $ , $ x_i \\ne y_i $ ) — indices of kittens, which got together due to the border removal on the corresponding day.\n\nIt's guaranteed, that the kittens $ x_i $ and $ y_i $ were in the different cells before this day.",
    "outputFormat": "For every cell from $ 1 $ to $ n $ print a single integer — the index of the kitten from $ 1 $ to $ n $ , who was originally in it.\n\nAll printed integers must be distinct.\n\nIt's guaranteed, that there is at least one answer possible. In case there are multiple possible answers, print any of them.",
    "samples": [
        [
            "5\n1 4\n2 5\n3 1\n4 5\n",
            "3 1 4 2 5\n"
        ]
    ],
    "hint": "The answer for the example contains one of several possible initial arrangements of the kittens.\n\nThe picture below shows how the cells were united for this initial arrangement. Note, that the kittens who wanted to play together on each day were indeed in adjacent cells.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1131F/0f66af3a5bf104383a10a56a67962cef2112dbf1.png)",
    "translation": "有一个长为 $n$ 的排列，一开始每个数都是一个独立的联通块。有 $n-1$ 次操作，每次要求 $x_i$ 和 $y_i$ 所在的联通块相邻，然后把这两个联通块合并。求一个合法的排列使得所有操作合法。保证有解。\r\n\r\n$1\\le n\\le 1.5\\times 10^5$。"
}