{
    "description": "The Third Doctor Who once correctly said that travel between parallel universes is \"like travelling sideways\". However, he incorrectly thought that there were infinite parallel universes, whereas in fact, as we now all know, there will never be more than 250.\n\nHeidi recently got her hands on a multiverse observation tool. She was able to see all $ n $ universes lined up in a row, with non-existent links between them. She also noticed that the Doctor was in the $ k $ -th universe.\n\nThe tool also points out that due to restrictions originating from the space-time discontinuum, the number of universes will never exceed $ m $ .\n\nObviously, the multiverse is unstable because of free will. Each time a decision is made, one of two events will randomly happen: a new parallel universe is created, or a non-existent link is broken.\n\nMore specifically,\n\n- When a universe is created, it will manifest itself between any two adjacent universes or at one of the ends.\n- When a link is broken, it could be cut between any two adjacent universes. After separating the multiverse into two segments, the segment NOT containing the Doctor will cease to exist.\n\nHeidi wants to perform a simulation of $ t $ decisions. Each time a decision is made, Heidi wants to know the length of the multiverse (i.e. the number of universes), and the position of the Doctor.",
    "inputFormat": "The first line contains four integers $ n $ , $ k $ , $ m $ and $ t $ ( $ 2 \\le k \\le n \\le m \\le 250 $ , $ 1 \\le t \\le 1000 $ ).\n\nEach of the following $ t $ lines is in one of the following formats:\n\n- \" $ 1 $ $ i $ \" — meaning that a universe is inserted at the position $ i $ ( $ 1 \\le i \\le l + 1 $ ), where $ l $ denotes the current length of the multiverse.\n- \" $ 0 $ $ i $ \" — meaning that the $ i $ -th link is broken ( $ 1 \\le i \\le l - 1 $ ), where $ l $ denotes the current length of the multiverse.",
    "outputFormat": "Output $ t $ lines. Each line should contain $ l $ , the current length of the multiverse and $ k $ , the current position of the Doctor.\n\nIt is guaranteed that the sequence of the steps will be valid, i.e. the multiverse will have length at most $ m $ and when the link breaking is performed, there will be at least one universe in the multiverse.",
    "samples": [
        [
            "5 2 10 4\n0 1\n1 1\n0 4\n1 2\n",
            "4 1\n5 2\n4 2\n5 3\n"
        ]
    ],
    "hint": "The multiverse initially consisted of 5 universes, with the Doctor being in the second.\n\nFirst, link 1 was broken, leaving the multiverse with 4 universes, and the Doctor in the first.\n\nThen, a universe was added to the leftmost end of the multiverse, increasing the multiverse length to 5, and the Doctor was then in the second universe.\n\nThen, the rightmost link was broken.\n\nFinally, a universe was added between the first and the second universe.",
    "translation": "**题目描述**\r\n\r\nThird Doctor 曾说平行宇宙之间的旅行“就像穿越旅行”。然而，他错认为存在着无限的平行宇宙，而事实上它们永远不会超过$250$个。\r\n\r\n海蒂最近得到了一个多元宇宙观测器。她能看到所有的$N$个宇宙排成一排，它们之间不存在联系。 Doctor 在第$k$宇宙。\r\n\r\n由于时空的种种原因，宇宙的数量永远不会超过$m$。\r\n\r\n显然，多元宇宙变幻莫测，每次做出变化时，必将会有一个新的并行宇宙被创建，或者一个不存在的链接被破坏。\r\n\r\n更具体地说，\r\n\r\n- 当一个宇宙被创造时，它将在任何两个相邻的宇宙之间或在其中一个末端出现。\r\n\r\n- 当一个连接断开时，它可以在任何两个相邻的宇宙之间被切断。在将多宇宙分割成两段之后，不包含 Doctor 的部分将在时空中陨落，不复存在。\r\n\r\n海蒂突发奇想，模拟$t$个变化。每次变化时时，海蒂想知道多元宇宙的长度（即宇宙的数量）和 Doctor 的位置。\r\n\r\n**输入格式**\r\n\r\n第一行包含四个整数$n$，$k$，$m$和$t$，意义如上所示。\r\n\r\n以下$t$行，每行包含一个$0$或$1$的数和$i$。\r\n\r\n若第一个数为$0$，意为在位置$i$（$1\\leq i\\leq l+1$）插入一个宇宙，其中$l$表示多重宇宙的当前长度。\r\n\r\n若第一个数为$1$，表示第i个链接断开了（$1\\leq i\\leq l-1$），其中$l$表示多元宇宙的当前长度。\r\n\r\n**输出格式**\r\n\r\n输出共$t$行，每行包含两个整数$l$和$k$，分别表示多元宇宙的当前长度和 Doctor 当前位置。\r\n\r\n数据保证多重宇宙的长度最多为$m$，并且当断开连接时，多重宇宙中至少有一个宇宙。"
}