{
    "description": "This is an interactive problem!\n\nAn arithmetic progression or arithmetic sequence is a sequence of integers such that the subtraction of element with its previous element ( $ x_i - x_{i - 1} $ , where $ i \\ge 2 $ ) is constant — such difference is called a common difference of the sequence.\n\nThat is, an arithmetic progression is a sequence of form $ x_i = x_1 + (i - 1) d $ , where $ d $ is a common difference of the sequence.\n\nThere is a secret list of $ n $ integers $ a_1, a_2, \\ldots, a_n $ .\n\nIt is guaranteed that all elements $ a_1, a_2, \\ldots, a_n $ are between $ 0 $ and $ 10^9 $ , inclusive.\n\nThis list is special: if sorted in increasing order, it will form an arithmetic progression with positive common difference ( $ d > 0 $ ). For example, the list $ [14, 24, 9, 19] $ satisfies this requirement, after sorting it makes a list $ [9, 14, 19, 24] $ , which can be produced as $ x_n = 9 + 5 \\cdot (n - 1) $ .\n\nAlso you are also given a device, which has a quite discharged battery, thus you can only use it to perform at most $ 60 $ queries of following two types:\n\n- Given a value $ i $ ( $ 1 \\le i \\le n $ ), the device will show the value of the $ a_i $ .\n- Given a value $ x $ ( $ 0 \\le x \\le 10^9 $ ), the device will return $ 1 $ if an element with a value strictly greater than $ x $ exists, and it will return $ 0 $ otherwise.\n\nYour can use this special device for at most $ 60 $ queries. Could you please find out the smallest element and the common difference of the sequence? That is, values $ x_1 $ and $ d $ in the definition of the arithmetic progression. Note that the array $ a $ is not sorted.",
    "inputFormat": "",
    "outputFormat": "The interaction starts with a single integer $ n $ ( $ 2 \\le n \\le 10^6 $ ), the size of the list of integers.\n\nThen you can make queries of two types:\n\n- \"? i\" ( $ 1 \\le i \\le n $ ) — to get the value of $ a_i $ .\n- \"> x\" ( $ 0 \\le x \\le 10^9 $ ) — to check whether there exists an element greater than $ x $\n\nAfter the query read its result $ r $ as an integer.\n\n- For the first query type, the $ r $ satisfies $ 0 \\le r \\le 10^9 $ .\n- For the second query type, the $ r $ is either $ 0 $ or $ 1 $ .\n- In case you make more than $ 60 $ queries or violated the number range in the queries, you will get a $ r = -1 $ .\n- If you terminate after receiving the -1, you will get the \"Wrong answer\" verdict. Otherwise you can get an arbitrary verdict because your solution will continue to read from a closed stream.\n\nWhen you find out what the smallest element $ x_1 $ and common difference $ d $ , print\n\n- \"! $ x_1 $ $ d $ \"\n\nAnd quit after that. This query is not counted towards the $ 60 $ queries limit.\n\nAfter printing any query do not forget to output end of line and flush the output. Otherwise you will get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see documentation for other languages.\n\nHacks\n\nFor hack, use the following format:\n\nThe first line should contain an integer $ n $ ( $ 2 \\le n \\le 10^6 $ ) — the list's size.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le 10^9 $ ) — the elements of the list.\n\nAlso, after the sorting the list must form an arithmetic progression with positive common difference.",
    "samples": [
        [
            "4\n\n0\n\n1\n\n14\n\n24\n\n9\n\n19\n\n",
            "\n> 25\n\n> 15\n\n? 1\n\n? 2\n\n? 3\n\n? 4\n\n! 9 5"
        ]
    ],
    "hint": "Note that the example interaction contains extra empty lines so that it's easier to read. The real interaction doesn't contain any empty lines and you shouldn't print any extra empty lines as well.\n\nThe list in the example test is $ [14, 24, 9, 19] $ .",
    "translation": "交互题。\n\n有一个长度为 $n$ 的序列 $a$，保证它从小到大排序后是个等差数列。你不知道这个序列长什么样，但你可以询问：\n\n- $?\\ i$ 表示询问 $a_i$ 的值；\n- $>\\ x$ 表示询问序列中是否存在严格大于 $x$ 的数。\n你可以问不超过 $60$ 个询问。\n\n现在，你需要求出这个等差数列的首项（也就是 $a$ 中的最小值）和这个等差数列的公差（也就是等差数列中相邻两个数的差）。\n\n$2\\le n\\le 10^6,0\\le a_i\\le 10^9$。"
}