{
    "description": "Little Petya loves presents. His mum bought him two strings of the same size for his birthday. The strings consist of uppercase and lowercase Latin letters. Now Petya wants to compare those two strings lexicographically. The letters' case does not matter, that is an uppercase letter is considered equivalent to the corresponding lowercase letter. Help Petya perform the comparison.",
    "inputFormat": "Each of the first two lines contains a bought string. The strings' lengths range from $ 1 $ to $ 100 $ inclusive. It is guaranteed that the strings are of the same length and also consist of uppercase and lowercase Latin letters.",
    "outputFormat": "If the first string is less than the second one, print \"-1\". If the second string is less than the first one, print \"1\". If the strings are equal, print \"0\". Note that the letters' case is not taken into consideration when the strings are compared.",
    "samples": [
        [
            "aaaa\naaaA\n",
            "0\n"
        ],
        [
            "abs\nAbz\n",
            "-1\n"
        ],
        [
            "abcdefg\nAbCdEfF\n",
            "1\n"
        ]
    ],
    "hint": "If you want more formal information about the lexicographical order (also known as the \"dictionary order\" or \"alphabetical order\"), you can visit the following site:\n\n- http://en.wikipedia.org/wiki/Lexicographical\\_order",
    "translation": "输入两个字符串，大小写无关紧要，比较它们的大小。\n\n输入格式\n\n两个字符串（保证长度相等）\n\n输出格式\n\n如果第一个字符串小于第二个字符串，则输出“-1”。如果第二个字符串小于第一个字符串，则输出“1”。如果字符串相同，则打印“0”。请注意，比较字符串时不考虑字母的大小写。"
}