{
    "description": "This problem differs from the previous problem only in constraints.\n\nPetya decided to visit Byteland during the summer holidays. It turned out that the history of this country is quite unusual.\n\nInitially, there were $ n $ different countries on the land that is now Berland. Each country had its own territory that was represented as a rectangle on the map. The sides of the rectangle were parallel to the axes, and the corners were located at points with integer coordinates. Territories of no two countries intersected, but it was possible that some territories touched each other. As time passed, sometimes two countries merged into one. It only happened if the union of their territories was also a rectangle. In the end only one country remained — Byteland.\n\nInitially, each country had a rectangular castle inside its territory. Its sides were parallel to the axes and its corners had integer coordinates. Some castles might touch the border of the corresponding country and sides or other castles. Miraculously, after all the unions the castles are still intact. Unfortunately, their locations are the only information we have to restore the initial territories of the countries.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1181E2/f468812bfa112254fc0a226123d17950651543de.png) The possible formation of Byteland. The castles are shown in blue. Petya wonders why no information about the initial countries remained. He suspected that the whole story is a fake. You were recommended to him as a smart person. Please check whether or not there exists a possible set of initial territories that could make the story true.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\leq n \\leq 100\\,000 $ ) — the number of countries and castles.\n\nEach of the next $ n $ lines contains four integers $ a_i, b_i, c_i, d_i $ ( $ 0 \\leq a_i < c_i \\leq 10^9 $ , $ 0 \\leq b_i < d_i \\leq 10^9 $ ) — the coordinates of the $ i $ -th castle, where $ (a_i, b_i) $ are the coordinates of the lower left corner and $ (c_i, d_i) $ are the coordinates of the upper right corner.\n\nIt is guaranteed that no two castles intersect, however, they may touch.",
    "outputFormat": "If there exists a possible set of territories that satisfies the story, print \"YES\", otherwise print \"NO\".\n\nYou can print each letter in any case (upper or lower).",
    "samples": [
        [
            "4\n0 0 1 2\n0 2 1 3\n1 0 2 1\n1 1 2 3\n",
            "YES\n"
        ],
        [
            "4\n0 0 2 1\n1 2 3 3\n2 0 3 2\n0 1 1 3\n",
            "NO\n"
        ]
    ],
    "hint": "The castles in the first and second examples are shown on the pictures below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1181E2/65c05eff44019e46877011da23e6739903c4b116.png) ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1181E2/13651d9028d4dc1ad40258518684f2d9fe9c5d09.png)"
}