{
    "description": "Fedor runs for president of Byteland! In the debates, he will be asked how to solve Byteland's transport problem. It's a really hard problem because of Byteland's transport system is now a tree (connected graph without cycles). Fedor's team has found out in the ministry of transport of Byteland that there is money in the budget only for one additional road. In the debates, he is going to say that he will build this road as a way to maximize the number of distinct simple paths in the country. A simple path is a path which goes through every vertex no more than once. Two simple paths are named distinct if sets of their edges are distinct.\n\nBut Byteland's science is deteriorated, so Fedor's team hasn't succeeded to find any scientists to answer how many distinct simple paths they can achieve after adding exactly one edge on the transport system?\n\nHelp Fedor to solve it.\n\nAn edge can be added between vertices that are already connected, but it can't be a loop.\n\nIn this problem, we consider only simple paths of length at least two.",
    "inputFormat": "The first line contains one integer $ n $ ( $ 2 \\leq n \\leq 500\\ 000 $ ) — number of vertices in Byteland's transport system.\n\nEach of the following $ n - 1 $ lines contains two integers $ v_i $ and $ u_i $ ( $ 1 \\leq v_i, u_i \\leq n $ ). It's guaranteed that the graph is tree.",
    "outputFormat": "Print exactly one integer — a maximal number of simple paths that can be achieved after adding one edge.",
    "samples": [
        [
            "2\n1 2\n",
            "2\n"
        ],
        [
            "4\n1 2\n1 3\n1 4\n",
            "11\n"
        ],
        [
            "6\n1 2\n1 3\n3 4\n3 5\n4 6\n",
            "29\n"
        ]
    ],
    "hint": "",
    "translation": "给一棵$n$个点的树，求加入一条边后，最多有多少条无向简单路径。\r\n\r\n简单路径定义为任意一个点最多经过一次的路径。"
}