{
    "description": "Arkady coordinates rounds on some not really famous competitive programming platform. Each round features $ n $ problems of distinct difficulty, the difficulties are numbered from $ 1 $ to $ n $ .\n\nTo hold a round Arkady needs $ n $ new (not used previously) problems, one for each difficulty. As for now, Arkady creates all the problems himself, but unfortunately, he can't just create a problem of a desired difficulty. Instead, when he creates a problem, he evaluates its difficulty from $ 1 $ to $ n $ and puts it into the problems pool.\n\nAt each moment when Arkady can choose a set of $ n $ new problems of distinct difficulties from the pool, he holds a round with these problems and removes them from the pool. Arkady always creates one problem at a time, so if he can hold a round after creating a problem, he immediately does it.\n\nYou are given a sequence of problems' difficulties in the order Arkady created them. For each problem, determine whether Arkady held the round right after creating this problem, or not. Initially the problems pool is empty.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 10^5 $ ) — the number of difficulty levels and the number of problems Arkady created.\n\nThe second line contains $ m $ integers $ a_1, a_2, \\ldots, a_m $ ( $ 1 \\le a_i \\le n $ ) — the problems' difficulties in the order Arkady created them.",
    "outputFormat": "Print a line containing $ m $ digits. The $ i $ -th digit should be $ 1 $ if Arkady held the round after creation of the $ i $ -th problem, and $ 0 $ otherwise.",
    "samples": [
        [
            "3 11\n2 3 1 2 2 2 3 2 2 3 1\n",
            "00100000001\n"
        ],
        [
            "4 8\n4 1 3 3 2 3 3 3\n",
            "00001000\n"
        ]
    ],
    "hint": "In the first example Arkady held the round after the first three problems, because they are of distinct difficulties, and then only after the last problem.",
    "translation": "### 题目大意\n有$n$个题，每个题有一个难度$a_i(1\\le a_i\\le m)$，从左往右加入题，当加入的题中$m$个难度都出现时，输出$1$并把每个难度都删除一道题，否则输出$0$，求输出序列\n\n### 输入格式\n第一行两个数$m,n$，表示难度个数和题目个数\n\n第二行$n$个整数，表示题目难度\n\n### 输出格式\n一行，表示输出序列"
}