{
    "description": "You are given a huge decimal number consisting of $ n $ digits. It is guaranteed that this number has no leading zeros. Each digit of this number is either 0 or 1.\n\nYou may perform several (possibly zero) operations with this number. During each operation you are allowed to change any digit of your number; you may change 0 to 1 or 1 to 0. It is possible that after some operation you can obtain a number with leading zeroes, but it does not matter for this problem.\n\nYou are also given two integers $ 0 \\le y < x < n $ . Your task is to calculate the minimum number of operations you should perform to obtain the number that has remainder $ 10^y $ modulo $ 10^x $ . In other words, the obtained number should have remainder $ 10^y $ when divided by $ 10^x $ .",
    "inputFormat": "The first line of the input contains three integers $ n, x, y $ ( $ 0 \\le y < x < n \\le 2 \\cdot 10^5 $ ) — the length of the number and the integers $ x $ and $ y $ , respectively.\n\nThe second line of the input contains one decimal number consisting of $ n $ digits, each digit of this number is either 0 or 1. It is guaranteed that the first digit of the number is 1.",
    "outputFormat": "Print one integer — the minimum number of operations you should perform to obtain the number having remainder $ 10^y $ modulo $ 10^x $ . In other words, the obtained number should have remainder $ 10^y $ when divided by $ 10^x $ .",
    "samples": [
        [
            "11 5 2\n11010100101\n",
            "1\n"
        ],
        [
            "11 5 1\n11010100101\n",
            "3\n"
        ]
    ],
    "hint": "In the first example the number will be $ 11010100100 $ after performing one operation. It has remainder $ 100 $ modulo $ 100000 $ .\n\nIn the second example the number will be $ 11010100010 $ after performing three operations. It has remainder $ 10 $ modulo $ 100000 $ .",
    "translation": "## 题目描述\r\nAiming_High神仙给你一个由$n$位数字组成的数，且保证这个数字没有前导零，且每一位数字要么是$0$要么是$1$。\r\n\r\nAiming_High神仙需要你对这个数进行若干次操作（可能是$0$次）。每次操作中，你可以更改其中的任何数位，把这个数位上的数字从$1$变成$0$或从$0$变成$1$。操作后的数可能带有前导零，但并不影响这个问题。\r\n\r\nAiming_High神仙还给了你两个数字$x$，$y$。你要做的是最小化操作次数，使得操作后的数除以$10^x$的余数等于$10^y$。\r\n\r\n## 输入输出格式\r\n\r\n### 输入格式：\r\n\r\n输入的第一行包含三个整数$n$，$x$，$y$。\r\n\r\n第二行包括一个数，由$n$个数位组成。保证每个数位上的数都是$0$或$1$，且无前导零。\r\n\r\n### 输出格式：\r\n\r\n输出一个整数，表示最小操作次数。\r\n"
}