{
    "description": "Thanks to the Doctor's help, the rebels managed to steal enough gold to launch a full-scale attack on the Empire! However, Darth Vader is looking for revenge and wants to take back his gold.\n\nThe rebels have hidden the gold in various bases throughout the galaxy. Darth Vader and the Empire are looking to send out their spaceships to attack these bases.\n\nThe galaxy can be represented as an undirected graph with $ n $ planets (nodes) and $ m $ wormholes (edges), each connecting two planets.\n\nA total of $ s $ empire spaceships and $ b $ rebel bases are located at different planets in the galaxy.\n\nEach spaceship is given a location $ x $ , denoting the index of the planet on which it is located, an attacking strength $ a $ , and a certain amount of fuel $ f $ .\n\nEach base is given a location $ x $ , and a defensive strength $ d $ .\n\nA spaceship can attack a base if both of these conditions hold:\n\n- the spaceship's attacking strength is greater or equal than the defensive strength of the base\n- the spaceship's fuel is greater or equal to the shortest distance, computed as the number of wormholes, between the spaceship's planet and the base's planet\n\nVader is very particular about his attacking formations. He requires that each spaceship is to attack at most one base and that each base is to be attacked by at most one spaceship.\n\nVader knows that the rebels have hidden $ k $ gold in each base, so he will assign the spaceships to attack bases in such a way that maximizes the number of bases attacked.\n\nTherefore, for each base that is attacked, the rebels lose $ k $ gold.\n\nHowever, the rebels have the ability to create any number of dummy bases. With the Doctor's help, these bases would exist beyond space and time, so all spaceship can reach them and attack them. Moreover, a dummy base is designed to seem irresistible: that is, it will always be attacked by some spaceship.\n\nOf course, dummy bases do not contain any gold, but creating such a dummy base costs $ h $ gold.\n\nWhat is the minimum gold the rebels can lose if they create an optimal number of dummy bases?",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\leq n \\leq 100 $ , $ 0 \\leq m \\leq 10000 $ ), the number of nodes and the number of edges, respectively.\n\nThe next $ m $ lines contain two integers $ u $ and $ v $ ( $ 1 \\leq u $ , $ v \\leq n $ ) denoting an undirected edge between the two nodes.\n\nThe next line contains four integers $ s $ , $ b $ , $ k $ and $ h $ ( $ 1 \\leq s $ , $ b \\leq 1000 $ , $ 0 \\leq k $ , $ h \\leq 10^9 $ ), the number of spaceships, the number of bases, the cost of having a base attacked, and the cost of creating a dummy base, respectively.\n\nThe next $ s $ lines contain three integers $ x $ , $ a $ , $ f $ ( $ 1 \\leq x \\leq n $ , $ 0 \\leq a $ , $ f \\leq 10^9 $ ), denoting the location, attack, and fuel of the spaceship.\n\nThe next $ b $ lines contain two integers $ x $ , $ d $ ( $ 1 \\leq x \\leq n $ , $ 0 \\leq d \\leq 10^9 $ ), denoting the location and defence of the base.",
    "outputFormat": "Print a single integer, the minimum cost in terms of gold.",
    "samples": [
        [
            "6 7\n1 2\n2 3\n3 4\n4 6\n6 5\n4 4\n3 6\n4 2 7 3\n1 10 2\n3 8 2\n5 1 0\n6 5 4\n3 7\n5 2\n",
            "12\n"
        ]
    ],
    "hint": "One way to minimize the cost is to build $ 4 $ dummy bases, for a total cost of $ 4 \\times 3 = 12 $ .\n\nOne empire spaceship will be assigned to attack each of these dummy bases, resulting in zero actual bases attacked."
}