{
    "description": "This problem is actually a subproblem of problem G from the same contest.\n\nThere are $ n $ candies in a candy box. The type of the $ i $ -th candy is $ a_i $ ( $ 1 \\le a_i \\le n $ ).\n\nYou have to prepare a gift using some of these candies with the following restriction: the numbers of candies of each type presented in a gift should be all distinct (i. e. for example, a gift having two candies of type $ 1 $ and two candies of type $ 2 $ is bad).\n\nIt is possible that multiple types of candies are completely absent from the gift. It is also possible that not all candies of some types will be taken to a gift.\n\nYour task is to find out the maximum possible size of the single gift you can prepare using the candies you have.\n\nYou have to answer $ q $ independent queries.\n\nIf you are Python programmer, consider using PyPy instead of Python when you submit your code.",
    "inputFormat": "The first line of the input contains one integer $ q $ ( $ 1 \\le q \\le 2 \\cdot 10^5 $ ) — the number of queries. Each query is represented by two lines.\n\nThe first line of each query contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of candies.\n\nThe second line of each query contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le n $ ), where $ a_i $ is the type of the $ i $ -th candy in the box.\n\nIt is guaranteed that the sum of $ n $ over all queries does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each query print one integer — the maximum possible size of the single gift you can compose using candies you got in this query with the restriction described in the problem statement.",
    "samples": [
        [
            "3\n8\n1 4 8 4 5 6 3 8\n16\n2 1 3 3 4 3 4 4 1 3 2 2 2 4 1 1\n9\n2 2 4 4 4 7 7 7 7\n",
            "3\n10\n9\n"
        ]
    ],
    "hint": "In the first query, you can prepare a gift with two candies of type $ 8 $ and one candy of type $ 5 $ , totalling to $ 3 $ candies.\n\nNote that this is not the only possible solution — taking two candies of type $ 4 $ and one candy of type $ 6 $ is also valid.",
    "translation": "本题是G题的一个子问题。\n\n你有$n$块糖果，第$i$块糖果的种类是$a_i$。\n\n你想选出来若干块糖果送给别人。你选出来的糖果需要满足任意两种糖果的数量都不能相等。\n\n求你最多能够选出来多少块糖果。\n\n你需要回答$q$组询问。\n\n$\\text{——by wucstdio}$"
}