{
    "description": "Let's analyze a program written on some strange programming language. The variables in this language have names consisting of $ 1 $ to $ 4 $ characters, and each character is a lowercase or an uppercase Latin letter, or a digit. There is an extra constraint that the first character should not be a digit.\n\nThere are four types of operations in the program, each denoted by one of the characters: $, ^, \\# or &.\n\nEach line of the program has one of the following formats:\n\n- <lvalue>=<rvalue>, where <lvalue> and <rvalue> are valid variable names;\n- <lvalue>=<arg1><op><arg2>, where <lvalue>, <arg1> and <arg2> are valid variable names, and <op> is an operation character.\n\nThe program is executed line-by-line, and the result of execution is stored in a variable having the name res. If res is never assigned in the program, then the result will be equal to the value of res before running the program.\n\nTwo programs are called equivalent if no matter which operations do characters $, ^, \\# and & denote (but, obviously, performing the same operation on the same arguments gives the same result) and which values do variables have before execution of program, the value of res after running the first program is equal to the value of res after running the second program (the programs are executed independently).\n\nYou are given a program consisting of $ n $ lines. Your task is to write a program consisting of minimum possible number of lines that is equivalent to the program you are given.",
    "inputFormat": "The first line contains one integer $ n $ ( $ 1 \\le n \\le 1000 $ ) — the number of lines in the program.\n\nThen $ n $ lines follow — the program itself. Each line corresponds to the format described in the statement and has no extra whitespaces.",
    "outputFormat": "In the first line print $ k $ — the minimum number of lines in the equivalent program.\n\nThen print $ k $ lines without any whitespaces — an equivalent program having exactly $ k $ lines, in the same format it is described in the statement.",
    "samples": [
        [
            "4\nc=aa#bb\nd12=c\nres=c^d12\ntmp=aa$c\n",
            "2\naaaa=aa#bb\nres=aaaa^aaaa\n"
        ],
        [
            "2\nmax=aaaa$bbbb\nmin=bbbb^aaaa\n",
            "0"
        ]
    ],
    "hint": "",
    "translation": "你要分析一段用一种神奇的语言写的程序。\r\n\r\n这种语言的变量是一个长度不超过$4$的字符串，每一个字符是一个拉丁字母或者数字。特别的，数字不能作为变量名的开头。\r\n\r\n这种语言有四种运算符，分别是$,^,#,&。\r\n\r\n每一行程序有以下两种格式：\r\n\r\n```cpp\r\n1、<lvalue>=<rvalue>，表示把<rvalue>的值赋给<lvalue>，其中<lvalue>和<rvalue>都是合法变量名。\r\n2、<lvalue>=<arg1><op><arg2>，其中<lvalue>,<arg1>和<arg2>都是合法变量名，<op>是运算符。\r\n```\r\n\r\n这种语言是一行一行运行的，运行结果是一个叫做\"res\"的变量。如果res没有出现，那么运行结果就是执行这段程序之前res的值。\r\n\r\n两段程序被称作等价的，当且仅当无论运算符代表什么运算，所有变量初始值是什么，这两段程序的结果都是一样的。\r\n\r\n你有一段$n$行的程序。你需要写出一段行数最少的等价的程序。"
}