{
    "description": "You are given a sequence $ s $ consisting of $ n $ digits from $ 1 $ to $ 9 $ .\n\nYou have to divide it into at least two segments (segment — is a consecutive sequence of elements) (in other words, you have to place separators between some digits of the sequence) in such a way that each element belongs to exactly one segment and if the resulting division will be represented as an integer numbers sequence then each next element of this sequence will be strictly greater than the previous one.\n\nMore formally: if the resulting division of the sequence is $ t_1, t_2, \\dots, t_k $ , where $ k $ is the number of element in a division, then for each $ i $ from $ 1 $ to $ k-1 $ the condition $ t_{i} < t_{i + 1} $ (using numerical comparing, it means that the integer representations of strings are compared) should be satisfied.\n\nFor example, if $ s=654 $ then you can divide it into parts $ [6, 54] $ and it will be suitable division. But if you will divide it into parts $ [65, 4] $ then it will be bad division because $ 65 > 4 $ . If $ s=123 $ then you can divide it into parts $ [1, 23] $ , $ [1, 2, 3] $ but not into parts $ [12, 3] $ .\n\nYour task is to find any suitable division for each of the $ q $ independent queries.",
    "inputFormat": "The first line of the input contains one integer $ q $ ( $ 1 \\le q \\le 300 $ ) — the number of queries.\n\nThe first line of the $ i $ -th query contains one integer number $ n_i $ ( $ 2 \\le n_i \\le 300 $ ) — the number of digits in the $ i $ -th query.\n\nThe second line of the $ i $ -th query contains one string $ s_i $ of length $ n_i $ consisting only of digits from $ 1 $ to $ 9 $ .",
    "outputFormat": "If the sequence of digits in the $ i $ -th query cannot be divided into at least two parts in a way described in the problem statement, print the single line \"NO\" for this query.\n\nOtherwise in the first line of the answer to this query print \"YES\", on the second line print $ k_i $ — the number of parts in your division of the $ i $ -th query sequence and in the third line print $ k_i $ strings $ t_{i, 1}, t_{i, 2}, \\dots, t_{i, k_i} $ — your division. Parts should be printed in order of the initial string digits. It means that if you write the parts one after another without changing their order then you'll get the string $ s_i $ .\n\nSee examples for better understanding.",
    "samples": [
        [
            "4\n6\n654321\n4\n1337\n2\n33\n4\n2122\n",
            "YES\n3\n6 54 321\nYES\n3\n1 3 37\nNO\nYES\n2\n21 22\n"
        ]
    ],
    "hint": "",
    "translation": "你有一个由 $n$ 个由 $0$ 到 $9$ 之间的数组成的序列 $s$。\n\n你必须最少把它分成两段，使得每一段组成的数字都比前一段组成的数字大。\n\n输入第一行一个 $q$，表示询问的组数。\n\n接下来有 $q$ 组询问，每一组询问第一行是一个整数 $n$，第二行为这个序列 $s$。\n\n如果可以，输出 `YES`，并输出你的分割方案，否则，输出 `NO`。"
}