{
    "description": "Petya loves lucky numbers. We all know that lucky numbers are the positive integers whose decimal representations contain only the lucky digits 4 and 7. For example, numbers 47, 744, 4 are lucky and 5, 17, 467 are not.\n\nPetya recently learned to determine whether a string of lowercase Latin letters is lucky. For each individual letter all its positions in the string are written out in the increasing order. This results in $ 26 $ lists of numbers; some of them can be empty. A string is considered lucky if and only if in each list the absolute difference of any two adjacent numbers is a lucky number.\n\nFor example, let's consider string \"zbcdzefdzc\". The lists of positions of equal letters are:\n\n- b: $ 2 $\n- c: $ 3,10 $\n- d: $ 4,8 $\n- e: $ 6 $\n- f: $ 7 $\n- z: $ 1,5,9 $\n- Lists of positions of letters a, g, h, ..., y are empty.\n\nThis string is lucky as all differences are lucky numbers. For letters z: $ 5-1=4 $ , $ 9-5=4 $ , for letters c: $ 10-3=7 $ , for letters d: $ 8-4=4 $ .\n\nNote that if some letter occurs only once in a string, it doesn't influence the string's luckiness after building the lists of positions of equal letters. The string where all the letters are distinct is considered lucky.\n\nFind the lexicographically minimal lucky string whose length equals $ n $ .",
    "inputFormat": "The single line contains a positive integer $ n $ ( $ 1<=n<=10^{5} $ ) — the length of the sought string.",
    "outputFormat": "Print on the single line the lexicographically minimal lucky string whose length equals $ n $ .",
    "samples": [
        [
            "5\n",
            "abcda\n"
        ],
        [
            "3\n",
            "abc\n"
        ]
    ],
    "hint": "The lexical comparison of strings is performed by the < operator in modern programming languages. String $ a $ is lexicographically less than string $ b $ if exists such $ i $ ( $ 1<=i<=n $ ), that $ a_{i}&lt;b_{i} $ , and for any $ j $ ( $ 1<=j&lt;i $ ) $ a_{j}=b_{j} $ .",
    "translation": "输入 $n$，输出一长度为 $n$ 的满足以下条件的字符串：\n\n-  都由小写字母组成；\n-  相邻两个相同字母之间的距离为 $4$ 或 $7$ 。\n-  在满足以上条件时，字典序最小。 "
}