{
    "description": "Now Serval is a junior high school student in Japari Middle School, and he is still thrilled on math as before.\n\nAs a talented boy in mathematics, he likes to play with numbers. This time, he wants to play with numbers on a rooted tree.\n\nA tree is a connected graph without cycles. A rooted tree has a special vertex called the root. A parent of a node $ v $ is the last different from $ v $ vertex on the path from the root to the vertex $ v $ . Children of vertex $ v $ are all nodes for which $ v $ is the parent. A vertex is a leaf if it has no children.\n\nThe rooted tree Serval owns has $ n $ nodes, node $ 1 $ is the root. Serval will write some numbers into all nodes of the tree. However, there are some restrictions. Each of the nodes except leaves has an operation $ \\max $ or $ \\min $ written in it, indicating that the number in this node should be equal to the maximum or minimum of all the numbers in its sons, respectively.\n\nAssume that there are $ k $ leaves in the tree. Serval wants to put integers $ 1, 2, \\ldots, k $ to the $ k $ leaves (each number should be used exactly once). He loves large numbers, so he wants to maximize the number in the root. As his best friend, can you help him?",
    "inputFormat": "The first line contains an integer $ n $ ( $ 2 \\leq n \\leq 3\\cdot 10^5 $ ), the size of the tree.\n\nThe second line contains $ n $ integers, the $ i $ -th of them represents the operation in the node $ i $ . $ 0 $ represents $ \\min $ and $ 1 $ represents $ \\max $ . If the node is a leaf, there is still a number of $ 0 $ or $ 1 $ , but you can ignore it.\n\nThe third line contains $ n-1 $ integers $ f_2, f_3, \\ldots, f_n $ ( $ 1 \\leq f_i \\leq i-1 $ ), where $ f_i $ represents the parent of the node $ i $ .",
    "outputFormat": "Output one integer — the maximum possible number in the root of the tree.",
    "samples": [
        [
            "6\n1 0 1 1 0 1\n1 2 2 2 2\n",
            "1\n"
        ],
        [
            "5\n1 0 1 0 1\n1 1 1 1\n",
            "4\n"
        ],
        [
            "8\n1 0 0 1 0 1 1 0\n1 1 2 2 3 3 3\n",
            "4\n"
        ],
        [
            "9\n1 1 0 0 1 0 1 0 1\n1 1 2 2 3 3 4 4\n",
            "5\n"
        ]
    ],
    "hint": "Pictures below explain the examples. The numbers written in the middle of the nodes are their indices, and the numbers written on the top are the numbers written in the nodes.\n\nIn the first example, no matter how you arrange the numbers, the answer is $ 1 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1153D/6708db6b93ae87595a2a5e6a14824b45296d26be.png)In the second example, no matter how you arrange the numbers, the answer is $ 4 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1153D/55298e44ca1267165e9d58705a4fc29c70e74b01.png)In the third example, one of the best solution to achieve $ 4 $ is to arrange $ 4 $ and $ 5 $ to nodes $ 4 $ and $ 5 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1153D/13208157ec6652f71e197305f666d97c9ee17111.png)In the fourth example, the best solution is to arrange $ 5 $ to node $ 5 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1153D/7e271f8f21b87048c8998b0ecd2a589e99082246.png)",
    "translation": "n个节点以1为根的一棵树，每个非叶子节点都有一个操作max或min（0表示min，1表示max），表示这个节点中的值应该分别等于其子节点中所有值的最大值或最小值。假设树上有k个叶节点，你可以将每个叶节点填上[1,k]的数字，且每个数字只使用一次，求根节点的最大值"
}