{
    "description": "Reziba has many magic gems. Each magic gem can be split into $ M $ normal gems. The amount of space each magic (and normal) gem takes is $ 1 $ unit. A normal gem cannot be split.\n\nReziba wants to choose a set of magic gems and split some of them, so the total space occupied by the resulting set of gems is $ N $ units. If a magic gem is chosen and split, it takes $ M $ units of space (since it is split into $ M $ gems); if a magic gem is not split, it takes $ 1 $ unit.\n\nHow many different configurations of the resulting set of gems can Reziba have, such that the total amount of space taken is $ N $ units? Print the answer modulo $ 1000000007 $ ( $ 10^9+7 $ ). Two configurations are considered different if the number of magic gems Reziba takes to form them differs, or the indices of gems Reziba has to split differ.",
    "inputFormat": "The input contains a single line consisting of $ 2 $ integers $ N $ and $ M $ ( $ 1 \\le N \\le 10^{18} $ , $ 2 \\le M \\le 100 $ ).",
    "outputFormat": "Print one integer, the total number of configurations of the resulting set of gems, given that the total amount of space taken is $ N $ units. Print the answer modulo $ 1000000007 $ ( $ 10^9+7 $ ).",
    "samples": [
        [
            "4 2\n",
            "5\n"
        ],
        [
            "3 2\n",
            "3\n"
        ]
    ],
    "hint": "In the first example each magic gem can split into $ 2 $ normal gems, and we know that the total amount of gems are $ 4 $ .\n\nLet $ 1 $ denote a magic gem, and $ 0 $ denote a normal gem.\n\nThe total configurations you can have is:\n\n- $ 1 1 1 1 $ (None of the gems split);\n- $ 0 0 1 1 $ (First magic gem splits into $ 2 $ normal gems);\n- $ 1 0 0 1 $ (Second magic gem splits into $ 2 $ normal gems);\n- $ 1 1 0 0 $ (Third magic gem splits into $ 2 $ normal gems);\n- $ 0 0 0 0 $ (First and second magic gems split into total $ 4 $ normal gems).\n\nHence, answer is $ 5 $ .",
    "translation": "### 题目描述\n\nxht37 有很多魔法宝石。每颗魔法宝石可以分解成 $ m $ 颗普通宝石，魔法宝石和普通宝石都占据 $ 1 $ 体积的空间，但普通宝石不能再被分解。\n\nxht37 想要使一些魔法宝石分解，使得所有宝石占据的空间**恰好**为 $ n $ 单位体积。显然，一个魔法宝石分解后会占据 $ m $ 体积空间，不分解的魔法宝石仍占据 $ 1 $ 体积空间。\n\n现在 xht37 想要求出有多少种分解方案，可以让最后得到的宝石**恰好**占据 $ n $ 单位体积。两种分解方案不同当且仅当分解的魔法宝石数量不同，或者是所用的宝石的编号不同。\n\nxht37 当然知道怎么做，但是他想考考你。\n\n### 输入格式\n\n输入包含两个数字 $ n,m (1 \\le N \\le 10^{18},2 \\le M \\le 100)$ 。\n\n### 输出格式\n\n输出能使宝石占据恰好 $ n $ 体积的方案数。因为方案数实在太大了，请输出方案数 $ \\mod 10^9+7 $ 后的结果。\n\n### 样例解释\n\n该样例中一颗魔法宝石可以分解得到两颗普通宝石，我们的目标是拿到 $ 4 $ 颗魔法宝石。\n\n让我们用 $ 1 $ 代表魔法宝石，$ 0 $ 代表普通宝石。\n\n则存在如下几种方案：\n\n* $ 1111 $ ：没有宝石被分解。\n* $ 0011 $ ：第一颗宝石分解。\n* $ 1001 $ ：第二颗宝石分解。\n* $ 1100 $ ：第三颗宝石分解。\n* $ 0000 $ ：第一颗和第二颗宝石分解。\n\n因此答案为 $ 5 $ 。"
}