{
    "description": "Tokitsukaze is playing a game derivated from Japanese mahjong. In this game, she has three tiles in her hand. Each tile she owns is a suited tile, which means it has a suit (manzu, pinzu or souzu) and a number (a digit ranged from $ 1 $ to $ 9 $ ). In this problem, we use one digit and one lowercase letter, which is the first character of the suit, to represent a suited tile. All possible suited tiles are represented as 1m, 2m, $ \\ldots $ , 9m, 1p, 2p, $ \\ldots $ , 9p, 1s, 2s, $ \\ldots $ , 9s.\n\nIn order to win the game, she must have at least one mentsu (described below) in her hand, so sometimes she should draw extra suited tiles. After drawing a tile, the number of her tiles increases by one. She can draw any tiles she wants, including those already in her hand.\n\nDo you know the minimum number of extra suited tiles she needs to draw so that she can win?\n\nHere are some useful definitions in this game:\n\n- A mentsu, also known as meld, is formed by a koutsu or a shuntsu;\n- A koutsu, also known as triplet, is made of three identical tiles, such as \\[1m, 1m, 1m\\], however, \\[1m, 1p, 1s\\] or \\[1m, 4m, 7m\\] is NOT a koutsu;\n- A shuntsu, also known as sequence, is made of three sequential numbered tiles in the same suit, such as \\[1m, 2m, 3m\\] and \\[5s, 7s, 6s\\], however, \\[9m, 1m, 2m\\] or \\[1m, 2p, 3s\\] is NOT a shuntsu.\n\nSome examples:\n\n- \\[2m, 3p, 2s, 4m, 1s, 2s, 4s\\] — it contains no koutsu or shuntsu, so it includes no mentsu;\n- \\[4s, 3m, 3p, 4s, 5p, 4s, 5p\\] — it contains a koutsu, \\[4s, 4s, 4s\\], but no shuntsu, so it includes a mentsu;\n- \\[5p, 5s, 9m, 4p, 1s, 7p, 7m, 6p\\] — it contains no koutsu but a shuntsu, \\[5p, 4p, 6p\\] or \\[5p, 7p, 6p\\], so it includes a mentsu.\n\nNote that the order of tiles is unnecessary and you can assume the number of each type of suited tiles she can draw is infinite.",
    "inputFormat": "The only line contains three strings — the tiles in Tokitsukaze's hand. For each string, the first character is a digit ranged from $ 1 $ to $ 9 $ and the second character is m, p or s.",
    "outputFormat": "Print a single integer — the minimum number of extra suited tiles she needs to draw.",
    "samples": [
        [
            "1s 2s 3s\n",
            "0\n"
        ],
        [
            "9m 9m 9m\n",
            "0\n"
        ],
        [
            "3p 9m 2p\n",
            "1\n"
        ]
    ],
    "hint": "In the first example, Tokitsukaze already has a shuntsu.\n\nIn the second example, Tokitsukaze already has a koutsu.\n\nIn the third example, Tokitsukaze can get a shuntsu by drawing one suited tile — 1p or 4p. The resulting tiles will be \\[3p, 9m, 2p, 1p\\] or \\[3p, 9m, 2p, 4p\\].",
    "translation": "XXX有3块麻将，每个麻将上有一个2位的字符串，由1~9的一位数字和m\\s\\p组成，现在有两种出牌方式：\r\n1. 3个一毛一样的麻将\r\n\r\n1. 第2位相同，前面是连号的（比如1p，2p，3p就可以\r\n\r\n但是XXX不是个遵守规则的人，TA可以把任意一个麻将换成另一种麻将，可以换多次，也可以不换，问！XXX至少要换多少次才能一次出完3个麻将？"
}