{
    "description": "Once, during a lesson, Sasha got bored and decided to talk with his friends. Suddenly, he saw Kefa. Since we can talk endlessly about Kefa, we won't even start doing that. The conversation turned to graphs. Kefa promised Sasha to tell him about one interesting fact from graph theory if Sasha helps Kefa to count the number of beautiful trees.\n\nIn this task, a tree is a weighted connected graph, consisting of $ n $ vertices and $ n-1 $ edges, and weights of edges are integers from $ 1 $ to $ m $ . Kefa determines the beauty of a tree as follows: he finds in the tree his two favorite vertices — vertices with numbers $ a $ and $ b $ , and counts the distance between them. The distance between two vertices $ x $ and $ y $ is the sum of weights of edges on the simple path from $ x $ to $ y $ . If the distance between two vertices $ a $ and $ b $ is equal to $ m $ , then the tree is beautiful.\n\nSasha likes graph theory, and even more, Sasha likes interesting facts, that's why he agreed to help Kefa. Luckily, Sasha is familiar with you the best programmer in Byteland. Help Sasha to count the number of beautiful trees for Kefa. Two trees are considered to be distinct if there is an edge that occurs in one of them and doesn't occur in the other one. Edge's weight matters.\n\nKefa warned Sasha, that there can be too many beautiful trees, so it will be enough to count the number modulo $ 10^9 + 7 $ .",
    "inputFormat": "The first line contains four integers $ n $ , $ m $ , $ a $ , $ b $ ( $ 2 \\le n \\le 10^6 $ , $ 1 \\le m \\le 10^6 $ , $ 1 \\le a, b \\le n $ , $ a \\neq b $ ) — the number of vertices in the tree, the maximum weight of an edge and two Kefa's favorite vertices.",
    "outputFormat": "Print one integer — the number of beautiful trees modulo $ 10^9+7 $ .",
    "samples": [
        [
            "3 2 1 3\n",
            "5\n"
        ],
        [
            "3 1 1 2\n",
            "2\n"
        ],
        [
            "5 15 1 5\n",
            "345444\n"
        ]
    ],
    "hint": "There are $ 5 $ beautiful trees in the first example:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1109D/d88275e8124b7826186324238111a8213d909f6c.png)\n\nIn the second example the following trees are beautiful:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1109D/96d3e8f4e82c072eb5d39cd2ef80bfe6884bfbd7.png)",
    "translation": "给定参数 $n,m,a,b$\n\n你现在要构造一颗 $n$ 个点树，树边的权值可以赋为 $[1,m]$中的一个整数。\n\n求有多少种构造树的方法，使得节点 $a$ 与节点 $b$ 在树上的最短路径恰好为 $m$ 。\n\n对 $10^9+7$ 取模"
}