{
    "description": "You are given a graph with $ 3 \\cdot n $ vertices and $ m $ edges. You are to find a matching of $ n $ edges, or an independent set of $ n $ vertices.\n\nA set of edges is called a matching if no two edges share an endpoint.\n\nA set of vertices is called an independent set if no two vertices are connected with an edge.",
    "inputFormat": "The first line contains a single integer $ T \\ge 1 $ — the number of graphs you need to process. The description of $ T $ graphs follows.\n\nThe first line of description of a single graph contains two integers $ n $ and $ m $ , where $ 3 \\cdot n $ is the number of vertices, and $ m $ is the number of edges in the graph ( $ 1 \\leq n \\leq 10^{5} $ , $ 0 \\leq m \\leq 5 \\cdot 10^{5} $ ).\n\nEach of the next $ m $ lines contains two integers $ v_i $ and $ u_i $ ( $ 1 \\leq v_i, u_i \\leq 3 \\cdot n $ ), meaning that there is an edge between vertices $ v_i $ and $ u_i $ .\n\nIt is guaranteed that there are no self-loops and no multiple edges in the graph.\n\nIt is guaranteed that the sum of all $ n $ over all graphs in a single test does not exceed $ 10^{5} $ , and the sum of all $ m $ over all graphs in a single test does not exceed $ 5 \\cdot 10^{5} $ .",
    "outputFormat": "Print your answer for each of the $ T $ graphs. Output your answer for a single graph in the following format.\n\nIf you found a matching of size $ n $ , on the first line print \"Matching\" (without quotes), and on the second line print $ n $ integers — the indices of the edges in the matching. The edges are numbered from $ 1 $ to $ m $ in the input order.\n\nIf you found an independent set of size $ n $ , on the first line print \"IndSet\" (without quotes), and on the second line print $ n $ integers — the indices of the vertices in the independent set.\n\nIf there is no matching and no independent set of the specified size, print \"Impossible\" (without quotes).\n\nYou can print edges and vertices in any order.\n\nIf there are several solutions, print any. In particular, if there are both a matching of size $ n $ , and an independent set of size $ n $ , then you should print exactly one of such matchings or exactly one of such independent sets.",
    "samples": [
        [
            "4\n1 2\n1 3\n1 2\n1 2\n1 3\n1 2\n2 5\n1 2\n3 1\n1 4\n5 1\n1 6\n2 15\n1 2\n1 3\n1 4\n1 5\n1 6\n2 3\n2 4\n2 5\n2 6\n3 4\n3 5\n3 6\n4 5\n4 6\n5 6\n",
            "Matching\n2\nIndSet\n1\nIndSet\n2 4\nMatching\n1 15\n"
        ]
    ],
    "hint": "The first two graphs are same, and there are both a matching of size 1 and an independent set of size 1. Any of these matchings and independent sets is a correct answer.\n\nThe third graph does not have a matching of size 2, however, there is an independent set of size 2. Moreover, there is an independent set of size 5: 2 3 4 5 6. However such answer is not correct, because you are asked to find an independent set (or matching) of size exactly $ n $ .\n\nThe fourth graph does not have an independent set of size 2, but there is a matching of size 2.",
    "translation": "给一个无向图，$3\\times n$ 个点， $m$ 条边，请找大小为 $n$ 的点独立集或边独立集。\n\n----\n\n第一行一个整数 $T$ 表示数据组数\n\n对于每组数据第一行两个整数 $n,m$ 接下来 $m$ 行每行 $u,v$，保证 $\\sum n\\le 10^5, \\sum m\\le 5\\times 10^5$\n\n对每组数据，若存在点独立集，输出 ``IndSet``，并在接下来的一行输出 $n$ 个整数，表示点的编号\n\n若存在边独立集，输出 ``Matching``，并在接下来的一行输出 $n$ 个整数，表示边的编号\n\n若都不存在，输出 ``Impossible``\n\n若都存在，输出点独立集**或者**边独立集\n\n输出的编号可以按任意顺序，如果有多种方案输出任意一个。\n\n----\n\nAiming_High 太强了"
}