{
    "description": "Recently Evlampy installed one interesting computer game, one of aspects of which is to split army into several groups and then fight with enemy's groups. Let us consider a simplified version of the battle.\n\nIn the nearest battle Evlampy should fight an enemy army that consists of $ m $ groups, the $ i $ -th of which has $ hp_i $ health points.\n\nEvlampy's army consists of $ n $ equal soldiers. Before each battle he should split his army in exactly $ m $ groups (possibly, empty) so that the total size of the groups is $ n $ . The battle is played step-by-step. On each step each of Evlampy's groups attacks exactly one enemy group. Thus, each step is described with an array of $ m $ integers $ a_1, a_2, \\ldots, a_m $ , meaning that the $ i $ -th Evlampy's group attacks the $ a_i $ -th enemy group. Different groups can attack same group, on each step the array $ a $ is chosen independently.\n\nAfter each step the health points of each enemy group decreases by the total number of soldiers in Evlampy's groups that attacked this enemy group at this step. Enemy group is destroyed once its health points are zero or negative. Evlampy's soldiers do not lose health.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1119G/edf5f25d98548aaccf45c3eec9aa6deb282c18da.png)An example of a step. The numbers in green circles represent the number of soldiers in Evlampy's groups, the arrows represent attacks, the numbers in red circles represent health points of enemy groups, the blue numbers represent how much the health points will decrease after the step.Evlampy understands that the upcoming battle will take the whole night. He became sad because this way he won't have enough time to finish his homework. Now Evlampy wants you to write a program that will help him win in the smallest possible number of steps. Can you help him?\n\nIn other words, find the smallest number of steps needed to destroy all enemy groups and show a possible way of doing this. Find the requires splitting of the army into $ m $ groups and the arrays $ a $ for each step.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\leq m \\leq n \\leq 10^{6} $ ) — the number of soldiers in Evlampy's army and the number of groups in enemy army. $ m $ is also equal to the maximum possible number of groups Evlampy can split the army to.\n\nThe second line contains $ m $ integers $ hp_1, hp_2, \\ldots, hp_m $ ( $ 1 \\leq hp_i \\leq 10^{6} $ ) — the health points of each of the enemy groups.\n\nIt is guaranteed that the sum of $ hp_i $ does not exceed $ 10^{6} $ .",
    "outputFormat": "Print a single integer $ t $ — the minimum possible number of steps needed to win the battle.\n\nAfter that print $ m $ integers $ s_1, s_2, \\ldots, s_m $ ( $ s_i \\ge 0 $ , $ s_1 + s_2 + \\ldots + s_m = n $ ), meaning that the $ i $ -th group of Evlampy's army should contain $ s_i $ soldiers.\n\nIn each of the next $ t $ lines print $ m $ integers $ a_1, a_2, \\ldots, a_m $ ( $ 1 \\le a_i \\le m $ ) — the description of one step. The integers mean that on the corresponding step the $ i $ -th Evlampy's group should attack the $ a_i $ -th enemy group. It is allowed to attack an already destroyed group.",
    "samples": [
        [
            "13 7\n6 4 3 7 2 1 5\n",
            "3\n0 1 2 3 1 2 4\n2 6 2 4 4 2 4\n3 1 7 1 7 7 1\n3 1 5 3 7 5 1\n"
        ],
        [
            "6 5\n3 3 3 3 3\n",
            "3\n3 3 0 0 0\n1 2 3 4 5\n3 4 5 5 5\n5 5 5 5 5\n"
        ],
        [
            "7 4\n1 5 9 2\n",
            "3\n1 2 4 0\n1 4 2 3\n2 3 3 3\n3 3 3 3"
        ]
    ],
    "hint": "The first example is shown below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1119G/83b26697e1512ab6ed6ffa18c7896b3d481f3fad.png)",
    "translation": "你有n个士兵，需要将他们分成m组，每组可以为0；\n\n现在这些士兵要去攻打m个敌人，每个敌人的生命值为hpi；\n\n一轮游戏中一组士兵选定一个攻打的敌人，敌人生命值-=这组的人数；\n\n胜利的判定是所有敌人的生命值为非正的；\n输出胜利的最小轮数，可以达到最小轮数的分配方式，并输出每轮的策略；\n\n本题翻译：louhao088"
}