{
    "description": "One important contest will take place on the most famous programming platform (Topforces) very soon!\n\nThe authors have a pool of $ n $ problems and should choose at most three of them into this contest. The prettiness of the $ i $ -th problem is $ a_i $ . The authors have to compose the most pretty contest (in other words, the cumulative prettinesses of chosen problems should be maximum possible).\n\nBut there is one important thing in the contest preparation: because of some superstitions of authors, the prettinesses of problems cannot divide each other. In other words, if the prettinesses of chosen problems are $ x, y, z $ , then $ x $ should be divisible by neither $ y $ , nor $ z $ , $ y $ should be divisible by neither $ x $ , nor $ z $ and $ z $ should be divisible by neither $ x $ , nor $ y $ . If the prettinesses of chosen problems are $ x $ and $ y $ then neither $ x $ should be divisible by $ y $ nor $ y $ should be divisible by $ x $ . Any contest composed from one problem is considered good.\n\nYour task is to find out the maximum possible total prettiness of the contest composed of at most three problems from the given pool.\n\nYou have to answer $ q $ independent queries.\n\nIf you are Python programmer, consider using PyPy instead of Python when you submit your code.",
    "inputFormat": "The first line of the input contains one integer $ q $ ( $ 1 \\le q \\le 2 \\cdot 10^5 $ ) — the number of queries.\n\nThe first line of the query contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of problems.\n\nThe second line of the query contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 2 \\le a_i \\le 2 \\cdot 10^5 $ ), where $ a_i $ is the prettiness of the $ i $ -th problem.\n\nIt is guaranteed that the sum of $ n $ over all queries does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each query print one integer — the maximum possible cumulative prettiness of the contest composed of at most three problems from the given pool of problems in the query.",
    "samples": [
        [
            "3\n4\n5 6 15 30\n4\n10 6 30 15\n3\n3 4 6\n",
            "30\n31\n10\n"
        ]
    ],
    "hint": "",
    "translation": "你有$n$个数$a_1$到$a_n$，你想选出来**至多**$3$个数，使得其中任意一个数都不是另一个数的倍数。\r\n\r\n你想使得你选出来的数字的和尽可能大，输出这个最大的和。\r\n\r\n$\\text{——by wucstdio}$"
}