{
    "description": "A car number in Berland consists of exactly $ n $ digits. A number is called beautiful if it has at least $ k $ equal digits. Vasya wants to change the digits in his car's number so that the number became beautiful. To replace one of $ n $ digits Vasya has to pay the sum of money, equal to the absolute difference between the old digit and the new one.\n\nHelp Vasya: find the minimum sum of money he should pay to make the number of his car beautiful. You should also find the resulting beautiful number. If there are several such numbers, then print the lexicographically minimum one.",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ k $ ( $ 2<=n<=10^{4},2<=k<=n $ ) which represent how many digits the number has and how many equal digits a beautiful number should have. The second line consists of $ n $ digits. It describes the old number of Vasya's car. It is guaranteed that the number contains no spaces and only contains digits.",
    "outputFormat": "On the first line print the minimum sum of money Vasya needs to change the number. On the second line print the car's new number. If there are several solutions, print the lexicographically minimum one.",
    "samples": [
        [
            "6 5\n898196\n",
            "4\n888188\n"
        ],
        [
            "3 2\n533\n",
            "0\n533\n"
        ],
        [
            "10 6\n0001112223\n",
            "3\n0000002223\n"
        ]
    ],
    "hint": "In the first sample replacing the second digit with an \"8\" costs $ |9-8|=1 $ . Replacing the fifth digit with an \"8\" costs the same. Replacing the sixth digit costs $ |6-8|=2 $ . As a result, Vasya will pay $ 1+1+2=4 $ for a beautiful number \"888188\".\n\nThe lexicographical comparison of strings is performed by the < operator in modern programming languages. The string $ x $ is lexicographically smaller than the string $ y $ , if there exists such $ i $ ( $ 1<=i<=n $ ), that $ x_{i}&lt;y_{i} $ , and for any $ j $ ( $ 1<=j&lt;i $ ) $ x_{j}=y_{j} $ . The strings compared in this problem will always have the length $ n $ .",
    "translation": "给出车牌号码n个数，改变其中的一些数使得有相同的k个数，改变一次所付出的代价为两个数的差的绝对值，求最少的代价并输出字典序最小的一个。\n\n感谢@Oscar12345 提供的翻译"
}