{
    "description": "Hiasat registered a new account in NeckoForces and when his friends found out about that, each one of them asked to use his name as Hiasat's handle.\n\nLuckily for Hiasat, he can change his handle in some points in time. Also he knows the exact moments friends will visit his profile page. Formally, you are given a sequence of events of two types:\n\n- $ 1 $ — Hiasat can change his handle.\n- $ 2 $ $ s $ — friend $ s $ visits Hiasat's profile.\n\nThe friend $ s $ will be happy, if each time he visits Hiasat's profile his handle would be $ s $ .\n\nHiasat asks you to help him, find the maximum possible number of happy friends he can get.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n \\le 10^5, 1 \\le m \\le 40 $ ) — the number of events and the number of friends.\n\nThen $ n $ lines follow, each denoting an event of one of two types:\n\n- $ 1 $ — Hiasat can change his handle.\n- $ 2 $ $ s $ — friend $ s $ ( $ 1 \\le |s| \\le 40 $ ) visits Hiasat's profile.\n\nIt's guaranteed, that each friend's name consists only of lowercase Latin letters.\n\nIt's guaranteed, that the first event is always of the first type and each friend will visit Hiasat's profile at least once.",
    "outputFormat": "Print a single integer — the maximum number of happy friends.",
    "samples": [
        [
            "5 3\n1\n2 motarack\n2 mike\n1\n2 light\n",
            "2\n"
        ],
        [
            "4 3\n1\n2 alice\n2 bob\n2 tanyaromanova\n",
            "1\n"
        ]
    ],
    "hint": "In the first example, the best way is to change the handle to the \"motarack\" in the first event and to the \"light\" in the fourth event. This way, \"motarack\" and \"light\" will be happy, but \"mike\" will not.\n\nIn the second example, you can choose either \"alice\", \"bob\" or \"tanyaromanova\" and only that friend will be happy.",
    "translation": "你在某社交网站上面注册了一个新账号，这个账号有$n$($n\\leq 10^5$)次记录。要么就是你更改过一次ID，要么就是一个ID为$s$($|s|\\leq 40$)的朋友访问过你的空间。\r\n\r\n你有$m$($m\\leq 40$)个朋友。每一个朋友都会访问你的空间至少一次。如果这一个朋友每一次访问你的空间的时候，你的ID和它的ID一样，那么他就会高兴。\r\n求你最多能让多少人高兴。\r\n## 输入格式\r\n\r\n第一行一个两个正整数$n$,$m$.\r\n接下来$n$行每行表示一次记录，有如下两种格式：\r\n> $1$\r\n>\r\n> $2$ $s$\r\n\r\n其中$1$表示你更改过一次ID，$2$表示你的一个ID为$s$的朋友访问过一次你的空间。\r\n\r\n保证第一个记录一定是$1$。\r\n\r\n## 输出格式\r\n\r\n一行，一个正整数，表示最多能让多少个朋友高兴。"
}