{
    "description": "This problem is same as the previous one, but has larger constraints.\n\nShiro's just moved to the new house. She wants to invite all friends of her to the house so they can play monopoly. However, her house is too small, so she can only invite one friend at a time.\n\nFor each of the $ n $ days since the day Shiro moved to the new house, there will be exactly one cat coming to the Shiro's house. The cat coming in the $ i $ -th day has a ribbon with color $ u_i $ . Shiro wants to know the largest number $ x $ , such that if we consider the streak of the first $ x $ days, it is possible to remove exactly one day from this streak so that every ribbon color that has appeared among the remaining $ x - 1 $ will have the same number of occurrences.\n\nFor example, consider the following sequence of $ u_i $ : $ [2, 2, 1, 1, 5, 4, 4, 5] $ . Then $ x = 7 $ makes a streak, since if we remove the leftmost $ u_i = 5 $ , each ribbon color will appear exactly twice in the prefix of $ x - 1 $ days. Note that $ x = 8 $ doesn't form a streak, since you must remove exactly one day.\n\nSince Shiro is just a cat, she is not very good at counting and needs your help finding the longest streak.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\leq n \\leq 10^5 $ ) — the total number of days.\n\nThe second line contains $ n $ integers $ u_1, u_2, \\ldots, u_n $ ( $ 1 \\leq u_i \\leq 10^5 $ ) — the colors of the ribbons the cats wear.",
    "outputFormat": "Print a single integer $ x $ — the largest possible streak of days.",
    "samples": [
        [
            "13\n1 1 1 2 2 2 3 3 3 4 4 4 5\n",
            "13"
        ],
        [
            "5\n10 100 20 200 1\n",
            "5"
        ],
        [
            "1\n100000\n",
            "1"
        ],
        [
            "7\n3 2 1 1 4 5 1\n",
            "6"
        ],
        [
            "6\n1 1 1 2 2 2\n",
            "5"
        ]
    ],
    "hint": "In the first example, we can choose the longest streak of $ 13 $ days, since upon removing the last day out of the streak, all of the remaining colors $ 1 $ , $ 2 $ , $ 3 $ , and $ 4 $ will have the same number of occurrences of $ 3 $ . Note that the streak can also be $ 10 $ days (by removing the $ 10 $ -th day from this streak) but we are interested in the longest streak.\n\nIn the fourth example, if we take the streak of the first $ 6 $ days, we can remove the third day from this streak then all of the remaining colors $ 1 $ , $ 2 $ , $ 3 $ , $ 4 $ and $ 5 $ will occur exactly once.",
    "translation": "给定一个长度为n的序列，求从第一项起最长的序列，使得去掉其中任一元素后每个数出现的次数相同，求这个最长序列的长度x。"
}