{
    "description": "This is an interactive problem. Remember to flush your output while communicating with the testing program. You may use fflush(stdout) in C++, system.out.flush() in Java, stdout.flush() in Python or flush(output) in Pascal to flush the output. If you use some other programming language, consult its documentation. You may also refer to the guide on interactive problems: <https://codeforces.com/blog/entry/45307>.\n\nYou are given a string $ t $ consisting of $ n $ lowercase Latin letters. This string was cyphered as follows: initially, the jury had a string $ s $ consisting of $ n $ lowercase Latin letters. Then they applied a sequence of no more than $ n $ (possibly zero) operations. $ i $ -th operation is denoted by two integers $ a_i $ and $ b_i $ ( $ 1 \\le a_i, b_i \\le n $ ), and means swapping two elements of the string with indices $ a_i $ and $ b_i $ . All operations were done in the order they were placed in the sequence. For example, if $ s $ is xyz and $ 2 $ following operations are performed: $ a_1 = 1, b_1 = 2 $ ; $ a_2 = 2, b_2 = 3 $ , then after the first operation the current string is yxz, and after the second operation the current string is yzx, so $ t $ is yzx.\n\nYou are asked to restore the original string $ s $ . Unfortunately, you have no information about the operations used in the algorithm (you don't even know if there were any operations in the sequence). But you may run the same sequence of operations on any string you want, provided that it contains only lowercase Latin letters and its length is $ n $ , and get the resulting string after those operations.\n\nCan you guess the original string $ s $ asking the testing system to run the sequence of swaps no more than $ 3 $ times?\n\nThe string $ s $ and the sequence of swaps are fixed in each test; the interactor doesn't try to adapt the test to your solution.",
    "inputFormat": "Initially the testing system sends one string $ t $ , consisting of lowercase Latin letters ( $ 1 \\le |t| = n \\le 10^4 $ ).",
    "outputFormat": "To give the answer, your program should print one line $ ! $ $ s $ with a line break in the end. After that, it should flush the output and terminate gracefully.\n\nInteraction\n\nBefore giving the answer, you may submit no more than $ 3 $ queries. To ask a query, print one line in the following format: $ ? $ $ s' $ , where $ s' $ should be a string consisting of exaclty $ n $ lowercase Latin letters. The line should be ended with a line break character. After submitting a query, flush the output and read the answer to your query — a string $ t' $ consisting of $ n $ lowercase Latin letters, which is the result of applying the sequence of swaps to string $ s' $ . This string will be given on a separate line ended by a line break character.\n\nIf you submit an incorrect query (or ask more than $ 3 $ queries), the answer to it will be one string 0. After receiving such an answer, your program should terminate immediately — otherwise you may receive verdict \"Runtime error\", \"Time limit exceeded\" or some other verdict instead of \"Wrong answer\".",
    "samples": [
        [
            "yzx\naab\nbaa\naba",
            "? baa\n? aba\n? aab\n! xyz\n"
        ]
    ],
    "hint": "In the sample, the testcase described in the statement is used. The participant asks the first query with string baa, which is transformed to aab. The second query contains string aba, which is transformed to baa. The third query contains string aab, which is transformed to aba. The participant can deduce that the initial string $ s $ was xyz.\n\nNote for hacking phase:\n\nTo submit a test in hacking phase, you should provide it in the following format:\n\nThe first line should contain the string $ s $ you guess, consisting of $ n \\in [1, 10000] $ lowercase Latin letters.\n\nThe second line should contain $ k $ ( $ 0 \\le k \\le n $ ) — the number of swap operations in the sequence.\n\nThen $ k $ lines should follow, $ i $ -th of them should denote $ i $ -th operation with two integers $ a_i $ and $ b_i $ ( $ 1 \\le a_i, b_i \\le n $ ).\n\nFor example, the sample test would look like that:\n\nxyz\n\n2\n\n1 2\n\n2 3",
    "translation": "这是一道交互题。\r\n\r\n给定一个字符串 $s$ , 我们拥有若干操作 , 但是你不知道 , 第 $i$ 个操作形如 $a_i,b_i$ 表示交换字符串 $s$ 中的第 $a_i$ 位和 $a_j$ 位。\r\n\r\n比如操作序列依次为 $(1,2),(2,3)$ ,给定字符串为 ```xyz``` 。\r\n\r\n那么我们执行第一次操作后字符串变为 ```yxz``` ,而执行第$3$次操作后则变为 ```yzx``` 。\r\n\r\n我们已经告知了你完成所有操作后的字符串序列,你需要还原其。\r\n\r\n不过,你可以询问至多 $3$ 次,每次询问你需要给出一个字符串,其长度与给定的字符串相等,然后我们会告诉你操作后的字符串序列。\r\n\r\n数据范围:保证$|s|\\le 10^4$。\r\n\r\n输出答案需要加上 ```!``` 。\r\n\r\n查询操作则需要加上 ```?```。\r\n\r\n翻译 by EmptySoulist"
}