{
    "description": "Serge came to the school dining room and discovered that there is a big queue here. There are $ m $ pupils in the queue. He's not sure now if he wants to wait until the queue will clear, so he wants to know which dish he will receive if he does. As Serge is very tired, he asks you to compute it instead of him.\n\nInitially there are $ n $ dishes with costs $ a_1, a_2, \\ldots, a_n $ . As you already know, there are the queue of $ m $ pupils who have $ b_1, \\ldots, b_m $ togrogs respectively (pupils are enumerated by queue order, i.e the first pupil in the queue has $ b_1 $ togrogs and the last one has $ b_m $ togrogs)\n\nPupils think that the most expensive dish is the most delicious one, so every pupil just buys the most expensive dish for which he has money (every dish has a single copy, so when a pupil has bought it nobody can buy it later), and if a pupil doesn't have money for any dish, he just leaves the queue (so brutal capitalism...)\n\nBut money isn't a problem at all for Serge, so Serge is buying the most expensive dish if there is at least one remaining.\n\nMoreover, Serge's school has a very unstable economic situation and the costs of some dishes or number of togrogs of some pupils can change. More formally, you must process $ q $ queries:\n\n- change $ a_i $ to $ x $ . It means that the price of the $ i $ -th dish becomes $ x $ togrogs.\n- change $ b_i $ to $ x $ . It means that the $ i $ -th pupil in the queue has $ x $ togrogs now.\n\nNobody leaves the queue during those queries because a saleswoman is late.\n\nAfter every query, you must tell Serge price of the dish which he will buy if he has waited until the queue is clear, or $ -1 $ if there are no dishes at this point, according to rules described above.",
    "inputFormat": "The first line contains integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 300\\ 000 $ ) — number of dishes and pupils respectively. The second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\leq a_i \\leq 10^{6} $ ) — elements of array $ a $ . The third line contains $ m $ integers $ b_1, b_2, \\ldots, b_{m} $ ( $ 1 \\leq b_i \\leq 10^{6} $ ) — elements of array $ b $ . The fourth line conatins integer $ q $ ( $ 1 \\leq q \\leq 300\\ 000 $ ) — number of queries.\n\nEach of the following $ q $ lines contains as follows:\n\n- if a query changes price of some dish, it contains $ 1 $ , and two integers $ i $ and $ x $ ( $ 1 \\leq i \\leq n $ , $ 1 \\leq x \\leq 10^{6} $ ), what means $ a_i $ becomes $ x $ .\n- if a query changes number of togrogs of some pupil, it contains $ 2 $ , and two integers $ i $ and $ x $ ( $ 1 \\leq i \\leq m $ , $ 1 \\leq x \\leq 10^{6} $ ), what means $ b_i $ becomes $ x $ .",
    "outputFormat": "For each of $ q $ queries prints the answer as the statement describes, the answer of the $ i $ -th query in the $ i $ -th line (the price of the dish which Serge will buy or $ -1 $ if nothing remains)",
    "samples": [
        [
            "1 1\n1\n1\n1\n1 1 100\n",
            "100\n"
        ],
        [
            "1 1\n1\n1\n1\n2 1 100\n",
            "-1\n"
        ],
        [
            "4 6\n1 8 2 4\n3 3 6 1 5 2\n3\n1 1 1\n2 5 10\n1 1 6\n",
            "8\n-1\n4\n"
        ]
    ],
    "hint": "In the first sample after the first query, there is one dish with price $ 100 $ togrogs and one pupil with one togrog, so Serge will buy the dish with price $ 100 $ togrogs.\n\nIn the second sample after the first query, there is one dish with price one togrog and one pupil with $ 100 $ togrogs, so Serge will get nothing.\n\nIn the third sample after the first query, nobody can buy the dish with price $ 8 $ , so Serge will take it. After the second query, all dishes will be bought, after the third one the third and fifth pupils will by the first and the second dishes respectively and nobody will by the fourth one.",
    "translation": "食堂有 $n$ 种菜品，第 $i$ 种菜品价格 $a_i$ 元。有 $m$ 个学生排队吃饭，第 $i$ 个学生带了 $b_i$ 元。学生依次挑选菜品，每个人都会选择之前没人买过的，自己能买得起的最贵的菜。现在给定菜品价格序列 $a$，以及学生身上所带金额的序列 $b$，并进行 $q$ 次修改，每次修改可以让一种菜品的价格变为 $x$ 元，或者让一个学生带的钱变成 $x$ 元。问每次修改完，学生买完之后剩下菜品中最贵的菜值多少钱？\n\n**【数据范围】**\n\n$1 \\le n,m \\le 3 \\times 10^5$，$1 \\le a,b \\le 10^6$，$1\\le q \\le 3 \\times 10^5$。"
}