{
    "description": "Berland SU holds yet another training contest for its students today. $ n $ students came, each of them brought his laptop. However, it turned out that everyone has forgot their chargers!\n\nLet students be numbered from $ 1 $ to $ n $ . Laptop of the $ i $ -th student has charge $ a_i $ at the beginning of the contest and it uses $ b_i $ of charge per minute (i.e. if the laptop has $ c $ charge at the beginning of some minute, it becomes $ c - b_i $ charge at the beginning of the next minute). The whole contest lasts for $ k $ minutes.\n\nPolycarp (the coach of Berland SU) decided to buy a single charger so that all the students would be able to successfully finish the contest. He buys the charger at the same moment the contest starts.\n\nPolycarp can choose to buy the charger with any non-negative (zero or positive) integer power output. The power output is chosen before the purchase, it can't be changed afterwards. Let the chosen power output be $ x $ . At the beginning of each minute (from the minute contest starts to the last minute of the contest) he can plug the charger into any of the student's laptops and use it for some integer number of minutes. If the laptop is using $ b_i $ charge per minute then it will become $ b_i - x $ per minute while the charger is plugged in. Negative power usage rate means that the laptop's charge is increasing. The charge of any laptop isn't limited, it can become infinitely large. The charger can be plugged in no more than one laptop at the same time.\n\nThe student successfully finishes the contest if the charge of his laptop never is below zero at the beginning of some minute (from the minute contest starts to the last minute of the contest, zero charge is allowed). The charge of the laptop of the minute the contest ends doesn't matter.\n\nHelp Polycarp to determine the minimal possible power output the charger should have so that all the students are able to successfully finish the contest. Also report if no such charger exists.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ , $ 1 \\le k \\le 2 \\cdot 10^5 $ ) — the number of students (and laptops, correspondigly) and the duration of the contest in minutes.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^{12} $ ) — the initial charge of each student's laptop.\n\nThe third line contains $ n $ integers $ b_1, b_2, \\dots, b_n $ ( $ 1 \\le b_i \\le 10^7 $ ) — the power usage of each student's laptop.",
    "outputFormat": "Print a single non-negative integer — the minimal possible power output the charger should have so that all the students are able to successfully finish the contest.\n\nIf no such charger exists, print -1.",
    "samples": [
        [
            "2 4\n3 2\n4 2\n",
            "5\n"
        ],
        [
            "1 5\n4\n2\n",
            "1\n"
        ],
        [
            "1 6\n4\n2\n",
            "2\n"
        ],
        [
            "2 2\n2 10\n3 15\n",
            "-1\n"
        ]
    ],
    "hint": "Let's take a look at the state of laptops in the beginning of each minute on the first example with the charger of power $ 5 $ :\n\n1. charge: $ [3, 2] $ , plug the charger into laptop 1;\n2. charge: $ [3 - 4 + 5, 2 - 2] = [4, 0] $ , plug the charger into laptop 2;\n3. charge: $ [4 - 4, 0 - 2 + 5] = [0, 3] $ , plug the charger into laptop 1;\n4. charge: $ [0 - 4 + 5, 3 - 2] = [1, 1] $ .\n\nThe contest ends after the fourth minute.\n\nHowever, let's consider the charger of power $ 4 $ :\n\n1. charge: $ [3, 2] $ , plug the charger into laptop 1;\n2. charge: $ [3 - 4 + 4, 2 - 2] = [3, 0] $ , plug the charger into laptop 2;\n3. charge: $ [3 - 4, 0 - 2 + 4] = [-1, 2] $ , the first laptop has negative charge, thus, the first student doesn't finish the contest.\n\nIn the fourth example no matter how powerful the charger is, one of the students won't finish the contest.",
    "translation": "有n个学生要打一场k分钟的比赛（当然要用电脑）。\r\n\r\n每个学生的电脑有初始电量ai和每分钟耗电量bi（电量在这一分钟的最后一刻结算，即在下一分钟时才会减少，电量允许为负）。\r\n\r\n这样肯定是无法打完比赛的，所以学生们买了一个充电器，功率为任意值，每分钟可以使电量增加x，结算规则与耗电量一样，它可以在任一分钟给任一学生的电脑充电任意时长。\r\n\r\n问题：求最小的x，使所有学生的电脑的电量在k分钟内都不为负。"
}