{
    "description": "The Cybermen and the Daleks have long been the Doctor's main enemies. Everyone knows that both these species enjoy destroying everything they encounter. However, a little-known fact about them is that they both also love taking Turing tests!\n\nHeidi designed a series of increasingly difficult tasks for them to spend their time on, which would allow the Doctor enough time to save innocent lives!\n\nThe funny part is that these tasks would be very easy for a human to solve.\n\nThe first task is as follows. There are some points on the plane. All but one of them are on the boundary of an axis-aligned square (its sides are parallel to the axes). Identify that point.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 2 \\le n \\le 10 $ ).\n\nEach of the following $ 4n + 1 $ lines contains two integers $ x_i, y_i $ ( $ 0 \\leq x_i, y_i \\leq 50 $ ), describing the coordinates of the next point.\n\nIt is guaranteed that there are at least $ n $ points on each side of the square and all $ 4n + 1 $ points are distinct.",
    "outputFormat": "Print two integers — the coordinates of the point that is not on the boundary of the square.",
    "samples": [
        [
            "2\n0 0\n0 1\n0 2\n1 0\n1 1\n1 2\n2 0\n2 1\n2 2\n",
            "1 1\n"
        ],
        [
            "2\n0 0\n0 1\n0 2\n0 3\n1 0\n1 2\n2 0\n2 1\n2 2\n",
            "0 3\n"
        ]
    ],
    "hint": "In both examples, the square has four sides $ x=0 $ , $ x=2 $ , $ y=0 $ , $ y=2 $ .",
    "translation": "网络人和戴尔家族一直很令医生头痛。因为众所周知，这两类人很喜欢破坏东西。但很少有人知道他们喜欢图灵测试\r\n\r\n为了让医生安心救人性命，小可为他们设计了一系列难度递进的任务\r\n\r\n而这道题是第一个任务。\r\n\r\n在平面上有一些点。除了一个点，其他点都在一个正方形的边界上（正方形的边与轴平行）。你的任务是找出这一个点"
}