{
    "description": "The only difference between the easy and the hard versions is constraints.\n\nA subsequence is a string that can be derived from another string by deleting some or no symbols without changing the order of the remaining symbols. Characters to be deleted are not required to go successively, there can be any gaps between them. For example, for the string \"abaca\" the following strings are subsequences: \"abaca\", \"aba\", \"aaa\", \"a\" and \"\" (empty string). But the following strings are not subsequences: \"aabaca\", \"cb\" and \"bcaa\".\n\nYou are given a string $ s $ consisting of $ n $ lowercase Latin letters.\n\nIn one move you can take any subsequence $ t $ of the given string and add it to the set $ S $ . The set $ S $ can't contain duplicates. This move costs $ n - |t| $ , where $ |t| $ is the length of the added subsequence (i.e. the price equals to the number of the deleted characters).\n\nYour task is to find out the minimum possible total cost to obtain a set $ S $ of size $ k $ or report that it is impossible to do so.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 1 \\le n, k \\le 100 $ ) — the length of the string and the size of the set, correspondingly.\n\nThe second line of the input contains a string $ s $ consisting of $ n $ lowercase Latin letters.",
    "outputFormat": "Print one integer — if it is impossible to obtain the set $ S $ of size $ k $ , print -1. Otherwise, print the minimum possible total cost to do it.",
    "samples": [
        [
            "4 5\nasdf\n",
            "4\n"
        ],
        [
            "5 6\naaaaa\n",
            "15\n"
        ],
        [
            "5 7\naaaaa\n",
            "-1\n"
        ],
        [
            "10 100\najihiushda\n",
            "233\n"
        ]
    ],
    "hint": "In the first example we can generate $ S $ = { \"asdf\", \"asd\", \"adf\", \"asf\", \"sdf\" }. The cost of the first element in $ S $ is $ 0 $ and the cost of the others is $ 1 $ . So the total cost of $ S $ is $ 4 $ .",
    "translation": "本题和H题唯一的不同点是数据范围。\n\n你有一个长度为$n$的字符串。你可以选择它的任意一个子序列。子序列定义为可以将这个字符串删去若干个字符得到。特别的，空串也是一个子序列。\n\n对于一个长度为$m$的子序列，选出它的花费是$n-m$，也就是你需要删掉的字符数量。\n\n你的任务是选出来$k$个**本质不同**的子序列，使得总花费最小。输出这个最小花费。\n\n如果选不出$k$个，输出$-1$。\n\n$\\text{——by wucstdio}$"
}