{
    "description": "Little Petya loves playing with squares. Mum bought him a square $ 2n×2n $ in size. Petya marked a cell inside the square and now he is solving the following task.\n\nThe task is to draw a broken line that would go along the grid lines and that would cut the square into two equal parts. The cutting line should not have any common points with the marked cell and the resulting two parts should be equal up to rotation.\n\nPetya wants to determine whether it is possible to cut the square in the required manner given the sizes of the square side and the coordinates of the marked cell. Help him.",
    "inputFormat": "The first line contains three space-separated integers $ 2n $ , $ x $ and $ y $ ( $ 2<=2n<=100,1<=x,y<=2n $ ), representing the length of a square's side and the coordinates of the marked cell. It is guaranteed that $ 2n $ is even.\n\nThe coordinates of the marked cell are represented by a pair of numbers $ x $ $ y $ , where $ x $ represents the number of the row and $ y $ represents the number of the column. The rows and columns are numbered by consecutive integers from $ 1 $ to $ 2n $ . The rows are numbered from top to bottom and the columns are numbered from the left to the right.",
    "outputFormat": "If the square is possible to cut, print \"YES\", otherwise print \"NO\" (without the quotes).",
    "samples": [
        [
            "4 1 1\n",
            "YES\n"
        ],
        [
            "2 2 2\n",
            "NO\n"
        ]
    ],
    "hint": "A sample test from the statement and one of the possible ways of cutting the square are shown in the picture:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF112B/73a8bd680c4d33b060b29ddcf134c8221469d9f6.png)",
    "translation": "有一块2n*2n的地板，在地板上有一个东西，给出坐标和地板的边长。如今要将地板切成相等的两部分，且不能切到那个东西，问能不能切成功。"
}