{
    "description": "You have been hired to supervise the project of a new amusement park. The park will have a special gimmick: directed slides that can get customers from one attraction to another quickly and in an entertaining way.\n\nThe park owner has given you the current project: a list of planned attractions and a list of slides that should be built between them. However, him being a businessman, he casually envisioned the impossible: among other things, he projected a slide coming from the Haunted Castle to the Roller Coaster, another from the Roller Coaster to the Drop Tower, and a third from the Drop Tower to the Haunted Castle. As the slides can only go downhill, it is evident why this is a problem. You don't have the luxury of ignoring the laws of physics when building the park, so you have to request changes in the project. Maybe he would accept reversing the slide between the Drop Tower and the Haunted Castle?\n\nFormally:\n\n- The project is a list of attractions and a list of directed slides. Each slide starts at one attraction and ends at another attraction.\n- A proposal is obtained from the project by reversing the directions of some slides (possibly none or all of them).\n- A proposal is legal if there is a way to assign an elevation to each attraction in such a way that every slide goes downhill.\n- The cost of a proposal is the number of slides whose directions were reversed.\n\nFor a given project, find and report the sum of costs all legal proposals. Since this number may be large, output it modulo $ 998,244,353 $ .",
    "inputFormat": "The first line contains two space-separated integers $ n $ , $ m $ ( $ 1 \\leq n \\leq 18 $ , $ 0 \\leq m \\leq n(n-1)/2 $ ) – the number of attractions and the number of slides, respectively. The attractions are numbered $ 1 $ through $ n $ .\n\nThen, $ m $ lines follow. The $ i $ -th of these lines contains two space-separated integers $ a_i $ , $ b_i $ ( $ 1 \\leq a_i, b_i \\leq n $ ) denoting a slide from $ a_i $ to $ b_i $ .\n\nYou may assume that:\n\n- There are no self-loops. (For each $ i $ : $ a_i \\neq b_i $ .)\n- No slide appears twice. (For all $ i \\neq j $ : $ a_i \\neq a_j $ or $ b_i \\neq b_j $ .)\n- No pair of attractions is connected in both directions. (The unordered pairs $ \\{a_i, b_i\\} $ are distinct.)",
    "outputFormat": "Output one line with a single integer, the sum of costs of all legal proposals modulo $ 998,244,353 $ .\n\nScoring\n\nSubtask 1 (7 points): $ n \\leq 3 $\n\nSubtask 2 (12 points): $ n \\leq 6 $\n\nSubtask 3 (23 points): $ n \\leq 10 $\n\nSubtask 4 (21 points): $ n \\leq 15 $\n\nSubtask 5 (37 points): no additional constraints",
    "samples": [
        [
            "2 1\n1 2\n",
            "1\n"
        ],
        [
            "3 3\n1 2\n2 3\n1 3\n",
            "9\n"
        ]
    ],
    "hint": "In the first example, there are two proposals:\n\n- The slide direction is not flipped. This proposal has cost $ 0 $ .\n- The slide direction is flipped. This proposal has cost $ 1 $ .\n\n As both proposals are valid, the answer is $ 0 + 1 = 1 $ .In the second example, there are eight proposals with the slide directions as follows:\n\n- $ 1 \\rightarrow 2 $ , $ 2 \\rightarrow 3 $ , $ 1 \\rightarrow 3 $ (cost $ 0 $ )\n- $ 1 \\rightarrow 2 $ , $ 2 \\rightarrow 3 $ , $ 3 \\rightarrow 1 $ (cost $ 1 $ )\n- $ 1 \\rightarrow 2 $ , $ 3 \\rightarrow 2 $ , $ 1 \\rightarrow 3 $ (cost $ 1 $ )\n- $ 1 \\rightarrow 2 $ , $ 3 \\rightarrow 2 $ , $ 3 \\rightarrow 1 $ (cost $ 2 $ )\n- $ 2 \\rightarrow 1 $ , $ 2 \\rightarrow 3 $ , $ 1 \\rightarrow 3 $ (cost $ 1 $ )\n- $ 2 \\rightarrow 1 $ , $ 2 \\rightarrow 3 $ , $ 3 \\rightarrow 1 $ (cost $ 2 $ )\n- $ 2 \\rightarrow 1 $ , $ 3 \\rightarrow 2 $ , $ 1 \\rightarrow 3 $ (cost $ 2 $ )\n- $ 2 \\rightarrow 1 $ , $ 3 \\rightarrow 2 $ , $ 3 \\rightarrow 1 $ (cost $ 3 $ )\n\nThe second proposal is not legal, as there is a slide sequence $ 1 \\rightarrow 2 \\rightarrow 3 \\rightarrow 1 $ . This means that the attraction $ 1 $ has to be strictly higher than ifself, which is clearly impossible. Similarly, the seventh proposal is not legal. The answer is thus $ 0 + 1 + 2 + 1 + 2 + 3 = 9 $ .",
    "translation": "- 给定一张 $n$ 点 $m$ 边的有向图，对于每条边，我们可以选择不懂或者旋转他的方向，用这种方法我们就可以构造出 $2m$ 张图。\n- 如果这张图无环，我们就称这张图是合法的。\n- 对于这 $2m$ 张图，求所有合法图的旋转边数次数和。\n- 答案对 $998244353$ 取模。\n- $1 \\le n \\le 18$，$0 \\le m \\le \\dfrac{n(n-1)}{2}$。\n- 翻译者：@[一只书虫仔](https://www.luogu.com.cn/user/114914)。"
}