{
    "description": "Linear Kingdom has exactly one tram line. It has $ n $ stops, numbered from $ 1 $ to $ n $ in the order of tram's movement. At the $ i $ -th stop $ a_{i} $ passengers exit the tram, while $ b_{i} $ passengers enter it. The tram is empty before it arrives at the first stop. Also, when the tram arrives at the last stop, all passengers exit so that it becomes empty.\n\nYour task is to calculate the tram's minimum capacity such that the number of people inside the tram at any time never exceeds this capacity. Note that at each stop all exiting passengers exit before any entering passenger enters the tram.",
    "inputFormat": "The first line contains a single number $ n $ ( $ 2<=n<=1000 $ ) — the number of the tram's stops.\n\nThen $ n $ lines follow, each contains two integers $ a_{i} $ and $ b_{i} $ ( $ 0<=a_{i},b_{i}<=1000 $ ) — the number of passengers that exits the tram at the $ i $ -th stop, and the number of passengers that enter the tram at the $ i $ -th stop. The stops are given from the first to the last stop in the order of tram's movement.\n\n- The number of people who exit at a given stop does not exceed the total number of people in the tram immediately before it arrives at the stop. More formally, ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF116A/29ed7ad994d68c6d9f21f24e7176a4363080af62.png). This particularly means that $ a_{1}=0 $ .\n- At the last stop, all the passengers exit the tram and it becomes empty. More formally, ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF116A/c1dd89cba73cae46dec0a234ed66ff152caeaa8c.png).\n- No passenger will enter the train at the last stop. That is, $ b_{n}=0 $ .",
    "outputFormat": "Print a single integer denoting the minimum possible capacity of the tram (0 is allowed).",
    "samples": [
        [
            "4\n0 3\n2 5\n4 2\n4 0\n",
            "6\n"
        ]
    ],
    "hint": "For the first example, a capacity of 6 is sufficient:\n\n- At the first stop, the number of passengers inside the tram before arriving is 0. Then, 3 passengers enter the tram, and the number of passengers inside the tram becomes 3.\n- At the second stop, 2 passengers exit the tram (1 passenger remains inside). Then, 5 passengers enter the tram. There are 6 passengers inside the tram now.\n- At the third stop, 4 passengers exit the tram (2 passengers remain inside). Then, 2 passengers enter the tram. There are 4 passengers inside the tram now.\n- Finally, all the remaining passengers inside the tram exit the tram at the last stop. There are no passenger inside the tram now, which is in line with the constraints.\n\nSince the number of passengers inside the tram never exceeds 6, a capacity of 6 is sufficient. Furthermore it is not possible for the tram to have a capacity less than 6. Hence, 6 is the correct answer.",
    "translation": "**题目描述：**\n\n线性王国有一条电车，它有n个停靠站，按照电车的运动顺序从1~n编号。\n在第i站都有ai位乘客离开电车，bi位乘客上车。电车原本为空。此外，当电车到达最后一站时，所有乘客都会下车。\n你的任务是计算电车的最低容量，这样电车内的人数在任何时候都不会超过这个容量。\n请注意，每个停靠口都遵循先下后上的原则。\n\n输入输出格式：\n\n**输入格式：**\n\n第一行包含n（2 <= n <= 1000） 表示 有轨电车停靠站的数量。\n\n然后的n行，每个包含两个整数 ai和bi( 0<=ai ,bi<=1000 ），表示在第i站上、下车的人数。按照电车的运动顺序从第一站到最后一站停车。\n\n输出格式：\n\n打印表示电车最小可能容量的单个整数（允许为0）\n\n翻译提供者：Karry_Huang"
}