{
    "description": "Owl Pacino has always been into trees — unweighted rooted trees in particular. He loves determining the diameter of every tree he sees — that is, the maximum length of any simple path in the tree.\n\nOwl Pacino's owl friends decided to present him the Tree Generator™ — a powerful machine creating rooted trees from their descriptions. An $ n $ -vertex rooted tree can be described by a bracket sequence of length $ 2(n - 1) $ in the following way: find any walk starting and finishing in the root that traverses each edge exactly twice — once down the tree, and later up the tree. Then follow the path and write down \"(\" (an opening parenthesis) if an edge is followed down the tree, and \")\" (a closing parenthesis) otherwise.\n\nThe following figure shows sample rooted trees and their descriptions:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1149C/a9818ec6abf351ce6c6a0eaa115c2729c37577f5.png)Owl wrote down the description of an $ n $ -vertex rooted tree. Then, he rewrote the description $ q $ times. However, each time he wrote a new description, he picked two different characters in the description he wrote the last time, swapped them and wrote down the resulting string. He always made sure that each written string was the description of a rooted tree.\n\nPacino then used Tree Generator™ for each description he wrote down. What is the diameter of each constructed tree?",
    "inputFormat": "The first line of the input contains two integers $ n, q $ ( $ 3 \\le n \\le 100\\,000 $ , $ 1 \\le q \\le 100\\,000 $ ) — the number of vertices in the tree and the number of changes to the tree description. The following line contains a description of the initial tree — a string of length $ 2(n-1) $ consisting of opening and closing parentheses.\n\nEach of the following $ q $ lines describes a single change to the description and contains two space-separated integers $ a_i, b_i $ ( $ 2 \\leq a_i, b_i \\leq 2n-3 $ ) which identify the indices of two brackets to be swapped. You can assume that the description will change after each query, and that after each change a tree can be constructed from the description.",
    "outputFormat": "Output $ q + 1 $ integers — the diameter of each constructed tree, in the order their descriptions have been written down.",
    "samples": [
        [
            "5 5\n(((())))\n4 5\n3 4\n5 6\n3 6\n2 5\n",
            "4\n3\n3\n2\n4\n4\n"
        ],
        [
            "6 4\n(((())()))\n6 7\n5 4\n6 4\n7 4\n",
            "4\n4\n4\n5\n3\n"
        ]
    ],
    "hint": "The following figure shows each constructed tree and its description in the first example test:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1149C/285660de836d4f0c8cc3430ffe028ede0245c7ef.png)",
    "translation": "$n$个点，$m$个询问。\n\n给你一棵树的括号序列，输出它的直径。\n\n有$m$次询问，每次询问表示交换两个括号，输出交换两个括号后的直径（保证每次操作后都为一棵树）\n\n输出共$m+1$行。\n\n$3 \\le n \\le 100\\,000,1 \\le q \\le 100\\,000$ "
}