{
    "description": "This morning, Roman woke up and opened the browser with $ n $ opened tabs numbered from $ 1 $ to $ n $ . There are two kinds of tabs: those with the information required for the test and those with social network sites. Roman decided that there are too many tabs open so he wants to close some of them.\n\nHe decided to accomplish this by closing every $ k $ -th ( $ 2 \\leq k \\leq n - 1 $ ) tab. Only then he will decide whether he wants to study for the test or to chat on the social networks. Formally, Roman will choose one tab (let its number be $ b $ ) and then close all tabs with numbers $ c = b + i \\cdot k $ that satisfy the following condition: $ 1 \\leq c \\leq n $ and $ i $ is an integer (it may be positive, negative or zero).\n\nFor example, if $ k = 3 $ , $ n = 14 $ and Roman chooses $ b = 8 $ , then he will close tabs with numbers $ 2 $ , $ 5 $ , $ 8 $ , $ 11 $ and $ 14 $ .\n\nAfter closing the tabs Roman will calculate the amount of remaining tabs with the information for the test (let's denote it $ e $ ) and the amount of remaining social network tabs ( $ s $ ). Help Roman to calculate the maximal absolute value of the difference of those values $ |e - s| $ so that it would be easy to decide what to do next.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 2 \\leq k < n \\leq 100 $ ) — the amount of tabs opened currently and the distance between the tabs closed.\n\nThe second line consists of $ n $ integers, each of them equal either to $ 1 $ or to $ -1 $ . The $ i $ -th integer denotes the type of the $ i $ -th tab: if it is equal to $ 1 $ , this tab contains information for the test, and if it is equal to $ -1 $ , it's a social network tab.",
    "outputFormat": "Output a single integer — the maximum absolute difference between the amounts of remaining tabs of different types $ |e - s| $ .",
    "samples": [
        [
            "4 2\n1 1 -1 1\n",
            "2\n"
        ],
        [
            "14 3\n-1 1 -1 -1 1 -1 -1 1 -1 -1 1 -1 -1 1\n",
            "9\n"
        ]
    ],
    "hint": "In the first example we can choose $ b = 1 $ or $ b = 3 $ . We will delete then one tab of each type and the remaining tabs are then all contain test information. Thus, $ e = 2 $ and $ s = 0 $ and $ |e - s| = 2 $ .\n\nIn the second example, on the contrary, we can leave opened only tabs that have social networks opened in them.",
    "translation": "### 题目大意\n\n给定一个长度为$n$的只有$1$和$-1$的序列，选择一个位置$b$，然后删掉位置为$b+i\\times k$的数（$i$为整数），求操作后$1$和$-1$数量的最大绝对差值\n\n### 输入格式\n第一行一个整数$n$\n\n第二行$n$个整数，每个数是$1$或$-1$\n\n### 输出格式\n一个整数，表示最大绝对差值"
}