{
    "description": "Alex decided to go on a touristic trip over the country.\n\nFor simplicity let's assume that the country has $ n $ cities and $ m $ bidirectional roads connecting them. Alex lives in city $ s $ and initially located in it. To compare different cities Alex assigned each city a score $ w_i $ which is as high as interesting city seems to Alex.\n\nAlex believes that his trip will be interesting only if he will not use any road twice in a row. That is if Alex came to city $ v $ from city $ u $ , he may choose as the next city in the trip any city connected with $ v $ by the road, except for the city $ u $ .\n\nYour task is to help Alex plan his city in a way that maximizes total score over all cities he visited. Note that for each city its score is counted at most once, even if Alex been there several times during his trip.",
    "inputFormat": "First line of input contains two integers $ n $ and $ m $ , ( $ 1 \\le n \\le 2 \\cdot 10^5 $ , $ 0 \\le m \\le 2 \\cdot 10^5 $ ) which are numbers of cities and roads in the country.\n\nSecond line contains $ n $ integers $ w_1, w_2, \\ldots, w_n $ ( $ 0 \\le w_i \\le 10^9 $ ) which are scores of all cities.\n\nThe following $ m $ lines contain description of the roads. Each of these $ m $ lines contains two integers $ u $ and $ v $ ( $ 1 \\le u, v \\le n $ ) which are cities connected by this road.\n\nIt is guaranteed that there is at most one direct road between any two cities, no city is connected to itself by the road and, finally, it is possible to go from any city to any other one using only roads.\n\nThe last line contains single integer $ s $ ( $ 1 \\le s \\le n $ ), which is the number of the initial city.",
    "outputFormat": "Output single integer which is the maximum possible sum of scores of visited cities.",
    "samples": [
        [
            "5 7\n2 2 8 6 9\n1 2\n1 3\n2 4\n3 2\n4 5\n2 5\n1 5\n2\n",
            "27"
        ],
        [
            "10 12\n1 7 1 9 3 3 6 30 1 10\n1 2\n1 3\n3 5\n5 7\n2 3\n5 4\n6 9\n4 6\n3 7\n6 8\n9 4\n9 10\n6\n",
            "61"
        ]
    ],
    "hint": "",
    "translation": "有 $n$ 个点， $m$ 条边的**简单无向图**。\n\n每个点有一个权值 $w_i$ 。\n\n一个人从 $s$ 出发，可以走一条不走回头路的路径。  \n（也就是不能经过一条边立刻反着走，但是允许重复经过边）\n\n即如果从 $u$ 走向 $v$ ，那么不能从 $v$ 走向 $u$ 。\n\n最大化权值和。"
}