{
    "description": "Polycarp has $ n $ different binary words. A word called binary if it contains only characters '0' and '1'. For example, these words are binary: \"0001\", \"11\", \"0\" and \"0011100\".\n\nPolycarp wants to offer his set of $ n $ binary words to play a game \"words\". In this game, players name words and each next word (starting from the second) must start with the last character of the previous word. The first word can be any. For example, these sequence of words can be named during the game: \"0101\", \"1\", \"10\", \"00\", \"00001\".\n\nWord reversal is the operation of reversing the order of the characters. For example, the word \"0111\" after the reversal becomes \"1110\", the word \"11010\" after the reversal becomes \"01011\".\n\nProbably, Polycarp has such a set of words that there is no way to put them in the order correspondent to the game rules. In this situation, he wants to reverse some words from his set so that:\n\n- the final set of $ n $ words still contains different words (i.e. all words are unique);\n- there is a way to put all words of the final set of words in the order so that the final sequence of $ n $ words is consistent with the game rules.\n\nPolycarp wants to reverse minimal number of words. Please, help him.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the input. Then $ t $ test cases follow.\n\nThe first line of a test case contains one integer $ n $ ( $ 1 \\le n \\le 2\\cdot10^5 $ ) — the number of words in the Polycarp's set. Next $ n $ lines contain these words. All of $ n $ words aren't empty and contains only characters '0' and '1'. The sum of word lengths doesn't exceed $ 4\\cdot10^6 $ . All words are different.\n\nGuaranteed, that the sum of $ n $ for all test cases in the input doesn't exceed $ 2\\cdot10^5 $ . Also, guaranteed that the sum of word lengths for all test cases in the input doesn't exceed $ 4\\cdot10^6 $ .",
    "outputFormat": "Print answer for all of $ t $ test cases in the order they appear.\n\nIf there is no answer for the test case, print -1. Otherwise, the first line of the output should contain $ k $ ( $ 0 \\le k \\le n $ ) — the minimal number of words in the set which should be reversed. The second line of the output should contain $ k $ distinct integers — the indexes of the words in the set which should be reversed. Words are numerated from $ 1 $ to $ n $ in the order they appear. If $ k=0 $ you can skip this line (or you can print an empty line). If there are many answers you can print any of them.",
    "samples": [
        [
            "4\n4\n0001\n1000\n0011\n0111\n3\n010\n101\n0\n2\n00000\n00001\n4\n01\n001\n0001\n00001\n",
            "1\n3 \n-1\n0\n\n2\n1 2 \n"
        ]
    ],
    "hint": "",
    "translation": "有 $t$ 组数据。\n\n给出 $n$ 个只由 $0$ 和 $1$ 组成的非空二进制串 $s[n]$ ，保证所有二进制串不同。\n\n你有一个操作，可以使一个二进制序列翻转，询问最少的操作次数，使得可以存在一个排列，使 $n$ 个二进制串可以首尾相接，且不存在两个相同的二进制串。\n\n形式化的，操作后的序列 $s$ ，所有二进制串都不相同，且存在一个排列 $p_i$ ，使 $\\forall 1\\le i<n,\\ s[p_i]\\text{的末尾}=s[p_{i+1}]\\text{的首位}$ 。\n\n你需要输出最少的操作次数，并按从小到大输出需要反转的二进制串编号。\n\n如果不存在方案则输出 $-1$ 。\n\n数据范围:$\\ 1\\le t\\le10^4,\\ 1\\le n\\le2\\times10^5,\\ \\sum|s|\\le 4\\times10^6$ 。\n\ntranslated by @Forever_Pursuit "
}