{
    "description": "It's a walking tour day in SIS.Winter, so $ t $ groups of students are visiting Torzhok. Streets of Torzhok are so narrow that students have to go in a row one after another.\n\nInitially, some students are angry. Let's describe a group of students by a string of capital letters \"A\" and \"P\":\n\n- \"A\" corresponds to an angry student\n- \"P\" corresponds to a patient student\n\nSuch string describes the row from the last to the first student.\n\nEvery minute every angry student throws a snowball at the next student. Formally, if an angry student corresponds to the character with index $ i $ in the string describing a group then they will throw a snowball at the student that corresponds to the character with index $ i+1 $ (students are given from the last to the first student). If the target student was not angry yet, they become angry. Even if the first (the rightmost in the string) student is angry, they don't throw a snowball since there is no one in front of them.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1287A/fe28f162bafed3e3625ed652021b9246ea06d9ce.png)Let's look at the first example test. The row initially looks like this: PPAP. Then, after a minute the only single angry student will throw a snowball at the student in front of them, and they also become angry: PPAA. After that, no more students will become angry.\n\nYour task is to help SIS.Winter teachers to determine the last moment a student becomes angry for every group.",
    "inputFormat": "The first line contains a single integer $ t $ — the number of groups of students ( $ 1 \\le t \\le 100 $ ). The following $ 2t $ lines contain descriptions of groups of students.\n\nThe description of the group starts with an integer $ k_i $ ( $ 1 \\le k_i \\le 100 $ ) — the number of students in the group, followed by a string $ s_i $ , consisting of $ k_i $ letters \"A\" and \"P\", which describes the $ i $ -th group of students.",
    "outputFormat": "For every group output single integer — the last moment a student becomes angry.",
    "samples": [
        [
            "1\n4\nPPAP",
            "1"
        ],
        [
            "3\n12\nAPPAPPPAPPPP\n3\nAAP\n3\nPPA",
            "4\n1\n0"
        ]
    ],
    "hint": "In the first test, after $ 1 $ minute the state of students becomes PPAA. After that, no new angry students will appear.\n\nIn the second tets, state of students in the first group is:\n\n- after $ 1 $ minute — AAPAAPPAAPPP\n- after $ 2 $ minutes — AAAAAAPAAAPP\n- after $ 3 $ minutes — AAAAAAAAAAAP\n- after $ 4 $ minutes all $ 12 $ students are angry\n\nIn the second group after $ 1 $ minute, all students are angry.",
    "translation": "有t队学生，每个学生有两种状态，生气（A）或不生气（P）。（话说为什么生气的戴着圣诞帽哇）所有生气的人都会往前一个人丢雪球，被丢到的人也会变得生气，也会丢雪球。问你每队人中最后一个时刻学生变得生气的时刻。"
}