{
    "description": "[Sakuzyo - Imprinting](https://www.youtube.com/watch?v=55Ca6av1kAY)\n\n\n\nA.R.C. Markland-N is a tall building with $ n $ floors numbered from $ 1 $ to $ n $ . Between each two adjacent floors in the building, there is a staircase connecting them.\n\nIt's lunchtime for our sensei Colin \"ConneR\" Neumann Jr, and he's planning for a location to enjoy his meal.\n\nConneR's office is at floor $ s $ of the building. On each floor (including floor $ s $ , of course), there is a restaurant offering meals. However, due to renovations being in progress, $ k $ of the restaurants are currently closed, and as a result, ConneR can't enjoy his lunch there.\n\nCooneR wants to reach a restaurant as quickly as possible to save time. What is the minimum number of staircases he needs to walk to reach a closest currently open restaurant.\n\nPlease answer him quickly, and you might earn his praise and even enjoy the lunch with him in the elegant Neumanns' way!",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases in the test. Then the descriptions of $ t $ test cases follow.\n\nThe first line of a test case contains three integers $ n $ , $ s $ and $ k $ ( $ 2 \\le n \\le 10^9 $ , $ 1 \\le s \\le n $ , $ 1 \\le k \\le \\min(n-1, 1000) $ ) — respectively the number of floors of A.R.C. Markland-N, the floor where ConneR is in, and the number of closed restaurants.\n\nThe second line of a test case contains $ k $ distinct integers $ a_1, a_2, \\ldots, a_k $ ( $ 1 \\le a_i \\le n $ ) — the floor numbers of the currently closed restaurants.\n\nIt is guaranteed that the sum of $ k $ over all test cases does not exceed $ 1000 $ .",
    "outputFormat": "For each test case print a single integer — the minimum number of staircases required for ConneR to walk from the floor $ s $ to a floor with an open restaurant.",
    "samples": [
        [
            "5\n5 2 3\n1 2 3\n4 3 3\n4 1 2\n10 2 6\n1 2 3 4 5 7\n2 1 1\n2\n100 76 8\n76 75 36 67 41 74 10 77",
            "2\n0\n4\n0\n2"
        ]
    ],
    "hint": "In the first example test case, the nearest floor with an open restaurant would be the floor $ 4 $ .\n\nIn the second example test case, the floor with ConneR's office still has an open restaurant, so Sensei won't have to go anywhere.\n\nIn the third example test case, the closest open restaurant is on the $ 6 $ -th floor.",
    "translation": "网易云：[削除 - Imprinting](https://music.163.com/#/song?id=30148626)\n\nA.R.C. Markland-N有n层。ConneR（真名Colin Neumann）的办公室在第s层。\n\n现在已知除了其中k层以外，每层上都有一个餐厅。请问ConneR的办公室到最近的餐厅有几层的距离？\n\n#### 输入格式\n\n多组数据，第一行一个$t$ ( $1\\le t\\le1000$ )表示数据组数。\n\n每组数据的第一行包含三个正整数，$n$ ( $2\\le n\\le 10^9$ )，$s$ ( $1\\le s\\le n$ )和$k$ ( $1\\le k\\le min(n-1,1000)$ )，分别表示A.R.C. Markland-N的层数，ConneR在哪一层，没有餐厅的楼层的数量。  \n每组数据的第二行包含k个不同的正整数 $a_1,a_2\\dots a_k$ ( $1 \\le a_i \\le n$ )，表示这些层没有餐厅。\n\n#### 输出格式\n\n共 $t$ 行，每行一个自然数，表示对于每组输入的答案。"
}