{
    "description": "You are given a binary string of length $ n $ (i. e. a string consisting of $ n $ characters '0' and '1').\n\nIn one move you can swap two adjacent characters of the string. What is the lexicographically minimum possible string you can obtain from the given one if you can perform no more than $ k $ moves? It is possible that you do not perform any moves at all.\n\nNote that you can swap the same pair of adjacent characters with indices $ i $ and $ i+1 $ arbitrary (possibly, zero) number of times. Each such swap is considered a separate move.\n\nYou have to answer $ q $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ q $ ( $ 1 \\le q \\le 10^4 $ ) — the number of test cases.\n\nThe first line of the test case contains two integers $ n $ and $ k $ ( $ 1 \\le n \\le 10^6, 1 \\le k \\le n^2 $ ) — the length of the string and the number of moves you can perform.\n\nThe second line of the test case contains one string consisting of $ n $ characters '0' and '1'.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 10^6 $ ( $ \\sum n \\le 10^6 $ ).",
    "outputFormat": "For each test case, print the answer on it: the lexicographically minimum possible string of length $ n $ you can obtain from the given one if you can perform no more than $ k $ moves.",
    "samples": [
        [
            "3\n8 5\n11011010\n7 9\n1111100\n7 11\n1111100\n",
            "01011110\n0101111\n0011111\n"
        ]
    ],
    "hint": "In the first example, you can change the string as follows: $ 1\\underline{10}11010 \\rightarrow \\underline{10}111010 \\rightarrow 0111\\underline{10}10 \\rightarrow 011\\underline{10}110 \\rightarrow 01\\underline{10}1110 \\rightarrow 01011110 $ .\n\nIn the third example, there are enough operations to make the string sorted.",
    "translation": "## 题目描述\n给定一个长度为n的二进制串(即由n个'0'和'1'构成的字符串)，你最多可以进行k次交换相邻两个字符的操作。\n\n一共q组询问。\n## 输入格式\n第一行一个整数q(1≤q≤1e4)，为测试用例的数量。\n\n每组测试数据的第一行为两个整数，字符串的长度n和可以执行的移动次数k。\n\n每组测试数据的第二行为一个由'0'和'1'构成的长度为n的字符串。\n## 输出格式\n对于每个测试数据，请输出对原字符串进行不超过k次交换操作后的**字典序**最小的字符串。"
}