{
    "description": "Amugae is in a very large round corridor. The corridor consists of two areas. The inner area is equally divided by $ n $ sectors, and the outer area is equally divided by $ m $ sectors. A wall exists between each pair of sectors of same area (inner or outer), but there is no wall between the inner area and the outer area. A wall always exists at the 12 o'clock position.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1200C/7fdeabfa2ad973f1b56c678ed3354417ac806e5e.png)The inner area's sectors are denoted as $ (1,1), (1,2), \\dots, (1,n) $ in clockwise direction. The outer area's sectors are denoted as $ (2,1), (2,2), \\dots, (2,m) $ in the same manner. For a clear understanding, see the example image above.\n\nAmugae wants to know if he can move from one sector to another sector. He has $ q $ questions.\n\nFor each question, check if he can move between two given sectors.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ q $ ( $ 1 \\le n, m \\le 10^{18} $ , $ 1 \\le q \\le 10^4 $ ) — the number of sectors in the inner area, the number of sectors in the outer area and the number of questions.\n\nEach of the next $ q $ lines contains four integers $ s_x $ , $ s_y $ , $ e_x $ , $ e_y $ ( $ 1 \\le s_x, e_x \\le 2 $ ; if $ s_x = 1 $ , then $ 1 \\le s_y \\le n $ , otherwise $ 1 \\le s_y \\le m $ ; constraints on $ e_y $ are similar). Amague wants to know if it is possible to move from sector $ (s_x, s_y) $ to sector $ (e_x, e_y) $ .",
    "outputFormat": "For each question, print \"YES\" if Amugae can move from $ (s_x, s_y) $ to $ (e_x, e_y) $ , and \"NO\" otherwise.\n\nYou can print each letter in any case (upper or lower).",
    "samples": [
        [
            "4 6 3\n1 1 2 3\n2 6 1 2\n2 6 2 4\n",
            "YES\nNO\nYES\n"
        ]
    ],
    "hint": "Example is shown on the picture in the statement.",
    "translation": "走廊有两部分构成：内圈和外圈。内圈有$n(n\\le10^{18})$个部分组成，外圈有$m(m\\le10^{18})$个部分组成。如下图，有墙在每个部分中阻隔。但是内圈和外圈之间没有墙。并且在走廊的12点钟方向始终有一堵墙。     \n![pic]( https://cdn.luogu.org/upload/pic/71439.png )\n里圈的各个部分被$(1,1),(1,2)...(1,n)$这种方式来表示。同理，外圈则被$(2,1),(2,2)...(2,m)$这种方式来表示。上图即使一个表达方式的样例。  \n现在，有个人想要知道从$(sx,sy)$出发能否到达$(ex,ey)$.他有$q\\le10^4$个疑问。   \n对于每个疑问，回答是否能从给出的两个区间中的一个到达另一个。\n"
}