{
    "description": "In the Catowice city next weekend the cat contest will be held. However, the jury members and the contestants haven't been selected yet. There are $ n $ residents and $ n $ cats in the Catowice, and each resident has exactly one cat living in his house. The residents and cats are numbered with integers from $ 1 $ to $ n $ , where the $ i $ -th cat is living in the house of $ i $ -th resident.\n\nEach Catowice resident is in friendship with several cats, including the one living in his house. In order to conduct a contest, at least one jury member is needed and at least one cat contestant is needed. Of course, every jury member should know none of the contestants. For the contest to be successful, it's also needed that the number of jury members plus the number of contestants is equal to $ n $ .\n\nPlease help Catowice residents to select the jury and the contestants for the upcoming competition, or determine that it's impossible to do.",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\le t \\le 100\\,000 $ ), the number of test cases. Then description of $ t $ test cases follow, where each description is as follows:\n\nThe first line contains integers $ n $ and $ m $ ( $ 1 \\le n \\le m \\le 10^6 $ ), the number of Catowice residents and the number of friendship pairs between residents and cats.\n\nEach of the next $ m $ lines contains integers $ a_i $ and $ b_i $ ( $ 1 \\le a_i, b_i \\le n $ ), denoting that $ a_i $ -th resident is acquaintances with $ b_i $ -th cat. It's guaranteed that each pair of some resident and some cat is listed at most once.\n\nIt's guaranteed, that for every $ i $ there exists a pair between $ i $ -th resident and $ i $ -th cat.\n\nDifferent test cases are separated with an empty line.\n\nIt's guaranteed, that the sum of $ n $ over all test cases is at most $ 10^6 $ and that the sum of $ m $ over all test cases is at most $ 10^6 $ .",
    "outputFormat": "For every test case print:\n\n- \"No\", if it's impossible to select the jury and contestants.\n- Otherwise print \"Yes\".In the second line print two integers $ j $ and $ p $ ( $ 1 \\le j $ , $ 1 \\le p $ , $ j + p = n $ ) — the number of jury members and the number of contest participants.\n  \n  In the third line print $ j $ distinct integers from $ 1 $ to $ n $ , the indices of the residents forming a jury.\n  \n  In the fourth line print $ p $ distinct integers from $ 1 $ to $ n $ , the indices of the cats, which will participate in the contest.\n  \n  In case there are several correct answers, print any of them.",
    "samples": [
        [
            "4\n3 4\n1 1\n2 2\n3 3\n1 3\n\n3 7\n1 1\n1 2\n1 3\n2 2\n3 1\n3 2\n3 3\n\n1 1\n1 1\n\n2 4\n1 1\n1 2\n2 1\n2 2\n",
            "Yes\n2 1\n1 3 \n2 \nYes\n1 2\n2 \n1 3 \nNo\nNo\n"
        ]
    ],
    "hint": "In the first test case, we can select the first and the third resident as a jury. Both of them are not acquaintances with a second cat, so we can select it as a contestant.\n\nIn the second test case, we can select the second resident as a jury. He is not an acquaintances with a first and a third cat, so they can be selected as contestants.\n\nIn the third test case, the only resident is acquaintances with the only cat, so they can't be in the contest together. So it's not possible to make a contest with at least one jury and at least one cat.\n\nIn the fourth test case, each resident is acquaintances with every cat, so it's again not possible to make a contest with at least one jury and at least one cat.",
    "translation": "有$\\rm{N}$个人和$\\rm{N}$只猫，每个人都认识一些猫（其中包括自己的猫）。\n\n要求选出$\\rm j$名裁判（人）和$\\rm p$只选手（猫），使得$\\rm j+p=N$，且选出的人和猫都互相不认识。\n\n\n如果不存在这样的方案输出一行$\\rm NO$。\n\n\n如果存在则第一行输出$\\rm YES$，第二行输出两个数字分别代表裁判和选手的数量,第三行输出所有裁判的编号，第四行输出所有选手的编号。\n\n\n"
}