{
    "description": "A group of students has recently been admitted to the Faculty of Computer Sciences at the Berland State University. Now the programming teacher wants to divide them into three subgroups for practice sessions.\n\nThe teacher knows that a lot of programmers argue which language is the best. The teacher doesn't want to hear any arguments in the subgroups, so she wants to divide the students into three subgroups so that no pair of students belonging to the same subgroup want to argue.\n\nTo perform this division, the teacher asked each student which programming language he likes. There are $ a $ students who answered that they enjoy Assembler, $ b $ students stated that their favourite language is Basic, and $ c $ remaining students claimed that C++ is the best programming language — and there was a large argument between Assembler fans and C++ fans.\n\nNow, knowing that Assembler programmers and C++ programmers can start an argument every minute, the teacher wants to divide the students into three subgroups so that every student belongs to exactly one subgroup, and there is no subgroup that contains at least one Assembler fan and at least one C++ fan. Since teaching a lot of students can be difficult, the teacher wants the size of the largest subgroup to be minimum possible.\n\nPlease help the teacher to calculate the minimum possible size of the largest subgroup!",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 5 $ ) — the number of test cases in the input. Then test cases follow.\n\nEach test case consists of one line containing three integers $ a $ , $ b $ and $ c $ ( $ 1 \\le a, b, c \\le 1000 $ ) — the number of Assembler fans, Basic fans and C++ fans, respectively.",
    "outputFormat": "For each test case print one integer — the minimum size of the largest subgroup if the students are divided in such a way that there is no subgroup that contains at least one Assembler fan and at least one C++ fan simultaneously.",
    "samples": [
        [
            "5\n3 5 7\n4 8 4\n13 10 13\n1000 1000 1000\n13 22 7\n",
            "5\n6\n13\n1000\n14\n"
        ],
        [
            "5\n1 3 4\n1000 1000 1\n4 1 2\n325 226 999\n939 861 505\n",
            "3\n667\n3\n517\n769\n"
        ]
    ],
    "hint": "Explanation of the answers for the example $ 1 $ :\n\n1. The first subgroup contains $ 3 $ Assembler fans and $ 2 $ Basic fans, the second subgroup — $ 5 $ C++ fans, the third subgroup — $ 2 $ C++ fans and $ 3 $ Basic fans.\n2. The first subgroup contains $ 4 $ Assembler fans, the second subgroup — $ 6 $ Basic fans, the third subgroup — $ 2 $ Basic fans and $ 4 $ C++ fans.\n3. The first subgroup contains all Assembler fans, the second subgroup — all Basic fans, the third subgroup — all C++ fans.\n4. The first subgroup contains all Assembler fans, the second subgroup — all Basic fans, the third subgroup — all C++ fans.\n5. The first subgroup contains $ 12 $ Assembler fans and $ 2 $ Basic fans, the second subgroup — $ 1 $ Assembler fan and $ 13 $ Basic fans, the third subgroup — $ 7 $ Basic fans and $ 7 $ C++ fans.",
    "translation": "给定三个数 $a,b,c$，$a$ 表示喜欢汇编程序的人数，$b$ 表示喜欢 Basic 语言的人数， $c$ 表示喜欢 C++ 语言的人数。老师想把学生分三组，但是喜欢汇编程序的不能与喜欢 C++ 的放在一组。请问分组后最大的一组最小能为多少。\n\n输入有 $t$ 组数据。\n\nTranslate By LaDeX."
}