{
    "description": "Gildong is playing a video game called Block Adventure. In Block Adventure, there are $ n $ columns of blocks in a row, and the columns are numbered from $ 1 $ to $ n $ . All blocks have equal heights. The height of the $ i $ -th column is represented as $ h_i $ , which is the number of blocks stacked in the $ i $ -th column.\n\nGildong plays the game as a character that can stand only on the top of the columns. At the beginning, the character is standing on the top of the $ 1 $ -st column. The goal of the game is to move the character to the top of the $ n $ -th column.\n\nThe character also has a bag that can hold infinitely many blocks. When the character is on the top of the $ i $ -th column, Gildong can take one of the following three actions as many times as he wants:\n\n- if there is at least one block on the column, remove one block from the top of the $ i $ -th column and put it in the bag;\n- if there is at least one block in the bag, take one block out of the bag and place it on the top of the $ i $ -th column;\n- if $ i < n $ and $ |h_i - h_{i+1}| \\le k $ , move the character to the top of the $ i+1 $ -st column. $ k $ is a non-negative integer given at the beginning of the game. Note that it is only possible to move to the next column.\n\nIn actions of the first two types the character remains in the $ i $ -th column, and the value $ h_i $ changes.\n\nThe character initially has $ m $ blocks in the bag. Gildong wants to know if it is possible to win the game. Help Gildong find the answer to his question.",
    "inputFormat": "Each test contains one or more test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ). Description of the test cases follows.\n\nThe first line of each test case contains three integers $ n $ , $ m $ , and $ k $ ( $ 1 \\le n \\le 100 $ , $ 0 \\le m \\le 10^6 $ , $ 0 \\le k \\le 10^6 $ ) — the number of columns in the game, the number of blocks in the character's bag at the beginning, and the non-negative integer $ k $ described in the statement.\n\nThe second line of each test case contains $ n $ integers. The $ i $ -th integer is $ h_i $ ( $ 0 \\le h_i \\le 10^6 $ ), the initial height of the $ i $ -th column.",
    "outputFormat": "For each test case, print \"YES\" if it is possible to win the game. Otherwise, print \"NO\".\n\nYou can print each letter in any case (upper or lower).",
    "samples": [
        [
            "5\n3 0 1\n4 3 5\n3 1 2\n1 4 7\n4 10 0\n10 20 10 20\n2 5 5\n0 11\n1 9 9\n99\n",
            "YES\nNO\nYES\nNO\nYES\n"
        ]
    ],
    "hint": "In the first case, Gildong can take one block from the $ 1 $ -st column, move to the $ 2 $ -nd column, put the block on the $ 2 $ -nd column, then move to the $ 3 $ -rd column.\n\nIn the second case, Gildong has to put the block in his bag on the $ 1 $ -st column to get to the $ 2 $ -nd column. But it is impossible to get to the $ 3 $ -rd column because $ |h_2 - h_3| = 3 > k $ and there is no way to decrease the gap.\n\nIn the fifth case, the character is already on the $ n $ -th column from the start so the game is won instantly.",
    "translation": "## 题目描述\n你在玩一个游戏，已知在你面前有$n$列砖块，你的背包中有$m$个砖块，第$i$列有$h_i$个砖块。\n\n在第$i$列你可以进行下列操作\n- 如果你的背包中有砖块，你可以将将背包中的砖块放在第$i$列。\n- 如果第$i$列有砖块，你可以捡起来，放在背包中。\n- 如果第$i$列和第$i+1$列的高度差少于或等于$k$个砖块，你可以从第$i$列跳到第$i+1$列。\n\n问你是否能从第一列从第$1$列跳到第$n$列。\n如果能，输出$YES$,如果不能，输出$NO$。。\n## 输入格式\n### 多组测试数据\n第一行输入组数${T}(1{\\le}T{\\le}1000)$。\n#### 对于每组测试数据\n第一行输入$n,m,k({1{\\le}n{\\le}100},{0{\\le}m{\\le}10^6},{0{\\le}k{\\le}10^6})$。\n\n第二行输入$n$个数，第$i$个数代表$h_i$。\n## 输出格式\n对于每组数据，输出$YES$或$NO$。"
}