{
    "description": "Petya loves lucky numbers. Everybody knows that lucky numbers are positive integers whose decimal representation contains only the lucky digits 4 and 7. For example, numbers 47, 744, 4 are lucky and 5, 17, 467 are not.\n\nOne day Petya was delivered a string $ s $ , containing only digits. He needs to find a string that\n\n- represents a lucky number without leading zeroes,\n- is not empty,\n- is contained in $ s $ as a substring the maximum number of times.\n\nAmong all the strings for which the three conditions given above are fulfilled, Petya only needs the lexicographically minimum one. Find this string for Petya.",
    "inputFormat": "The single line contains a non-empty string $ s $ whose length can range from $ 1 $ to $ 50 $ , inclusive. The string only contains digits. The string can contain leading zeroes.",
    "outputFormat": "In the only line print the answer to Petya's problem. If the sought string does not exist, print \"-1\" (without quotes).",
    "samples": [
        [
            "047\n",
            "4\n"
        ],
        [
            "16\n",
            "-1\n"
        ],
        [
            "472747\n",
            "7\n"
        ]
    ],
    "hint": "The lexicographical comparison of strings is performed by the < operator in the modern programming languages. String $ x $ is lexicographically less than string $ y $ either if $ x $ is a prefix of $ y $ , or exists such $ i $ ( $ 1<=i<=min(|x|,|y|) $ ), that $ x_{i}&lt;y_{i} $ and for any $ j $ ( $ 1<=j&lt;i $ ) $ x_{j}=y_{j} $ . Here $ |a| $ denotes the length of string $ a $ .\n\nIn the first sample three conditions are fulfilled for strings \"4\", \"7\" and \"47\". The lexicographically minimum one is \"4\".\n\nIn the second sample $ s $ has no substrings which are lucky numbers.\n\nIn the third sample the three conditions are only fulfilled for string \"7\".",
    "translation": "Petya喜欢幸运数字。 \n\n每个人都知道幸运数字是正整数，其小数表示仅包含幸运数字4和7。例如，数字47、744、4是幸运数字，而5、17、467不是。\n\nPetya收到了一个仅包含数字的字符串s。 \n\n他需要找到一个子字符串\n```\n是没有前导零的幸运数字，\n\n不为空，\n\n在s中作为子字符串包含s的最大次数。\n```\n在满足以上三个条件的所有字符串中，Petya仅需按字典顺序的最小条件即可。 "
}