{
    "description": "After years of hard work scientists invented an absolutely new e-reader display. The new display has a larger resolution, consumes less energy and its production is cheaper. And besides, one can bend it. The only inconvenience is highly unusual management. For that very reason the developers decided to leave the e-readers' software to programmers.\n\nThe display is represented by $ n×n $ square of pixels, each of which can be either black or white. The display rows are numbered with integers from $ 1 $ to $ n $ upside down, the columns are numbered with integers from $ 1 $ to $ n $ from the left to the right. The display can perform commands like \" $ x,y $ \". When a traditional display fulfills such command, it simply inverts a color of $ (x,y) $ , where $ x $ is the row number and $ y $ is the column number. But in our new display every pixel that belongs to at least one of the segments $ (x,x)-(x,y) $ and $ (y,y)-(x,y) $ (both ends of both segments are included) inverts a color.\n\nFor example, if initially a display $ 5×5 $ in size is absolutely white, then the sequence of commands $ (1,4) $ , $ (3,5) $ , $ (5,1) $ , $ (3,3) $ leads to the following changes:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF126C/5d608234784f14fa9e772dd780ce70ecdd0fa335.png)You are an e-reader software programmer and you should calculate minimal number of commands needed to display the picture. You can regard all display pixels as initially white.",
    "inputFormat": "The first line contains number $ n $ ( $ 1<=n<=2000 $ ).\n\nNext $ n $ lines contain $ n $ characters each: the description of the picture that needs to be shown. \"0\" represents the white color and \"1\" represents the black color.",
    "outputFormat": "Print one integer $ z $ — the least number of commands needed to display the picture.",
    "samples": [
        [
            "5\n01110\n10010\n10001\n10011\n11110\n",
            "4\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个 $n \\times n$ 的正方形，初始时每个点都是 `0`。当接收到 $(x,y)$ 的命令时，$(x,x) \\rarr (x,y)$ 和 $(x,y) \\rarr (y,y)$ 段（包括两端点）中的每个点均发生反转（`1` 变 `0`，`0` 变 `1`）。 计算使输入的表每个点都变为 0 所需的最少命令数 $s$，并输出。\n\n**【输入格式】**\n\n第一行一个正整数 $n$，接下来 $n$ 行描述一个 $n \\times n$ 的由 ```0``` 或 ```1``` 组成的矩形。\n\n**【输出格式】**\n\n一行一个整数，表示把矩形改为全 ```0``` 的最少操作步数。\n\n**【数据范围】**\n\n$1 \\leq n \\leq 2 \\times 10^3$，输入的数组只由 ```0``` 或 ```1``` 组成。"
}