{
    "description": "Shichikuji is the new resident deity of the South Black Snail Temple. Her first job is as follows:\n\nThere are $ n $ new cities located in Prefecture X. Cities are numbered from $ 1 $ to $ n $ . City $ i $ is located $ x_i $ km North of the shrine and $ y_i $ km East of the shrine. It is possible that $ (x_i, y_i) = (x_j, y_j) $ even when $ i \\ne j $ .\n\nShichikuji must provide electricity to each city either by building a power station in that city, or by making a connection between that city and another one that already has electricity. So the City has electricity if it has a power station in it or it is connected to a City which has electricity by a direct connection or via a chain of connections.\n\n- Building a power station in City $ i $ will cost $ c_i $ yen;\n- Making a connection between City $ i $ and City $ j $ will cost $ k_i + k_j $ yen per km of wire used for the connection. However, wires can only go the cardinal directions (North, South, East, West). Wires can cross each other. Each wire must have both of its endpoints in some cities. If City $ i $ and City $ j $ are connected by a wire, the wire will go through any shortest path from City $ i $ to City $ j $ . Thus, the length of the wire if City $ i $ and City $ j $ are connected is $ |x_i - x_j| + |y_i - y_j| $ km.\n\nShichikuji wants to do this job spending as little money as possible, since according to her, there isn't really anything else in the world other than money. However, she died when she was only in fifth grade so she is not smart enough for this. And thus, the new resident deity asks for your help.\n\nAnd so, you have to provide Shichikuji with the following information: minimum amount of yen needed to provide electricity to all cities, the cities in which power stations will be built, and the connections to be made.\n\nIf there are multiple ways to choose the cities and the connections to obtain the construction of minimum price, then print any of them.",
    "inputFormat": "First line of input contains a single integer $ n $ ( $ 1 \\leq n \\leq 2000 $ ) — the number of cities.\n\nThen, $ n $ lines follow. The $ i $ -th line contains two space-separated integers $ x_i $ ( $ 1 \\leq x_i \\leq 10^6 $ ) and $ y_i $ ( $ 1 \\leq y_i \\leq 10^6 $ ) — the coordinates of the $ i $ -th city.\n\nThe next line contains $ n $ space-separated integers $ c_1, c_2, \\dots, c_n $ ( $ 1 \\leq c_i \\leq 10^9 $ ) — the cost of building a power station in the $ i $ -th city.\n\nThe last line contains $ n $ space-separated integers $ k_1, k_2, \\dots, k_n $ ( $ 1 \\leq k_i \\leq 10^9 $ ).",
    "outputFormat": "In the first line print a single integer, denoting the minimum amount of yen needed.\n\nThen, print an integer $ v $ — the number of power stations to be built.\n\nNext, print $ v $ space-separated integers, denoting the indices of cities in which a power station will be built. Each number should be from $ 1 $ to $ n $ and all numbers should be pairwise distinct. You can print the numbers in arbitrary order.\n\nAfter that, print an integer $ e $ — the number of connections to be made.\n\nFinally, print $ e $ pairs of integers $ a $ and $ b $ ( $ 1 \\le a, b \\le n $ , $ a \\ne b $ ), denoting that a connection between City $ a $ and City $ b $ will be made. Each unordered pair of cities should be included at most once (for each $ (a, b) $ there should be no more $ (a, b) $ or $ (b, a) $ pairs). You can print the pairs in arbitrary order.\n\nIf there are multiple ways to choose the cities and the connections to obtain the construction of minimum price, then print any of them.",
    "samples": [
        [
            "3\n2 3\n1 1\n3 2\n3 2 3\n3 2 3\n",
            "8\n3\n1 2 3 \n0\n"
        ],
        [
            "3\n2 1\n1 2\n3 3\n23 2 23\n3 2 3\n",
            "27\n1\n2 \n2\n1 2\n2 3\n"
        ]
    ],
    "hint": "For the answers given in the samples, refer to the following diagrams (cities with power stations are colored green, other cities are colored blue, and wires are colored red):\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1245D/251d50cda099f4e4be2994b6b01574cc32a17cd3.png)\n\nFor the first example, the cost of building power stations in all cities is $ 3 + 2 + 3 = 8 $ . It can be shown that no configuration costs less than 8 yen.\n\nFor the second example, the cost of building a power station in City 2 is 2. The cost of connecting City 1 and City 2 is $ 2 \\cdot (3 + 2) = 10 $ . The cost of connecting City 2 and City 3 is $ 3 \\cdot (2 + 3) = 15 $ . Thus the total cost is $ 2 + 10 + 15 = 27 $ . It can be shown that no configuration costs less than 27 yen.",
    "translation": "已知一个平面上有 $n$ 个城市，需要个 $n$ 个城市均通上电\n\n一个城市有电，必须在这个城市有发电站或者和一个有电的城市用电缆相连\n\n在一个城市建造发电站的代价是 $c[i]$\n\n$i$ 和 $j$ 两个城市相连的代价是 $k[i]+k[j]$ 乘上两者的曼哈顿距离\n\n求最小代价的方案\n\n输入:\n\n第一行为城市个数\n\n下面是每个城市的坐标\n\n下面是建造发电站的代价 $c[i]$\n\n下面是每个城市连线的系数 $k[i]$\n\n输出:\n\n一个为最小代价\n\n建造发电站的城市数，和每个城市\n\n连线的条数，和每条连线\n\n任意一种即可，输出顺序任意\n"
}