{
    "description": "Berland Gardeners United Inc. hired you for the project called \"SmartGarden\". The main feature of this project is automatic garden watering.\n\nFormally the garden can be represented as a square of $ n \\times n $ cells with rows numbered $ 1 $ to $ n $ from top to bottom and columns numbered $ 1 $ to $ n $ from left to right. Each cell of the garden contains either a plant or a slab.\n\nIt's known that slabs are located on the main diagonal of the matrix representing the garden, and in the cells that are below the main diagonal and share a side with at least one cell of the main diagonal. All the remaining cells of the garden are filled with plants.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1250M/920cff7b857d3b33730690cd330ac3e3f7380869.png)Example of the garden for $ n=5 $ .During implementation of the project you created a smart robot that takes a list of commands as an input, which are processed one by one. Each command contains:\n\n- a list of horizontal lines (rows in the matrix representing the garden);\n- a list of vertical lines (columns in the matrix representing the garden).\n\nWhile executing each command robot waters only cells in the intersection of specified rows and specified columns. So, if you specify $ r $ rows and $ c $ columns, then exactly $ r \\cdot c $ cells will be watered.\n\nIn the demo for the customer you have tuned robot in such a way that it waters all the garden. To do that you prepared a single command containing all $ n $ rows and all $ n $ columns.\n\nUnfortunately, 5 hours before the demo for your customer it turned out that the CEO of Berland Gardeners United Inc. was going to take part in it. Moreover, most probably he will be standing on a garden slab during the demo!\n\nNow you need to create a list of commands for the robot so that it waters all the plants and doesn't water any cell containing a slab. Since it's only a beta version of \"SmartGarden\", the total number of commands shouldn't exceed $ 50 $ .\n\nCreate a program that, for a given size of the garden, will find a list of no more than $ 50 $ commands that allow the robot to water all the plants in the garden without watering the slabs. It is allowed to water a plant several times.",
    "inputFormat": "The first and the only line of the input contains a single integer $ n $ ( $ 2 \\le n \\le 5000 $ ), where $ n $ is the size of the garden.",
    "outputFormat": "In the first line print the total number of commands for the robot $ k $ ( $ 1 \\le k \\le 50 $ ). In the next $ 2 \\cdot k $ lines print all the commands. Each command should be specified by $ 2 $ lines. The first line of each command should describe rows in the command and the second line should describe columns in the command. Each of these $ 2 $ lines should have the following format:\n\n- the first number of the line should specify the total number of items $ x $ in the appropriate list;\n- then $ x $ distinct numbers follow, where each number is in the range $ 1 \\dots n $ and describes a chosen row for the first line and a chosen column for the second line.\n\nIf there are multiple ways to water the garden, print any of them.",
    "samples": [
        [
            "2",
            "2\n1 1\n1 2\n1 1\n1 2\n"
        ],
        [
            "4",
            "4\n2 1 4\n1 2\n2 1 2\n2 3 4\n1 3\n2 1 4\n1 4\n1 1\n"
        ]
    ],
    "hint": "",
    "translation": "- 有一个 $n \\times n$ 的矩阵，初始时所有位置上都是 $0$。每次操作你可以选择若干行 $r_1,r_2,\\dots,r_p$ 和若干列 $c_1,c_2,\\dots,c_q$，把这些行列交点处的位置都变成 $1$。\n\n- 现在，你需要在不超过 $50$ 次操作内，除了满足 $j \\le i \\le j+1$ 的点，即主对角线和主对角线左下的那一斜排为 $0$ 外，其他都为 $1$\n- $n \\le 5000$"
}