{
    "description": "It is Bubble Cup finals season and farmer Johnny Bubbles must harvest his bubbles. The bubbles are in a rectangular bubblefield formed of $ N $ x $ M $ square parcels divided into $ N $ rows and $ M $ columns. The parcel in $ i^{th} $ row and $ j^{th} $ column yields $ A_{i,j} $ bubbles.\n\nJohnny Bubbles has available a very special self-driving bubble harvester that, once manually positioned at the beginning of a row or column, automatically harvests all the bubbles in that row or column. Once the harvester reaches the end of the row or column it stops and must be repositioned. The harvester can pass through any parcel any number of times, but it can collect bubbles from the parcel only once.\n\nJohnny is very busy farmer, so he is available to manually position the harvester at most four times per day. Johnny is also impatient, so he wants to harvest as many bubbles as possible on the first day.\n\nPlease help Johnny to calculate what is the maximum number of bubbles he can collect on the first day.",
    "inputFormat": "The first line contains two integers $ N $ and $ M $ ( $ 1 $ $ \\leq $ $ N $ , $ M $ $ \\leq $ $ N $ \\* $ M $ $ \\leq $ $ 10^{5} $ ) - the bubblefield size.\n\nEach of the next $ N $ lines contains $ M $ integers. The $ j^{th} $ element in the $ i^{th} $ line is $ A_{i,j} $ ( $ 0 $ $ \\leq $ $ a_{i,j} $ $ \\leq $ $ 10^{9} $ ) — the yield of the parcel located in the $ i^{th} $ row and the $ j^{th} $ column.",
    "outputFormat": "Output contains one integer number - maximum number of the bubbles Johnny can harvest on the first day.",
    "samples": [
        [
            "2 2\n1 2\n3 4\n",
            "10\n"
        ],
        [
            "5 5\n0 9 2 7 0\n9 0 3 0 5\n0 8 0 3 1\n6 7 4 3 9\n3 6 4 1 0\n",
            "80\n"
        ]
    ],
    "hint": "In the first example, farmer Johnny can harvest all the bubbles by positioning the harvester on the first and the second row.\n\nIn the second example, one way Johnny can harvest maximum number of bubbles is to position the harvester in the second row, the fourth row, the second column and the fourth column.",
    "translation": "n * m的网格中，在第i行j列有a[i][j]个泡泡，每次可以收割一行或一列的泡泡，最多收割4次，问最多可以收割到多少泡泡。"
}