{
    "description": "Christmas was knocking on the door, and our protagonist, Bob, was preparing a spectacular present for his long-time second best friend Charlie. As chocolate boxes are lame, he decided to decorate a tree instead. Bob's tree can be represented as an undirected connected graph with $ n $ nodes (numbered $ 1 $ to $ n $ ) and $ n-1 $ edges. Initially, Bob placed a decoration with label $ i $ on node $ i $ , for each $ 1 \\le i \\le n $ . However, as such a simple arrangement is lame, he decided to shuffle the decorations a bit. Formally, Bob did the following steps:\n\n- First, he listed the $ n-1 $ edges in some order.\n- Then, he considered the edges one by one in that order. For each edge $ (u, v) $ , he swapped the decorations of node $ u $ with the one of node $ v $ .\n\nAfter finishing, Bob seemed satisfied with the arrangement, so he went to sleep.\n\nThe next morning, Bob wakes up only to find out that his beautiful arrangement has been ruined! Last night, Bob's younger brother Bobo dropped some of the decorations on the floor while he was playing with the tree. Fortunately, no decorations were lost, so Bob can repair the tree in no time. However, he completely forgets how the tree looked like yesterday. Therefore, given the labels of the decorations still on the tree, Bob wants to know the number of possible configurations of the tree. As the result can be quite large, Bob will be happy if you can output the result modulo $ 1000000007 $ ( $ 10^9+7 $ ). Note that, it is possible that there exists no possible configurations.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\leq n \\leq 500\\,000 $ ) — the number of nodes.\n\nEach of the next $ n - 1 $ lines contains two integers $ u $ and $ v $ ( $ 1 \\leq u, v \\leq n $ ), denoting that there is an edge connecting two nodes $ u $ and $ v $ . It is guaranteed that the given edges form a tree.\n\nThe last line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le n $ ). For each $ i $ , $ a_i = 0 $ means that the decoration of node $ i $ has been dropped on the floor. Otherwise, $ a_i $ is the label of the decoration of node $ i $ . It is guaranteed that no label appears more than once.",
    "outputFormat": "Output the number of possible configurations modulo $ 1000000007 $ ( $ 10^9+7 $ ).",
    "samples": [
        [
            "4\n3 4\n2 4\n4 1\n0 4 0 0\n",
            "2\n"
        ],
        [
            "5\n1 2\n2 4\n3 4\n5 4\n0 0 0 0 0\n",
            "12\n"
        ],
        [
            "3\n1 2\n1 3\n1 0 0\n",
            "0\n"
        ]
    ],
    "hint": "In the first example, the possible configurations of the tree are $ [2, 4, 1, 3] $ and $ [3, 4, 2, 1] $ .\n\nIn the second example, note that while there are $ 4! = 24 $ possible permutations of the edges, each of them results in a possible configuration, there are only $ 12 $ different configurations.\n\nIn the third example, it is easy to see that the decoration $ 1 $ cannot stay at node $ 1 $ after the swaps.",
    "translation": "- 给出一棵 $N$ 个节点的树，初始时第 $i$ 个节点上有一个数字 $i$。\n- 每次你可以选择一条未被删除的边，交换这条边连接的两个点上的数字后，删除这条边。\n- 现给定一个序列 $a$，第 $i$ 个位置上若不为 $0$，则代表要求最终第 $i$ 个位置上的数要为 $a_i$。否则没有特殊要求。\n- 试求出，执行 $N-1$ 次操作之后，有多少种最终局面满足序列 $a$ 的要求。答案对 $10^9+7$ 取模。\n- $2 \\leq N \\leq 5 \\times 10^5$，$0 \\leq a_i \\leq N$。"
}