{
    "description": "Let's define a number ebne (even but not even) if and only if its sum of digits is divisible by $ 2 $ but the number itself is not divisible by $ 2 $ . For example, $ 13 $ , $ 1227 $ , $ 185217 $ are ebne numbers, while $ 12 $ , $ 2 $ , $ 177013 $ , $ 265918 $ are not. If you're still unsure what ebne numbers are, you can look at the sample notes for more clarification.\n\nYou are given a non-negative integer $ s $ , consisting of $ n $ digits. You can delete some digits (they are not necessary consecutive/successive) to make the given number ebne. You cannot change the order of the digits, that is, after deleting the digits the remaining digits collapse. The resulting number shouldn't contain leading zeros. You can delete any number of digits between $ 0 $ (do not delete any digits at all) and $ n-1 $ .\n\nFor example, if you are given $ s= $ 222373204424185217171912 then one of possible ways to make it ebne is: 222373204424185217171912 $ \\rightarrow $ 2237344218521717191. The sum of digits of 2237344218521717191 is equal to $ 70 $ and is divisible by $ 2 $ , but number itself is not divisible by $ 2 $ : it means that the resulting number is ebne.\n\nFind any resulting number that is ebne. If it's impossible to create an ebne number from the given number report about it.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 3000 $ ) — the number of digits in the original number.\n\nThe second line of each test case contains a non-negative integer number $ s $ , consisting of $ n $ digits.\n\nIt is guaranteed that $ s $ does not contain leading zeros and the sum of $ n $ over all test cases does not exceed $ 3000 $ .",
    "outputFormat": "For each test case given in the input print the answer in the following format:\n\n- If it is impossible to create an ebne number, print \"-1\" (without quotes);\n- Otherwise, print the resulting number after deleting some, possibly zero, but not all digits. This number should be ebne. If there are multiple answers, you can print any of them. Note that answers with leading zeros or empty strings are not accepted. It's not necessary to minimize or maximize the number of deleted digits.",
    "samples": [
        [
            "4\n4\n1227\n1\n0\n6\n177013\n24\n222373204424185217171912",
            "1227\n-1\n17703\n2237344218521717191"
        ]
    ],
    "hint": "In the first test case of the example, $ 1227 $ is already an ebne number (as $ 1 + 2 + 2 + 7 = 12 $ , $ 12 $ is divisible by $ 2 $ , while in the same time, $ 1227 $ is not divisible by $ 2 $ ) so we don't need to delete any digits. Answers such as $ 127 $ and $ 17 $ will also be accepted.\n\nIn the second test case of the example, it is clearly impossible to create an ebne number from the given number.\n\nIn the third test case of the example, there are many ebne numbers we can obtain by deleting, for example, $ 1 $ digit such as $ 17703 $ , $ 77013 $ or $ 17013 $ . Answers such as $ 1701 $ or $ 770 $ will not be accepted as they are not ebne numbers. Answer $ 013 $ will not be accepted as it contains leading zeroes.\n\nExplanation:\n\n- $ 1 + 7 + 7 + 0 + 3 = 18 $ . As $ 18 $ is divisible by $ 2 $ while $ 17703 $ is not divisible by $ 2 $ , we can see that $ 17703 $ is an ebne number. Same with $ 77013 $ and $ 17013 $ ;\n- $ 1 + 7 + 0 + 1 = 9 $ . Because $ 9 $ is not divisible by $ 2 $ , $ 1701 $ is not an ebne number;\n- $ 7 + 7 + 0 = 14 $ . This time, $ 14 $ is divisible by $ 2 $ but $ 770 $ is also divisible by $ 2 $ , therefore, $ 770 $ is not an ebne number.\n\nIn the last test case of the example, one of many other possible answers is given. Another possible answer is: 222373204424185217171912 $ \\rightarrow $ 22237320442418521717191 (delete the last digit).",
    "translation": "有 $T$ 组数据.\n\n给你一个长为 $N$ 的非负数字串.\n\n现在你需要从这个串里删掉 $0\\leq k \\leq N-1$ 个数码 ( 这些数码可以不连续 ) , 使这个数字串形成的数不能被 $2$ 整除, 但是这些数码的和可以被 $2$ 整除.\n\n输出处理后的数字串.\n\n如果给定的数字串无法通过删掉一些数码来满足要求,输出 $−1$.\n\n数据范围: $1 \\leq T \\leq 1000, 1\\leq N \\leq 3000$."
}