{
    "description": "The Oak has $ n $ nesting places, numbered with integers from $ 1 $ to $ n $ . Nesting place $ i $ is home to $ b_i $ bees and $ w_i $ wasps.\n\nSome nesting places are connected by branches. We call two nesting places adjacent if there exists a branch between them. A simple path from nesting place $ x $ to $ y $ is given by a sequence $ s_0, \\ldots, s_p $ of distinct nesting places, where $ p $ is a non-negative integer, $ s_0 = x $ , $ s_p = y $ , and $ s_{i-1} $ and $ s_{i} $ are adjacent for each $ i = 1, \\ldots, p $ . The branches of The Oak are set up in such a way that for any two pairs of nesting places $ x $ and $ y $ , there exists a unique simple path from $ x $ to $ y $ . Because of this, biologists and computer scientists agree that The Oak is in fact, a tree.\n\nA village is a nonempty set $ V $ of nesting places such that for any two $ x $ and $ y $ in $ V $ , there exists a simple path from $ x $ to $ y $ whose intermediate nesting places all lie in $ V $ .\n\nA set of villages $ \\cal P $ is called a partition if each of the $ n $ nesting places is contained in exactly one of the villages in $ \\cal P $ . In other words, no two villages in $ \\cal P $ share any common nesting place, and altogether, they contain all $ n $ nesting places.\n\nThe Oak holds its annual Miss Punyverse beauty pageant. The two contestants this year are Ugly Wasp and Pretty Bee. The winner of the beauty pageant is determined by voting, which we will now explain. Suppose $ \\mathcal{P} $ is a partition of the nesting places into $ m $ villages $ V_1, \\ldots, V_m $ . There is a local election in each village. Each of the insects in this village vote for their favorite contestant. If there are strictly more votes for Ugly Wasp than Pretty Bee, then Ugly Wasp is said to win in that village. Otherwise, Pretty Bee wins. Whoever wins in the most number of villages wins.\n\nAs it always goes with these pageants, bees always vote for the bee (which is Pretty Bee this year) and wasps always vote for the wasp (which is Ugly Wasp this year). Unlike their general elections, no one abstains from voting for Miss Punyverse as everyone takes it very seriously.\n\nMayor Waspacito, and his assistant Alexwasp, wants Ugly Wasp to win. He has the power to choose how to partition The Oak into exactly $ m $ villages. If he chooses the partition optimally, determine the maximum number of villages in which Ugly Wasp wins.",
    "inputFormat": "The first line of input contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) denoting the number of test cases. The next lines contain descriptions of the test cases.\n\nThe first line of each test case contains two space-separated integers $ n $ and $ m $ ( $ 1 \\le m \\le n \\le 3000 $ ). The second line contains $ n $ space-separated integers $ b_1, b_2, \\ldots, b_n $ ( $ 0 \\le b_i \\le 10^9 $ ). The third line contains $ n $ space-separated integers $ w_1, w_2, \\ldots, w_n $ ( $ 0 \\le w_i \\le 10^9 $ ). The next $ n - 1 $ lines describe the pairs of adjacent nesting places. In particular, the $ i $ -th of them contains two space-separated integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le n $ , $ x_i \\neq y_i $ ) denoting the numbers of two adjacent nesting places. It is guaranteed that these pairs form a tree.\n\nIt is guaranteed that the sum of $ n $ in a single file is at most $ 10^5 $ .",
    "outputFormat": "For each test case, output a single line containing a single integer denoting the maximum number of villages in which Ugly Wasp wins, among all partitions of The Oak into $ m $ villages.",
    "samples": [
        [
            "2\n4 3\n10 160 70 50\n70 111 111 0\n1 2\n2 3\n3 4\n2 1\n143 420\n214 349\n2 1\n",
            "2\n0\n"
        ]
    ],
    "hint": "In the first test case, we need to partition the $ n = 4 $ nesting places into $ m = 3 $ villages. We can make Ugly Wasp win in $ 2 $ villages via the following partition: $ \\{\\{1, 2\\}, \\{3\\}, \\{4\\}\\} $ . In this partition,\n\n- Ugly Wasp wins in village $ \\{1, 2\\} $ , garnering $ 181 $ votes as opposed to Pretty Bee's $ 170 $ ;\n- Ugly Wasp also wins in village $ \\{3\\} $ , garnering $ 111 $ votes as opposed to Pretty Bee's $ 70 $ ;\n- Ugly Wasp loses in the village $ \\{4\\} $ , garnering $ 0 $ votes as opposed to Pretty Bee's $ 50 $ .\n\nThus, Ugly Wasp wins in $ 2 $ villages, and it can be shown that this is the maximum possible number.\n\nIn the second test case, we need to partition the $ n = 2 $ nesting places into $ m = 1 $ village. There is only one way to do this: $ \\{\\{1, 2\\}\\} $ . In this partition's sole village, Ugly Wasp gets $ 563 $ votes, and Pretty Bee also gets $ 563 $ votes. Ugly Wasp needs strictly more votes in order to win. Therefore, Ugly Wasp doesn't win in any village.",
    "translation": "给定一棵$n$个节点的树，每个点有点权$b_i$和$w_i$，请将这棵树划分为$m$个连通块，使得满足以下条件的连通块个数最大化:\r\n\r\n- 连通块内点的$w$之和**严格大于**连通块内点的$b$之和\r\n\r\n## 输入\r\n第一行一个数$t(1 \\leq t \\leq 100)$,表示数据组数。对于每组数据：  \r\n第一行两个正整数$n$和$m(1 \\leq m \\leq n\\leq 3000)$,  \r\n第二行$n$个整数$b_1 \\dots b_n(0\\leq b_i \\leq 10^9)$,  \r\n第三行$n$个整数$w_1 \\dots w_n(0\\leq w_i \\leq 10^9)$,  \r\n接下来$n-1$行，每行两个数$x,y(1 \\leq x,y \\leq n,x \\neq y)$, 表示树边。  \r\n保证每个输入文件中$n$的和不超过$10^5$。\r\n\r\n## 输出\r\n对于每组数据输出一行一个整数，表示所求连通块数的最大值。\r\n"
}