{
    "description": "Tomorrow is a difficult day for Polycarp: he has to attend $ a $ lectures and $ b $ practical classes at the university! Since Polycarp is a diligent student, he is going to attend all of them.\n\nWhile preparing for the university, Polycarp wonders whether he can take enough writing implements to write all of the lectures and draw everything he has to during all of the practical classes. Polycarp writes lectures using a pen (he can't use a pencil to write lectures!); he can write down $ c $ lectures using one pen, and after that it runs out of ink. During practical classes Polycarp draws blueprints with a pencil (he can't use a pen to draw blueprints!); one pencil is enough to draw all blueprints during $ d $ practical classes, after which it is unusable.\n\nPolycarp's pencilcase can hold no more than $ k $ writing implements, so if Polycarp wants to take $ x $ pens and $ y $ pencils, they will fit in the pencilcase if and only if $ x + y \\le k $ .\n\nNow Polycarp wants to know how many pens and pencils should he take. Help him to determine it, or tell that his pencilcase doesn't have enough room for all the implements he needs tomorrow!\n\nNote that you don't have to minimize the number of writing implements (though their total number must not exceed $ k $ ).",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases in the input. Then the test cases follow.\n\nEach test case is described by one line containing five integers $ a $ , $ b $ , $ c $ , $ d $ and $ k $ , separated by spaces ( $ 1 \\le a, b, c, d, k \\le 100 $ ) — the number of lectures Polycarp has to attend, the number of practical classes Polycarp has to attend, the number of lectures which can be written down using one pen, the number of practical classes for which one pencil is enough, and the number of writing implements that can fit into Polycarp's pencilcase, respectively.\n\nIn hacks it is allowed to use only one test case in the input, so $ t = 1 $ should be satisfied.",
    "outputFormat": "For each test case, print the answer as follows:\n\nIf the pencilcase can't hold enough writing implements to use them during all lectures and practical classes, print one integer $ -1 $ . Otherwise, print two non-negative integers $ x $ and $ y $ — the number of pens and pencils Polycarp should put in his pencilcase. If there are multiple answers, print any of them. Note that you don't have to minimize the number of writing implements (though their total number must not exceed $ k $ ).",
    "samples": [
        [
            "3\n7 5 4 5 8\n7 5 4 5 2\n20 53 45 26 4\n",
            "7 1\n-1\n1 3\n"
        ]
    ],
    "hint": "There are many different answers for the first test case; $ x = 7 $ , $ y = 1 $ is only one of them. For example, $ x = 3 $ , $ y = 1 $ is also correct.\n\n $ x = 1 $ , $ y = 3 $ is the only correct answer for the third test case.",
    "translation": "题目简述：\n\nt组数据，每组a,b,c,d,k\n\n一只钢笔可以写c次讲座，一只铅笔可以写d次绘画课，现在有a次讲座，b次绘画课，文具盒里面可以存k支笔，如果有解满足上完所有课程，则输出解，否则输出-1"
}