{
    "description": "We just discovered a new data structure in our research group: a suffix three!\n\nIt's very useful for natural language processing. Given three languages and three suffixes, a suffix three can determine which language a sentence is written in.\n\nIt's super simple, 100% accurate, and doesn't involve advanced machine learning algorithms.\n\nLet us tell you how it works.\n\n- If a sentence ends with \"po\" the language is Filipino.\n- If a sentence ends with \"desu\" or \"masu\" the language is Japanese.\n- If a sentence ends with \"mnida\" the language is Korean.\n\nGiven this, we need you to implement a suffix three that can differentiate Filipino, Japanese, and Korean.\n\nOh, did I say three suffixes? I meant four.",
    "inputFormat": "The first line of input contains a single integer $ t $ ( $ 1 \\leq t \\leq 30 $ ) denoting the number of test cases. The next lines contain descriptions of the test cases.\n\nEach test case consists of a single line containing a single string denoting the sentence. Spaces are represented as underscores (the symbol \"\\_\") for ease of reading. The sentence has at least $ 1 $ and at most $ 1000 $ characters, and consists only of lowercase English letters and underscores. The sentence has no leading or trailing underscores and no two consecutive underscores. It is guaranteed that the sentence ends with one of the four suffixes mentioned above.",
    "outputFormat": "For each test case, print a single line containing either \"FILIPINO\", \"JAPANESE\", or \"KOREAN\" (all in uppercase, without quotes), depending on the detected language.",
    "samples": [
        [
            "8\nkamusta_po\ngenki_desu\nohayou_gozaimasu\nannyeong_hashimnida\nhajime_no_ippo\nbensamu_no_sentou_houhou_ga_okama_kenpo\nang_halaman_doon_ay_sarisari_singkamasu\nsi_roy_mustang_ay_namamasu\n",
            "FILIPINO\nJAPANESE\nJAPANESE\nKOREAN\nFILIPINO\nFILIPINO\nJAPANESE\nJAPANESE\n"
        ]
    ],
    "hint": "The first sentence ends with \"po\", so it is written in Filipino.\n\nThe second and third sentences end with \"desu\" and \"masu\", so they are written in Japanese.\n\nThe fourth sentence ends with \"mnida\", so it is written in Korean.",
    "translation": "给定 $n$ 个字符串，对于每个字符串：\r\n\r\n+ 若它以 `po` 结尾，输出 `FILIPINO`\r\n+ 若它以 `desu` 或 `masu` 结尾，输出 `JAPANESE`\r\n+ 若它以 `mnida` 结尾，输出 `KOREAN`\r\n\r\n保证所给的字符串一定满足以上的三种情况之一。"
}