{
    "description": "Polycarp is working on the implementation of displaying likes on the Codehorses social network. The number of likes should be displayed in a format that will be easy to read by users. It was decided that for large numbers of likes the format should be like 123K (one hundred twenty-three thousand) or like 56M (fifty-six million).\n\nThe following displaying strategy has been approved:\n\n- the number will be displayed either as an integer number from 0 to 999, or as a positive integer number of thousands (from 1K to 999K), or as a positive integer number of millions (from 1M on),\n- the specified exact number of likes $ n $ when displaying should be rounded to the nearest view from the case above (if rounding is ambiguous, it must be rounded up): for example, $ 1785 $ should be rounded to 2K instead of 1K, $ 4500000 $ should be rounded to 5M.\n\nHelp Polycarp implement this part of the functionality: for a given non-negative integer number of likes $ n $ , print its view in the Codehorses interface.",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases in the input. The following are descriptions of the $ t $ input test cases, one per line.\n\nThe description of each test case consists of a single line that contains a non-negative integer $ n $ ( $ 0 \\le n \\le 2\\cdot10^9 $ ) — the number of likes.",
    "outputFormat": "Print $ t $ answers to the given test cases in the order from the input. Each printed value must have one of the following types:\n\n- either an integer from 0 to 999 which corresponds just to the number of likes,\n- or a number of thousands from 1K to 999K,\n- or a number of millions from 1M to 2000M.\n\nThe answer is equal to a view which is the closest (by difference) to the given number $ n $ . If this rounding is ambiguous, then round answer up (to a greater value).",
    "samples": [
        [
            "9\n999\n123\n0\n1782\n31415926\n1500\n999999\n35499710\n2000000000",
            "999\n123\n0\n2K\n31M\n2K\n1M\n35M\n2000M"
        ]
    ],
    "hint": "Let's describe some test cases:\n\n- $ 1782 $ can be displayed either as 1K or as 2K but 2K is the nearest view;\n- $ 1500 $ have same difference with 1K and 2K so it should be rounded up;\n- $ 999999 $ should be displayed as 1M since it's closer to it than to 999K."
}