{
    "description": "You have three piles of candies: red, green and blue candies:\n\n- the first pile contains only red candies and there are $ r $ candies in it,\n- the second pile contains only green candies and there are $ g $ candies in it,\n- the third pile contains only blue candies and there are $ b $ candies in it.\n\nEach day Tanya eats exactly two candies of different colors. She is free to choose the colors of eaten candies: the only restriction that she can't eat two candies of the same color in a day.\n\nFind the maximal number of days Tanya can eat candies? Each day she needs to eat exactly two candies.",
    "inputFormat": "The first line contains integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases in the input. Then $ t $ test cases follow.\n\nEach test case is given as a separate line of the input. It contains three integers $ r $ , $ g $ and $ b $ ( $ 1 \\le r, g, b \\le 10^8 $ ) — the number of red, green and blue candies, respectively.",
    "outputFormat": "Print $ t $ integers: the $ i $ -th printed integer is the answer on the $ i $ -th test case in the input.",
    "samples": [
        [
            "6\n1 1 1\n1 2 1\n4 1 1\n7 4 10\n8 1 4\n8 2 8\n",
            "1\n2\n2\n10\n5\n9\n"
        ]
    ],
    "hint": "In the first example, Tanya can eat candies for one day only. She can eat any pair of candies this day because all of them have different colors.\n\nIn the second example, Tanya can eat candies for two days. For example, she can eat red and green candies on the first day, and green and blue candies on the second day.\n\nIn the third example, Tanya can eat candies for two days. For example, she can eat red and green candies on the first day, and red and blue candies on the second day. Note, that two red candies will remain uneaten.",
    "translation": "### 题意简述\n\n有三堆糖果，在同一堆中的糖果颜色相同，但没有两堆糖果的颜色是一样的。\n\n你每天要吃掉两个糖果，但不能吃掉两个颜色相同的糖果。你最多可以吃多少天？\n\n### 输入格式\n\n第一行一个正整数 $t(1\\leq t \\leq 1000)$ 测试数据的数量。\n\n对于每组测试数据，在一行有三个正整数 $r,g,b(1\\leq r,g,b \\leq 10^8)$，表示每堆糖果的数量。\n\n### 输出格式\n\n对于每组测试数据，输出一个整数，表示最多可以吃的天数。\n\n翻译贡献者 U108949"
}