{
    "description": "This is the harder version of the problem. In this version, $ 1 \\le n \\le 10^6 $ and $ 0 \\leq a_i \\leq 10^6 $ . You can hack this problem if you locked it. But you can hack the previous problem only if you locked both problems\n\nChristmas is coming, and our protagonist, Bob, is preparing a spectacular present for his long-time best friend Alice. This year, he decides to prepare $ n $ boxes of chocolate, numbered from $ 1 $ to $ n $ . Initially, the $ i $ -th box contains $ a_i $ chocolate pieces.\n\nSince Bob is a typical nice guy, he will not send Alice $ n $ empty boxes. In other words, at least one of $ a_1, a_2, \\ldots, a_n $ is positive. Since Alice dislikes coprime sets, she will be happy only if there exists some integer $ k > 1 $ such that the number of pieces in each box is divisible by $ k $ . Note that Alice won't mind if there exists some empty boxes.\n\nCharlie, Alice's boyfriend, also is Bob's second best friend, so he decides to help Bob by rearranging the chocolate pieces. In one second, Charlie can pick up a piece in box $ i $ and put it into either box $ i-1 $ or box $ i+1 $ (if such boxes exist). Of course, he wants to help his friend as quickly as possible. Therefore, he asks you to calculate the minimum number of seconds he would need to make Alice happy.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\le n \\le 10^6 $ ) — the number of chocolate boxes.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le 10^6 $ ) — the number of chocolate pieces in the $ i $ -th box.\n\nIt is guaranteed that at least one of $ a_1, a_2, \\ldots, a_n $ is positive.",
    "outputFormat": "If there is no way for Charlie to make Alice happy, print $ -1 $ .\n\nOtherwise, print a single integer $ x $ — the minimum number of seconds for Charlie to help Bob make Alice happy.",
    "samples": [
        [
            "3\n4 8 5\n",
            "9\n"
        ],
        [
            "5\n3 10 2 1 5\n",
            "2\n"
        ],
        [
            "4\n0 5 15 10\n",
            "0\n"
        ],
        [
            "1\n1\n",
            "-1\n"
        ]
    ],
    "hint": "In the first example, Charlie can move all chocolate pieces to the second box. Each box will be divisible by $ 17 $ .\n\nIn the second example, Charlie can move a piece from box $ 2 $ to box $ 3 $ and a piece from box $ 4 $ to box $ 5 $ . Each box will be divisible by $ 3 $ .\n\nIn the third example, each box is already divisible by $ 5 $ .\n\nIn the fourth example, since Charlie has no available move, he cannot help Bob make Alice happy.",
    "translation": "$n$盒排成一列的糖果盒，每次可以取出某一盒一颗糖果放到相邻的糖果盒里\n\n问使得所有盒子的里的糖果数均能被某个$k(k>1)$整除的最少移动次数\n"
}