{
    "description": "This problem is different with hard version only by constraints on total answers length\n\nIt is an interactive problem\n\nVenya joined a tour to the madhouse, in which orderlies play with patients the following game. Orderlies pick a string $ s $ of length $ n $ , consisting only of lowercase English letters. The player can ask two types of queries:\n\n- ? l r – ask to list all substrings of $ s[l..r] $ . Substrings will be returned in random order, and in every substring, all characters will be randomly shuffled.\n- ! s – guess the string picked by the orderlies. This query can be asked exactly once, after that the game will finish. If the string is guessed correctly, the player wins, otherwise he loses.\n\nThe player can ask no more than $ 3 $ queries of the first type.\n\nTo make it easier for the orderlies, there is an additional limitation: the total number of returned substrings in all queries of the first type must not exceed $ (n+1)^2 $ .\n\nVenya asked you to write a program, which will guess the string by interacting with the orderlies' program and acting by the game's rules.\n\nYour program should immediately terminate after guessing the string using a query of the second type. In case your program guessed the string incorrectly, or it violated the game rules, it will receive verdict Wrong answer.\n\nNote that in every test case the string is fixed beforehand and will not change during the game, which means that the interactor is not adaptive.",
    "inputFormat": "First line contains number $ n $ ( $ 1 \\le n \\le 100 $ ) — the length of the picked string.",
    "outputFormat": "You start the interaction by reading the number $ n $ .\n\nTo ask a query about a substring from $ l $ to $ r $ inclusively ( $ 1 \\le l \\le r \\le n $ ), you should output\n\n? l r\n\non a separate line. After this, all substrings of $ s[l..r] $ will be returned in random order, each substring exactly once. In every returned substring all characters will be randomly shuffled.\n\nIn the case, if you ask an incorrect query, ask more than $ 3 $ queries of the first type or there will be more than $ (n+1)^2 $ substrings returned in total, you will receive verdict Wrong answer.\n\nTo guess the string $ s $ , you should output\n\n! s\n\non a separate line.\n\nAfter printing each query, do not forget to flush the output. Otherwise, you will get Idleness limit exceeded. To flush the output, you can use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see documentation for other languages.\n\nIf you received - (dash) as an answer to any query, you need to terminate your program with exit code 0 (for example, by calling exit(0)). This means that there was an error in the interaction protocol. If you don't terminate with exit code 0, you can receive any unsuccessful verdict.\n\nHack format\n\nTo hack a solution, use the following format:\n\nThe first line should contain one integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the length of the string, and the following line should contain the string $ s $ .",
    "samples": [
        [
            "4\n\na\naa\na\n\ncb\nb\nc\n\nc",
            "? 1 2\n\n? 3 4\n\n? 4 4\n\n! aabc"
        ]
    ],
    "hint": "",
    "translation": "本题和困难版的唯一区别是子串总长度的限制。\n\n这是一道交互题。\n\n有一个长度为 $n$ 的由小写字母组成的字符串，你需要通过两种操作得到整个字符串：\n\n- `? l r` ——列出 $s[l\\dots r]$ 的所有子串。子串返回的顺序会被随机打乱，并且在每一个子串中，字母的顺序也会被随机打乱。\n- `! s` ——表示你已经得到了 $s$。这个操作只能进行一次，进行完后游戏立即结束。\n\n你可以进行最多三次询问，同时所有子串的个数总和不能大于 $(n+1)^2$。\n\n注意测试点中的字符串是预先给定的，而不会根据你的询问而发生改变。"
}