{
    "description": "Anna and Maria are in charge of the math club for junior students. When the club gathers together, the students behave badly. They've brought lots of shoe laces to the club and got tied with each other. Specifically, each string ties together two students. Besides, if two students are tied, then the lace connects the first student with the second one as well as the second student with the first one.\n\nTo restore order, Anna and Maria do the following. First, for each student Anna finds out what other students he is tied to. If a student is tied to exactly one other student, Anna reprimands him. Then Maria gathers in a single group all the students who have been just reprimanded. She kicks them out from the club. This group of students immediately leaves the club. These students takes with them the laces that used to tie them. Then again for every student Anna finds out how many other students he is tied to and so on. And they do so until Anna can reprimand at least one student.\n\nDetermine how many groups of students will be kicked out of the club.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ — the initial number of students and laces (![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF129B/7728df3b74f07d3a2db1d898acbc148a6e9ffaa3.png)). The students are numbered from $ 1 $ to $ n $ , and the laces are numbered from $ 1 $ to $ m $ . Next $ m $ lines each contain two integers $ a $ and $ b $ — the numbers of students tied by the $ i $ -th lace ( $ 1<=a,b<=n,a≠b $ ). It is guaranteed that no two students are tied with more than one lace. No lace ties a student to himself.",
    "outputFormat": "Print the single number — the number of groups of students that will be kicked out from the club.",
    "samples": [
        [
            "3 3\n1 2\n2 3\n3 1\n",
            "0\n"
        ],
        [
            "6 3\n1 2\n2 3\n3 4\n",
            "2\n"
        ],
        [
            "6 5\n1 4\n2 4\n3 4\n5 4\n6 4\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample Anna and Maria won't kick out any group of students — in the initial position every student is tied to two other students and Anna won't be able to reprimand anyone.\n\nIn the second sample four students are tied in a chain and two more are running by themselves. First Anna and Maria kick out the two students from both ends of the chain (1 and 4), then — two other students from the chain (2 and 3). At that the students who are running by themselves will stay in the club.\n\nIn the third sample Anna and Maria will momentarily kick out all students except for the fourth one and the process stops at that point. The correct answer is one.",
    "translation": "### 题目描述\r\n\r\n小贝和小聪是俱乐部的管理人员。当俱乐部聚会时，学生们又开始捣乱。他们带来很多鞋带，并且用鞋带将大家相互捆绑起来，每根鞋带捆住两个学生。\r\n\r\n为了恢复秩序，小贝和小聪采取了以下措施。首先，对于每位学生，小贝检查他和哪些学生捆在一起。如果和这个学生捆在一起的学生人数等于1，小贝就将这个学生记录在案。小贝检查完每位学生后，小聪就将这些被记录的学生分到一个组中，并将这组学生踢出俱乐部。这组学生立刻离开俱乐部，同时将捆着他们的鞋带也一起带走。这组学生离开后，小贝和小聪继续重复上述的过程，直到没有学生可以被记录下来为止。\r\n\r\n请确定总共有多少组学生被踢出俱乐部。\r\n\r\n### 输入格式\r\n\r\n第一行包含两个整数n和m分别表示刚开始的学生数量和鞋带数量(![图片](http://codeforces.com/predownloaded/71/d0/71d028b02d9dc63a3c5b31c7dff711ec27569a4c.png))。学生们从1到n进行编号，鞋带从1到m进行编号。接下来m行，每行包含两个整数a和b，表示被第i根鞋带捆住的两位学生的编号(1 ≤ a, b ≤ n, a ≠ b)。输入保证没有一对学生被多于一根的鞋带捆住。\r\n\r\n### 输出格式\r\n\r\n输出一个整数，表示被踢出俱乐部的学生组数。\r\n\r\n### 样例说明\r\n\r\n在第一个样例中，小贝和小聪不会踢掉任何学生，因为每位学生都和另外两位学生捆在一起。\r\n\r\n在第二个样例中，有4名学生依次捆成一条“链”，还有2名学生没有被捆。小贝和小聪会先将“链”两端的学生（1号和4号）作为一组踢走，再将2号和3号作为一组踢走，所以答案为2。\r\n\r\n在第三组样例中，除了4号学生，其他学生会作为一组一起被踢走，所以答案为1。"
}