{
    "description": "In addition to complaints about lighting, a lot of complaints about insufficient radio signal covering has been received by Bertown city hall recently. $ n $ complaints were sent to the mayor, all of which are suspiciosly similar to each other: in the $ i $ -th complaint, one of the radio fans has mentioned that the signals of two radio stations $ x_i $ and $ y_i $ are not covering some parts of the city, and demanded that the signal of at least one of these stations can be received in the whole city.\n\nOf cousre, the mayor of Bertown is currently working to satisfy these complaints. A new radio tower has been installed in Bertown, it can transmit a signal with any integer power from $ 1 $ to $ M $ (let's denote the signal power as $ f $ ). The mayor has decided that he will choose a set of radio stations and establish a contract with every chosen station. To establish a contract with the $ i $ -th station, the following conditions should be met:\n\n- the signal power $ f $ should be not less than $ l_i $ , otherwise the signal of the $ i $ -th station won't cover the whole city;\n- the signal power $ f $ should be not greater than $ r_i $ , otherwise the signal will be received by the residents of other towns which haven't established a contract with the $ i $ -th station.\n\nAll this information was already enough for the mayor to realise that choosing the stations is hard. But after consulting with specialists, he learned that some stations the signals of some stations may interfere with each other: there are $ m $ pairs of stations ( $ u_i $ , $ v_i $ ) that use the same signal frequencies, and for each such pair it is impossible to establish contracts with both stations. If stations $ x $ and $ y $ use the same frequencies, and $ y $ and $ z $ use the same frequencies, it does not imply that $ x $ and $ z $ use the same frequencies.\n\nThe mayor finds it really hard to analyze this situation, so he hired you to help him. You have to choose signal power $ f $ and a set of stations to establish contracts with such that:\n\n- all complaints are satisfied (formally, for every $ i \\in [1, n] $ the city establishes a contract either with station $ x_i $ , or with station $ y_i $ );\n- no two chosen stations interfere with each other (formally, for every $ i \\in [1, m] $ the city does not establish a contract either with station $ u_i $ , or with station $ v_i $ );\n- for each chosen station, the conditions on signal power are met (formally, for each chosen station $ i $ the condition $ l_i \\le f \\le r_i $ is met).",
    "inputFormat": "The first line contains $ 4 $ integers $ n $ , $ p $ , $ M $ and $ m $ ( $ 2 \\le n, p, M, m \\le 4 \\cdot 10^5 $ ) — the number of complaints, the number of radio stations, maximum signal power and the number of interfering pairs, respectively.\n\nThen $ n $ lines follow, which describe the complains. Each line contains two integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i < y_i \\le p $ ) — the indices of the radio stations mentioned in the $ i $ -th complaint). All complaints are distinct.\n\nThen $ p $ lines follow, which describe the radio stations. Each line contains two integers $ l_i $ and $ r_i $ ( $ 1 \\le l_i \\le r_i \\le M $ ) — the constrains on signal power that should be satisfied if the city establishes a contract with the $ i $ -th station.\n\nThen $ m $ lines follow, which describe the pairs of interfering radio stations. Each line contains two integers $ u_i $ and $ v_i $ ( $ 1 \\le u_i < v_i \\le p $ ) — the indices of interfering radio stations. All these pairs are distinct.",
    "outputFormat": "If it is impossible to choose signal power and a set of stations to meet all conditions, print $ -1 $ .\n\nOtherwise print two integers $ k $ and $ f $ in the first line — the number of stations in the chosen set and the chosen signal power, respectively. In the second line print $ k $ distinct integers from $ 1 $ to $ p $ — the indices of stations to establish contracts with (in any order). If there are multiple answers, print any of them; you don't have to minimize/maximize the number of chosen stations, and the same applies to signal power.",
    "samples": [
        [
            "2 4 4 2\n1 3\n2 3\n1 4\n1 2\n3 4\n1 4\n1 2\n3 4\n",
            "2 3\n1 3 "
        ],
        [
            "2 4 4 2\n1 3\n2 4\n1 2\n1 2\n3 4\n3 4\n1 2\n3 4\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "有 $p$ 种电站，需要选择一种电站序列使其满足：\n\n- $n$ 对 $(x,y)$，$x$ 电站或 $y$ 电站中至少有一个\n- $m$ 对 $(x,y)$，$x$ 电站或 $y$ 电站中最多有一个\n\n\n\n- 第 $i$ 种电站有两个参数 $li$ 和 $ri$ $(1<=li<=ri<=M)$，表示其覆盖的区间为$[li,ri]$。若选定一个电站序列，序列中所有电站覆盖区间的交集不能为空。要求若求得一种合法电站序列，输出交集中任意一个点。\n"
}