{
    "description": "As you might already know, space has always been a problem in ICPC Jakarta. To cope with this, ICPC Jakarta is planning to build two new buildings. These buildings should have a shape of a rectangle of the same size. Now, their problem is to find land to build the buildings.\n\nThere are $ N $ lands available for sale. The $ i^{th} $ land has a rectangular shape of size $ L_i \\times W_i $ . For a good feng shui, the building's side should be parallel to the land's sides.\n\nOne way is to build the two buildings on two different lands, one on each land (not necessarily with the same orientation). A building of size $ A \\times B $ can be build on the $ i^{th} $ land if and only if at least one of the following is satisfied:\n\n- $ A \\le L_i $ and $ B \\le W_i $ , or\n- $ A \\le W_i $ and $ B \\le L_i $ .\n\n Alternatively, it is also possible to build two buildings of $ A \\times B $ on the $ i^{th} $ land with the same orientation. Formally, it is possible to build two buildings of $ A \\times B $ on the $ i^{th} $ land if and only if at least one of the following is satisfied: - $ A \\times 2 \\le L_i $ and $ B \\le W_i $ , or\n- $ A \\times 2 \\le W_i $ and $ B \\le L_i $ , or\n- $ A \\le L_i $ and $ B \\times 2 \\le W_i $ , or\n- $ A \\le W_i $ and $ B \\times 2 \\le L_i $ .\n\nYour task in this problem is to help ICPC Jakarta to figure out the largest possible buildings they can build given $ N $ available lands. Note that ICPC Jakarta has to build two buildings of $ A \\times B $ ; output the largest possible for $ A \\times B $ .",
    "inputFormat": "Input begins with a line containing an integer: $ N $ ( $ 1 \\le N \\le 100\\,000 $ ) representing the number of available lands. The next $ N $ lines each contains two integers: $ L_i $ $ W_i $ ( $ 1 \\le L_i, W_i \\le 10^9 $ ) representing the size of the land.",
    "outputFormat": "Output in a line a number representing the largest building that ICPC Jakarta can build with exactly one decimal point (see sample input/output for clarity).",
    "samples": [
        [
            "2\n5 5\n3 4\n",
            "12.5\n"
        ],
        [
            "2\n2 5\n4 3\n",
            "8.0\n"
        ],
        [
            "3\n10 1\n9 8\n7 6\n",
            "42.0\n"
        ]
    ],
    "hint": "Explanation for the sample input/output #1\n\nTwo buildings of $ 2.5 \\times 5 $ can be built both on the first land.\n\nExplanation for the sample input/output #2\n\nTwo buildings of $ 2 \\times 4 $ can be built each on the first and second lands.\n\nExplanation for the sample input/output #3\n\nTwo buildings of $ 7 \\times 6 $ can be built each on the second and third lands."
}