{
    "description": "Ivan plays an old action game called Heretic. He's stuck on one of the final levels of this game, so he needs some help with killing the monsters.\n\nThe main part of the level is a large corridor (so large and narrow that it can be represented as an infinite coordinate line). The corridor is divided into two parts; let's assume that the point $ x = 0 $ is where these parts meet.\n\nThe right part of the corridor is filled with $ n $ monsters — for each monster, its initial coordinate $ x_i $ is given (and since all monsters are in the right part, every $ x_i $ is positive).\n\nThe left part of the corridor is filled with crusher traps. If some monster enters the left part of the corridor or the origin (so, its current coordinate becomes less than or equal to $ 0 $ ), it gets instantly killed by a trap.\n\nThe main weapon Ivan uses to kill the monsters is the Phoenix Rod. It can launch a missile that explodes upon impact, obliterating every monster caught in the explosion and throwing all other monsters away from the epicenter. Formally, suppose that Ivan launches a missile so that it explodes in the point $ c $ . Then every monster is either killed by explosion or pushed away. Let some monster's current coordinate be $ y $ , then:\n\n- if $ c = y $ , then the monster is killed;\n- if $ y < c $ , then the monster is pushed $ r $ units to the left, so its current coordinate becomes $ y - r $ ;\n- if $ y > c $ , then the monster is pushed $ r $ units to the right, so its current coordinate becomes $ y + r $ .\n\nIvan is going to kill the monsters as follows: choose some integer point $ d $ and launch a missile into that point, then wait until it explodes and all the monsters which are pushed to the left part of the corridor are killed by crusher traps, then, if at least one monster is still alive, choose another integer point (probably the one that was already used) and launch a missile there, and so on.\n\nWhat is the minimum number of missiles Ivan has to launch in order to kill all of the monsters? You may assume that every time Ivan fires the Phoenix Rod, he chooses the impact point optimally.\n\nYou have to answer $ q $ independent queries.",
    "inputFormat": "The first line contains one integer $ q $ ( $ 1 \\le q \\le 10^5 $ ) — the number of queries.\n\nThe first line of each query contains two integers $ n $ and $ r $ ( $ 1 \\le n, r \\le 10^5 $ ) — the number of enemies and the distance that the enemies are thrown away from the epicenter of the explosion.\n\nThe second line of each query contains $ n $ integers $ x_i $ ( $ 1 \\le x_i \\le 10^5 $ ) — the initial positions of the monsters.\n\nIt is guaranteed that sum of all $ n $ over all queries does not exceed $ 10^5 $ .",
    "outputFormat": "For each query print one integer — the minimum number of shots from the Phoenix Rod required to kill all monsters.",
    "samples": [
        [
            "2\n3 2\n1 3 5\n4 1\n5 2 3 5\n",
            "2\n2\n"
        ]
    ],
    "hint": "In the first test case, Ivan acts as follows:\n\n- choose the point $ 3 $ , the first monster dies from a crusher trap at the point $ -1 $ , the second monster dies from the explosion, the third monster is pushed to the point $ 7 $ ;\n- choose the point $ 7 $ , the third monster dies from the explosion.\n\nIn the second test case, Ivan acts as follows:\n\n- choose the point $ 5 $ , the first and fourth monsters die from the explosion, the second monster is pushed to the point $ 1 $ , the third monster is pushed to the point $ 2 $ ;\n- choose the point $ 2 $ , the first monster dies from a crusher trap at the point $ 0 $ , the second monster dies from the explosion.",
    "translation": "一个水平的坐标轴，怪兽都在原点右边（xi>0），若使得（xi<=0）则怪兽死亡。\n\n当在c点发射导弹，则：\n- y=c：怪兽死亡\n- y<c：怪兽向左移动r个单位，坐标变为 y\n-r\n- y>c：怪兽向右移动r个单位，坐标为y+r\n\n为了杀死怪兽，至少要发射多少导弹。"
}