{
    "description": "DLS and JLS are bored with a Math lesson. In order to entertain themselves, DLS took a sheet of paper and drew $ n $ distinct lines, given by equations $ y = x + p_i $ for some distinct $ p_1, p_2, \\ldots, p_n $ .\n\nThen JLS drew on the same paper sheet $ m $ distinct lines given by equations $ y = -x + q_i $ for some distinct $ q_1, q_2, \\ldots, q_m $ .\n\nDLS and JLS are interested in counting how many line pairs have integer intersection points, i.e. points with both coordinates that are integers. Unfortunately, the lesson will end up soon, so DLS and JLS are asking for your help.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ), the number of test cases in the input. Then follow the test case descriptions.\n\nThe first line of a test case contains an integer $ n $ ( $ 1 \\le n \\le 10^5 $ ), the number of lines drawn by DLS.\n\nThe second line of a test case contains $ n $ distinct integers $ p_i $ ( $ 0 \\le p_i \\le 10^9 $ ) describing the lines drawn by DLS. The integer $ p_i $ describes a line given by the equation $ y = x + p_i $ .\n\nThe third line of a test case contains an integer $ m $ ( $ 1 \\le m \\le 10^5 $ ), the number of lines drawn by JLS.\n\nThe fourth line of a test case contains $ m $ distinct integers $ q_i $ ( $ 0 \\le q_i \\le 10^9 $ ) describing the lines drawn by JLS. The integer $ q_i $ describes a line given by the equation $ y = -x + q_i $ .\n\nThe sum of the values of $ n $ over all test cases in the input does not exceed $ 10^5 $ . Similarly, the sum of the values of $ m $ over all test cases in the input does not exceed $ 10^5 $ .\n\nIn hacks it is allowed to use only one test case in the input, so $ t=1 $ should be satisfied.",
    "outputFormat": "For each test case in the input print a single integer — the number of line pairs with integer intersection points.",
    "samples": [
        [
            "3\n3\n1 3 2\n2\n0 3\n1\n1\n1\n1\n1\n2\n1\n1\n",
            "3\n1\n0\n"
        ]
    ],
    "hint": "The picture shows the lines from the first test case of the example. Black circles denote intersection points with integer coordinates.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1248A/8a7326901424797e600db27d56ff13441fc9fe8a.png)",
    "translation": "有一个长度为n的序列p1，p2...pn，代表n条直线 y=x+pi\n\n有一个长度为m的序列q1，q2...qm，代表m条直线 y=-x+qi\n\n问这n+m条直线之间有多少个整数交点。"
}