{
    "description": "The only difference between easy and hard versions is constraints.\n\nThe BerTV channel every day broadcasts one episode of one of the $ k $ TV shows. You know the schedule for the next $ n $ days: a sequence of integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le k $ ), where $ a_i $ is the show, the episode of which will be shown in $ i $ -th day.\n\nThe subscription to the show is bought for the entire show (i.e. for all its episodes), for each show the subscription is bought separately.\n\nHow many minimum subscriptions do you need to buy in order to have the opportunity to watch episodes of purchased shows $ d $ ( $ 1 \\le d \\le n $ ) days in a row? In other words, you want to buy the minimum number of TV shows so that there is some segment of $ d $ consecutive days in which all episodes belong to the purchased shows.",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\le t \\le 10000 $ ) — the number of test cases in the input. Then $ t $ test case descriptions follow.\n\nThe first line of each test case contains three integers $ n, k $ and $ d $ ( $ 1 \\le n \\le 2\\cdot10^5 $ , $ 1 \\le k \\le 10^6 $ , $ 1 \\le d \\le n $ ). The second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le k $ ), where $ a_i $ is the show that is broadcasted on the $ i $ -th day.\n\nIt is guaranteed that the sum of the values ​​of $ n $ for all test cases in the input does not exceed $ 2\\cdot10^5 $ .",
    "outputFormat": "Print $ t $ integers — the answers to the test cases in the input in the order they follow. The answer to a test case is the minimum number of TV shows for which you need to purchase a subscription so that you can watch episodes of the purchased TV shows on BerTV for $ d $ consecutive days. Please note that it is permissible that you will be able to watch more than $ d $ days in a row.",
    "samples": [
        [
            "4\n5 2 2\n1 2 1 2 1\n9 3 3\n3 3 3 2 2 2 1 1 1\n4 10 4\n10 8 6 4\n16 9 8\n3 1 4 1 5 9 2 6 5 3 5 8 9 7 9 3\n",
            "2\n1\n4\n5\n"
        ]
    ],
    "hint": "In the first test case to have an opportunity to watch shows for two consecutive days, you need to buy a subscription on show $ 1 $ and on show $ 2 $ . So the answer is two.\n\nIn the second test case, you can buy a subscription to any show because for each show you can find a segment of three consecutive days, consisting only of episodes of this show.\n\nIn the third test case in the unique segment of four days, you have four different shows, so you need to buy a subscription to all these four shows.\n\nIn the fourth test case, you can buy subscriptions to shows $ 3,5,7,8,9 $ , and you will be able to watch shows for the last eight days.",
    "translation": "### 题目描述\r\n\r\n给你一个序列$a_1, a_2, \\dots, a_n$,$1 \\le a_i \\le k$,请你找出最小的$s$。\r\n\r\n要求存在一段长为$d$的区间，有且只有$s$种数。\r\n\r\n### 输入输出格式\r\n\r\n第一个数为数据组数T\r\n\r\n对于每组数据输入两行，第一行为给定的$n$,$k$,$d$,第二行为数列$a$.\r\n\r\n### 输入样例\r\n\r\ninput：\r\n\r\n```\r\n4\r\n5 2 2\r\n1 2 1 2 1\r\n9 3 3\r\n3 3 3 2 2 2 1 1 1\r\n4 10 4\r\n10 8 6 4\r\n16 9 8\r\n3 1 4 1 5 9 2 6 5 3 5 8 9 7 9 3\r\n```\r\n\r\noutput：\r\n\r\n```\r\n2\r\n1\r\n4\r\n5\r\n```\r\n\r\n### 数据范围与提示\r\n\r\n对于所有数据，$1 \\le n \\le 2\\cdot10^5$,$1 \\le k \\le 10^6$,$1 \\le d \\le n$."
}