{
    "description": "Mr. Scrooge, a very busy man, decided to count the time he wastes on all sorts of useless stuff to evaluate the lost profit. He has already counted the time he wastes sleeping and eating. And now Mr. Scrooge wants to count the time he has wasted signing papers.\n\nMr. Scrooge's signature can be represented as a polyline $ A_{1}A_{2}...\\ A_{n} $ . Scrooge signs like that: first it places a pen at the point $ A_{1} $ , then draws a segment from point $ A_{1} $ to point $ A_{2} $ , then he draws a segment from point $ A_{2} $ to point $ A_{3} $ and so on to point $ A_{n} $ , where he stops signing and takes the pen off the paper. At that the resulting line can intersect with itself and partially repeat itself but Scrooge pays no attention to it and never changes his signing style. As Scrooge makes the signature, he never takes the pen off the paper and his writing speed is constant — $ 50 $ millimeters per second.\n\nScrooge signed exactly $ k $ papers throughout his life and all those signatures look the same.\n\nFind the total time Scrooge wasted signing the papers.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 2<=n<=100 $ , $ 1<=k<=1000 $ ). Each of the following $ n $ lines contains the coordinates of the polyline's endpoints. The $ i $ -th one contains coordinates of the point $ A_{i} $ — integers $ x_{i} $ and $ y_{i} $ , separated by a space.\n\nAll points $ A_{i} $ are different. The absolute value of all coordinates does not exceed $ 20 $ . The coordinates are measured in millimeters.",
    "outputFormat": "Print one real number — the total time Scrooges wastes on signing the papers in seconds. The absolute or relative error should not exceed $ 10^{-6} $ .",
    "samples": [
        [
            "2 1\n0 0\n10 0\n",
            "0.200000000"
        ],
        [
            "5 10\n3 1\n-5 6\n-2 -1\n3 2\n10 0\n",
            "6.032163204"
        ],
        [
            "6 10\n5 0\n4 0\n6 0\n3 0\n7 0\n2 0\n",
            "3.000000000"
        ]
    ],
    "hint": "",
    "translation": "题意：给n个点的坐标，然后在纸上用折线将这n个点连起来，一共有k张纸，连线速度为50/second ，求所用时间。"
}