{
    "description": "Tanya likes cartoons. She knows that $ n $ new cartoons will be released in his favorite cinema: the $ i $ -th of them will be airing from the day $ a_i $ to the day $ b_i $ ( $ 1 \\le a_i \\le b_i \\le 10^9 $ ).\n\nThe cinema has a special offer: there is a huge discount every day when only one cartoon is airing.\n\nTanya doesn't care which cartoon she will watch but she'd like to save some money. That's why she asks you to find any day $ x $ when only one cartoon will be airing. Formally: find $ x $ such that there is exactly one $ i $ ( $ 1 \\le i \\le n $ ) with $ a_i \\le x \\le b_i $ . If there are several possible answers, print any of them. If there is no such day, print -1.",
    "inputFormat": "The first line contains single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases. The following are descriptions of the $ t $ test cases.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 2000 $ ) — the number of cartoons.\n\nIn the next $ n $ lines, the cartoons themselves are described, one per line, by a pair of integers $ a_i $ , $ b_i $ ( $ 1 \\le a_i \\le b_i \\le 10^9 $ ) — the first and last airing days for the $ i $ -th cartoon.\n\nIt is guaranteed that the sum of the values $ n $ for all test cases in the input does not exceed $ 2000 $ .",
    "outputFormat": "Print $ t $ answers to given test cases in the order in which they appear in the input: the $ i $ -th answer is such $ x $ , that only one cartoon will be airing on day $ x $ or -1 if there are no such days.",
    "samples": [
        [
            "5\n1\n1 1\n3\n2 1000000000\n2 500000000\n500000002 1000000000\n3\n1 2\n3 4\n1 4\n2\n4 11\n4 9\n3\n1 5\n10 10\n1 5",
            "1\n500000001\n-1\n10\n10"
        ]
    ],
    "hint": "In the third test case: at day $ 1 $ and $ 2 $ , first and third cartoons will be airing, and days $ 3 $ and $ 4 $ , second and third cartoons will be airing. So, there is no day when only one cartoon will be airing.\n\nIn the fourth test case, $ 11 $ is also a possible answer."
}