{
    "description": "A large-scale conference on unnatural sciences is going to be held soon in Berland! In total, $ n $ scientists from all around the world have applied. All of them have indicated a time segment when they will attend the conference: two integers $ l_i $ , $ r_i $ — day of arrival and day of departure.\n\nAlso, some of the scientists have indicated their country, while some preferred not to. So, each scientist also has a value $ c_i $ , where:\n\n- $ c_i > 0 $ , if the scientist is coming from country $ c_i $ (all countries are numbered from $ 1 $ to $ 200 $ );\n- $ c_i = 0 $ , if the scientist preferred to not indicate the country.\n\nEveryone knows that it is interesting and useful to chat with representatives of other countries! A participant of the conference will be upset if she will not meet people from other countries during the stay. It is possible to meet people during all time of stay, including the day of arrival and the day of departure.\n\nConference organizers need to be ready for the worst! They are interested in the largest number $ x $ , that it is possible that among all people attending the conference exactly $ x $ will be upset.\n\nHelp the organizers to find the maximum number of upset scientists.",
    "inputFormat": "The first line of the input contains integer $ t $ ( $ 1 \\le t \\le 100 $ ) — number of test cases. Then the test cases follow.\n\nThe first line of each test case contains integer $ n $ ( $ 1 \\le n \\le 500 $ ) — the number of registered conference participants.\n\nNext $ n $ lines follow, each containing three integers $ l_i $ , $ r_i $ , $ c_i $ ( $ 1 \\le l_i \\le r_i \\le 10^6 $ , $ 0 \\le c_i \\le 200 $ ) — the day of arrival, the day of departure and the country (or the fact that it was not indicated) for the $ i $ -th participant.\n\nThe sum of $ n $ among all test cases in the input does not exceed $ 500 $ .",
    "outputFormat": "Output $ t $ integers — maximum number of upset scientists for each test case.",
    "samples": [
        [
            "2\n4\n1 10 30\n5 6 30\n6 12 0\n1 1 0\n4\n1 2 1\n2 3 0\n3 4 0\n4 5 2\n",
            "4\n2\n"
        ]
    ],
    "hint": "",
    "translation": "**题目描述**\r\n\r\n一个大型会议即将在柏林召开，全世界共有$n$位科学家将出席会议。他们都表明了他们将出席会议的时间段：两个整数$l_i$和$r_i$，分别表示抵达日和离开日。\r\n\r\n此外，一些科学家已经表明了他们的国家，而一些人没有。因此，每个科学家也有一个值$c_i$，其中：\r\n\r\n- $c_i>0$ 时表示第$i$个科学家来自编号为$c_i$的国家（$1\\leq c_i\\leq 200$）；\r\n\r\n- $c_i=0$ 时表示该科学家尚未透露国家。\r\n\r\n如果与会者在逗留期间不与其他国家的人见面，TA 会感到不高兴。在所有逗留期间，包括抵达日和离开日，都有可能与人见面。\r\n\r\n会议组织者需要做好最坏的准备！他们对人数最多的$x$感兴趣，有可能在所有出席会议的人中，$x$会感到不高兴。\r\n\r\n请编写程序算出最不高兴的科学家。\r\n\r\n**输入格式**\r\n\r\n本题包含**多组数据**。\r\n\r\n第一行包含一个整数$t$（$1\\leq t\\le 100$），表示数据组数。\r\n\r\n每组数据的第一行包含一个整数$n$（$1\\leq n\\le 500$），表示科学家总人数。\r\n\r\n以下$n$行，每行包含三个整数$l_i$，$r_i$和$c_i$（$1\\leq l_i,r_i\\le 10^6$，$0\\leq c_i\\le 200$），意义如上所述。\r\n\r\n数据保证所有测试用例的n之和不超过500。\r\n\r\n**输出格式**\r\n\r\n输出共$t$行，第$i$行的数表示对于第$i$组数据中最不高兴的科学家。"
}