{
    "description": "You are given a tournament — complete directed graph.\n\nIn one operation you can pick any vertex $ v $ and change the direction of all edges with $ v $ on one of the ends (i.e all edges $ u \\to v $ change their orientation to $ v \\to u $ and vice versa).\n\nYou want to make the tournament strongly connected with the smallest possible number of such operations if it is possible.\n\nAlso, if it is possible, you need to find the number of ways to make this number of operations to make graph strongly connected (two ways are different if for some $ i $ vertex that we chose on $ i $ -th operation in one way is different from vertex that we chose on $ i $ -th operation in another way). You only need to find this value modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "The first line of input contains one integer $ n $ ( $ 3 \\leq n \\leq 2000 $ ): the number of vertices in the tournament.\n\nFollowing $ n $ lines contain a description of the given tournament, each of them contains a binary string of length $ n $ . If $ j $ -th character of $ i $ -th string is equal to '1', then the graph has an edge $ i \\to j $ .\n\nIt is guaranteed that there are no edges $ i \\to i $ and the graph has exactly one edge among $ i \\to j $ and $ j \\to i $ for different $ i $ and $ j $ .",
    "outputFormat": "If it is not possible to convert tournament to strongly connected with the given operations, output \"-1\".\n\nOtherwise, output two integers: the smallest number of operations that you need to make the given graph strongly connected and the number of ways to do this number of operations to make graph strongly connected, modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "3\n010\n001\n100\n",
            "0 1\n"
        ],
        [
            "4\n0010\n1000\n0100\n1110\n",
            "-1\n"
        ],
        [
            "6\n010000\n001000\n100000\n111001\n111100\n111010\n",
            "2 18\n"
        ]
    ],
    "hint": "",
    "translation": "给定一张 $n$ 个点的竞赛图，定义一次操作为选取一个顶点 $v$ 并翻转所有以 $v$ 为顶点的边的方向。\n\n请你判断是否存在一种操作方案使得操作完成后，这个图是**强连通**的。如果存在，求出最小的操作次数，以及使得操作次数达到最小的操作方案数。其中，方案数对 $998244353$ 取模。\n\nNote: 有向图 $G$ 是强连通的，当且仅当对于任意有序顶点对 $(x,y)$，$G$ 中存在一条从 $x$ 到 $y$ 的路径。\n\n保证 $3\\le n\\le 2000$。"
}