{
    "description": "Consider a square grid with $ h $ rows and $ w $ columns with some dominoes on it. Each domino covers exactly two cells of the grid that share a common side. Every cell is covered by at most one domino.\n\nLet's call a placement of dominoes on the grid perfectly balanced if no row and no column contains a pair of cells covered by two different dominoes. In other words, every row and column may contain no covered cells, one covered cell, or two covered cells that belong to the same domino.\n\nYou are given a perfectly balanced placement of dominoes on a grid. Find the number of ways to place zero or more extra dominoes on this grid to keep the placement perfectly balanced. Output this number modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "The first line contains three integers $ h $ , $ w $ , and $ n $ ( $ 1 \\le h, w \\le 3600 $ ; $ 0 \\le n \\le 2400 $ ), denoting the dimensions of the grid and the number of already placed dominoes. The rows are numbered from $ 1 $ to $ h $ , and the columns are numbered from $ 1 $ to $ w $ .\n\nEach of the next $ n $ lines contains four integers $ r_{i, 1}, c_{i, 1}, r_{i, 2}, c_{i, 2} $ ( $ 1 \\le r_{i, 1} \\le r_{i, 2} \\le h $ ; $ 1 \\le c_{i, 1} \\le c_{i, 2} \\le w $ ), denoting the row id and the column id of the cells covered by the $ i $ -th domino. Cells $ (r_{i, 1}, c_{i, 1}) $ and $ (r_{i, 2}, c_{i, 2}) $ are distinct and share a common side.\n\nThe given domino placement is perfectly balanced.",
    "outputFormat": "Output the number of ways to place zero or more extra dominoes on the grid to keep the placement perfectly balanced, modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "5 7 2\n3 1 3 2\n4 4 4 5\n",
            "8\n"
        ],
        [
            "5 4 2\n1 2 2 2\n4 3 4 4\n",
            "1\n"
        ],
        [
            "23 42 0\n",
            "102848351\n"
        ]
    ],
    "hint": "In the first example, the initial grid looks like this:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1237F/23d2c7832fa87b26433f4443e57f8a2c61335a78.png)\n\nHere are $ 8 $ ways to place zero or more extra dominoes to keep the placement perfectly balanced:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1237F/f39e74c5e6c5abc41daa487ad47333c83b2084c2.png)\n\nIn the second example, the initial grid looks like this:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1237F/7739b264ee73fb643402600eb5d0f9454c11a61d.png)\n\nNo extra dominoes can be placed here.",
    "translation": "给你一个$n\\times m$的棋盘，上面已经放了$k$个的骨牌（$1\\times2$）\r\n\r\n对于一个骨牌的每个格子，不能有其他骨牌的格子和它在同一列，同一行\r\n\r\n你可以在剩下的格子里放骨牌，也可以不放\r\n\r\n问这个棋盘有多少种放骨牌的方案，对$998244353$取模\r\n\r\n$1\\le n,m\\le3600,0\\le k\\le2400$"
}