{
    "description": "Three planets $ X $ , $ Y $ and $ Z $ within the Alpha planetary system are inhabited with an advanced civilization. The spaceports of these planets are connected by interplanetary space shuttles. The flight scheduler should decide between $ 1 $ , $ 2 $ and $ 3 $ return flights for every existing space shuttle connection. Since the residents of Alpha are strong opponents of the symmetry, there is a strict rule that any two of the spaceports connected by a shuttle must have a different number of flights.\n\nFor every pair of connected spaceports, your goal is to propose a number $ 1 $ , $ 2 $ or $ 3 $ for each shuttle flight, so that for every two connected spaceports the overall number of flights differs.\n\nYou may assume that:\n\n1\\) Every planet has at least one spaceport\n\n2\\) There exist only shuttle flights between spaceports of different planets\n\n3\\) For every two spaceports there is a series of shuttle flights enabling traveling between them\n\n4\\) Spaceports are not connected by more than one shuttle",
    "inputFormat": "The first row of the input is the integer number $ N $ $ (3 \\leq N \\leq 100 000) $ , representing overall number of spaceports. The second row is the integer number $ M $ $ (2 \\leq M \\leq 100 000) $ representing number of shuttle flight connections.\n\nThird row contains $ N $ characters from the set $ \\{X, Y, Z\\} $ . Letter on $ I^{th} $ position indicates on which planet is situated spaceport $ I $ . For example, \"XYYXZZ\" indicates that the spaceports $ 0 $ and $ 3 $ are located at planet $ X $ , spaceports $ 1 $ and $ 2 $ are located at $ Y $ , and spaceports $ 4 $ and $ 5 $ are at $ Z $ .\n\nStarting from the fourth row, every row contains two integer numbers separated by a whitespace. These numbers are natural numbers smaller than $ N $ and indicate the numbers of the spaceports that are connected. For example, \" $ 12\\ 15 $ \" indicates that there is a shuttle flight between spaceports $ 12 $ and $ 15 $ .",
    "outputFormat": "The same representation of shuttle flights in separate rows as in the input, but also containing a third number from the set $ \\{1, 2, 3\\} $ standing for the number of shuttle flights between these spaceports.",
    "samples": [
        [
            "10\n15\nXXXXYYYZZZ\n0 4\n0 5\n0 6\n4 1\n4 8\n1 7\n1 9\n7 2\n7 5\n5 3\n6 2\n6 9\n8 2\n8 3\n9 3\n",
            "0 4 2\n0 5 2\n0 6 2\n4 1 1\n4 8 1\n1 7 2\n1 9 3\n7 2 2\n7 5 1\n5 3 1\n6 2 1\n6 9 1\n8 2 3\n8 3 1\n9 3 1\n"
        ]
    ],
    "hint": "",
    "translation": "给你一个 $\\text{n}$ 个点，$\\text{m}$ 条双向边的一个联通图。\n\n其中，图上的每个点都被包含于三个集合中的唯一一个。\n\n题目保证，每个集合中至少有一个点，并且所有的边只会连在两个不在同一集合中的点上。\n\n现在你可以为每一条边赋一个权值 $1,2~or~3$。\n\n定义每个点的权值为所有与它相连的边的权值之和。\n\n你要使得图中每两个有边所连接的点的权值不同。\n\n求赋权方案。\n\n$3 \\leq n \\leq 100 000$。\n\n$2 \\leq m \\leq 100 000$。"
}