{
    "description": "It's Petya's birthday party and his friends have presented him a brand new \"Electrician- $ n $ \" construction set, which they are sure he will enjoy as he always does with weird puzzles they give him.\n\nConstruction set \"Electrician- $ n $ \" consists of $ 2n - 1 $ wires and $ 2n $ light bulbs. Each bulb has its own unique index that is an integer from $ 1 $ to $ 2n $ , while all wires look the same and are indistinguishable. In order to complete this construction set one has to use each of the wires to connect two distinct bulbs. We define a chain in a completed construction set as a sequence of distinct bulbs of length at least two, such that every two consecutive bulbs in this sequence are directly connected by a wire. Completed construction set configuration is said to be correct if a resulting network of bulbs and wires has a tree structure, i.e. any two distinct bulbs are the endpoints of some chain.\n\nPetya was assembling different configurations for several days, and he noticed that sometimes some of the bulbs turn on. After a series of experiments he came up with a conclusion that bulbs indexed $ 2i $ and $ 2i - 1 $ turn on if the chain connecting them consists of exactly $ d_i $ wires. Moreover, the following important condition holds: the value of $ d_i $ is never greater than $ n $ .\n\nPetya did his best but was not able to find a configuration that makes all bulbs to turn on, so he seeks your assistance. Please, find out a configuration that makes all bulbs shine. It is guaranteed that such configuration always exists.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1 \\leq n \\leq 100\\,000 $ ) — the parameter of a construction set that defines the number of bulbs and the number of wires.\n\nNext line contains $ n $ integers $ d_1, d_2, \\ldots, d_n $ ( $ 1 \\leq d_i \\leq n $ ), where $ d_i $ stands for the number of wires the chain between bulbs $ 2i $ and $ 2i - 1 $ should consist of.",
    "outputFormat": "Print $ 2n - 1 $ lines. The $ i $ -th of them should contain two distinct integers $ a_i $ and $ b_i $ ( $ 1 \\leq a_i, b_i \\leq 2n $ , $ a_i \\ne b_i $ ) — indices of bulbs connected by a wire.\n\nIf there are several possible valid answer you can print any of them.",
    "samples": [
        [
            "3\n2 2 2\n",
            "1 6\n2 6\n3 5\n3 6\n4 5\n"
        ],
        [
            "4\n2 2 2 1\n",
            "1 6\n1 7\n2 6\n3 5\n3 6\n4 5\n7 8\n"
        ],
        [
            "6\n2 2 2 2 2 2\n",
            "1 3\n2 3\n3 5\n4 5\n5 7\n6 7\n7 12\n8 12\n9 11\n9 12\n10 11\n"
        ],
        [
            "2\n1 1\n",
            "1 2\n1 4\n3 4\n"
        ]
    ],
    "hint": " ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1214E/653e46890165db1b6960166c1b7c5da6935781d3.png)  Answer for the first sample test.   ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1214E/1e668da580416d0a9428bdcff70010776ff6715e.png)  Answer for the second sample test.",
    "translation": "## 题目描述\n\n你需要构造出一个节点数为 $2n$ 的一棵树. 给出 $n$ 个范围在 $[1, n]$ 的正整数 $d_i$ . 你构造出来的树需要满足: 第 $2i - 1$ 个点与第 $2i$ 个点在树上的距离恰为$d_i$.\n\n这里定义两个点 $u$ , $v$ 之间的距离为 $u$ 到 $v$ 路径上的边数.\n\n如果有多种方案, 输出任意一种即可.\n\n## 输入格式\n\n第一行一个正整数 $n$ , 含义如题目描述所述.\n\n第二行 $n$ 个正整数 $d_i$ , 含义如题目描述所述.\n\n## 输出格式\n\n$2n-1$行, 每行两个正整数 $u_i$ 和 $v_i$ , 表示你构造的树上 $u_i$ 和 $v_i$ 之间连有一条边.\n\n## 数据范围\n\n$1 \\leq d_i \\leq n \\leq 10^5$"
}