{
    "description": "You are given a bipartite graph: the first part of this graph contains $ n_1 $ vertices, the second part contains $ n_2 $ vertices, and there are $ m $ edges. The graph can contain multiple edges.\n\nInitially, each edge is colorless. For each edge, you may either leave it uncolored (it is free), paint it red (it costs $ r $ coins) or paint it blue (it costs $ b $ coins). No edge can be painted red and blue simultaneously.\n\nThere are three types of vertices in this graph — colorless, red and blue. Colored vertices impose additional constraints on edges' colours:\n\n- for each red vertex, the number of red edges indicent to it should be strictly greater than the number of blue edges incident to it;\n- for each blue vertex, the number of blue edges indicent to it should be strictly greater than the number of red edges incident to it.\n\nColorless vertices impose no additional constraints.\n\nYour goal is to paint some (possibly none) edges so that all constraints are met, and among all ways to do so, you should choose the one with minimum total cost.",
    "inputFormat": "The first line contains five integers $ n_1 $ , $ n_2 $ , $ m $ , $ r $ and $ b $ ( $ 1 \\le n_1, n_2, m, r, b \\le 200 $ ) — the number of vertices in the first part, the number of vertices in the second part, the number of edges, the amount of coins you have to pay to paint an edge red, and the amount of coins you have to pay to paint an edge blue, respectively.\n\nThe second line contains one string consisting of $ n_1 $ characters. Each character is either U, R or B. If the $ i $ -th character is U, then the $ i $ -th vertex of the first part is uncolored; R corresponds to a red vertex, and B corresponds to a blue vertex.\n\nThe third line contains one string consisting of $ n_2 $ characters. Each character is either U, R or B. This string represents the colors of vertices of the second part in the same way.\n\nThen $ m $ lines follow, the $ i $ -th line contains two integers $ u_i $ and $ v_i $ ( $ 1 \\le u_i \\le n_1 $ , $ 1 \\le v_i \\le n_2 $ ) denoting an edge connecting the vertex $ u_i $ from the first part and the vertex $ v_i $ from the second part.\n\nThe graph may contain multiple edges.",
    "outputFormat": "If there is no coloring that meets all the constraints, print one integer $ -1 $ .\n\nOtherwise, print an integer $ c $ denoting the total cost of coloring, and a string consisting of $ m $ characters. The $ i $ -th character should be U if the $ i $ -th edge should be left uncolored, R if the $ i $ -th edge should be painted red, or B if the $ i $ -th edge should be painted blue. If there are multiple colorings with minimum possible cost, print any of them.",
    "samples": [
        [
            "3 2 6 10 15\nRRB\nUB\n3 2\n2 2\n1 2\n1 1\n2 1\n1 1",
            "35\nBUURRU"
        ],
        [
            "3 1 3 4 5\nRRR\nB\n2 1\n1 1\n3 1",
            "-1"
        ],
        [
            "3 1 3 4 5\nURU\nB\n2 1\n1 1\n3 1",
            "14\nRBB"
        ]
    ],
    "hint": "",
    "translation": "有一张二分图，左边有 $n_1$ 个点，右边有 $n_2$ 个点，$m$ 条边。每个点可能有一种颜色 `R` 或者 `B`，也可能没有，也就是 `U`。现在要给一些边染色，把边染成 `R` 要花费 $r$ 的代价，把边染成 `B` 要花费 $b$ 的代价，要求对于每个颜色为 `R` 的点，与之相邻的边中 `R` 的边**严格多于** `B` 的边；对于每个颜色为 `B` 的点，与之相邻的边中 `B` 的边**严格多于** `R` 的边。求花费最小的方案，输出任意一种，无解输出 $-1$。其中 $1 \\le n_1, n_2, m, r, b \\le 200$。"
}