{
    "description": "I'm the Map, I'm the Map! I'm the MAP!!!\n\nMap\n\n\n\nIn anticipation of new adventures Boots wanted to do a good deed. After discussion with the Map and Backpack, they decided to gift Dora a connected graph. After a long search, Boots chose $ t $ graph's variants, which Dora might like. However fox Swiper wants to spoil his plan.\n\nThe Swiper knows, that Dora now is only able to count up to $ 3 $ , so he has came up with a following idea. He wants to steal some non-empty set of vertices, so that the Dora won't notice the loss. He has decided to steal some non-empty set of vertices, so that after deletion of the stolen vertices and edges adjacent to them, every remaining vertex wouldn't change it's degree modulo $ 3 $ . The degree of a vertex is the number of edges it is adjacent to. It would've been suspicious to steal all the vertices, so Swiper needs another plan.\n\nBoots are sure, that the crime can not be allowed. However they are afraid, that they won't be able to handle this alone. So Boots decided to ask for your help. Please determine for every graph's variant whether the Swiper can perform the theft or not.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 100\\,000 $ ) — the number of graph variants.\n\nThe first line of each variant contains integers $ n $ , $ m $ ( $ 1 \\le n \\le 500\\,000 $ , $ 0 \\le m \\le 500\\,000 $ ), the number of vertexes and edges in the graph.\n\nThen $ m $ lines follow, each containing integers $ a_i $ , $ b_i $ ( $ 1 \\le a_i, b_i \\le n $ ), the indices of the vertices connected with a corresponding edge.\n\nIt's guaranteed, that the graph is connected and doesn't contain multiple edges or self-loops.\n\nIt's guaranteed, that the sum of $ n $ over all variants is at most $ 500\\,000 $ and that the sum of $ m $ over all variants is at most $ 500\\,000 $ .\n\nDescriptions of graph's variants are separated with an empty line.",
    "outputFormat": "For each variant:\n\n- In case the answer exists, print \"Yes\" and then the answer itself.The first line should contain an integer $ c $ ( $ 1 < c < n $ ), the number of vertices the Crook can steal, without Dora noticing the loss. On the next line print $ c $ distinct integers, the indices of the graph's vertices in arbitrary order.\n- Otherwise print \"No\".\n\nIn case there are several correct ways to steal the vertices, print any of them.\n\nPlease note, that it's not required to maximize the number of stolen vertices.",
    "samples": [
        [
            "3\n3 3\n1 2\n2 3\n3 1\n\n6 6\n1 2\n1 3\n2 3\n2 5\n2 6\n2 4\n\n8 12\n1 2\n1 3\n2 3\n1 4\n4 5\n5 1\n3 6\n3 7\n3 8\n6 1\n7 1\n8 1\n",
            "No\nYes\n3\n4 5 6\nYes\n3\n6 7 8\n"
        ]
    ],
    "hint": "The picture below shows the third variant from the example test. The set of the vertices the Crook can steal is denoted with bold.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1239F/f318148d950fc435cf0df199f24486fcf2b048b3.png)",
    "translation": "给定一个无向图，判断是否能删去一个不是空集且不是全集的点集，使得剩下的点的度数在模 $3$ 的意义下不变。可行时输出任意方案。"
}