{
    "description": "Recall that a binary search tree is a rooted binary tree, whose nodes each store a key and each have at most two distinguished subtrees, left and right. The key in each node must be greater than any key stored in the left subtree, and less than any key stored in the right subtree.\n\nThe depth of a vertex is the number of edges on the simple path from the vertex to the root. In particular, the depth of the root is $ 0 $ .\n\nLet's call a binary search tree perfectly balanced if there doesn't exist a binary search tree with the same number of vertices that has a strictly smaller sum of depths of its vertices.\n\nLet's call a binary search tree with integer keys striped if both of the following conditions are satisfied for every vertex $ v $ :\n\n- If $ v $ has a left subtree whose root is $ u $ , then the parity of the key of $ v $ is different from the parity of the key of $ u $ .\n- If $ v $ has a right subtree whose root is $ w $ , then the parity of the key of $ v $ is the same as the parity of the key of $ w $ .\n\nYou are given a single integer $ n $ . Find the number of perfectly balanced striped binary search trees with $ n $ vertices that have distinct integer keys between $ 1 $ and $ n $ , inclusive. Output this number modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "The only line contains a single integer $ n $ ( $ 1 \\le n \\le 10^6 $ ), denoting the required number of vertices.",
    "outputFormat": "Output the number of perfectly balanced striped binary search trees with $ n $ vertices and distinct integer keys between $ 1 $ and $ n $ , inclusive, modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "4\n",
            "1\n"
        ],
        [
            "3\n",
            "0\n"
        ]
    ],
    "hint": "In the first example, this is the only tree that satisfies the conditions: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1237E/4e380cf51a86e19e2f842af24fccbe15c0690783.png)\n\nIn the second example, here are various trees that don't satisfy some condition: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1237E/2e8a40da0f5146c1c54bd64b0e3ffa3e8248274f.png)",
    "translation": "$\\rm Soulist$问您有多少棵点数为$n(n\\le 10^6)$点权为${1,2,...,n}$中的数的二叉搜索树满足：\r\n\r\n$1.):$ 除了最下面一层外，所有层都是满的；\r\n\r\n$2.):$ 对于每个点，如果它有左儿子，那么左儿子的点权和它的奇偶性不同；如果它有右儿子，那么右儿子的点权和它的奇偶性相同。\r\n\r\n答案对$998244353$取模"
}