{
    "description": "Nikolay lives in a two-storied house. There are $ n $ rooms on each floor, arranged in a row and numbered from one from left to right. So each room can be represented by the number of the floor and the number of the room on this floor (room number is an integer between $ 1 $ and $ n $ ).\n\nIf Nikolay is currently in some room, he can move to any of the neighbouring rooms (if they exist). Rooms with numbers $ i $ and $ i+1 $ on each floor are neighbouring, for all $ 1 \\leq i \\leq n - 1 $ . There may also be staircases that connect two rooms from different floors having the same numbers. If there is a staircase connecting the room $ x $ on the first floor and the room $ x $ on the second floor, then Nikolay can use it to move from one room to another.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1244B/c3053f6602a9b90cafab0dc252fe4e75c11e365b.png) The picture illustrates a house with $ n = 4 $ . There is a staircase between the room $ 2 $ on the first floor and the room $ 2 $ on the second floor, and another staircase between the room $ 4 $ on the first floor and the room $ 4 $ on the second floor. The arrows denote possible directions in which Nikolay can move. The picture corresponds to the string \"0101\" in the input. Nikolay wants to move through some rooms in his house. To do this, he firstly chooses any room where he starts. Then Nikolay moves between rooms according to the aforementioned rules. Nikolay never visits the same room twice (he won't enter a room where he has already been).\n\nCalculate the maximum number of rooms Nikolay can visit during his tour, if:\n\n- he can start in any room on any floor of his choice,\n- and he won't visit the same room twice.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases in the input. Then test cases follow. Each test case consists of two lines.\n\nThe first line contains one integer $ n $ $ (1 \\le n \\le 1\\,000) $ — the number of rooms on each floor.\n\nThe second line contains one string consisting of $ n $ characters, each character is either a '0' or a '1'. If the $ i $ -th character is a '1', then there is a staircase between the room $ i $ on the first floor and the room $ i $ on the second floor. If the $ i $ -th character is a '0', then there is no staircase between the room $ i $ on the first floor and the room $ i $ on the second floor.\n\nIn hacks it is allowed to use only one test case in the input, so $ t = 1 $ should be satisfied.",
    "outputFormat": "For each test case print one integer — the maximum number of rooms Nikolay can visit during his tour, if he can start in any room on any floor, and he won't visit the same room twice.",
    "samples": [
        [
            "4\n5\n00100\n8\n00000000\n5\n11111\n3\n110\n",
            "6\n8\n10\n6\n"
        ]
    ],
    "hint": "In the first test case Nikolay may start in the first room of the first floor. Then he moves to the second room on the first floor, and then — to the third room on the first floor. Then he uses a staircase to get to the third room on the second floor. Then he goes to the fourth room on the second floor, and then — to the fifth room on the second floor. So, Nikolay visits $ 6 $ rooms.\n\nThere are no staircases in the second test case, so Nikolay can only visit all rooms on the same floor (if he starts in the leftmost or in the rightmost room).\n\nIn the third test case it is possible to visit all rooms: first floor, first room $ \\rightarrow $ second floor, first room $ \\rightarrow $ second floor, second room $ \\rightarrow $ first floor, second room $ \\rightarrow $ first floor, third room $ \\rightarrow $ second floor, third room $ \\rightarrow $ second floor, fourth room $ \\rightarrow $ first floor, fourth room $ \\rightarrow $ first floor, fifth room $ \\rightarrow $ second floor, fifth room.\n\nIn the fourth test case it is also possible to visit all rooms: second floor, third room $ \\rightarrow $ second floor, second room $ \\rightarrow $ second floor, first room $ \\rightarrow $ first floor, first room $ \\rightarrow $ first floor, second room $ \\rightarrow $ first floor, third room.",
    "translation": "## 题目描述\n\n有两层房间，每层 $n$ 个，我们用数对 $(a, b)$ 来表示每个房子，其中 $a$ 表示第几层，$b$ 表示从左向右数第几个\n\n对于房子 $(1, i)$ 或 $(2, i)$，都与 $(1, i - 1), (1, i + 1)$ 或 $(2, i - 1), (2, i + 1)$ 相连\n\n而在若干个或个位置中，又有一个双向的梯子，具体来说，若在 $i$ 的位置有一个梯子，则 $(1, i), (2, i)$ 是相连的\n\n求不重复经过同一个房间的情况下，最多能走过多少个房间\n\n## 输入输出格式\n\n### 输入格式\n\n第一行给出测试数据组数\n\n对于每组测试数据：\n\n第一行给出 $n$，意义如上\n\n第二行给出一个长度为 $n$ 的 $01$ 串，若在 $i$ 位为 $1$，代表在位置 $i$ 有个梯子\n\n### 输出格式\n\n不重复经过同一个房间的情况下，最多能走过多少个房间"
}