{
    "description": "Long is a huge fan of CFC (Codeforces Fried Chicken). But the price of CFC is increasing, so he decides to breed the chicken on his own farm.\n\nHis farm is presented by a rectangle grid with $ r $ rows and $ c $ columns. Some of these cells contain rice, others are empty. $ k $ chickens are living on his farm. The number of chickens is not greater than the number of cells with rice on the farm.\n\nLong wants to give his chicken playgrounds by assigning these farm cells to his chickens. He would like to satisfy the following requirements:\n\n- Each cell of the farm is assigned to exactly one chicken.\n- Each chicken is assigned at least one cell.\n- The set of cells assigned to every chicken forms a connected area. More precisely, if two cells $ (x, y) $ and $ (u, v) $ are assigned to the same chicken, this chicken is able to walk from $ (x, y) $ to $ (u, v) $ by passing only its cells and moving from each cell to another cell sharing a side.\n\nLong also wants to prevent his chickens from fighting for food. Hence he wants the difference between the maximum and the minimum number of cells with rice assigned to a chicken to be as small as possible. Please help him.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ T $ ( $ 1 \\le T \\le 2 \\cdot 10^4 $ ). Description of the test cases follows.\n\nThe first line of each test case contains three integers $ r $ , $ c $ and $ k $ ( $ 1 \\leq r, c \\leq 100, 1 \\leq k \\leq 62 $ ), representing the size of Long's farm and the number of chickens Long has.\n\nEach of the next $ r $ lines contains $ c $ characters, each is either \".\" or \"R\", representing an empty cell or a cell with rice. It is guaranteed that the number of chickens is not greater than the number of cells with rice on the farm.\n\nIt is guaranteed that the sum of $ r \\cdot c $ over all test cases does not exceed $ 2 \\cdot 10^4 $ .",
    "outputFormat": "For each test case, print $ r $ lines with $ c $ characters on each line. Each character should be either a lowercase English character, an uppercase English character, or a digit. Two characters should be equal if and only if the two corresponding cells are assigned to the same chicken. Uppercase and lowercase characters are considered different, so \"A\" and \"a\" belong to two different chickens.\n\nIf there are multiple optimal answers, print any.",
    "samples": [
        [
            "4\n3 5 3\n..R..\n...R.\n....R\n6 4 6\nR..R\nR..R\nRRRR\nRRRR\nR..R\nR..R\n5 5 4\nRRR..\nR.R..\nRRR..\nR..R.\nR...R\n2 31 62\nRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR\nRRRRRRRRRRRRRRRRRRRRRRRRRRRRRRR\n",
            "11122\n22223\n33333\naacc\naBBc\naBBc\nCbbA\nCbbA\nCCAA\n11114\n22244\n32444\n33344\n33334\nabcdefghijklmnopqrstuvwxyzABCDE\nFGHIJKLMNOPQRSTUVWXYZ0123456789"
        ]
    ],
    "hint": "These pictures explain the sample output. Each color represents one chicken. Cells filled with patterns (not solid colors) contain rice.\n\nIn the first test case, each chicken has one cell with rice. Hence, the difference between the maximum and the minimum number of cells with rice assigned to a chicken is $ 0 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1254A/1bff8ca11bd265337b0e871e2919557b9f31df1c.png)\n\nIn the second test case, there are $ 4 $ chickens with $ 3 $ cells of rice, and $ 2 $ chickens with $ 2 $ cells of rice. Hence, the difference between the maximum and the minimum number of cells with rice assigned to a chicken is $ 3 - 2 = 1 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1254A/2ec7f9b3f1d8e0f97ddc9a49d6dcde16eae965cb.png)\n\nIn the third test case, each chicken has $ 3 $ cells with rice. ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1254A/cc5ea14ecb6cc9df893cd1ba4b47e078c09da70f.png)\n\nIn the last test case, since there are $ 62 $ chicken with exactly $ 62 $ cells of rice, each chicken must be assigned to exactly one cell. The sample output is one of the possible way.",
    "translation": "对于每个测试点，共有$T$组数据。对于每组数据：\n\n给定$r$行$c$列字符矩阵，每个元素为'.'或者'r'。\n\n给定正整数$k$，现将要字符矩阵划分为四连通的$k$块，并定义每个连通块的权值为其中'r'的个数。\n\n试求一种划分方案，使得连通块之间的最大权值减最小权值之差最小。\n\n划分方案将用字符集$\\{\\textrm{`0',`1',\\dots,`9',`a',`b',\\dots,`z',`A',`B',\\dots,`Z'}\\}$来表示：两个位置属于同一连通块，当且仅当它们对应的字符相同。\n\n如果有多种方案，任意输出一种即可。\n\n$T\\le 2\\times 10^4, r\\le 100,c\\le 100,k\\le 62$，且\n单个测试点中的$r\\times c$总和不超过$2\\times 10^4$。\n\n _Translated by Caro23333_ "
}