{
    "description": "Treeland consists of $ n $ cities and $ n-1 $ two-way roads connecting pairs of cities. From every city, you can reach every other city moving only by the roads. You are right, the system of cities and roads in this country forms an undirected tree.\n\nThe government has announced a program for the modernization of urban infrastructure of some cities. You have been assigned to select an arbitrary subset of cities $ S $ to upgrade (potentially all the cities) that satisfies the following requirements:\n\n- the subset of cities must be \"connected\", that is, from any city of the subset $ S $ you can get to any other city of the subset $ S $ by roads, moving only through cities from $ S $ ,\n- the number of \"dead-ends\" in $ S $ must be equal to the given number $ k $ . A city is a \"dead-end\" if it is the only city in $ S $ or connected to exactly one another city from $ S $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1297E/7cd7bb61382c998a3f0e198ae33c0dae4d73087b.png)This shows one of the possible ways to select $ S $ (blue vertices) for a given configuration and $ k=4 $ . Dead-ends are vertices with numbers $ 1 $ , $ 4 $ , $ 6 $ and $ 7 $ .Help Treeland upgrade its cities. Find any of the possible subsets $ S $ or determine that such a subset does not exist.",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the input. This is followed by the test cases themselves.\n\nEach test case begins with a line that contains two integers $ n $ and $ k $ ( $ 2 \\le n \\le 3 \\cdot 10^5 $ , $ 1 \\le k \\le n $ ) — the number of cities in Treeland and the number of \"dead-end\" cities required in the subset $ S $ .\n\nThis is followed by $ n-1 $ lines with road descriptions. Each road is given by two integers $ x $ and $ y $ ( $ 1 \\le x, y \\le n $ ; $ x \\ne y $ ) — the numbers of the cities that are connected by this road. It is guaranteed that from every city you can reach any other, moving only by the roads.\n\nThe sum of the values of $ n $ for all test cases in the input does not exceed $ 3 \\cdot 10^5 $ .",
    "outputFormat": "For each test case print Yes or No (in any case, upper or lower), depending on whether the answer exists or not. If the answer exists, then print an integer $ m $ ( $ 1 \\le m \\le n $ ) — the number of cities in the found subset. Then print $ m $ different numbers from $ 1 $ to $ n $ — the numbers of the cities in the found subset. City numbers can be printed in any order. If there are several answers, print any of them.",
    "samples": [
        [
            "4\n10 4\n4 5\n5 2\n2 1\n1 3\n1 9\n9 10\n2 7\n7 8\n5 6\n4 3\n1 2\n2 3\n3 4\n5 3\n1 2\n1 3\n1 4\n1 5\n4 1\n1 2\n2 4\n2 3",
            "Yes\n9\n1 2 4 5 6 7 8 9 10 \nNo\nYes\n4\n1 3 4 5 \nYes\n1\n4"
        ]
    ],
    "hint": ""
}