{
    "description": "You are both a shop keeper and a shop assistant at a small nearby shop. You have $ n $ goods, the $ i $ -th good costs $ a_i $ coins.\n\nYou got tired of remembering the price of each product when customers ask for it, thus you decided to simplify your life. More precisely you decided to set the same price for all $ n $ goods you have.\n\nHowever, you don't want to lose any money so you want to choose the price in such a way that the sum of new prices is not less than the sum of the initial prices. It means that if you sell all $ n $ goods for the new price, you will receive at least the same (or greater) amount of money as if you sell them for their initial prices.\n\nOn the other hand, you don't want to lose customers because of big prices so among all prices you can choose you need to choose the minimum one.\n\nSo you need to find the minimum possible equal price of all $ n $ goods so if you sell them for this price, you will receive at least the same (or greater) amount of money as if you sell them for their initial prices.\n\nYou have to answer $ q $ independent queries.",
    "inputFormat": "The first line of the input contains one integer $ q $ ( $ 1 \\le q \\le 100 $ ) — the number of queries. Then $ q $ queries follow.\n\nThe first line of the query contains one integer $ n $ ( $ 1 \\le n \\le 100) $ — the number of goods. The second line of the query contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^7 $ ), where $ a_i $ is the price of the $ i $ -th good.",
    "outputFormat": "For each query, print the answer for it — the minimum possible equal price of all $ n $ goods so if you sell them for this price, you will receive at least the same (or greater) amount of money as if you sell them for their initial prices.",
    "samples": [
        [
            "3\n5\n1 2 3 4 5\n3\n1 2 2\n4\n1 1 1 1\n",
            "3\n2\n1\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目大意\n\n有n个商品，其中第i个商品的成本为a_i。\n\n现在要求你求出一个平均价格，使得每件商品按照此平均价格卖出后不亏本，而且赚到的钱最少（挣的钱可以为0）\n\n注意题目有多组数据。\n\n### 输入格式\n第一行输入数据组数q（1≤q≤100，q为整数）。\n\n接下来q组数据。对于每组数据，先输入商品个数n（1≤n≤100，n为整数），接下来一行包含n个整数：a_1，a_2，... ... ，a_n，其中a_i表示第i个商品的成本。\n\n### 输出格式\n对于每组数据，每行输出一个平均价格。\n\nTranslated by @夙_愿扬"
}