{
    "description": "New Year is getting near. So it's time to change handles on codeforces. Mishka wants to change his handle but in such a way that people would not forget who he is.\n\nTo make it work, he only allowed to change letters case. More formally, during one handle change he can choose any segment of his handle $ [i; i + l - 1] $ and apply tolower or toupper to all letters of his handle on this segment (more fomally, replace all uppercase letters with corresponding lowercase or vice versa). The length $ l $ is fixed for all changes.\n\nBecause it is not allowed to change codeforces handle too often, Mishka can perform at most $ k $ such operations. What is the minimum value of $ min(lower, upper) $ (where $ lower $ is the number of lowercase letters, and $ upper $ is the number of uppercase letters) can be obtained after optimal sequence of changes?",
    "inputFormat": "The first line of the input contains three integers $ n, k $ and $ l $ ( $ 1 \\le n, k, l \\le 10^6, l \\le n) $ — the length of Mishka's handle, the number of changes and the length of the segment.\n\nThe second line of the input contains one string $ s $ , consisting of $ n $ lowercase and uppercase Latin letters — Mishka's handle.",
    "outputFormat": "Print one integer — the minimum value of $ min(lower, upper) $ after that Mishka change his handle at most $ k $ times in a way described in the problem statement.",
    "samples": [
        [
            "7 1 4\nPikMike\n",
            "0\n"
        ],
        [
            "15 2 2\nAaAaAAaaAAAAaaA\n",
            "2\n"
        ],
        [
            "14 2 6\naBcdEFGHIJklMn\n",
            "0\n"
        ],
        [
            "9 2 2\naAaAAAaaA\n",
            "1\n"
        ]
    ],
    "hint": "",
    "translation": "- 给出一个01串(表现为大小写），可以最多选择 $k$ 个 $l$ 长度的子串，全部变为0或1。\n- 求操作后的 $\\min(cnt_0 , cnt_1)$ 的最小值\n- $1 \\le n,k,l \\le 10^6$"
}