{
    "description": "Olga came to visit the twins Anna and Maria and saw that they have many cookies. The cookies are distributed into bags. As there are many cookies, Olga decided that it's no big deal if she steals a bag. However, she doesn't want the sisters to quarrel because of nothing when they divide the cookies. That's why Olga wants to steal a bag with cookies so that the number of cookies in the remaining bags was even, that is, so that Anna and Maria could evenly divide it into two (even 0 remaining cookies will do, just as any other even number). How many ways there are to steal exactly one cookie bag so that the total number of cookies in the remaining bags was even?",
    "inputFormat": "The first line contains the only integer $ n $ ( $ 1<=n<=100 $ ) — the number of cookie bags Anna and Maria have. The second line contains $ n $ integers $ a_{i} $ ( $ 1<=a_{i}<=100 $ ) — the number of cookies in the $ i $ -th bag.",
    "outputFormat": "Print in the only line the only number — the sought number of ways. If there are no such ways print 0.",
    "samples": [
        [
            "1\n1\n",
            "1\n"
        ],
        [
            "10\n1 2 2 3 4 4 4 2 2 2\n",
            "8\n"
        ],
        [
            "11\n2 2 2 2 2 2 2 2 2 2 99\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample Olga should take the only bag so that the twins ended up with the even number of cookies.\n\nIn the second sample Olga can take any of five bags with two cookies or any of three bags with four cookies — $ 5+3=8 $ ways in total.\n\nIn the third sample, no matter which bag with two cookies Olga chooses, the twins are left with $ 2*9+99=117 $ cookies. Thus, Olga has only one option: to take the bag with $ 99 $ cookies.",
    "translation": " 【题目描述】有n袋饼干( $1\\le n\\le 100$),每袋里有 $a_i(1\\le a_i\\le 100)$ 块饼干。拿走一袋饼干，使剩下的饼干数为偶数。求有多少种拿走的方案。\n \n 【输入格式】第一行是 $n(1\\le n\\le 100)$,第二行是 $n$ 个用空格隔开的数 $a_i(1\\le a_i\\le 100)$\n \n 【输出格式】一个整数，即拿走饼干的方案。若不存在，输出0\n\n感谢@面瘫者 提供的翻译"
}