{
    "description": "Two large companies \"Cecsi\" and \"Poca Pola\" are fighting against each other for a long time. In order to overcome their competitor, \"Poca Pola\" started a super secret project, for which it has total $ n $ vacancies in all of their offices. After many tests and interviews $ n $ candidates were selected and the only thing left was their employment.\n\nBecause all candidates have the same skills, it doesn't matter where each of them will work. That is why the company decided to distribute candidates between workplaces so that the total distance between home and workplace over all candidates is minimal.\n\nIt is well known that Earth is round, so it can be described as a circle, and all $ m $ cities on Earth can be described as points on this circle. All cities are enumerated from $ 1 $ to $ m $ so that for each $ i $ ( $ 1 \\le i \\le m - 1 $ ) cities with indexes $ i $ and $ i + 1 $ are neighbors and cities with indexes $ 1 $ and $ m $ are neighbors as well. People can move only along the circle. The distance between any two cities equals to minimal number of transitions between neighboring cities you have to perform to get from one city to another. In particular, the distance between the city and itself equals $ 0 $ .\n\nThe \"Poca Pola\" vacancies are located at offices in cities $ a_1, a_2, \\ldots, a_n $ . The candidates live in cities $ b_1, b_2, \\ldots, b_n $ . It is possible that some vacancies are located in the same cities and some candidates live in the same cities.\n\nThe \"Poca Pola\" managers are too busy with super secret project, so you were asked to help \"Poca Pola\" to distribute candidates between workplaces, so that the sum of the distance between home and workplace over all candidates is minimum possible.",
    "inputFormat": "The first line contains two integers $ m $ and $ n $ ( $ 1 \\le m \\le 10^9 $ , $ 1 \\le n \\le 200\\,000 $ ) — the number of cities on Earth and the number of vacancies.\n\nThe second line contains $ n $ integers $ a_1, a_2, a_3, \\ldots, a_n $ ( $ 1 \\le a_i \\le m $ ) — the cities where vacancies are located.\n\nThe third line contains $ n $ integers $ b_1, b_2, b_3, \\ldots, b_n $ ( $ 1 \\le b_i \\le m $ ) — the cities where the candidates live.",
    "outputFormat": "The first line should contain the minimum total distance between home and workplace over all candidates.\n\nThe second line should contain $ n $ different integers from $ 1 $ to $ n $ . The $ i $ -th of them should be the index of candidate that should work at $ i $ -th workplace.",
    "samples": [
        [
            "10 3\n1 5 5\n10 4 6\n",
            "3\n1 2 3 "
        ],
        [
            "10 3\n1 4 8\n8 3 6\n",
            "4\n2 3 1 "
        ]
    ],
    "hint": "In the first example, the distance between each candidate and his workplace equals to $ 1 $ (from $ 1 $ to $ 10 $ , from $ 4 $ to $ 5 $ and from $ 6 $ to $ 5 $ ).\n\nIn the second example:\n\n- The second candidate works at first workplace, the distance between cities $ 3 $ and $ 1 $ equals to $ 2 $ .\n- The third candidate works at second workplace, the distance between cities $ 6 $ and $ 4 $ equals to $ 2 $ .\n- The first candidate works at third workplace, the distance between cities $ 8 $ and $ 8 $ equals to $ 0 $ .",
    "translation": "有一个长度为$m$的环形铁路，在铁路的某些点上有一些人或一些办公室，现在要求给每个人配一个办公室，让所有人的上班路程最短。人和办公室的数量都是$n$。"
}