{
    "description": "You are responsible for installing a gas pipeline along a road. Let's consider the road (for simplicity) as a segment $ [0, n] $ on $ OX $ axis. The road can have several crossroads, but for simplicity, we'll denote each crossroad as an interval $ (x, x + 1) $ with integer $ x $ . So we can represent the road as a binary string consisting of $ n $ characters, where character 0 means that current interval doesn't contain a crossroad, and 1 means that there is a crossroad.\n\nUsually, we can install the pipeline along the road on height of $ 1 $ unit with supporting pillars in each integer point (so, if we are responsible for $ [0, n] $ road, we must install $ n + 1 $ pillars). But on crossroads we should lift the pipeline up to the height $ 2 $ , so the pipeline won't obstruct the way for cars.\n\nWe can do so inserting several zig-zag-like lines. Each zig-zag can be represented as a segment $ [x, x + 1] $ with integer $ x $ consisting of three parts: $ 0.5 $ units of horizontal pipe + $ 1 $ unit of vertical pipe + $ 0.5 $ of horizontal. Note that if pipeline is currently on height $ 2 $ , the pillars that support it should also have length equal to $ 2 $ units.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1207C/f1dfe38b83de03ccc78e9e23fedbdc3223f970d0.png)Each unit of gas pipeline costs us $ a $ bourles, and each unit of pillar — $ b $ bourles. So, it's not always optimal to make the whole pipeline on the height $ 2 $ . Find the shape of the pipeline with minimum possible cost and calculate that cost.\n\nNote that you must start and finish the pipeline on height $ 1 $ and, also, it's guaranteed that the first and last characters of the input string are equal to 0.",
    "inputFormat": "The fist line contains one integer $ T $ ( $ 1 \\le T \\le 100 $ ) — the number of queries. Next $ 2 \\cdot T $ lines contain independent queries — one query per two lines.\n\nThe first line contains three integers $ n $ , $ a $ , $ b $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ , $ 1 \\le a \\le 10^8 $ , $ 1 \\le b \\le 10^8 $ ) — the length of the road, the cost of one unit of the pipeline and the cost of one unit of the pillar, respectively.\n\nThe second line contains binary string $ s $ ( $ |s| = n $ , $ s_i \\in \\{0, 1\\} $ , $ s_1 = s_n = 0 $ ) — the description of the road.\n\nIt's guaranteed that the total length of all strings $ s $ doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "Print $ T $ integers — one per query. For each query print the minimum possible cost of the constructed pipeline.",
    "samples": [
        [
            "4\n8 2 5\n00110010\n8 1 1\n00110010\n9 100000000 100000000\n010101010\n2 5 1\n00\n",
            "94\n25\n2900000000\n13\n"
        ]
    ],
    "hint": "The optimal pipeline for the first query is shown at the picture above.\n\nThe optimal pipeline for the second query is pictured below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1207C/2782d7e4c7012251045217f9f050b1e333f47c33.png)The optimal (and the only possible) pipeline for the third query is shown below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1207C/7e72ed8fa647ff66b04ca0425394c874c1b110fe.png)The optimal pipeline for the fourth query is shown below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1207C/248de9c02a0298296e2131b26213178e9c6ad6ba.png)",
    "translation": "你需要在城市里修建管道和支柱，管道和支柱的单位长度的价格分别为$a,b$\n\n给你一个长度为$n$的$01$序列，其中$1$表示这里需要通车，$0$表示这里不需要通车，高度为$2$的地方才可以通车(保证序列的头尾不需要通车)\n\n如图，红色表示管道，黑色表示支柱，我们可以在一段单位区间建立一条S形线条，每个S形可以表示为该段由三部分组成：$0.5$个单位的水平管道+$1$个单位的垂直管道+$0.5$个单位的水平管道\n\n每一段的单位区间左右都有支柱支撑，支柱的高度等于管道端点的高度\n\n你需要保证所有通车的地方高度为$2$的同时，建管道和支柱的费用总和最小"
}