{
    "description": "Today, Yasser and Adel are at the shop buying cupcakes. There are $ n $ cupcake types, arranged from $ 1 $ to $ n $ on the shelf, and there are infinitely many of each type. The tastiness of a cupcake of type $ i $ is an integer $ a_i $ . There are both tasty and nasty cupcakes, so the tastiness can be positive, zero or negative.\n\nYasser, of course, wants to try them all, so he will buy exactly one cupcake of each type.\n\nOn the other hand, Adel will choose some segment $ [l, r] $ $ (1 \\le l \\le r \\le n) $ that does not include all of cupcakes (he can't choose $ [l, r] = [1, n] $ ) and buy exactly one cupcake of each of types $ l, l + 1, \\dots, r $ .\n\nAfter that they will compare the total tastiness of the cupcakes each of them have bought. Yasser will be happy if the total tastiness of cupcakes he buys is strictly greater than the total tastiness of cupcakes Adel buys regardless of Adel's choice.\n\nFor example, let the tastinesses of the cupcakes be $ [7, 4, -1] $ . Yasser will buy all of them, the total tastiness will be $ 7 + 4 - 1 = 10 $ . Adel can choose segments $ [7], [4], [-1], [7, 4] $ or $ [4, -1] $ , their total tastinesses are $ 7, 4, -1, 11 $ and $ 3 $ , respectively. Adel can choose segment with tastiness $ 11 $ , and as $ 10 $ is not strictly greater than $ 11 $ , Yasser won't be happy :(\n\nFind out if Yasser will be happy after visiting the shop.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nThe first line of each test case contains $ n $ ( $ 2 \\le n \\le 10^5 $ ).\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ -10^9 \\le a_i \\le 10^9 $ ), where $ a_i $ represents the tastiness of the $ i $ -th type of cupcake.\n\nIt is guaranteed that the sum of $ n $ over all test cases doesn't exceed $ 10^5 $ .",
    "outputFormat": "For each test case, print \"YES\", if the total tastiness of cupcakes Yasser buys will always be strictly greater than the total tastiness of cupcakes Adel buys regardless of Adel's choice. Otherwise, print \"NO\".",
    "samples": [
        [
            "3\n4\n1 2 3 4\n3\n7 4 -1\n3\n5 -5 5",
            "YES\nNO\nNO"
        ]
    ],
    "hint": "In the first example, the total tastiness of any segment Adel can choose is less than the total tastiness of all cupcakes.\n\nIn the second example, Adel will choose the segment $ [1, 2] $ with total tastiness $ 11 $ , which is not less than the total tastiness of all cupcakes, which is $ 10 $ .\n\nIn the third example, Adel can choose the segment $ [3, 3] $ with total tastiness of $ 5 $ . Note that Yasser's cupcakes' total tastiness is also $ 5 $ , so in that case, the total tastiness of Yasser's cupcakes isn't strictly greater than the total tastiness of Adel's cupcakes.",
    "translation": "### 题意简述\n\n给定长度为 $n$ 的数列 $a=[a_1,a_2,...,a_n]$。\n\nYasser 会选择所有的 $n$ 个数，并算出它们的和 $\\sum a_i$。\n\nAdel 会选择两个正整数 $l,r(1\\leq l \\leq r \\leq n)$，并算出 $\\sum_{i=l}^{r} a_i$。Adel 不能选择 $l=1,r=n$。\n\n如果 Yasser 算出的和在任意情况下（即 Adel 选取任意的 $l,r$ 都是如此）**严格大于** Adel 算出的，那么 Yasser 会开心。否则 Yasser 不会开心。\n\n请你判断 Yasser 是否开心。\n\n### 输入格式\n\n**本题有多组数据**。\n\n第一行一个正整数 $t(1\\leq t \\leq 10^4)$，表示数据的组数。\n\n对于每组数据，第一行一个正整数 $n(2\\leq n \\leq 10^5)$。\n\n接下来一行 $a_1,a_2,...,a_n(-10^{9} \\leq a_i \\leq 10^9)$。\n\n保证 $\\sum n$ 不会超过 $10^5$。\n\n### 输出格式\n\n对于每组数据，如果 Yasser 会开心，输出 `YES`，否则输出 `NO`。\n\n翻译贡献者 U108949"
}