{
    "description": "A sky scraper with 1000 floors has been built in the city of N. It has modern superfast elevators to help to travel from one floor to another. Each elevator has two doors, the front one and the back one. If one goes in through the front door, he goes out through the back one and vice versa. The elevator has two rails numbered with numbers 1 and 2. Rail 1 is located to the left of the entrance to the front door (or correspondingly, to the right of the entrance to the back door). Rail 2 is located opposite it, to the right of the entrance to the front door and to the left of the entrance to the back door. We know that each person in the city of N holds at a rail with the strongest hand.\n\nOne day a VIP person visited the city and of course, he took a look at the skyscraper and took a ride in the elevator. We know the door through which he entered and the rail he was holding at. Now we need to determine as soon as possible whether he is left-handed or right-handed.",
    "inputFormat": "The first line indicates the door through which the very important person entered the elevator. It contains \"front\" if the person enters the elevator through the front door and \"back\" if he entered the elevator through the back door. The second line contains integer $ a $ ( $ 1<=a<=2 $ ) which denotes the number of the rail at which the person was holding.",
    "outputFormat": "Print character \"R\" if the VIP is right-handed or \"L\" if he is left-handed.",
    "samples": [
        [
            "front\n1\n",
            "L\n"
        ]
    ],
    "hint": "",
    "translation": "纽约市建造了一座1000层的摩天大楼，它有现代化的超高速电梯，帮助人们从一层楼到另一层楼。每个电梯有两个门，前面有一个，后面有一个。如果一个人从前门进去，他就要从后门出去，反之亦然。电梯有两条编号为1和2的栏杆。栏杆1位于前门入口左侧（或相应地位于后门入口右侧）。栏杆2位于其对面，前门入口右侧和后门入口左侧。我们知道，N市的每个人都用最结实的手抓住一根栏杆。\n有一天，一位贵宾参观了这座城市，当然，他看了一眼摩天大楼，在电梯里搭车。我们知道他进门的门和他拿着的栏杆。现在我们需要尽快确定他是左撇子还是右撇子。"
}