{
    "description": "Denis came to Nastya and discovered that she was not happy to see him... There is only one chance that she can become happy. Denis wants to buy all things that Nastya likes so she will certainly agree to talk to him.\n\nThe map of the city where they live has a lot of squares, some of which are connected by roads. There is exactly one way between each pair of squares which does not visit any vertex twice. It turns out that the graph of the city is a tree.\n\nDenis is located at vertex $ 1 $ at the time $ 0 $ . He wants to visit every vertex at least once and get back as soon as possible.\n\nDenis can walk one road in $ 1 $ time. Unfortunately, the city is so large that it will take a very long time to visit all squares. Therefore, Denis took a desperate step. He pulled out his pocket time machine, which he constructed in his basement. With its help, Denis can change the time to any non-negative time, which is less than the current time.\n\nBut the time machine has one feature. If the hero finds himself in the same place and at the same time twice, there will be an explosion of universal proportions and Nastya will stay unhappy. Therefore, Denis asks you to find him a route using a time machine that he will get around all squares and will return to the first and at the same time the maximum time in which he visited any square will be minimal.\n\nFormally, Denis's route can be represented as a sequence of pairs: $ \\{v_1, t_1\\}, \\{v_2, t_2\\}, \\{v_3, t_3\\}, \\ldots, \\{v_k,       t_k\\} $ , where $ v_i $ is number of square, and $ t_i $ is time in which the boy is now.\n\nThe following conditions must be met:\n\n- The route starts on square $ 1 $ at time $ 0 $ , i.e. $ v_1 = 1, t_1 = 0 $ and ends on the square $ 1 $ , i.e. $ v_k = 1 $ .\n- All transitions are divided into two types: \n  1. Being in the square change the time: $ \\{ v_i, t_i \\} \\to \\{             v_{i+1}, t_{i+1} \\} : v_{i+1} = v_i, 0 \\leq t_{i+1} <             t_i $ .\n  2. Walk along one of the roads: $ \\{ v_i, t_i \\} \\to \\{             v_{i+1}, t_{i+1} \\} $ . Herewith, $ v_i $ and $ v_{i+1} $ are connected by road, and $ t_{i+1} = t_i +             1 $\n- All pairs $ \\{ v_i, t_i \\} $ must be different.\n- All squares are among $ v_1, v_2, \\ldots, v_k $ .\n\nYou need to find a route such that the maximum time in any square will be minimal, that is, the route for which $ \\max{(t_1, t_2,       \\ldots, t_k)} $ will be the minimum possible.",
    "inputFormat": "The first line contains a single integer $ n $ $ (1 \\leq n       \\leq 10^5) $ — the number of squares in the city.\n\nThe next $ n - 1 $ lines contain two integers $ u $ and $ v $ $ (1 \\leq v, u \\leq n, u \\neq v) $ - the numbers of the squares connected by the road.\n\nIt is guaranteed that the given graph is a tree.",
    "outputFormat": "In the first line output the integer $ k $ $ (1 \\leq k \\leq       10^6) $ — the length of the path of Denis.\n\nIn the next $ k $ lines output pairs $ v_i, t_i $ — pairs that describe Denis's route (as in the statement).\n\nAll route requirements described in the statements must be met.\n\nIt is guaranteed that under given restrictions there is at least one route and an answer whose length does not exceed $ 10^6 $ . If there are several possible answers, print any.",
    "samples": [
        [
            "5\n1 2\n2 3\n2 4\n4 5",
            "13\n1 0\n2 1\n3 2\n3 1\n2 2\n4 3\n4 1\n5 2\n5 1\n4 2\n2 3\n2 0\n1 1"
        ]
    ],
    "hint": "",
    "translation": "题目大意：给你一棵树，通过每条边需要 $1$ 的时间，你可以在一个结点处将时间变为任意一个比当前时间小的非负整数，要求满足以下两个限制：\n\n- 经过每个节点至少一次\n- 每一个节点上，到达它的时间（更改时的时间也计算在内）不得重复\n- 必须回到 $1$ 号节点\n\n求出任意一种使得到达每个节点的时间最大值最小。"
}