{
    "description": "Consider a conveyor belt represented using a grid consisting of $ n $ rows and $ m $ columns. The cell in the $ i $ -th row from the top and the $ j $ -th column from the left is labelled $ (i,j) $ .\n\nEvery cell, except $ (n,m) $ , has a direction R (Right) or D (Down) assigned to it. If the cell $ (i,j) $ is assigned direction R, any luggage kept on that will move to the cell $ (i,j+1) $ . Similarly, if the cell $ (i,j) $ is assigned direction D, any luggage kept on that will move to the cell $ (i+1,j) $ . If at any moment, the luggage moves out of the grid, it is considered to be lost.\n\nThere is a counter at the cell $ (n,m) $ from where all luggage is picked. A conveyor belt is called functional if and only if any luggage reaches the counter regardless of which cell it is placed in initially. More formally, for every cell $ (i,j) $ , any luggage placed in this cell should eventually end up in the cell $ (n,m) $ .\n\nThis may not hold initially; you are, however, allowed to change the directions of some cells to make the conveyor belt functional. Please determine the minimum amount of cells you have to change.\n\nPlease note that it is always possible to make any conveyor belt functional by changing the directions of some set of cells.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10 $ ). Description of the test cases follows.\n\nThe first line of each test case contains two integers $ n, m $ ( $ 1 \\le n \\le 100 $ , $ 1 \\le m \\le 100 $ ) — the number of rows and columns, respectively.\n\nThe following $ n $ lines each contain $ m $ characters. The $ j $ -th character in the $ i $ -th line, $ a_{i,j} $ is the initial direction of the cell $ (i, j) $ . Please note that $ a_{n,m}= $ C.",
    "outputFormat": "For each case, output in a new line the minimum number of cells that you have to change to make the conveyor belt functional.",
    "samples": [
        [
            "4\n3 3\nRRD\nDDR\nRRC\n1 4\nDDDC\n6 9\nRDDDDDRRR\nRRDDRRDDD\nRRDRDRRDR\nDDDDRDDRR\nDRRDRDDDR\nDDRDRRDDC\n1 1\nC",
            "1\n3\n9\n0"
        ]
    ],
    "hint": "In the first case, just changing the direction of $ (2,3) $ to D is enough.\n\nYou can verify that the resulting belt is functional. For example, if we place any luggage at $ (2,2) $ , it first moves to $ (3,2) $ and then to $ (3,3) $ .\n\nIn the second case, we have no option but to change the first $ 3 $ cells from D to R making the grid equal to RRRC.",
    "translation": "### 题目描述\n\n给你一个 $n \\times m$ 的矩阵，每一格上有个一标记不是 $R$ 就是 $D$，如果为 $R$ 表示这一格的物品会被送到这一格紧邻的右边的那一格，如果为 $D$ 表示这一格的物品会被送到这一格紧邻的下边的那一格。问你最少修改（$R$ 变 $D$ 或者 $D$ 变 $R$）多少次使得不管哪一个里的物品最后都能到达 $(n,m)$。\n\ntranslated by [yu__xuan](https://www.luogu.com.cn/user/142110)\n\n### 输入格式\n\n多组测试。\n\n第一行一个 $t \\ (1 \\leq t \\leq 10)$，表示数据组数。\n\n每一组数据第一行为 $n,m \\ (1 \\leq n,m \\leq 100)$ 表示矩阵有 $n$ 行 $m$ 列。\n\n接下来有 $n$ 行每行 $m$ 个字符为 $R$ 或 $D$（无空格分隔）。\n\n### 输出格式\n对于每组数据输出一行表示最少修改多少次。"
}