{
    "description": "Little Petya likes to play a lot. Most of all he likes to play a game «Holes». This is a game for one person with following rules:\n\nThere are $ N $ holes located in a single row and numbered from left to right with numbers from 1 to $ N $ . Each hole has it's own power (hole number $ i $ has the power $ a_{i} $ ). If you throw a ball into hole $ i $ it will immediately jump to hole $ i+a_{i} $ , then it will jump out of it and so on. If there is no hole with such number, the ball will just jump out of the row. On each of the $ M $ moves the player can perform one of two actions:\n\n- Set the power of the hole $ a $ to value $ b $ .\n- Throw a ball into the hole $ a $ and count the number of jumps of a ball before it jump out of the row and also write down the number of the hole from which it jumped out just before leaving the row.\n\nPetya is not good at math, so, as you have already guessed, you are to perform all computations.",
    "inputFormat": "The first line contains two integers $ N $ and $ M $ ( $ 1<=N<=10^{5} $ , $ 1<=M<=10^{5} $ ) — the number of holes in a row and the number of moves. The second line contains $ N $ positive integers not exceeding $ N $ — initial values of holes power. The following $ M $ lines describe moves made by Petya. Each of these line can be one of the two types:\n\n- $ 0 $ $ a $ $ b $\n- $ 1 $ $ a $\n\n Type $ 0 $ means that it is required to set the power of hole $ a $ to $ b $ , and type $ 1 $ means that it is required to throw a ball into the $ a $ -th hole. Numbers $ a $ and $ b $ are positive integers do not exceeding $ N $ .",
    "outputFormat": "For each move of the type $ 1 $ output two space-separated numbers on a separate line — the number of the last hole the ball visited before leaving the row and the number of jumps it made.",
    "samples": [
        [
            "8 5\n1 1 1 1 1 2 8 2\n1 1\n0 1 3\n1 1\n0 3 4\n1 2\n",
            "8 7\n8 5\n7 3\n"
        ]
    ],
    "hint": "",
    "translation": "有$N$个洞，每个洞有相应的弹力，能把这个球弹到$i+power[i]$ 位置。当球的位置$>N$时即视为被弹出\n\n输入：\n第一行两个正整数$N$，$M$，下面$N$个数代表初始的$power[i]$\n之后$M$行分别代表$M$个操作\n\n共有两种操作:\n\n   $0$ $a$ $b$ 把$a$位置的弹力改成$b$\n\n   $1$ $a$ 在$a$处放一个球，输出最后一次落在哪个洞,球被弹出前共被弹了多少次\n\n输出：对于每个操作2，输出两个题目中要求的值（空格隔开）\n\n$1<=N<=100000$\n\n$1<=M<=100000$"
}