{
    "description": "Bashar was practicing for the national programming contest. Because of sitting too much in front of the computer without doing physical movements and eating a lot Bashar became much fatter. Bashar is going to quit programming after the national contest and he is going to become an actor (just like his father), so he should lose weight.\n\nIn order to lose weight, Bashar is going to run for $ k $ kilometers. Bashar is going to run in a place that looks like a grid of $ n $ rows and $ m $ columns. In this grid there are two one-way roads of one-kilometer length between each pair of adjacent by side cells, one road is going from the first cell to the second one, and the other road is going from the second cell to the first one. So, there are exactly $ (4 n m - 2n - 2m) $ roads.\n\nLet's take, for example, $ n = 3 $ and $ m = 4 $ . In this case, there are $ 34 $ roads. It is the picture of this case (arrows describe roads):\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1301D/f8acc1bb44bf67b8a6e82d8abf101031f5e398f8.png)\n\nBashar wants to run by these rules:\n\n- He starts at the top-left cell in the grid;\n- In one move Bashar may go up (the symbol 'U'), down (the symbol 'D'), left (the symbol 'L') or right (the symbol 'R'). More formally, if he stands in the cell in the row $ i $ and in the column $ j $ , i.e. in the cell $ (i, j) $ he will move to: \n  - in the case 'U' to the cell $ (i-1, j) $ ;\n  - in the case 'D' to the cell $ (i+1, j) $ ;\n  - in the case 'L' to the cell $ (i, j-1) $ ;\n  - in the case 'R' to the cell $ (i, j+1) $ ;\n- He wants to run exactly $ k $ kilometers, so he wants to make exactly $ k $ moves;\n- Bashar can finish in any cell of the grid;\n- He can't go out of the grid so at any moment of the time he should be on some cell;\n- Bashar doesn't want to get bored while running so he must not visit the same road twice. But he can visit the same cell any number of times.\n\nBashar asks you if it is possible to run by such rules. If it is possible, you should tell him how should he run.\n\nYou should give him $ a $ steps to do and since Bashar can't remember too many steps, $ a $ should not exceed $ 3000 $ . In every step, you should give him an integer $ f $ and a string of moves $ s $ of length at most $ 4 $ which means that he should repeat the moves in the string $ s $ for $ f $ times. He will perform the steps in the order you print them.\n\nFor example, if the steps are $ 2 $ RUD, $ 3 $ UUL then the moves he is going to move are RUD $ + $ RUD $ + $ UUL $ + $ UUL $ + $ UUL $ = $ RUDRUDUULUULUUL.\n\nCan you help him and give him a correct sequence of moves such that the total distance he will run is equal to $ k $ kilometers or say, that it is impossible?",
    "inputFormat": "The only line contains three integers $ n $ , $ m $ and $ k $ ( $ 1 \\leq n, m \\leq 500 $ , $ 1 \\leq k \\leq 10 ^{9} $ ), which are the number of rows and the number of columns in the grid and the total distance Bashar wants to run.",
    "outputFormat": "If there is no possible way to run $ k $ kilometers, print \"NO\" (without quotes), otherwise print \"YES\" (without quotes) in the first line.\n\nIf the answer is \"YES\", on the second line print an integer $ a $ ( $ 1 \\leq a \\leq 3000 $ ) — the number of steps, then print $ a $ lines describing the steps.\n\nTo describe a step, print an integer $ f $ ( $ 1 \\leq f \\leq 10^{9} $ ) and a string of moves $ s $ of length at most $ 4 $ . Every character in $ s $ should be 'U', 'D', 'L' or 'R'.\n\nBashar will start from the top-left cell. Make sure to move exactly $ k $ moves without visiting the same road twice and without going outside the grid. He can finish at any cell.\n\nWe can show that if it is possible to run exactly $ k $ kilometers, then it is possible to describe the path under such output constraints.",
    "samples": [
        [
            "3 3 4",
            "YES\n2\n2 R\n2 L"
        ],
        [
            "3 3 1000000000",
            "NO"
        ],
        [
            "3 3 8",
            "YES\n3\n2 R\n2 D\n1 LLRR"
        ],
        [
            "4 4 9",
            "YES\n1\n3 RLD"
        ],
        [
            "3 4 16",
            "YES\n8\n3 R\n3 L\n1 D\n3 R\n1 D\n1 U\n3 L\n1 D"
        ]
    ],
    "hint": "The moves Bashar is going to move in the first example are: \"RRLL\".\n\nIt is not possible to run $ 1000000000 $ kilometers in the second example because the total length of the roads is smaller and Bashar can't run the same road twice.\n\nThe moves Bashar is going to move in the third example are: \"RRDDLLRR\".\n\nThe moves Bashar is going to move in the fifth example are: \"RRRLLLDRRRDULLLD\". It is the picture of his run (the roads on this way are marked with red and numbered in the order of his running):\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1301D/eda2cf93789d47332ff1838d0a037b6665e63145.png)",
    "translation": "给你一个$n\\times m$的网格,相邻的格子之间有双向边(来回两条边).\n\n问是否能不经过重复的边的情况下从左上角出发遍历$k$条边.\n\n$1\\le n,m\\le 500,1\\le k\\le10^9$\n"
}