{
    "description": "This is an interactive problem.\n\nAfter getting AC after 13 Time Limit Exceeded verdicts on a geometry problem, Kuroni went to an Italian restaurant to celebrate this holy achievement. Unfortunately, the excess sauce disoriented him, and he's now lost!\n\nThe United States of America can be modeled as a tree (why though) with $ n $ vertices. The tree is rooted at vertex $ r $ , wherein lies Kuroni's hotel.\n\nKuroni has a phone app designed to help him in such emergency cases. To use the app, he has to input two vertices $ u $ and $ v $ , and it'll return a vertex $ w $ , which is the lowest common ancestor of those two vertices.\n\nHowever, since the phone's battery has been almost drained out from live-streaming Kuroni's celebration party, he could only use the app at most $ \\lfloor \\frac{n}{2} \\rfloor $ times. After that, the phone would die and there will be nothing left to help our dear friend! :(\n\nAs the night is cold and dark, Kuroni needs to get back, so that he can reunite with his comfy bed and pillow(s). Can you help him figure out his hotel's location?",
    "inputFormat": "",
    "outputFormat": "The interaction starts with reading a single integer $ n $ ( $ 2 \\le n \\le 1000 $ ), the number of vertices of the tree.\n\nThen you will read $ n-1 $ lines, the $ i $ -th of them has two integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le n $ , $ x_i \\ne y_i $ ), denoting there is an edge connecting vertices $ x_i $ and $ y_i $ . It is guaranteed that the edges will form a tree.\n\nThen you can make queries of type \"? u v\" ( $ 1 \\le u, v \\le n $ ) to find the lowest common ancestor of vertex $ u $ and $ v $ .\n\nAfter the query, read the result $ w $ as an integer.\n\nIn case your query is invalid or you asked more than $ \\lfloor \\frac{n}{2} \\rfloor $ queries, the program will print $ -1 $ and will finish interaction. You will receive a Wrong answer verdict. Make sure to exit immediately to avoid getting other verdicts.\n\nWhen you find out the vertex $ r $ , print \"! $ r $ \" and quit after that. This query does not count towards the $ \\lfloor \\frac{n}{2} \\rfloor $ limit.\n\nNote that the tree is fixed beforehand and will not change during the queries, i.e. the interactor is not adaptive.\n\nAfter printing any query do not forget to print end of line and flush the output. Otherwise, you might get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see the documentation for other languages.\n\nHacks\n\nTo hack, use the following format:\n\nThe first line should contain two integers $ n $ and $ r $ ( $ 2 \\le n \\le 1000 $ , $ 1 \\le r \\le n $ ), denoting the number of vertices and the vertex with Kuroni's hotel.\n\nThe $ i $ -th of the next $ n-1 $ lines should contain two integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le n $ ) — denoting there is an edge connecting vertex $ x_i $ and $ y_i $ .\n\nThe edges presented should form a tree.",
    "samples": [
        [
            "6\n1 4\n4 2\n5 3\n6 3\n2 3\n\n3\n\n4\n\n4",
            "? 5 6\n\n? 3 1\n\n? 1 2\n\n! 4"
        ]
    ],
    "hint": "Note that the example interaction contains extra empty lines so that it's easier to read. The real interaction doesn't contain any empty lines and you shouldn't print any extra empty lines as well.\n\nThe image below demonstrates the tree in the sample test:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1305D/3f777a34971aedf6bf2be87025826d252775cf29.png)",
    "translation": "这是一道交互题。\n\n给你一棵有 $n$ 个节点的树。对于每次询问，提交两个点，评测机会返回这两个点的 LCA。求树根。\n\n询问格式为 ``? u v``，此时评测机会返回 $u$ 和 $v$ 的 LCA。\n\n提交格式为 ``! x``，表示你得出树根为点 $x$。\n\n你可以最多询问 $\\lfloor \\dfrac n 2 \\rfloor$ 次。"
}