{
    "description": "The round carousel consists of $ n $ figures of animals. Figures are numbered from $ 1 $ to $ n $ in order of the carousel moving. Thus, after the $ n $ -th figure the figure with the number $ 1 $ follows. Each figure has its own type — the type of the animal corresponding to this figure (the horse, the tiger and so on). The type of animal of the $ i $ -th figure equals $ t_i $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1328D/6fef0d63a3e427398bbe634881f56ca00339f29a.png)The example of the carousel for $ n=9 $ and $ t=[5, 5, 1, 15, 1, 5, 5, 1, 1] $ . You want to color each figure in one of the colors. You think that it's boring if the carousel contains two different figures (with the distinct types of animals) going one right after another and colored in the same color.\n\nYour task is to color the figures in such a way that the number of distinct colors used is the minimum possible and there are no figures of the different types going one right after another and colored in the same color. If you use exactly $ k $ distinct colors, then the colors of figures should be denoted with integers from $ 1 $ to $ k $ .",
    "inputFormat": "The input contains one or more test cases.\n\nThe first line contains one integer $ q $ ( $ 1 \\le q \\le 10^4 $ ) — the number of test cases in the test. Then $ q $ test cases follow. One test case is given on two lines.\n\nThe first line of the test case contains one integer $ n $ ( $ 3 \\le n \\le 2 \\cdot 10^5 $ ) — the number of figures in the carousel. Figures are numbered from $ 1 $ to $ n $ in order of carousel moving. Assume that after the $ n $ -th figure the figure $ 1 $ goes.\n\nThe second line of the test case contains $ n $ integers $ t_1, t_2, \\dots, t_n $ ( $ 1 \\le t_i \\le 2 \\cdot 10^5 $ ), where $ t_i $ is the type of the animal of the $ i $ -th figure.\n\nThe sum of $ n $ over all test cases does not exceed $ 2\\cdot10^5 $ .",
    "outputFormat": "Print $ q $ answers, for each test case print two lines.\n\nIn the first line print one integer $ k $ — the minimum possible number of distinct colors of figures.\n\nIn the second line print $ n $ integers $ c_1, c_2, \\dots, c_n $ ( $ 1 \\le c_i \\le k $ ), where $ c_i $ is the color of the $ i $ -th figure. If there are several answers, you can print any.",
    "samples": [
        [
            "4\n5\n1 2 1 2 2\n6\n1 2 2 1 2 2\n5\n1 2 1 2 3\n3\n10 10 10",
            "2\n1 2 1 2 2\n2\n2 1 2 1 2 1\n3\n2 3 2 3 1\n1\n1 1 1"
        ]
    ],
    "hint": "",
    "translation": "有$q$组询问,每组询问如下:\n\n已知一个有$n(3\\le n\\le 2*10^5)$个点的**环**,点$i$的类型为$a_i$,现在需要给每个点进行染色,要求**相邻**不同类型的点的颜色不同且所用颜色数最小.输出颜色数及一种染色方案即可.(颜色从1开始)\n\n注意:($\\sum n)\\le 2*10^5$."
}