{
    "description": "This is an interactive problem.\n\nAnton and Harris are playing a game to decide which of them is the king of problemsetting.\n\nThere are three piles of stones, initially containing $ a $ , $ b $ , and $ c $ stones, where $ a $ , $ b $ , and $ c $ are distinct positive integers. On each turn of the game, the following sequence of events takes place:\n\n- The first player chooses a positive integer $ y $ and provides it to the second player.\n- The second player adds $ y $ stones to one of the piles, with the condition that he cannot choose the same pile in two consecutive turns.\n\nThe second player loses if, at any point, two of the piles contain the same number of stones. The first player loses if $ 1000 $ turns have passed without the second player losing.\n\nFeeling confident in his skills, Anton decided to let Harris choose whether he wants to go first or second. Help Harris defeat Anton and become the king of problemsetting!",
    "inputFormat": "The first line of input contains three distinct positive integers $ a $ , $ b $ , and $ c $ ( $ 1 \\le a, b, c \\le 10^9 $ ) — the initial number of stones in piles $ 1 $ , $ 2 $ , and $ 3 $ respectively.",
    "outputFormat": "The interaction begins by reading the integers $ a $ , $ b $ and $ c $ .\n\nAfter reading the integers, print a single line containing either \"First\" or \"Second\", denoting who you want to play as (as first or second correspondently).\n\nOn each turn, the first player (either you or the judge) must print a positive integer $ y $ ( $ 1 \\le y \\le 10^{12} $ ).\n\nThen, the second player must print $ 1 $ , $ 2 $ , or $ 3 $ , indicating which pile should have $ y $ stones added to it. From the second turn onwards, the pile that the second player chooses must be different from the pile that they chose on the previous turn.\n\nIf you are playing as Second and complete $ 1000 $ turns without losing, or if you are playing as First and the judge has determined that it cannot make a move without losing, the interactor will print $ 0 $ and will finish interaction. This means that your program is correct for this test case, and you should exit immediately.\n\nIf you are playing as First and complete $ 1000 $ turns without winning, or if you are playing as Second and print a move that makes two piles have the same number of stones, or if you output an invalid move as either player, the interactor will print $ -1 $ and will finish interaction. You will receive a Wrong Answer verdict. Make sure to exit immediately to avoid getting other verdicts.\n\nAfter printing something do not forget to output end of line and flush the output. Otherwise, you will get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see documentation for other languages.\n\n In this problem, hacks are disabled.",
    "samples": [
        [
            "5 2 6\n\n\n3\n\n0",
            "First\n2\n\n3"
        ]
    ],
    "hint": "In the sample input, the piles initially have $ 5 $ , $ 2 $ , and $ 6 $ stones. Harris decides to go first and provides the number $ 2 $ to Anton. Anton adds $ 2 $ stones to the third pile, which results in $ 5 $ , $ 2 $ , and $ 8 $ .\n\nIn the next turn, Harris chooses $ 3 $ . Note that Anton cannot add the stones to the third pile since he chose the third pile in the previous turn. Anton realizes that he has no valid moves left and reluctantly recognizes Harris as the king.",
    "translation": "这是一道**交互题**。\n\n有三堆石子，个数分别为$a,b,c$。游戏的规则如下：\n\n- 先手每次给定一个数$k$，后手需要给这三堆石子的某一堆的个数加上$k$。\n- 后手不能连续对同一堆石子进行操作。\n- 当存在两堆石子个数相等时，先手胜；当回合数超过1000时，后手胜。\n\n你可以自行决定当先手还是后手。\n\n$a,b,c \\leq 10^9,k \\leq 10^{12}$。"
}