{
    "description": "Polycarp and his friends want to visit a new restaurant. The restaurant has $ n $ tables arranged along a straight line. People are already sitting at some tables. The tables are numbered from $ 1 $ to $ n $ in the order from left to right. The state of the restaurant is described by a string of length $ n $ which contains characters \"1\" (the table is occupied) and \"0\" (the table is empty).\n\nRestaurant rules prohibit people to sit at a distance of $ k $ or less from each other. That is, if a person sits at the table number $ i $ , then all tables with numbers from $ i-k $ to $ i+k $ (except for the $ i $ -th) should be free. In other words, the absolute difference of the numbers of any two occupied tables must be strictly greater than $ k $ .\n\nFor example, if $ n=8 $ and $ k=2 $ , then:\n\n- strings \"10010001\", \"10000010\", \"00000000\", \"00100000\" satisfy the rules of the restaurant;\n- strings \"10100100\", \"10011001\", \"11111111\" do not satisfy to the rules of the restaurant, since each of them has a pair of \"1\" with a distance less than or equal to $ k=2 $ .\n\nIn particular, if the state of the restaurant is described by a string without \"1\" or a string with one \"1\", then the requirement of the restaurant is satisfied.\n\nYou are given a binary string $ s $ that describes the current state of the restaurant. It is guaranteed that the rules of the restaurant are satisfied for the string $ s $ .\n\nFind the maximum number of free tables that you can occupy so as not to violate the rules of the restaurant. Formally, what is the maximum number of \"0\" that can be replaced by \"1\" such that the requirement will still be satisfied?\n\nFor example, if $ n=6 $ , $ k=1 $ , $ s= $ \"100010\", then the answer to the problem will be $ 1 $ , since only the table at position $ 3 $ can be occupied such that the rules are still satisfied.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the test. Then $ t $ test cases follow.\n\nEach test case starts with a line containing two integers $ n $ and $ k $ ( $ 1 \\le k \\le n \\le 2\\cdot 10^5 $ ) — the number of tables in the restaurant and the minimum allowed distance between two people.\n\nThe second line of each test case contains a binary string $ s $ of length $ n $ consisting of \"0\" and \"1\" — a description of the free and occupied tables in the restaurant. The given string satisfy to the rules of the restaurant — the difference between indices of any two \"1\" is more than $ k $ .\n\nThe sum of $ n $ for all test cases in one test does not exceed $ 2\\cdot 10^5 $ .",
    "outputFormat": "For each test case output one integer — the number of tables that you can occupy so as not to violate the rules of the restaurant. If additional tables cannot be taken, then, obviously, you need to output $ 0 $ .",
    "samples": [
        [
            "6\n6 1\n100010\n6 2\n000000\n5 1\n10101\n3 1\n001\n2 2\n00\n1 1\n0",
            "1\n2\n0\n1\n1\n1"
        ]
    ],
    "hint": "The first test case is explained in the statement.\n\nIn the second test case, the answer is $ 2 $ , since you can choose the first and the sixth table.\n\nIn the third test case, you cannot take any free table without violating the rules of the restaurant.",
    "translation": "给出一个长为 $n$ 的 $01$ 字符串和一个整数 $k$（$1\\le k\\le n\\le 2\\times10^5$），要求将串中的若干个 $0$ 变成 $1$，并且要使得变化后的串中任意相邻的两个 $1$ 之间至少有 $k$ 个 $0$，问最多可以将多少个 $0$ 变成 $1$。"
}