{
    "description": "Linda likes to change her hair color from time to time, and would be pleased if her boyfriend Archie would notice the difference between the previous and the new color. Archie always comments on Linda's hair color if and only if he notices a difference — so Linda always knows whether Archie has spotted the difference or not.\n\nThere is a new hair dye series in the market where all available colors are numbered by integers from $ 1 $ to $ N $ such that a smaller difference of the numerical values also means less visual difference.\n\nLinda assumes that for these series there should be some critical color difference $ C $ ( $ 1 \\le C \\le N $ ) for which Archie will notice color difference between the current color $ \\mathrm{color}_{\\mathrm{new}} $ and the previous color $ \\mathrm{color}_{\\mathrm{prev}} $ if $ \\left|\\mathrm{color}_{\\mathrm{new}} - \\mathrm{color}_{\\mathrm{prev}}\\right| \\ge C $ and will not if $ \\left|\\mathrm{color}_{\\mathrm{new}} - \\mathrm{color}_{\\mathrm{prev}}\\right| < C $ .\n\nNow she has bought $ N $ sets of hair dye from the new series — one for each of the colors from $ 1 $ to $ N $ , and is ready to set up an experiment. Linda will change her hair color on a regular basis and will observe Archie's reaction — whether he will notice the color change or not. Since for the proper dye each set should be used completely, each hair color can be obtained no more than once.\n\nBefore the experiment, Linda was using a dye from a different series which is not compatible with the new one, so for the clearness of the experiment Archie's reaction to the first used color is meaningless.\n\nHer aim is to find the precise value of $ C $ in a limited number of dyes. Write a program which finds the value of $ C $ by experimenting with the given $ N $ colors and observing Archie's reactions to color changes.",
    "inputFormat": "",
    "outputFormat": "This is an interactive task. In the beginning you are given a single integer $ T $ ( $ 1 \\leq T \\leq 100 $ ), the number of cases in the test.\n\nFor each test case, the input first contains a single integer — the value of $ N $ ( $ 1 < N \\le 10^{18} $ ). The value of $ C $ is kept secret by the grading system.\n\nThen your program should make queries writing output in the following format: \"? $ P $ \", where $ P $ is an integer ( $ 1 \\le P \\le N $ ) denoting the next color used. For each query the grading system gives an answer in the next line of the input. The answer is $ 1 $ if Archie notices the color difference between the last two colors and $ 0 $ otherwise. No two queries should have the same $ P $ value.\n\nWhen your program determines $ C $ , it should output its value in the following format: \"= $ C $ \". The grading system will not respond to this output and will proceed with the next test case.\n\nYour program may use at most 64 queries \"?\" for each test case to find the correct value of $ C $ .\n\nTo establish proper communication between your program and the grading system, you should flush the output stream after each query.\n\n $ $$$\\begin{array}{ll} \\text{Language} & \\text{Command} \\\\ \\hline \\text{C++} & \\texttt{std::cout }\\texttt{<}\\texttt{<}\\texttt{ std::endl;} \\\\ \\text{Java} & \\texttt{System.out.flush();} \\\\ \\text{Python} & \\texttt{sys.stdout.flush()} \\end{array} $ $  Flush commands </center><p>Note that <span class=\"tex-font-style-tt\">std::endl</span> writes a newline and flushes the stream.</p><p>It is possible to receive an \"Output isn't correct\" outcome even after printing a correct answer, if task constraints were violated during the communication. Violating the communication protocol itself may result in an \"Execution killed\" outcome.</p><p>Submitting user tests requires specifying an input file with the testcase parameters. The format of the input file is \"<span class=\"tex-font-style-tt\"> $ T $ </span>\" in the first line, and then \"<span class=\"tex-font-style-tt\"> $ N $   $ C $ </span>\" on a single line for each of the  $ T $  cases.</p></div><div><div class=\"section-title\">Scoring</div><p>Subtasks: </p><ol> <li> (9 points)  $ N \\\\le 64 $  </li><li> (13 points)  $ N \\\\le 125 $  </li><li> (21 points)  $ N \\\\le 1000 $  </li><li> (24 points)  $ N \\\\le 10^9$$$ 2. (33 points) No further constraints.",
    "samples": [
        [
            "1\n\n7\n\n1\n\n1\n\n0\n\n0\n\n1",
            "? 2\n\n? 7\n\n? 4\n\n? 1\n\n? 5\n\n= 4"
        ]
    ],
    "hint": "Comments to the example input line by line:\n\n1. $ N = 7 $ .\n2. Answer to the first query is meaningless (can also be $ 0 $ ).\n3. $ C \\leq 5 $ .\n4. $ 3 < C \\leq 5 $ . It would be wise to check difference $ 4 $ . However, this can not be done in the next query since $ 4 + 4 = 8 $ and $ 4 - 4 = 0 $ both are outside the allowed interval $ 1 \\le P \\le 7 $ .\n5. $ 3 < C \\leq 5 $ .\n6. $ 3 < C \\leq 4 $ . Therefore, $ C = 4 $ .",
    "translation": "有一个值 $c<n$，你可以用最多 $64$ 次询问把它查询出来。\n\n每次询问你可以给出一个 $x\\le n$，假设你上次问的是 $y$，那么系统将返回 $|x-y|≥c$ 是否为真。\n\n因为第一次询问没有上次询问的值，所以系统返回什么都可以。此外，你还要保证你询问的 $x$ 不重复。\n\n$n\\le10^{18}$ 多测。"
}