{
    "description": "You are given an undirected graph where each edge has one of two colors: black or red.\n\nYour task is to assign a real number to each node so that:\n\n- for each black edge the sum of values at its endpoints is $ 1 $ ;\n- for each red edge the sum of values at its endpoints is $ 2 $ ;\n- the sum of the absolute values of all assigned numbers is the smallest possible.\n\nOtherwise, if it is not possible, report that there is no feasible assignment of the numbers.",
    "inputFormat": "The first line contains two integers $ N $ ( $ 1 \\leq N \\leq       100\\,000 $ ) and $ M $ ( $ 0 \\leq M \\leq 200\\,000 $ ): the number of nodes and the number of edges, respectively. The nodes are numbered by consecutive integers: $ 1, 2, \\ldots, N $ .\n\nThe next $ M $ lines describe the edges. Each line contains three integers $ a $ , $ b $ and $ c $ denoting that there is an edge between nodes $ a $ and $ b $ ( $ 1 \\leq a, b \\leq       N $ ) with color $ c $ ( $ 1 $ denotes black, $ 2 $ denotes red).",
    "outputFormat": "If there is a solution, the first line should contain the word \"YES\" and the second line should contain $ N $ space-separated numbers. For each $ i $ ( $ 1 \\le i \\le N $ ), the $ i $ -th number should be the number assigned to the node $ i $ .\n\nOutput should be such that:\n\n- the sum of the numbers at the endpoints of each edge differs from the precise value by less than $ 10^{-6} $ ;\n- the sum of the absolute values of all assigned numbers differs from the smallest possible by less than $ 10^{-6} $ .\n\nIf there are several valid solutions, output any of them.\n\nIf there is no solution, the only line should contain the word \"NO\".\n\nScoring\n\nSubtasks:\n\n1. (5 points) $ N \\leq 5 $ , $ M \\leq 14 $\n2. (12 points) $ N \\leq 100 $\n3. (17 points) $ N \\leq 1000 $\n4. (24 points) $ N \\leq 10\\,000 $\n5. (42 points) No further constraints",
    "samples": [
        [
            "4 4\n1 2 1\n2 3 2\n1 3 2\n3 4 1",
            "YES\n0.5 0.5 1.5 -0.5"
        ],
        [
            "2 1\n1 2 1",
            "YES\n0.3 0.7"
        ],
        [
            "3 2\n1 2 2\n2 3 2",
            "YES\n0 2 0"
        ],
        [
            "3 4\n1 2 2\n2 2 1\n2 1 1\n1 2 2",
            "NO"
        ]
    ],
    "hint": "Note that in the second example the solution is not unique.",
    "translation": "给定一张 $N$ 点 $M$ 边的无向图，节点的编号为 $1 \\sim N$，每个点有一个**实数**点权 $v_i$。  \n每条边有一个边权 $1$ 或 $2$，边的边权等于这条边连接的两个点的点权和。  \n现给定每条边的边权，求一组点权绝对值和最小的方案，即最小化 $\\sum_{i=1}^n |v_i|$。  \n多种方案输出任意一种，无解输出 `NO`。  \n$1 \\leq N \\leq 10^5,0 \\leq M \\leq 2 \\times 10^5$"
}