{
    "description": "Leo Jr. draws pictures in his notebook with checkered sheets (that is, each sheet has a regular square grid printed on it). We can assume that the sheets are infinitely large in any direction.\n\nTo draw a picture, Leo Jr. colors some of the cells on a sheet gray. He considers the resulting picture beautiful if the following conditions are satisfied:\n\n- The picture is connected, that is, it is possible to get from any gray cell to any other by following a chain of gray cells, with each pair of adjacent cells in the path being neighbours (that is, sharing a side).\n- Each gray cell has an even number of gray neighbours.\n- There are exactly $ n $ gray cells with all gray neighbours. The number of other gray cells can be arbitrary (but reasonable, so that they can all be listed).\n\nLeo Jr. is now struggling to draw a beautiful picture with a particular choice of $ n $ . Help him, and provide any example of a beautiful picture.\n\nTo output cell coordinates in your answer, assume that the sheet is provided with a Cartesian coordinate system such that one of the cells is chosen to be the origin $ (0, 0) $ , axes $ 0x $ and $ 0y $ are orthogonal and parallel to grid lines, and a unit step along any axis in any direction takes you to a neighbouring cell.",
    "inputFormat": "The only line contains a single integer $ n $ ( $ 1 \\leq n \\leq 500 $ ) — the number of gray cells with all gray neighbours in a beautiful picture.",
    "outputFormat": "In the first line, print a single integer $ k $ — the number of gray cells in your picture. For technical reasons, $ k $ should not exceed $ 5 \\cdot 10^5 $ .\n\nEach of the following $ k $ lines should contain two integers — coordinates of a gray cell in your picture. All listed cells should be distinct, and the picture should satisdfy all the properties listed above. All coordinates should not exceed $ 10^9 $ by absolute value.\n\nOne can show that there exists an answer satisfying all requirements with a small enough $ k $ .",
    "samples": [
        [
            "4",
            "12\n1 0\n2 0\n0 1\n1 1\n2 1\n3 1\n0 2\n1 2\n2 2\n3 2\n1 3\n2 3"
        ]
    ],
    "hint": "The answer for the sample is pictured below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1368C/3fa001b29e7935b0f51cdaa16df617ab997510da.png)",
    "translation": "### 题面描述\r\n\r\n在网格图上给不超过 $5\\times 10^5$ 的格子涂色，使得所有被涂色的格子**连通**且**与偶数个被涂色的格子相邻**，且恰好有 $n$ 个被涂色的格子的**四周的格子都被涂色**。\r\n\r\n### 输入格式\r\n\r\n一行一个整数 $n\\ (1\\leq n\\leq 500)$，表示四周都被涂色的格子的个数。\r\n\r\n### 输出格式\r\n\r\n第一行输出一个不超过 $5\\times 10^5$ 的整数 $k$，表示被涂色的格子的个数。\r\n\r\n接下来 $k$ 行，每行两个绝对值不超过 $10^9$ 的整数 $x,y$，表示被染色的格子的坐标。\r\n\r\n可以证明总是有一个合法的方案满足所有的要求。\r\n\r\nTranslated by Alex_Wei."
}