{
    "description": "Roma is playing a new expansion for his favorite game World of Darkraft. He made a new character and is going for his first grind.\n\nRoma has a choice to buy exactly one of $ n $ different weapons and exactly one of $ m $ different armor sets. Weapon $ i $ has attack modifier $ a_i $ and is worth $ ca_i $ coins, and armor set $ j $ has defense modifier $ b_j $ and is worth $ cb_j $ coins.\n\nAfter choosing his equipment Roma can proceed to defeat some monsters. There are $ p $ monsters he can try to defeat. Monster $ k $ has defense $ x_k $ , attack $ y_k $ and possesses $ z_k $ coins. Roma can defeat a monster if his weapon's attack modifier is larger than the monster's defense, and his armor set's defense modifier is larger than the monster's attack. That is, a monster $ k $ can be defeated with a weapon $ i $ and an armor set $ j $ if $ a_i > x_k $ and $ b_j > y_k $ . After defeating the monster, Roma takes all the coins from them. During the grind, Roma can defeat as many monsters as he likes. Monsters do not respawn, thus each monster can be defeated at most one.\n\nThanks to Roma's excessive donations, we can assume that he has an infinite amount of in-game currency and can afford any of the weapons and armor sets. Still, he wants to maximize the profit of the grind. The profit is defined as the total coins obtained from all defeated monsters minus the cost of his equipment. Note that Roma must purchase a weapon and an armor set even if he can not cover their cost with obtained coins.\n\nHelp Roma find the maximum profit of the grind.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ , and $ p $ ( $ 1 \\leq n, m, p \\leq 2 \\cdot 10^5 $ ) — the number of available weapons, armor sets and monsters respectively.\n\nThe following $ n $ lines describe available weapons. The $ i $ -th of these lines contains two integers $ a_i $ and $ ca_i $ ( $ 1 \\leq a_i \\leq 10^6 $ , $ 1 \\leq ca_i \\leq 10^9 $ ) — the attack modifier and the cost of the weapon $ i $ .\n\nThe following $ m $ lines describe available armor sets. The $ j $ -th of these lines contains two integers $ b_j $ and $ cb_j $ ( $ 1 \\leq b_j \\leq 10^6 $ , $ 1 \\leq cb_j \\leq 10^9 $ ) — the defense modifier and the cost of the armor set $ j $ .\n\nThe following $ p $ lines describe monsters. The $ k $ -th of these lines contains three integers $ x_k, y_k, z_k $ ( $ 1 \\leq x_k, y_k \\leq 10^6 $ , $ 1 \\leq z_k \\leq 10^3 $ ) — defense, attack and the number of coins of the monster $ k $ .",
    "outputFormat": "Print a single integer — the maximum profit of the grind.",
    "samples": [
        [
            "2 3 3\n2 3\n4 7\n2 4\n3 2\n5 11\n1 2 4\n2 1 6\n3 4 6",
            "1"
        ]
    ],
    "hint": "",
    "translation": "给定一系列有代价的装备，第一种提供 $x$ 值，第二种提供 $y$ 值，每种装备买一个。给出一些怪兽，如果怪兽的 $x_i$ 和 $y_i$ 都小于选定的 $x$ 和 $y$ ，那么会有 $z_i$ 的奖励。最大化收益。\n\n$1\\leq n\\leq 2\\times 10^5$ 。"
}