{
    "description": "Carousel Boutique is busy again! Rarity has decided to visit the pony ball and she surely needs a new dress, because going out in the same dress several times is a sign of bad manners. First of all, she needs a dress pattern, which she is going to cut out from the rectangular piece of the multicolored fabric.\n\nThe piece of the multicolored fabric consists of $ n \\times m $ separate square scraps. Since Rarity likes dresses in style, a dress pattern must only include scraps sharing the same color. A dress pattern must be the square, and since Rarity is fond of rhombuses, the sides of a pattern must form a $ 45^{\\circ} $ angle with sides of a piece of fabric (that way it will be resembling the traditional picture of a rhombus).\n\nExamples of proper dress patterns: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1393D/1313c2f6e2e4ec2b50b9f433196c0f6817a45d78.png) Examples of improper dress patterns: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1393D/53b6557287b6852020c7bea84c9bc4969c632d30.png) The first one consists of multi-colored scraps, the second one goes beyond the bounds of the piece of fabric, the third one is not a square with sides forming a $ 45^{\\circ} $ angle with sides of the piece of fabric.\n\nRarity wonders how many ways to cut out a dress pattern that satisfies all the conditions that do exist. Please help her and satisfy her curiosity so she can continue working on her new masterpiece!",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1       \\le n, m \\le 2000 $ ). Each of the next $ n $ lines contains $ m $ characters: lowercase English letters, the $ j $ -th of which corresponds to scrap in the current line and in the $ j $ -th column. Scraps having the same letter share the same color, scraps having different letters have different colors.",
    "outputFormat": "Print a single integer: the number of ways to cut out a dress pattern to satisfy all of Rarity's conditions.",
    "samples": [
        [
            "3 3\naaa\naaa\naaa",
            "10"
        ],
        [
            "3 4\nabab\nbaba\nabab",
            "12"
        ],
        [
            "5 5\nzbacg\nbaaac\naaaaa\neaaad\nweadd",
            "31"
        ]
    ],
    "hint": "In the first example, all the dress patterns of size $ 1 $ and one of size $ 2 $ are satisfactory.\n\nIn the second example, only the dress patterns of size $ 1 $ are satisfactory.",
    "translation": "45dino 要从一块 $n\\times m$ 的布料上裁一块菱形做裙子（不是给自己做。\n\n这一块布料由 $n\\times m$ 个颜色块组成，要满足裁下的菱形必须由若干相同的颜色块组成。\n\n求有多少种裁法。\n\n注：一个方格也算一个菱形。"
}