{
    "description": "Leo has developed a new programming language C+=. In C+=, integer variables can only be changed with a \"+=\" operation that adds the right-hand side value to the left-hand side variable. For example, performing \"a += b\" when a =  $ 2 $ , b =  $ 3 $ changes the value of a to $ 5 $ (the value of b does not change).\n\nIn a prototype program Leo has two integer variables a and b, initialized with some positive values. He can perform any number of operations \"a += b\" or \"b += a\". Leo wants to test handling large integers, so he wants to make the value of either a or b strictly greater than a given value $ n $ . What is the smallest number of operations he has to perform?",
    "inputFormat": "The first line contains a single integer $ T $ ( $ 1 \\leq T       \\leq 100 $ ) — the number of test cases.\n\nEach of the following $ T $ lines describes a single test case, and contains three integers $ a, b, n $ ( $ 1 \\leq a, b \\leq n       \\leq 10^9 $ ) — initial values of a and b, and the value one of the variables has to exceed, respectively.",
    "outputFormat": "For each test case print a single integer — the smallest number of operations needed. Separate answers with line breaks.",
    "samples": [
        [
            "2\n1 2 3\n5 4 100",
            "2\n7"
        ]
    ],
    "hint": "In the first case we cannot make a variable exceed $ 3 $ in one operation. One way of achieving this in two operations is to perform \"b += a\" twice.",
    "translation": "### 题意\r\n\r\n有三个整数 $a$，$b$ 与 $n$，每一次可以执行以下操作之一：\r\n\r\n- 将 $a$ 增加 $b$；\r\n\r\n- 将 $b$ 增加 $a$。\r\n\r\n求使得 $a$ 和 $b$ 中**至少**有一个数**严格大于** $n$ **至少**需要操作几次。\r\n\r\n### 输入格式\r\n\r\n本题**含有多组数据**。第一行一个整数 $T$，表示数据组数。\r\n\r\n接下来 $T$ 行每行三个整数 $a$，$b$ 与 $n$，含义如上所述。\r\n\r\n### 输出格式\r\n\r\n对于每组数据一行一个数，表示最小操作次数。\r\n\r\n### 数据范围\r\n\r\n- $1 \\leq T \\leq 100$\r\n\r\n- $1 \\leq a,b \\leq n \\leq 10^9$"
}