{
    "description": "Being Santa Claus is very difficult. Sometimes you have to deal with difficult situations.\n\nToday Santa Claus came to the holiday and there were $ m $ children lined up in front of him. Let's number them from $ 1 $ to $ m $ . Grandfather Frost knows $ n $ spells. The $ i $ -th spell gives a candy to every child whose place is in the $ [L_i, R_i] $ range. Each spell can be used at most once. It is also known that if all spells are used, each child will receive at most $ k $ candies.\n\nIt is not good for children to eat a lot of sweets, so each child can eat no more than one candy, while the remaining candies will be equally divided between his (or her) Mom and Dad. So it turns out that if a child would be given an even amount of candies (possibly zero), then he (or she) will be unable to eat any candies and will go sad. However, the rest of the children (who received an odd number of candies) will be happy.\n\nHelp Santa Claus to know the maximum number of children he can make happy by casting some of his spells.",
    "inputFormat": "The first line contains three integers of $ n $ , $ m $ , and $ k $ ( $ 1 \\leq n \\leq 100\\,000, 1 \\leq m \\leq 10^9, 1 \\leq k \\leq 8 $ ) — the number of spells, the number of children and the upper limit on the number of candy a child can get if all spells are used, respectively.\n\nThis is followed by $ n $ lines, each containing integers $ L_i $ and $ R_i $ ( $ 1 \\leq L_i \\leq R_i \\leq m $ ) — the parameters of the $ i $ spell.",
    "outputFormat": "Print a single integer — the maximum number of children that Santa can make happy.",
    "samples": [
        [
            "3 5 3\n1 3\n2 4\n3 5",
            "4"
        ]
    ],
    "hint": "In the first example, Santa should apply the first and third spell. In this case all children will be happy except the third.",
    "translation": "做圣诞老人是一件很难的事。有时你不得不面对困难的情况。\n\n今天圣诞老人在度假的时候，有 $m$ 个孩子排在他面前。我们把他们从 $1$ 到 $m$ 编上号。圣诞老人知道 $n$ 个咒语。每个咒语给编号从 $L_i$ 到 $R_i$ 的每个孩子一颗糖果。题目保证如果将全部的咒语都用一次，每个孩子至多收到 k 颗糖果\n\n如果一个孩子得到的糖果量是偶数（可能为零），那么他（或她）会很伤心。不过，其他孩子（收到奇数个糖果的孩子）会很高兴。\n\n请问圣诞老人最多能使多少个孩子快乐。"
}