{
    "description": "Lee is used to finish his stories in a stylish way, this time he barely failed it, but Ice Bear came and helped him. Lee is so grateful for it, so he decided to show Ice Bear his new game called \"Critic\"...\n\nThe game is a one versus one game. It has $ t $ rounds, each round has two integers $ s_i $ and $ e_i $ (which are determined and are known before the game begins, $ s_i $ and $ e_i $ may differ from round to round). The integer $ s_i $ is written on the board at the beginning of the corresponding round.\n\nThe players will take turns. Each player will erase the number on the board (let's say it was $ a $ ) and will choose to write either $ 2 \\cdot a $ or $ a + 1 $ instead. Whoever writes a number strictly greater than $ e_i $ loses that round and the other one wins that round.\n\nNow Lee wants to play \"Critic\" against Ice Bear, for each round he has chosen the round's $ s_i $ and $ e_i $ in advance. Lee will start the first round, the loser of each round will start the next round.\n\nThe winner of the last round is the winner of the game, and the loser of the last round is the loser of the game.\n\nDetermine if Lee can be the winner independent of Ice Bear's moves or not. Also, determine if Lee can be the loser independent of Ice Bear's moves or not.",
    "inputFormat": "The first line contains the integer $ t $ ( $ 1 \\le t \\le       10^5 $ ) — the number of rounds the game has.\n\nThen $ t $ lines follow, each contains two integers $ s_i $ and $ e_i $ ( $ 1 \\le s_i \\le e_i \\le 10^{18} $ ) — the $ i $ -th round's information.\n\nThe rounds are played in the same order as given in input, $ s_i $ and $ e_i $ for all rounds are known to everyone before the game starts.",
    "outputFormat": "Print two integers.\n\nThe first one should be 1 if Lee can be the winner independent of Ice Bear's moves, and 0 otherwise.\n\nThe second one should be 1 if Lee can be the loser independent of Ice Bear's moves, and 0 otherwise.",
    "samples": [
        [
            "3\n5 8\n1 4\n3 10",
            "1 1"
        ],
        [
            "4\n1 2\n2 3\n3 4\n4 5",
            "0 0"
        ],
        [
            "1\n1 1",
            "0 1"
        ],
        [
            "2\n1 9\n4 5",
            "0 0"
        ],
        [
            "2\n1 2\n2 8",
            "1 0"
        ],
        [
            "6\n216986951114298167 235031205335543871\n148302405431848579 455670351549314242\n506251128322958430 575521452907339082\n1 768614336404564650\n189336074809158272 622104412002885672\n588320087414024192 662540324268197150",
            "1 0"
        ]
    ],
    "hint": "Remember, whoever writes an integer greater than $ e_i $ loses.",
    "translation": "### 题目描述\n\n（以下内容并非逐字翻译，但并不影响做题）\n\nLee 习惯于用一种新奇的方式结束他的故事，比如和 Ice Bear 玩一个叫做 Critic 的游戏。\n\n游戏规则是这样的：这是一个 1V1 的游戏，有且仅有 $t$ 轮。对于每一轮，有且仅有两个双方均已知的，不会更改的整数 $s_i$ , $e_i$ 。其中 $s_i$ 被写在了黑板上。\n\n现在，两名玩家同时上场，有两种操作，他/它只能并且必须选择一种操作：\n\n* 将黑板上的数 $a$ 改写为 $a+1$\n\n* 将黑板上的数 $a$ 改写为 $2 \\times a$\n\n最终，写上的 $a$ 大于这一轮的 $e_i$ 的人输掉该轮比赛。每一轮的失败者就是下一轮的起始者（首先上去写数的人）。整场比赛的输赢取决于最后一轮的输赢。\n\n求出，如果 Lee 是第一轮比赛的起始者，他是否有必赢，必输策略。\n\n### 输入格式\n\n第一行一个整数$t $，表示整场比赛有几轮。\n\n下面$t $行，每行两个整数$s_i,e_i$,中间用空格隔开，第$i+1$行是第$i$ 场比赛的信息。\n\n### 输出格式\n\n一行两个整数，中间用空格隔开，表示Lee是（1）否（0）有必赢，必输策略。"
}