{
    "description": "Uncle Bogdan is in captain Flint's crew for a long time and sometimes gets nostalgic for his homeland. Today he told you how his country introduced a happiness index.\n\nThere are $ n $ cities and $ n−1 $ undirected roads connecting pairs of cities. Citizens of any city can reach any other city traveling by these roads. Cities are numbered from $ 1 $ to $ n $ and the city $ 1 $ is a capital. In other words, the country has a tree structure.\n\nThere are $ m $ citizens living in the country. A $ p_i $ people live in the $ i $ -th city but all of them are working in the capital. At evening all citizens return to their home cities using the shortest paths.\n\nEvery person has its own mood: somebody leaves his workplace in good mood but somebody are already in bad mood. Moreover any person can ruin his mood on the way to the hometown. If person is in bad mood he won't improve it.\n\nHappiness detectors are installed in each city to monitor the happiness of each person who visits the city. The detector in the $ i $ -th city calculates a happiness index $ h_i $ as the number of people in good mood minus the number of people in bad mood. Let's say for the simplicity that mood of a person doesn't change inside the city.\n\nHappiness detector is still in development, so there is a probability of a mistake in judging a person's happiness. One late evening, when all citizens successfully returned home, the government asked uncle Bogdan (the best programmer of the country) to check the correctness of the collected happiness indexes.\n\nUncle Bogdan successfully solved the problem. Can you do the same?\n\nMore formally, You need to check: \"Is it possible that, after all people return home, for each city $ i $ the happiness index will be equal exactly to $ h_i $ \".",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le       10000 $ ) — the number of test cases.\n\nThe first line of each test case contains two integers $ n $ and $ m $ ( $ 1 \\le n \\le 10^5 $ ; $ 0 \\le m \\le 10^9 $ ) — the number of cities and citizens.\n\nThe second line of each test case contains $ n $ integers $ p_1, p_2, \\ldots, p_{n} $ ( $ 0 \\le p_i \\le m $ ; $ p_1 + p_2       + \\ldots + p_{n} = m $ ), where $ p_i $ is the number of people living in the $ i $ -th city.\n\nThe third line contains $ n $ integers $ h_1, h_2, \\ldots,       h_{n} $ ( $ -10^9 \\le h_i \\le 10^9 $ ), where $ h_i $ is the calculated happiness index of the $ i $ -th city.\n\nNext $ n − 1 $ lines contain description of the roads, one per line. Each line contains two integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le n $ ; $ x_i \\neq y_i $ ), where $ x_i $ and $ y_i $ are cities connected by the $ i $ -th road.\n\nIt's guaranteed that the sum of $ n $ from all test cases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print YES, if the collected data is correct, or NO — otherwise. You can print characters in YES or NO in any case.",
    "samples": [
        [
            "2\n7 4\n1 0 1 1 0 1 0\n4 0 0 -1 0 -1 0\n1 2\n1 3\n1 4\n3 5\n3 6\n3 7\n5 11\n1 2 5 2 1\n-11 -2 -6 -2 -1\n1 2\n1 3\n1 4\n3 5",
            "YES\nYES"
        ],
        [
            "2\n4 4\n1 1 1 1\n4 1 -3 -1\n1 2\n1 3\n1 4\n3 13\n3 3 7\n13 1 4\n1 2\n1 3",
            "NO\nNO"
        ]
    ],
    "hint": "Let's look at the first test case of the first sample:\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1388C/001794ade043a3f0f7ed603305eb551246689207.png)At first, all citizens are in the capital. Let's describe one of possible scenarios:\n\n- a person from city $ 1 $ : he lives in the capital and is in good mood;\n- a person from city $ 4 $ : he visited cities $ 1 $ and $ 4 $ , his mood was ruined between cities $ 1 $ and $ 4 $ ;\n- a person from city $ 3 $ : he visited cities $ 1 $ and $ 3 $ in good mood;\n- a person from city $ 6 $ : he visited cities $ 1 $ , $ 3 $ and $ 6 $ , his mood was ruined between cities $ 1 $ and $ 3 $ ;\n\n In total, - $ h_1 = 4 - 0 =         4 $ ,\n- $ h_2 = 0 $ ,\n- $ h_3 = 1 - 1 = 0 $ ,\n- $ h_4 = 0 - 1 = -1 $ ,\n- $ h_5 = 0 $ ,\n- $ h_6 = 0 - 1 = -1 $ ,\n- $ h_7 = 0 $ .\n\nThe second case of the first test:\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1388C/a9264c4828a85c9989a95ed8604e23cfb9f3dcda.png)All people have already started in bad mood in the capital — this is the only possible scenario.\n\nThe first case of the second test:\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1388C/b8bbd8cbfa8f12355a17c596fd18bc65433a619c.png)The second case of the second test:\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1388C/5c48a1551b8fe0dc0edc02bc5782fb0068b84587.png)It can be proven that there is no way to achieve given happiness indexes in both cases of the second test.",
    "translation": "## 题目描述\n给出一颗根节点为 $1$ 的树，对于每个节点 $i$，有 $p_i$ 个人的家在节点 $i$ 上。\n\n一开始所有人都在根节点上，然后每个人会往家沿着最短路走。\n\n每个人出发时有一个心情，可能是好心情也可能是坏心情，在经过一条边时，心情可能由好变坏，但是不可能由坏变好。\n\n每个点有一个幸福检测器，最后的检测结果为：所有经过该节点的人中，好心情的人数减坏心情的人数。\n\n现在给出 $h_i$，问有没有可能最后每个节点的检测结果恰好为 $h_i$。\n\n## 输入描述\n第一行一个整数 $t$ 表示有多少组数据。\n\n每组数据中，第一行两个整数 $n,m$，表示节点数和总人数。\n\n第二行 $n$ 个整数表示 $p_i$。\n\n第三行 $n$ 个整数表示 $h_i$。\n\n下面 $n-1$ 行，每行两个整数 $x,y$，表示节点 $x$ 和 $y$ 之间存在一条边。\n\n## 输出描述\n输出 $t$ 行，每行为 `YES` 或 `NO`，`YES` 表示有可能最后每个节点的检测结果恰好为 $h_i$，`NO` 表示没有可能。"
}