{
    "description": "The King of Berland Polycarp LXXXIV has $ n $ daughters. To establish his power to the neighbouring kingdoms he wants to marry his daughters to the princes of these kingdoms. As a lucky coincidence there are $ n $ other kingdoms as well.\n\nSo Polycarp LXXXIV has enumerated his daughters from $ 1 $ to $ n $ and the kingdoms from $ 1 $ to $ n $ . For each daughter he has compiled a list of kingdoms princes of which she wanted to marry.\n\nPolycarp LXXXIV is very busy, so he finds a couple for his daughters greedily one after another.\n\nFor the first daughter he takes the kingdom with the lowest number from her list and marries the daughter to their prince. For the second daughter he takes the kingdom with the lowest number from her list, prince of which hasn't been taken already. If there are no free princes in the list then the daughter marries nobody and Polycarp LXXXIV proceeds to the next daughter. The process ends after the $ n $ -th daughter.\n\nFor example, let there be $ 4 $ daughters and kingdoms, the lists daughters have are $ [2, 3] $ , $ [1, 2] $ , $ [3, 4] $ , $ [3] $ , respectively.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1327B/50ce2d8ac0f6b682008f6274aa8cfbc6afc16be3.png)In that case daughter $ 1 $ marries the prince of kingdom $ 2 $ , daughter $ 2 $ marries the prince of kingdom $ 1 $ , daughter $ 3 $ marries the prince of kingdom $ 3 $ , leaving daughter $ 4 $ nobody to marry to.\n\nActually, before starting the marriage process Polycarp LXXXIV has the time to convince one of his daughters that some prince is also worth marrying to. Effectively, that means that he can add exactly one kingdom to exactly one of his daughter's list. Note that this kingdom should not be present in the daughter's list.\n\nPolycarp LXXXIV wants to increase the number of married couples.\n\nUnfortunately, what he doesn't have the time for is determining what entry to add. If there is no way to increase the total number of married couples then output that the marriages are already optimal. Otherwise, find such an entry that the total number of married couples increases if Polycarp LXXXIV adds it.\n\nIf there are multiple ways to add an entry so that the total number of married couples increases then print any of them.\n\nFor your and our convenience you are asked to answer $ t $ independent test cases.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^5 $ ) — the number of test cases.\n\nThen $ t $ test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the number of daughters and the number of kingdoms.\n\nEach of the next $ n $ lines contains the description of each daughter's list. The first integer $ k $ ( $ 0 \\le k \\le n $ ) is the number of entries in the $ i $ -th daughter's list. After that $ k $ distinct integers follow $ g_i[1], g_i[2], \\dots, g_i[k] $ ( $ 1 \\le g_i[j] \\le n $ ) — the indices of the kingdoms in the list in the increasing order ( $ g_i[1] < g_i[2] < \\dots < g_i[k] $ ).\n\nIt's guaranteed that the total number of daughters over all test cases does not exceed $ 10^5 $ .\n\nIt's also guaranteed that the total number of kingdoms in lists over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case print the answer to it.\n\nPrint \"IMPROVE\" in the first line if Polycarp LXXXIV can add some kingdom to some of his daughter's list so that the total number of married couples increases. The second line then should contain two integers — the index of the daughter and the index of the kingdom Polycarp LXXXIV should add to that daughter's list.\n\nIf there are multiple ways to add an entry so that the total number of married couples increases then print any of them.\n\nOtherwise the only line should contain one word \"OPTIMAL\".",
    "samples": [
        [
            "5\n4\n2 2 3\n2 1 2\n2 3 4\n1 3\n2\n0\n0\n3\n3 1 2 3\n3 1 2 3\n3 1 2 3\n1\n1 1\n4\n1 1\n1 2\n1 3\n1 4",
            "IMPROVE\n4 4\nIMPROVE\n1 1\nOPTIMAL\nOPTIMAL\nOPTIMAL"
        ]
    ],
    "hint": "The first test case is depicted in the statement. Adding the fourth kingdom to the list of the fourth daughter makes her marry the prince of the fourth kingdom.\n\nIn the second test case any new entry will increase the number of marriages from $ 0 $ to $ 1 $ .\n\nIn the third and the fourth test cases there is no way to add an entry.\n\nIn the fifth test case there is no way to change the marriages by adding any entry.",
    "translation": "$n$个男人和$n$个女人，下标都是$1\\sim n$。每个女的有一份他所喜欢的男人的下标列表。我们按照这样的贪心规则包办婚姻：每个女的选择他的列表中下标最小且没有被其他女人选择过的男人结婚，如果不存在这样的男人就不结婚。你现在可以尝试给某一个女人的喜欢列表加上一个不在列表中的男人下标，问是否能够提高包办婚姻成功的次数\n"
}