{
    "description": "Returning back to problem solving, Gildong is now studying about palindromes. He learned that a palindrome is a string that is the same as its reverse. For example, strings \"pop\", \"noon\", \"x\", and \"kkkkkk\" are palindromes, while strings \"moon\", \"tv\", and \"abab\" are not. An empty string is also a palindrome.\n\nGildong loves this concept so much, so he wants to play with it. He has $ n $ distinct strings of equal length $ m $ . He wants to discard some of the strings (possibly none or all) and reorder the remaining strings so that the concatenation becomes a palindrome. He also wants the palindrome to be as long as possible. Please help him find one.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n \\le 100 $ , $ 1 \\le m \\le 50 $ ) — the number of strings and the length of each string.\n\nNext $ n $ lines contain a string of length $ m $ each, consisting of lowercase Latin letters only. All strings are distinct.",
    "outputFormat": "In the first line, print the length of the longest palindrome string you made.\n\nIn the second line, print that palindrome. If there are multiple answers, print any one of them. If the palindrome is empty, print an empty line or don't print this line at all.",
    "samples": [
        [
            "3 3\ntab\none\nbat",
            "6\ntabbat"
        ],
        [
            "4 2\noo\nox\nxo\nxx",
            "6\noxxxxo"
        ],
        [
            "3 5\nhello\ncodef\norces",
            "0"
        ],
        [
            "9 4\nabab\nbaba\nabcd\nbcde\ncdef\ndefg\nwxyz\nzyxw\nijji",
            "20\nababwxyzijjizyxwbaba"
        ]
    ],
    "hint": "In the first example, \"battab\" is also a valid answer.\n\nIn the second example, there can be 4 different valid answers including the sample output. We are not going to provide any hints for what the others are.\n\nIn the third example, the empty string is the only valid palindrome string.",
    "translation": "- 给你 $n$ 个长度为 $m$ 的字符串。\n\n- 请你判断删去其中的几个（或者不删去），能使得将剩下字符串随意排列所形成的回文串长度最大。\n\n- 请你输出最大的长度和那个回文串。\n\n- $1\\le n\\le 100$，$1\\le m\\le 50$。\n\n- translate by @[ShineEternal](https://www.luogu.com.cn/user/45475)。"
}