{
    "description": "James Bond has a new plan for catching his enemy. There are some cities and directed roads between them, such that it is possible to travel between any two cities using these roads. When the enemy appears in some city, Bond knows her next destination but has no idea which path she will choose to move there.\n\nThe city $ a $ is called interesting, if for each city $ b $ , there is exactly one simple path from $ a $ to $ b $ . By a simple path, we understand a sequence of distinct cities, such that for every two neighboring cities, there exists a directed road from the first to the second city.\n\nBond's enemy is the mistress of escapes, so only the chase started in an interesting city gives the possibility of catching her. James wants to arrange his people in such cities. However, if there are not enough interesting cities, the whole action doesn't make sense since Bond's people may wait too long for the enemy.\n\nYou are responsible for finding all the interesting cities or saying that there is not enough of them. By not enough, James means strictly less than $ 20\\% $ of all cities.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 2\\,000 $ ) — the number of test cases. Each test case is described as follows:\n\nThe first line contains two integers $ n $ and $ m $ ( $ 1 \\leq n \\le 10^5 $ , $ 0 \\leq m \\le 2 \\cdot 10^5 $ ) — the number of cities and roads between them. Each of the following $ m $ lines contains two integers $ u $ , $ v $ ( $ u \\neq v $ ; $ 1 \\leq u, v \\leq n $ ), which denote that there is a directed road from $ u $ to $ v $ .\n\nYou can assume that between each ordered pair of cities there is at most one road. The sum of $ n $ over all test cases doesn't exceed $ 10^5 $ , and the sum of $ m $ doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "If strictly less than $ 20\\% $ of all cities are interesting, print $ -1 $ . Otherwise, let $ k $ be the number of interesting cities. Print $ k $ distinct integers in increasing order — the indices of interesting cities.",
    "samples": [
        [
            "4\n3 3\n1 2\n2 3\n3 1\n3 6\n1 2\n2 1\n2 3\n3 2\n1 3\n3 1\n7 10\n1 2\n2 3\n3 1\n1 4\n4 5\n5 1\n4 6\n6 7\n7 4\n6 1\n6 8\n1 2\n2 3\n3 4\n4 5\n5 6\n6 1\n6 2\n5 1",
            "1 2 3 \n-1\n1 2 3 5 \n-1"
        ]
    ],
    "hint": "In all drawings, if a city is colored green, then it is interesting; otherwise, it is colored red.\n\nIn the first sample, each city is interesting.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1361E/ea02130aaa657158e02932dc79202b09c65411df.png)In the second sample, no city is interesting.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1361E/9f70c6807b725116da2e28994dd20c33629e3f31.png)In the third sample, cities $ 1 $ , $ 2 $ , $ 3 $ and $ 5 $ are interesting.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1361E/f1d050ad3537d17cb3725772a1afecd8c2c46f32.png)In the last sample, only the city $ 1 $ is interesting. It is strictly less than $ 20\\% $ of all cities, so the answer is $ -1 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1361E/d74f523bcab5b0c943643c6309e1f1139462efcb.png)",
    "translation": "给定一个有 $n$ 个点 $m$ 条边的**有向强连通图**。称一个点是**好的**当且仅当它到其他点都有且只有一条**简单路径**。如果好的点至少有 $20\\%$ 则输出所有好的点，否则输出 `-1`。\n\n**单个测试点内有多组数据。**\n$1\\leq T\\leq 2\\times 10^3,1\\leq n\\leq 10^5,1\\leq m\\leq 2\\times 10^5,\\sum n\\leq 10^5,\\sum m\\leq 2\\times 10^5$。\n"
}