{
    "description": "Note that the only difference between the easy and hard version is the constraint on the number of queries. You can make hacks only if all versions of the problem are solved.\n\n This is an interactive problem.\n\nYou are given a tree consisting of $ n $ nodes numbered with integers from $ 1 $ to $ n $ . Ayush and Ashish chose two secret distinct nodes in the tree. You need to find out both the nodes. You can make the following query:\n\n- Provide a list of nodes and you will receive a node from that list whose sum of distances to both the hidden nodes is minimal (if there are multiple such nodes in the list, you will receive any one of them). You will also get the sum of distances of that node to the hidden nodes.\n\nRecall that a tree is a connected graph without cycles. The distance between two nodes is defined as the number of edges in the simple path between them.\n\nMore formally, let's define two hidden nodes as $ s $ and $ f $ . In one query you can provide the set of nodes $ \\{a_1,       a_2, \\ldots, a_c\\} $ of the tree. As a result, you will get two numbers $ a_i $ and $ dist(a_i, s) + dist(a_i, f) $ . The node $ a_i $ is any node from the provided set, for which the number $ dist(a_i, s) + dist(a_i, f) $ is minimal.\n\n You can ask no more than $ 11 $ queries.",
    "inputFormat": "The first line contains a single integer $ t $ $ (1 \\leq t       \\leq 10) $ — the number of test cases. Please note, how the interaction process is organized.\n\nThe first line of each test case consists of a single integer $ n $ $ (2 \\le n \\le 1000) $ — the number of nodes in the tree.\n\nThe next $ n - 1 $ lines consist of two integers $ u $ , $ v $ $ (1 \\le u, v \\le n, u \\ne v) $ — the edges of the tree.",
    "outputFormat": "To ask a query print a single line:\n\n- In the beginning print \"? c \" (without quotes) where $ c $ $ (1 \\leq c \\leq n) $ denotes the number of nodes being queried, followed by $ c $ distinct integers in the range $ [1, n] $ — the indices of nodes from the list.\n\nFor each query, you will receive two integers $ x $ , $ d $ — the node (among the queried nodes) with the minimum sum of distances to the hidden nodes and the sum of distances from that node to the hidden nodes. If the subset of nodes queried is invalid or you exceeded the number of queries then you will get $ x = d = -1 $ . In this case, you should terminate the program immediately.\n\nWhen you have guessed the hidden nodes, print a single line \"! \" (without quotes), followed by two integers in the range $ [1, n] $ — the hidden nodes. You can output the hidden nodes in any order.\n\n After this, you should read a string. If you guess the nodes correctly, you will receive the string \"Correct\". In this case, you should continue solving the remaining test cases or terminate the program, if all test cases were solved. Otherwise, you will receive the string \"Incorrect\". In this case, you should terminate the program immediately.\n\nGuessing the hidden nodes does not count towards the number of queries asked.\n\n The interactor is not adaptive. The hidden nodes do not change with queries.\n\n Do not forget to read the string \"Correct\" / \"Incorrect\" after guessing the hidden nodes.\n\nYou need to solve each test case before receiving the input for the next test case.\n\n The limit of $ 11 $ queries applies to each test case and not to the entire input.\n\nAfter printing a query do not forget to output the end of the line and flush the output. Otherwise, you will get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see the documentation for other languages.\n\n Hacks\n\nTo hack the solution, use the following test format:\n\nThe first line should contain a single integer $ t $ $ (1 \\leq       t \\leq 10) $ — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case should contain a single integer $ n $ $ (2 \\le n \\le 1000) $ — the number of nodes in the tree. The second line should contain two distinct integers in the range $ [1, n] $ — the hidden nodes. The next $ n - 1 $ lines should contain two integers $ u $ , $ v $ $ (1 \\le u, v \\le n,       u \\ne v) $ — the edges of the tree.",
    "samples": [
        [
            "1\n3\n1 2\n1 3\n\n1 1\n\n2 3\n\n3 1\n\n3 1\n\nCorrect",
            "? 1 1\n\n? 1 2\n\n? 1 3\n\n? 2 2 3\n\n! 1 3"
        ]
    ],
    "hint": "The tree from the first test is shown below, and the hidden nodes are $ 1 $ and $ 3 $ .\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1370F2/deea4b0040e770b1c1e50ebf95e24ae594eea667.png)",
    "translation": "**这是一道交互题。困难版与简单版唯一的区别是交互次数限制。**\r\n\r\n**本题有多组数据。**\r\n\r\n已知一棵 $n$ 个顶点的树（边集已知），其中有两个不同的顶点被暗中做了标记。你现在需要通过若干次询问，猜出两个被标记顶点的编号。\r\n\r\n一次询问的格式为 ` ? c x_1 x_2 ... x_c `，即代表你向交互库请求关于 $x_1,x_2,\\cdots,x_c$ 这 $c$ 个点的信息。\r\n\r\n对于一次询问，交互库的返回格式为 ` x d `，表示在询问的集合中，到两个被标记点的距离之和最小的点是 $x$，这个最小值为 $d$。如果有多个最小值点，$x$ 的值可能是其中任意一个。\r\n\r\n如果已经知晓答案，请用 ` ! x y ` 的格式来输出你的答案，任意顺序均可。在这之后，你会收到一个字符串 ` Correct ` 或者 ` Incorrect `，代表你的猜测是否正确。如果收到了 ` Incorrect `，请立即终止程序，否则请继续处理下一组数据。\r\n\r\n对于每组数据，请你在不超过 $11$ 次询问之内给出答案。\r\n\r\n$1\\le t\\le 10, 2\\le n\\le 1000$。\r\n\r\n_Translated by Caro23333_"
}