{
    "description": "Lord Omkar has permitted you to enter the Holy Church of Omkar! To test your worthiness, Omkar gives you a password which you must interpret!\n\nA password is an array $ a $ of $ n $ positive integers. You apply the following operation to the array: pick any two adjacent numbers that are not equal to each other and replace them with their sum. Formally, choose an index $ i $ such that $ 1 \\leq i       < n $ and $ a_{i} \\neq a_{i+1} $ , delete both $ a_i $ and $ a_{i+1} $ from the array and put $ a_{i}+a_{i+1} $ in their place.\n\nFor example, for array $ [7, 4, 3, 7] $ you can choose $ i =       2 $ and the array will become $ [7, 4+3, 7] = [7, 7, 7] $ . Note that in this array you can't apply this operation anymore.\n\nNotice that one operation will decrease the size of the password by $ 1 $ . What is the shortest possible length of the password after some number (possibly $ 0 $ ) of operations?",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 100 $ ). Description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\leq n \\leq 2 \\cdot 10^5 $ ) — the length of the password.\n\nThe second line of each test case contains $ n $ integers $ a_{1},a_{2},\\dots,a_{n} $ ( $ 1 \\leq a_{i} \\leq 10^9 $ ) — the initial contents of your password.\n\nThe sum of $ n $ over all test cases will not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each password, print one integer: the shortest possible length of the password after some number of operations.",
    "samples": [
        [
            "2\n4\n2 1 3 1\n2\n420 420",
            "1\n2"
        ]
    ],
    "hint": "In the first test case, you can do the following to achieve a length of $ 1 $ :\n\nPick $ i=2 $ to get $ [2, 4, 1] $\n\nPick $ i=1 $ to get $ [6, 1] $\n\nPick $ i=1 $ to get $ [7] $\n\nIn the second test case, you can't perform any operations because there is no valid $ i $ that satisfies the requirements mentioned above.",
    "translation": "### 题目描述\n多组询问，每次给出一个长度为 $n$ 的序列 $a$，对于两个相邻的且不相同的数，你可以将他们合并起来，即将这两个数替换成它们的和。\n\n注意到，你每次进行一次操作后，序列长度会 $-1$，现在你可以随意进行若干次操作，问最后序列长度最短是多少。"
}