{
    "description": "Polycarp has spent the entire day preparing problems for you. Now he has to sleep for at least $ a $ minutes to feel refreshed.\n\n Polycarp can only wake up by hearing the sound of his alarm. So he has just fallen asleep and his first alarm goes off in $ b $ minutes.\n\nEvery time Polycarp wakes up, he decides if he wants to sleep for some more time or not. If he's slept for less than $ a $ minutes in total, then he sets his alarm to go off in $ c $ minutes after it is reset and spends $ d $ minutes to fall asleep again. Otherwise, he gets out of his bed and proceeds with the day.\n\nIf the alarm goes off while Polycarp is falling asleep, then he resets his alarm to go off in another $ c $ minutes and tries to fall asleep for $ d $ minutes again.\n\nYou just want to find out when will Polycarp get out of his bed or report that it will never happen.\n\n Please check out the notes for some explanations of the example.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le       1000 $ ) — the number of testcases.\n\nThe only line of each testcase contains four integers $ a, b, c,       d $ ( $ 1 \\le a, b, c, d \\le 10^9 $ ) — the time Polycarp has to sleep for to feel refreshed, the time before the first alarm goes off, the time before every succeeding alarm goes off and the time Polycarp spends to fall asleep.",
    "outputFormat": "For each test case print one integer. If Polycarp never gets out of his bed then print -1. Otherwise, print the time it takes for Polycarp to get out of his bed.",
    "samples": [
        [
            "7\n10 3 6 4\n11 3 6 4\n5 9 4 10\n6 5 2 3\n1 1 1 1\n3947465 47342 338129 123123\n234123843 13 361451236 361451000",
            "27\n27\n9\n-1\n1\n6471793\n358578060125049"
        ]
    ],
    "hint": "In the first testcase Polycarp wakes up after $ 3 $ minutes. He only rested for $ 3 $ minutes out of $ 10 $ minutes he needed. So after that he sets his alarm to go off in $ 6 $ minutes and spends $ 4 $ minutes falling asleep. Thus, he rests for $ 2 $ more minutes, totaling in $ 3+2=5 $ minutes of sleep. Then he repeats the procedure three more times and ends up with $ 11 $ minutes of sleep. Finally, he gets out of his bed. He spent $ 3 $ minutes before the first alarm and then reset his alarm four times. The answer is $ 3+4 \\cdot 6 = 27 $ .\n\nThe second example is almost like the first one but Polycarp needs $ 11 $ minutes of sleep instead of $ 10 $ . However, that changes nothing because he gets $ 11 $ minutes with these alarm parameters anyway.\n\nIn the third testcase Polycarp wakes up rested enough after the first alarm. Thus, the answer is $ b=9 $ .\n\nIn the fourth testcase Polycarp wakes up after $ 5 $ minutes. Unfortunately, he keeps resetting his alarm infinitely being unable to rest for even a single minute :(",
    "translation": "小$P$每天要睡足$a$分钟。他定了一个闹钟，会在$b$分钟后响起。如果此时小$P$还没有睡足$a$分钟，那么他会定一个$c$分钟的闹钟，并花费$d$分钟入睡。如果他被吵醒后仍未达到$a$分钟，那么他会再定$c$分钟闹钟并花费$d$分钟入睡……如果某次闹钟响起时他已经睡足了$a$分钟，他就会起床。\n\n请问他一共要花费多少分钟才会起床，或者他永远不会起床。"
}