{
    "description": "Dark is going to attend Motarack's birthday. Dark decided that the gift he is going to give to Motarack is an array $ a $ of $ n $ non-negative integers.\n\nDark created that array $ 1000 $ years ago, so some elements in that array disappeared. Dark knows that Motarack hates to see an array that has two adjacent elements with a high absolute difference between them. He doesn't have much time so he wants to choose an integer $ k $ ( $ 0 \\leq k \\leq 10^{9} $ ) and replaces all missing elements in the array $ a $ with $ k $ .\n\nLet $ m $ be the maximum absolute difference between all adjacent elements (i.e. the maximum value of $ |a_i - a_{i+1}| $ for all $ 1 \\leq i \\leq n - 1 $ ) in the array $ a $ after Dark replaces all missing elements with $ k $ .\n\nDark should choose an integer $ k $ so that $ m $ is minimized. Can you help him?",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains one integer $ n $ ( $ 2 \\leq n \\leq 10^{5} $ ) — the size of the array $ a $ .\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ -1 \\leq a_i \\leq 10 ^ {9} $ ). If $ a_i = -1 $ , then the $ i $ -th integer is missing. It is guaranteed that at least one integer is missing in every test case.\n\nIt is guaranteed, that the sum of $ n $ for all test cases does not exceed $ 4 \\cdot 10 ^ {5} $ .",
    "outputFormat": "Print the answers for each test case in the following format:\n\nYou should print two integers, the minimum possible value of $ m $ and an integer $ k $ ( $ 0 \\leq k \\leq 10^{9} $ ) that makes the maximum absolute difference between adjacent elements in the array $ a $ equal to $ m $ .\n\nMake sure that after replacing all the missing elements with $ k $ , the maximum absolute difference between adjacent elements becomes $ m $ .\n\nIf there is more than one possible $ k $ , you can print any of them.",
    "samples": [
        [
            "7\n5\n-1 10 -1 12 -1\n5\n-1 40 35 -1 35\n6\n-1 -1 9 -1 3 -1\n2\n-1 -1\n2\n0 -1\n4\n1 -1 3 -1\n7\n1 -1 7 5 2 -1 5",
            "1 11\n5 35\n3 6\n0 42\n0 0\n1 2\n3 4"
        ]
    ],
    "hint": "In the first test case after replacing all missing elements with $ 11 $ the array becomes $ [11, 10, 11, 12, 11] $ . The absolute difference between any adjacent elements is $ 1 $ . It is impossible to choose a value of $ k $ , such that the absolute difference between any adjacent element will be $ \\leq 0 $ . So, the answer is $ 1 $ .\n\nIn the third test case after replacing all missing elements with $ 6 $ the array becomes $ [6, 6, 9, 6, 3, 6] $ .\n\n- $ |a_1 - a_2| = |6 - 6| = 0 $ ;\n- $ |a_2 - a_3| = |6 - 9| = 3 $ ;\n- $ |a_3 - a_4| = |9 - 6| = 3 $ ;\n- $ |a_4 - a_5| = |6 - 3| = 3 $ ;\n- $ |a_5 - a_6| = |3 - 6| = 3 $ .\n\nSo, the maximum difference between any adjacent elements is $ 3 $ .",
    "translation": "$t$ 组数据。\n\n给定一个 $n$ 和一个长度为 $n$ 的，除 $-1$ 外其它数字均为非负数的序列 $a$，要求将 $a$ 中所有 $-1$ 填充为 $k$，使得该序列相邻数字绝对值之差最小。\n\n输出最小绝对值之差及填充的数字 $k$，如果有多个可能的 $k$，输出任意一个。"
}