{
    "description": "Unary is a minimalistic Brainfuck dialect in which programs are written using only one token.\n\nBrainfuck programs use 8 commands: \"+\", \"-\", \"\\[\", \"\\]\", \"<\", \">\", \".\" and \",\" (their meaning is not important for the purposes of this problem). Unary programs are created from Brainfuck programs using the following algorithm. First, replace each command with a corresponding binary code, using the following conversion table:\n\n- \">\" $ → $ 1000,\n- \"<\" $ → $ 1001,\n- \"+\" $ → $ 1010,\n- \"-\" $ → $ 1011,\n- \".\" $ → $ 1100,\n- \",\" $ → $ 1101,\n- \"\\[\" $ → $ 1110,\n- \"\\]\" $ → $ 1111.\n\nNext, concatenate the resulting binary codes into one binary number in the same order as in the program. Finally, write this number using unary numeral system — this is the Unary program equivalent to the original Brainfuck one.\n\nYou are given a Brainfuck program. Your task is to calculate the size of the equivalent Unary program, and print it modulo $ 1000003 $ $ (10^{6}+3) $ .",
    "inputFormat": "The input will consist of a single line $ p $ which gives a Brainfuck program. String $ p $ will contain between 1 and 100 characters, inclusive. Each character of $ p $ will be \"+\", \"-\", \"\\[\", \"\\]\", \"<\", \">\", \".\" or \",\".",
    "outputFormat": "Output the size of the equivalent Unary program modulo $ 1000003 $ $ (10^{6}+3) $ .",
    "samples": [
        [
            ",.\n",
            "220\n"
        ],
        [
            "++++[&gt;,.&lt;-]\n",
            "61425\n"
        ]
    ],
    "hint": "To write a number $ n $ in unary numeral system, one simply has to write 1 $ n $ times. For example, 5 written in unary system will be 11111.\n\nIn the first example replacing Brainfuck commands with binary code will give us 1101 1100. After we concatenate the codes, we'll get 11011100 in binary system, or 220 in decimal. That's exactly the number of tokens in the equivalent Unary program.",
    "translation": "一种叫Brainfuck的语言有一个方言叫Unary。\r\n\r\nBrainfuck语言的程序由如下八种字符构成：\"+\", \"-\", \"[\", \"]\", \"<\", \">\", \".\" 和 \",\"。\r\n\r\nBrainfuck语言的程序转换成Unary首先要将给定的字符转换成二进制串：\r\n- \">\" $→$ 1000,\r\n- \"<\" $→$ 1001,\r\n- \"+\" $→$ 1010,\r\n- \"-\" $→$ 1011,\r\n- \".\" $→$ 1100,\r\n- \",\" $→$ 1101,\r\n- \"[\" $→$ 1110,\r\n- \"]\" $→$ 1111.\r\n\r\n然后把这些二进制串按在程序中出现的顺序连接在一起形成一个二进制数$n$，一个与上述Brainfuck程序等价的Unary程序就是$n$个$1$。\r\n\r\n你的任务是：给你一个Brainfuck程序，求他对应的Unary程序中有多少个$1$。由于这个数可能很大，请你输出这个数$mod\\space1000003$的值。"
}