{
    "description": "You are given a string $ s $ such that each its character is either 1, 2, or 3. You have to choose the shortest contiguous substring of $ s $ such that it contains each of these three characters at least once.\n\nA contiguous substring of string $ s $ is a string that can be obtained from $ s $ by removing some (possibly zero) characters from the beginning of $ s $ and some (possibly zero) characters from the end of $ s $ .",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le       20000 $ ) — the number of test cases.\n\nEach test case consists of one line containing the string $ s $ ( $ 1 \\le |s| \\le 200000 $ ). It is guaranteed that each character of $ s $ is either 1, 2, or 3.\n\nThe sum of lengths of all strings in all test cases does not exceed $ 200000 $ .",
    "outputFormat": "For each test case, print one integer — the length of the shortest contiguous substring of $ s $ containing all three types of characters at least once. If there is no such substring, print $ 0 $ instead.",
    "samples": [
        [
            "7\n123\n12222133333332\n112233\n332211\n12121212\n333333\n31121",
            "3\n3\n4\n4\n0\n0\n4"
        ]
    ],
    "hint": "Consider the example test:\n\nIn the first test case, the substring 123 can be used.\n\nIn the second test case, the substring 213 can be used.\n\nIn the third test case, the substring 1223 can be used.\n\nIn the fourth test case, the substring 3221 can be used.\n\nIn the fifth test case, there is no character 3 in $ s $ .\n\nIn the sixth test case, there is no character 1 in $ s $ .\n\nIn the seventh test case, the substring 3112 can be used.",
    "translation": "有一个长度为$n$的字符集为$\\{1,2,3\\}$的字符串$S$。现在需要求出最短的连续子串，使得这个子串中存在$\\{1,2,3\\}$三种数字。"
}