{
    "description": "A competitive eater, Alice is scheduling some practices for an eating contest on a magical calendar. The calendar is unusual because a week contains not necessarily $ 7 $ days!\n\nIn detail, she can choose any integer $ k $ which satisfies $ 1 \\leq k \\leq r $ , and set $ k $ days as the number of days in a week.\n\nAlice is going to paint some $ n $ consecutive days on this calendar. On this calendar, dates are written from the left cell to the right cell in a week. If a date reaches the last day of a week, the next day's cell is the leftmost cell in the next (under) row.\n\nShe wants to make all of the painted cells to be connected by side. It means, that for any two painted cells there should exist at least one sequence of painted cells, started in one of these cells, and ended in another, such that any two consecutive cells in this sequence are connected by side.\n\nAlice is considering the shape of the painted cells. Two shapes are the same if there exists a way to make them exactly overlapped using only parallel moves, parallel to the calendar's sides.\n\nFor example, in the picture, a week has $ 4 $ days and Alice paints $ 5 $ consecutive days. \\[1\\] and \\[2\\] are different shapes, but \\[1\\] and \\[3\\] are equal shapes.\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1371B/39eae368c2a57a50366d3b4d64699d9970b52d63.png)Alice wants to know how many possible shapes exists if she set how many days a week has and choose consecutive $ n $ days and paints them in calendar started in one of the days of the week. As was said before, she considers only shapes, there all cells are connected by side.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases. Next $ t $ lines contain descriptions of test cases.\n\nFor each test case, the only line contains two integers $ n $ , $ r $ ( $ 1 \\le n \\le 10^9, 1 \\le r \\le 10^9 $ ).",
    "outputFormat": "For each test case, print a single integer — the answer to the problem.\n\nPlease note, that the answer for some test cases won't fit into $ 32 $ -bit integer type, so you should use at least $ 64 $ -bit integer type in your programming language.",
    "samples": [
        [
            "5\n3 4\n3 2\n3 1\n13 7\n1010000 9999999",
            "4\n3\n1\n28\n510049495001"
        ]
    ],
    "hint": "In the first test case, Alice can set $ 1,2,3 $ or $ 4 $ days as the number of days in a week.\n\nThere are $ 6 $ possible paintings shown in the picture, but there are only $ 4 $ different shapes. So, the answer is $ 4 $ . Notice that the last example in the picture is an invalid painting because all cells are not connected by sides.\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1371B/1ff3916b23daa3947041e2801c12887257623fb7.png)In the last test case, be careful with the overflow issue, described in the output format.",
    "translation": "在 Alice 看来，一周不一定包含 $7$ 天。\r\n\r\n她可以选择 $1 \\leq k \\leq r$ 的正整数 $k$，将 $k$ 作为一周的天数。\r\n\r\n现在，Alice 想在每行有 $k$ 个格子的日历上以某个单元格为起点，连续画 $n$ 天。她会从起点开始往右侧一直画，直到右侧没有单元格，此时，她会从下一行的第一个单元格开始画。\r\n\r\n她希望画过的单元格是连接在一起的：对于任意两个被画过的单元格，存在一个被画过的单元格序列，该序列是一条四连通路径，从这两个单元格中的其中一个开始，到另一个结束。\r\n\r\n她在思考画过的单元格的形状。如果有一种方法可以让两个形状通过平移而重叠在一起，则它们是相等的。正如题目描述中的图片一样，[1] 和 [2] 形状不同，但 [1] 和 [3] 形状相同。\r\n\r\nAlice 想知道，如果她设置一周有 $k$ 天并在日历上连续画 $n$ 天，有多少种可能且不同的形状。请注意上文提到过的：她希望画过的单元格是连在一起的，所以如果画过的单元格没有连在一起，那么这种形状不是可能的形状。\r\n\r\n多组数据，数据组数 $t \\leq 1000$，$1 \\leq n,r \\leq 10^9$\r\n\r\n翻译 by Meatherm"
}