{
    "description": "A lot of people associate Logo programming language with turtle graphics. In this case the turtle moves along the straight line and accepts commands \"T\" (\"turn around\") and \"F\" (\"move 1 unit forward\").\n\nYou are given a list of commands that will be given to the turtle. You have to change exactly $ n $ commands from the list (one command can be changed several times). How far from the starting point can the turtle move after it follows all the commands of the modified list?",
    "inputFormat": "The first line of input contains a string $ commands $ — the original list of commands. The string $ commands $ contains between 1 and 100 characters, inclusive, and contains only characters \"T\" and \"F\".\n\nThe second line contains an integer $ n $ ( $ 1<=n<=50 $ ) — the number of commands you have to change in the list.",
    "outputFormat": "Output the maximum distance from the starting point to the ending point of the turtle's path. The ending point of the turtle's path is turtle's coordinate after it follows all the commands of the modified list.",
    "samples": [
        [
            "FT\n1\n",
            "2\n"
        ],
        [
            "FFFTFFF\n2\n",
            "6\n"
        ]
    ],
    "hint": "In the first example the best option is to change the second command (\"T\") to \"F\" — this way the turtle will cover a distance of 2 units.\n\nIn the second example you have to change two commands. One of the ways to cover maximal distance of 6 units is to change the fourth command and first or last one.",
    "translation": "很多人把LOGO编程语言和海龟图形联系起来。在这种情况下，海龟沿着直线移动，接受命令“T”（“转向180度”）和“F”（“向前移动1单元”）。\n\n你会收到一份给海龟的命令清单。你必须从列表中精确地改变N个命令（一个命令可以被改变多次）。要求出海龟在遵循修改后的所有命令后，会从起点最远可以移到多远？"
}