{
    "description": "A subway scheme, classic for all Berland cities is represented by a set of $ n $ stations connected by $ n $ passages, each of which connects exactly two stations and does not pass through any others. Besides, in the classic scheme one can get from any station to any other one along the passages. The passages can be used to move in both directions. Between each pair of stations there is no more than one passage.\n\nBerland mathematicians have recently proved a theorem that states that any classic scheme has a ringroad. There can be only one ringroad. In other words, in any classic scheme one can find the only scheme consisting of stations (where any two neighbouring ones are linked by a passage) and this cycle doesn't contain any station more than once.\n\nThis invention had a powerful social impact as now the stations could be compared according to their distance from the ringroad. For example, a citizen could say \"I live in three passages from the ringroad\" and another one could reply \"you loser, I live in one passage from the ringroad\". The Internet soon got filled with applications that promised to count the distance from the station to the ringroad (send a text message to a short number...).\n\nThe Berland government decided to put an end to these disturbances and start to control the situation. You are requested to write a program that can determine the remoteness from the ringroad for each station by the city subway scheme.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 3<=n<=3000 $ ), $ n $ is the number of stations (and trains at the same time) in the subway scheme. Then $ n $ lines contain descriptions of the trains, one per line. Each line contains a pair of integers $ x_{i},y_{i} $ ( $ 1<=x_{i},y_{i}<=n $ ) and represents the presence of a passage from station $ x_{i} $ to station $ y_{i} $ . The stations are numbered from 1 to $ n $ in an arbitrary order. It is guaranteed that $ x_{i}≠y_{i} $ and that no pair of stations contain more than one passage. The passages can be used to travel both ways. It is guaranteed that the given description represents a classic subway scheme.",
    "outputFormat": "Print $ n $ numbers. Separate the numbers by spaces, the $ i $ -th one should be equal to the distance of the $ i $ -th station from the ringroad. For the ringroad stations print number 0.",
    "samples": [
        [
            "4\n1 3\n4 3\n4 2\n1 2\n",
            "0 0 0 0 "
        ],
        [
            "6\n1 2\n3 4\n6 4\n2 3\n1 3\n3 5\n",
            "0 0 0 1 1 2 "
        ]
    ],
    "hint": "",
    "translation": "给出一个 $n$ 个点，$n$ 条边的无向无权图，图上每条边的长度为 $1$，保证图中有且仅由一个环。\n\n你的任务是求出每一个点到环（环上任意一点）的最短路径长度。  \n\n### 输入格式\n\n第一行一个整数 $n$（$3 \\leq n \\leq 3 \\times 10^3$），表示点的个数和边的个数。\n\n接下来 $n$ 行，每行两个整数 $u,v$，表示 $u,v$ 之间有一条边，$1 \\le u,v \\le n$。\n\n### 输出格式\n\n一行 $n$ 个由空格隔开的整数，表示每个点到环的最短距离。"
}