{
    "description": "Guy-Manuel and Thomas have an array $ a $ of $ n $ integers \\[ $ a_1, a_2, \\dots, a_n $ \\]. In one step they can add $ 1 $ to any element of the array. Formally, in one step they can choose any integer index $ i $ ( $ 1 \\le i \\le n $ ) and do $ a_i := a_i + 1 $ .\n\nIf either the sum or the product of all elements in the array is equal to zero, Guy-Manuel and Thomas do not mind to do this operation one more time.\n\nWhat is the minimum number of steps they need to do to make both the sum and the product of all elements in the array different from zero? Formally, find the minimum number of steps to make $ a_1 + a_2 + $ $ \\dots $ $ + a_n \\ne 0 $ and $ a_1 \\cdot a_2 \\cdot $ $ \\dots $ $ \\cdot a_n \\ne 0 $ .",
    "inputFormat": "Each test contains multiple test cases.\n\nThe first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^3 $ ). The description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the size of the array.\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ -100 \\le a_i \\le 100 $ ) — elements of the array .",
    "outputFormat": "For each test case, output the minimum number of steps required to make both sum and product of all elements in the array different from zero.",
    "samples": [
        [
            "4\n3\n2 -1 -1\n4\n-1 0 0 1\n2\n-1 2\n3\n0 -2 1",
            "1\n2\n0\n2"
        ]
    ],
    "hint": "In the first test case, the sum is $ 0 $ . If we add $ 1 $ to the first element, the array will be $ [3,-1,-1] $ , the sum will be equal to $ 1 $ and the product will be equal to $ 3 $ .\n\nIn the second test case, both product and sum are $ 0 $ . If we add $ 1 $ to the second and the third element, the array will be $ [-1,1,1,1] $ , the sum will be equal to $ 2 $ and the product will be equal to $ -1 $ . It can be shown that fewer steps can't be enough.\n\nIn the third test case, both sum and product are non-zero, we don't need to do anything.\n\nIn the fourth test case, after adding $ 1 $ twice to the first element the array will be $ [2,-2,1] $ , the sum will be $ 1 $ and the product will be $ -4 $ .",
    "translation": "- 给定一个含有 $n$ 个整数的数列。\r\n- 每次可以将其中的一个数加一，记为一次操作。\r\n- 问使得数列**所有数之和**与数列**所有数的乘积**都不为 $0$ 的操作次数。\r\n\r\n- translate by @[ShineEternal](https://www.luogu.com.cn/user/45475)。"
}