{
    "description": "Kuroni isn't good at economics. So he decided to found a new financial pyramid called Antihype. It has the following rules:\n\n1. You can join the pyramid for free and get $ 0 $ coins.\n2. If you are already a member of Antihype, you can invite your friend who is currently not a member of Antihype, and get a number of coins equal to your age (for each friend you invite).\n\n $ n $ people have heard about Antihype recently, the $ i $ -th person's age is $ a_i $ . Some of them are friends, but friendship is a weird thing now: the $ i $ -th person is a friend of the $ j $ -th person if and only if $ a_i \\text{ AND } a_j = 0 $ , where $ \\text{AND} $ denotes the [bitwise AND operation](https://en.wikipedia.org/wiki/Bitwise_operation#AND).\n\nNobody among the $ n $ people is a member of Antihype at the moment. They want to cooperate to join and invite each other to Antihype in a way that maximizes their combined gainings. Could you help them?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1\\le n \\le 2\\cdot 10^5 $ ) — the number of people.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 0\\le a_i \\le 2\\cdot 10^5 $ ) — the ages of the people.",
    "outputFormat": "Output exactly one integer — the maximum possible combined gainings of all $ n $ people.",
    "samples": [
        [
            "3\n1 2 3",
            "2"
        ]
    ],
    "hint": "Only the first and second persons are friends. The second can join Antihype and invite the first one, getting $ 2 $ for it.",
    "translation": "现在有n个人，并且给出他们的年龄。\n\n两个人是朋友，当且仅当两个人年龄的按位与结果为0。\n\n现在，有一个传销组织，每个人有两种操作：\n\n1、主动加入传销组织，这样的话，传销组织不会给你钱；\n\n2、邀请自己的一个朋友加入传销组织，这样的话，传销组织会奖励你数值等于你的年龄的钱。（当然，执行该操作的人必须已经进入传销组织了）\n\n每个人只可以进入传销组织一次。\n\n现在，请你输出，如果n个人通力合作，传销组织支付给这n个人的钱数之和最大是多少。\n\n样例解释：\n\n前两个人是朋友，让第二个人主动加入组织，并邀请第一个人加入，传销组织会奖励第二个人2块钱。\n\n第三个人没有朋友，他主动加入传销组织，传销组织也不会给他钱。\n\n所以，总共3个人可以获得2块钱。"
}