{
    "description": "Little Petya very much likes rectangles and especially squares. Recently he has received 8 points on the plane as a gift from his mother. The points are pairwise distinct. Petya decided to split them into two sets each containing 4 points so that the points from the first set lay at the vertexes of some square and the points from the second set lay at the vertexes of a rectangle. Each point of initial 8 should belong to exactly one set. It is acceptable for a rectangle from the second set was also a square. If there are several partitions, Petya will be satisfied by any of them. Help him find such partition. Note that the rectangle and the square from the partition should have non-zero areas. The sides of the figures do not have to be parallel to the coordinate axes, though it might be the case.",
    "inputFormat": "You are given 8 pairs of integers, a pair per line — the coordinates of the points Petya has. The absolute value of all coordinates does not exceed $ 10^{4} $ . It is guaranteed that no two points coincide.",
    "outputFormat": "Print in the first output line \"YES\" (without the quotes), if the desired partition exists. In the second line output 4 space-separated numbers — point indexes from the input, which lie at the vertexes of the square. The points are numbered starting from 1. The numbers can be printed in any order. In the third line print the indexes of points lying at the vertexes of a rectangle in the similar format. All printed numbers should be pairwise distinct.\n\nIf the required partition does not exist, the first line should contain the word \"NO\" (without the quotes), after which no output is needed.",
    "samples": [
        [
            "0 0\n10 11\n10 0\n0 11\n1 1\n2 2\n2 1\n1 2\n",
            "YES\n5 6 7 8\n1 2 3 4\n"
        ],
        [
            "0 0\n1 1\n2 2\n3 3\n4 4\n5 5\n6 6\n7 7\n",
            "NO\n"
        ],
        [
            "0 0\n4 4\n4 0\n0 4\n1 2\n2 3\n3 2\n2 1\n",
            "YES\n1 2 3 4\n5 6 7 8\n"
        ]
    ],
    "hint": "Pay attention to the third example: the figures do not necessarily have to be parallel to the coordinate axes.",
    "translation": "### 题目描述\r\nKc吟唱着歌谣，躺在草坪上边想着她边看起了星星。Kc刚刚结识了笛卡尔这位好基友，认为他的坐标系非常神奇。于是他随机地选出了8颗星星，并且给它们标上了坐标。Kc又不甘寂寞，于是思考起一个问题：这八个点能否恰好构成一个正方形和一个矩形呢？\r\n### 输入格式\r\n输入文件包括8行16个数，表示8个星星的坐标，坐标绝对值不超过10000。\r\n### 输出格式\r\n输出文件第一行是\"YES\"或者\"NO\"。表示是否有解。\r\n\r\n若有解则第二行依次输出正方形每个顶点的序号。第三行依次输出矩形每个顶点的序号。序号即为输入的顺序。\r\n\r\n另外注意：因为kc是一个刁端的人，所以他要求第二行和第三行这八个数要字典序最小。\r\n\r\n四点共线不能认为是正方形或矩形\r\n\r\n### 输入输出样例\r\n### 输入 #1\r\n0 0\r\n\r\n10 11\r\n\r\n10 0\r\n\r\n0 11\r\n\r\n1 1\r\n\r\n2 2\r\n\r\n2 1\r\n\r\n1 2\r\n### 输出 #1\r\nYES\r\n\r\n5 6 7 8\r\n\r\n1 2 3 4\r\n\r\n### 说明/提示：\r\n图形不一定要与坐标轴平行。"
}