{
    "description": "The last contest held on Johnny's favorite competitive programming platform has been received rather positively. However, Johnny's rating has dropped again! He thinks that the presented tasks are lovely, but don't show the truth about competitors' skills.\n\nThe boy is now looking at the ratings of consecutive participants written in a binary system. He thinks that the more such ratings differ, the more unfair is that such people are next to each other. He defines the difference between two numbers as the number of bit positions, where one number has zero, and another has one (we suppose that numbers are padded with leading zeros to the same length). For example, the difference of $ 5 = 101_2 $ and $ 14 = 1110_2 $ equals to $ 3 $ , since $ 0101 $ and $ 1110 $ differ in $ 3 $ positions. Johnny defines the unfairness of the contest as the sum of such differences counted for neighboring participants.\n\nJohnny has just sent you the rating sequence and wants you to find the unfairness of the competition. You have noticed that you've got a sequence of consecutive integers from $ 0 $ to $ n $ . That's strange, but the boy stubbornly says that everything is right. So help him and find the desired unfairness for received numbers.",
    "inputFormat": "The input consists of multiple test cases. The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 10\\,000 $ ) — the number of test cases. The following $ t $ lines contain a description of test cases.\n\nThe first and only line in each test case contains a single integer $ n $ ( $ 1 \\leq n \\leq 10^{18}) $ .",
    "outputFormat": "Output $ t $ lines. For each test case, you should output a single line with one integer — the unfairness of the contest if the rating sequence equals to $ 0 $ , $ 1 $ , ..., $ n - 1 $ , $ n $ .",
    "samples": [
        [
            "5\n5\n7\n11\n1\n2000000000000",
            "8\n11\n19\n1\n3999999999987"
        ]
    ],
    "hint": "For $ n = 5 $ we calculate unfairness of the following sequence (numbers from $ 0 $ to $ 5 $ written in binary with extra leading zeroes, so they all have the same length):\n\n- $ 000 $\n- $ 001 $\n- $ 010 $\n- $ 011 $\n- $ 100 $\n- $ 101 $\n\nThe differences are equal to $ 1 $ , $ 2 $ , $ 1 $ , $ 3 $ , $ 1 $ respectively, so unfairness is equal to $ 1 + 2 + 1 + 3 + 1 = 8 $ .",
    "translation": "定义两个数的差异为它们在二进制下不同的位的数量（我们认为它们补充了足够的前导零）。\r\n\r\n例如，$0101$ 和 $1110$ 的差异为 $3$ —— 它们从高到低的第 $1,3,4$ 位是不同的。\r\n\r\n你需要求出 $0,1,2,..,n-1,n$ 中相邻的数的差异之和。\r\n\r\n多组数据，数据组数 $t \\leq 10000$，$1 \\leq n \\leq 10^{18}$\r\n\r\n翻译 by Meatherm"
}