{
    "description": "Polycarpus has postcards and photos hung in a row on the wall. He decided to put them away to the closet and hang on the wall a famous painter's picture. Polycarpus does it like that: he goes from the left to the right and removes the objects consecutively. As Polycarpus doesn't want any mix-ups to happen, he will not carry in his hands objects of two different types. In other words, Polycarpus can't carry both postcards and photos simultaneously. Sometimes he goes to the closet and puts the objects there, thus leaving his hands free. Polycarpus must put all the postcards and photos to the closet. He cannot skip objects. What minimum number of times he should visit the closet if he cannot carry more than 5 items?",
    "inputFormat": "The only line of the input data contains a non-empty string consisting of letters \"С\" and \"P\" whose length does not exceed $ 100 $ characters. If the $ i $ -th character in the string is the letter \"С\", that means that the $ i $ -th object (the numbering goes from the left to the right) on Polycarpus' wall is a postcard. And if the $ i $ -th character is the letter \"P\", than the $ i $ -th object on the wall is a photo.",
    "outputFormat": "Print the only number — the minimum number of times Polycarpus has to visit the closet.",
    "samples": [
        [
            "CPCPCPC\n",
            "7\n"
        ],
        [
            "CCCCCCPPPPPP\n",
            "4\n"
        ],
        [
            "CCCCCCPPCPPPPPPPPPP\n",
            "6\n"
        ],
        [
            "CCCCCCCCCC\n",
            "2\n"
        ]
    ],
    "hint": "In the first sample Polycarpus needs to take one item to the closet 7 times.\n\nIn the second sample Polycarpus can first take 3 postcards to the closet; then 3 more. He can take the 6 photos that are left in the similar way, going to the closet twice.\n\nIn the third sample Polycarpus can visit the closet twice, both times carrying 3 postcards. Then he can take there 2 photos at once, then one postcard and finally, he can carry the last 10 photos if he visits the closet twice.\n\nIn the fourth sample Polycarpus can visit the closet twice and take there all 10 postcards (5 items during each go).",
    "translation": "给定一个只含\"C\",\"P\"的字符串，求这个字符串最少可以拆成几个长度不大于5的含有相同字符的字符串。"
}