{
    "description": "Vivek has encountered a problem. He has a maze that can be represented as an $ n \\times m $ grid. Each of the grid cells may represent the following:\n\n- Empty — '.'\n- Wall — '\\#'\n- Good person — 'G'\n- Bad person — 'B'\n\nThe only escape from the maze is at cell $ (n, m) $ .\n\nA person can move to a cell only if it shares a side with their current cell and does not contain a wall. Vivek wants to block some of the empty cells by replacing them with walls in such a way, that all the good people are able to escape, while none of the bad people are able to. A cell that initially contains 'G' or 'B' cannot be blocked and can be travelled through.\n\nHelp him determine if there exists a way to replace some (zero or more) empty cells with walls to satisfy the above conditions.\n\nIt is guaranteed that the cell $ (n,m) $ is empty. Vivek can also block this cell.",
    "inputFormat": "The first line contains one integer $ t $ $ (1 \\le t \\le 100) $ — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ , $ m $ $ (1 \\le n, m \\le 50) $ — the number of rows and columns in the maze.\n\nEach of the next $ n $ lines contain $ m $ characters. They describe the layout of the maze. If a character on a line equals '.', the corresponding cell is empty. If it equals '\\#', the cell has a wall. 'G' corresponds to a good person and 'B' corresponds to a bad person.",
    "outputFormat": "For each test case, print \"Yes\" if there exists a way to replace some empty cells with walls to satisfy the given conditions. Otherwise print \"No\"\n\nYou may print every letter in any case (upper or lower).",
    "samples": [
        [
            "6\n1 1\n.\n1 2\nG.\n2 2\n#B\nG.\n2 3\nG.#\nB#.\n3 3\n#B.\n#..\nGG.\n2 2\n#B\nB.",
            "Yes\nYes\nNo\nNo\nYes\nYes"
        ]
    ],
    "hint": "For the first and second test cases, all conditions are already satisfied.\n\nFor the third test case, there is only one empty cell $ (2,2) $ , and if it is replaced with a wall then the good person at $ (1,2) $ will not be able to escape.\n\nFor the fourth test case, the good person at $ (1,1) $ cannot escape.\n\nFor the fifth test case, Vivek can block the cells $ (2,3) $ and $ (2,2) $ .\n\nFor the last test case, Vivek can block the destination cell $ (2, 2) $ .",
    "translation": "### 题目描述\n\n给出一个 $n$ 行 $m$ 列的网格，每个格子上有四种情况：\n- `.` 表示这个格子是空地。\n- `#` 表示这个格子是墙。\n- `G` 表示这个格子是好人。\n- `B` 表示这个格子是坏人。\n\n`G`，`B`格子都可以认为是空地。\n\n你需要判断能否 `.` 格子上放任意数量的墙，保证所有好人可以通过在空地间移动到达点 $(n,m)$ 而所有坏人都不行。\n\n### 输入格式\n\n**本题有多组数据**\n\n第一行有一个正整数 $T$，表示有 $T$ 组数据。  \n\n每组数据的第一行有两个正整数 $n, m$，表示网格图的行数和列数。  \n\n之后 $n$ 行，每行一个长度为 $m$ 的字符串，描述了这张网格图。\n\n保证 $1\\le t\\le100$，$1\\le n, m\\le50$。\n\n### 输出格式\n\n每组数据输出一行 `yes` 或 `no`，大小写任意。"
}