{
    "description": "Young boy Artem tries to paint a picture, and he asks his mother Medina to help him. Medina is very busy, that's why she asked for your help.\n\nArtem wants to paint an $ n \\times m $ board. Each cell of the board should be colored in white or black.\n\nLets $ B $ be the number of black cells that have at least one white neighbor adjacent by the side. Let $ W $ be the number of white cells that have at least one black neighbor adjacent by the side. A coloring is called good if $ B = W + 1 $ .\n\nThe first coloring shown below has $ B=5 $ and $ W=4 $ (all cells have at least one neighbor with the opposite color). However, the second coloring is not good as it has $ B=4 $ , $ W=4 $ (only the bottom right cell doesn't have a neighbor with the opposite color).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1333A/34674661541310c7b0f570cbf7d03ed451c5851a.png)Please, help Medina to find any good coloring. It's guaranteed that under given constraints the solution always exists. If there are several solutions, output any of them.",
    "inputFormat": "Each test contains multiple test cases.\n\nThe first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 20 $ ). Each of the next $ t $ lines contains two integers $ n, m $ ( $ 2 \\le n,m \\le 100 $ ) — the number of rows and the number of columns in the grid.",
    "outputFormat": "For each test case print $ n $ lines, each of length $ m $ , where $ i $ -th line is the $ i $ -th row of your colored matrix (cell labeled with 'B' means that the cell is black, and 'W' means white). Do not use quotes.\n\nIt's guaranteed that under given constraints the solution always exists.",
    "samples": [
        [
            "2\n3 2\n3 3",
            "BW\nWB\nBB\nBWB\nBWW\nBWB"
        ]
    ],
    "hint": "In the first testcase, $ B=3 $ , $ W=2 $ .\n\nIn the second testcase, $ B=5 $ , $ W=4 $ . You can see the coloring in the statement.",
    "translation": "- 题目描述：\r\n\r\n给你一块 $n\\times m$ 的木板，每一个格子都要涂成黑色或者白色。\r\n\r\n设这个黑板的 $B$ 值为**相邻的格子有至少一个白色格子的黑色格子的个数** ，$W$值为**相邻的格子有至少一个黑色格子的白色格子的个数**。\r\n\r\n现在让你输出一种涂色方案，使这个方案的 $B=W+1$，数据保证有解，如有多种方案，输出任意一种即可\r\n\r\n- 输入输出格式及数据范围：\r\n\r\n**本题输入含有多组数据**\r\n\r\n第一行输入一个整数 $t(1\\le t\\le 20)$，表示数据组数\r\n\r\n对于每组数据，输入两个整数 $n,m(2\\le n,m \\le 100)$，表示木板的行数和列数，含义见题目描述\r\n\r\n- 样例解释：\r\n\r\n第一组数据的输出中，$B=3,W=2$，符合 $B=W+1$\r\n\r\n第二组数据的输出中，$B=5,W=4$，符合条件"
}