{
    "description": "Bill likes to play with dominoes. He took an $ n \\times m $ board divided into equal square cells, and covered it with dominoes. Each domino covers two adjacent cells of the board either horizontally or vertically, and each cell is covered exactly once with a half of one domino (that is, there are no uncovered cells, and no two dominoes cover the same cell twice).\n\nAfter that Bill decided to play with the covered board and share some photos of it on social media. First, he removes exactly one domino from the board, freeing two of the cells. Next, he moves dominoes around. A domino can only be moved along the line parallel to its longer side. A move in the chosen direction is possible if the next cell in this direction is currently free. Bill doesn't want to lose track of what the original tiling looks like, so he makes sure that at any point each domino shares at least one cell with its original position.\n\nAfter removing a domino and making several (possibly, zero) moves Bill takes a photo of the board and posts it. However, with the amount of filters Bill is using, domino borders are not visible, so only the two free cells of the board can be identified. When the photo is posted, Bill reverts the board to its original state and starts the process again.\n\nBill wants to post as many photos as possible, but he will not post any photo twice. How many distinct photos can he take? Recall that photos are different if the pairs of free cells in the photos are different.",
    "inputFormat": "The first line contains two positive integers $ n $ and $ m $ ( $ nm \\leq 2 \\cdot 10^5 $ ) — height and width of the board respectively.\n\nThe next $ n $ lines describe the tiling of the board, row by row from top to bottom. Each of these lines contains $ m $ characters, describing the cells in the corresponding row left to right. Each character is one of U, D, L, or R, meaning that the cell is covered with a top, bottom, left, or right half of a domino respectively.\n\nIt is guaranteed that the described tiling is valid, that is, each half-domino has a counterpart in the relevant location. In particular, since tiling is possible, the number of cells in the board is even.",
    "outputFormat": "Print a single integer — the number of distinct photos Bill can take.",
    "samples": [
        [
            "2 4\nUUUU\nDDDD",
            "4"
        ],
        [
            "2 3\nULR\nDLR",
            "6"
        ],
        [
            "6 6\nULRUUU\nDUUDDD\nUDDLRU\nDLRLRD\nULRULR\nDLRDLR",
            "133"
        ]
    ],
    "hint": "In the first sample case, no moves are possible after removing any domino, thus there are four distinct photos.\n\nIn the second sample case, four photos are possible after removing the leftmost domino by independently moving/not moving the remaining two dominoes. Two more different photos are obtained by removing one of the dominoes on the right.",
    "translation": "有一个 $n\\times m$ 的棋盘，被 $1\\times2$ 的骨牌覆盖，保证 $2\\mid nm$。\n\n现在你需要执行以下操作：\n1. 移去恰好一张骨牌。\n2. 将一张骨牌沿着其长边进行移动。你可以进行这一步任意次。\n3. 你需要保证在任意时刻，每张骨牌的位置与其初始位置至少有一个公共格子。\n\n求你可以得到的所有可能的局面的数量。\n\n两种局面不同，当且仅当某个位置在其中一者中被骨牌覆盖，而在另一者中没有。\n\n$nm\\le2\\times10^5$。\n\n输入格式为：输入一张大小为 $n\\times m$ 的矩阵，位置 $(i,j)$ 为 `L`/`R`/`U`/`D` 表示其被一张骨牌的 左/右/上/下 端覆盖。"
}