{
    "description": "Warawreh created a great company called Nanosoft. The only thing that Warawreh still has to do is to place a large picture containing its logo on top of the company's building.\n\nThe logo of Nanosoft can be described as four squares of the same size merged together into one large square. The top left square is colored with red, the top right square is colored with green, the bottom left square is colored with yellow and the bottom right square is colored with blue.\n\nAn Example of some correct logos:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1301E/b18bda37e952600d50a433d5d6d034271a8ea951.png)\n\nAn Example of some incorrect logos:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1301E/aae70af4076310da7ad4524bd1dc8d30ba1f870a.png)\n\nWarawreh went to Adhami's store in order to buy the needed picture. Although Adhami's store is very large he has only one picture that can be described as a grid of $ n $ rows and $ m $ columns. The color of every cell in the picture will be green (the symbol 'G'), red (the symbol 'R'), yellow (the symbol 'Y') or blue (the symbol 'B').\n\nAdhami gave Warawreh $ q $ options, in every option he gave him a sub-rectangle from that picture and told him that he can cut that sub-rectangle for him. To choose the best option, Warawreh needs to know for every option the maximum area of sub-square inside the given sub-rectangle that can be a Nanosoft logo. If there are no such sub-squares, the answer is $ 0 $ .\n\nWarawreh couldn't find the best option himself so he asked you for help, can you help him?",
    "inputFormat": "The first line of input contains three integers $ n $ , $ m $ and $ q $ $ (1 \\leq n , m \\leq 500, 1 \\leq q \\leq 3 \\cdot 10^{5}) $ — the number of row, the number columns and the number of options.\n\nFor the next $ n $ lines, every line will contain $ m $ characters. In the $ i $ -th line the $ j $ -th character will contain the color of the cell at the $ i $ -th row and $ j $ -th column of the Adhami's picture. The color of every cell will be one of these: {'G','Y','R','B'}.\n\nFor the next $ q $ lines, the input will contain four integers $ r_1 $ , $ c_1 $ , $ r_2 $ and $ c_2 $ $ (1 \\leq r_1 \\leq r_2 \\leq n, 1 \\leq c_1 \\leq c_2 \\leq m) $ . In that option, Adhami gave to Warawreh a sub-rectangle of the picture with the upper-left corner in the cell $ (r_1, c_1) $ and with the bottom-right corner in the cell $ (r_2, c_2) $ .",
    "outputFormat": "For every option print the maximum area of sub-square inside the given sub-rectangle, which can be a NanoSoft Logo. If there are no such sub-squares, print $ 0 $ .",
    "samples": [
        [
            "5 5 5\nRRGGB\nRRGGY\nYYBBG\nYYBBR\nRBBRG\n1 1 5 5\n2 2 5 5\n2 2 3 3\n1 1 3 5\n4 4 5 5",
            "16\n4\n4\n4\n0"
        ],
        [
            "6 10 5\nRRRGGGRRGG\nRRRGGGRRGG\nRRRGGGYYBB\nYYYBBBYYBB\nYYYBBBRGRG\nYYYBBBYBYB\n1 1 6 10\n1 3 3 10\n2 2 6 6\n1 7 6 10\n2 1 5 10",
            "36\n4\n16\n16\n16"
        ],
        [
            "8 8 8\nRRRRGGGG\nRRRRGGGG\nRRRRGGGG\nRRRRGGGG\nYYYYBBBB\nYYYYBBBB\nYYYYBBBB\nYYYYBBBB\n1 1 8 8\n5 2 5 7\n3 1 8 6\n2 3 5 8\n1 2 6 8\n2 1 5 5\n2 1 7 7\n6 5 7 5",
            "64\n0\n16\n4\n16\n4\n36\n0"
        ]
    ],
    "hint": "Picture for the first test:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1301E/5c5a8909793534c432ad07cd7594615ef6950dde.png)\n\nThe pictures from the left to the right corresponds to the options. The border of the sub-rectangle in the option is marked with black, the border of the sub-square with the maximal possible size, that can be cut is marked with gray.",
    "translation": "给你一个$n\\times m$的只包含四种颜色的网格。\n\n$q$此询问，每次问一个矩阵中所包含的形如以下格式的$Logo$的最大面积\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1301E/b18bda37e952600d50a433d5d6d034271a8ea951.png)\n$1\\le n,m\\le500,1\\le q\\le3\\cdot10^5$"
}