{
    "description": "Anna is a girl so brave that she is loved by everyone in the city and citizens love her cookies. She is planning to hold a party with cookies. Now she has $ a $ vanilla cookies and $ b $ chocolate cookies for the party.\n\nShe invited $ n $ guests of the first type and $ m $ guests of the second type to the party. They will come to the party in some order. After coming to the party, each guest will choose the type of cookie (vanilla or chocolate) to eat. There is a difference in the way how they choose that type:\n\nIf there are $ v $ vanilla cookies and $ c $ chocolate cookies at the moment, when the guest comes, then\n\n- if the guest of the first type: if $ v>c $ the guest selects a vanilla cookie. Otherwise, the guest selects a chocolate cookie.\n- if the guest of the second type: if $ v>c $ the guest selects a chocolate cookie. Otherwise, the guest selects a vanilla cookie.\n\nAfter that:\n\n- If there is at least one cookie of the selected type, the guest eats one.\n- Otherwise (there are no cookies of the selected type), the guest gets angry and returns to home.\n\nAnna wants to know if there exists some order of guests, such that no one guest gets angry. Your task is to answer her question.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases. Next $ t $ lines contain descriptions of test cases.\n\nFor each test case, the only line contains four integers $ a $ , $ b $ , $ n $ , $ m $ ( $ 0 \\le a,b,n,m \\le 10^{18}, n+m \\neq 0 $ ).",
    "outputFormat": "For each test case, print the answer in one line. If there exists at least one valid order, print \"Yes\". Otherwise, print \"No\".\n\nYou can print each letter in any case (upper or lower).",
    "samples": [
        [
            "6\n2 2 1 2\n0 100 0 1\n12 13 25 1\n27 83 14 25\n0 0 1 0\n1000000000000000000 1000000000000000000 1000000000000000000 1000000000000000000",
            "Yes\nNo\nNo\nYes\nNo\nYes"
        ]
    ],
    "hint": "In the first test case, let's consider the order $ \\{1, 2,       2\\} $ of types of guests. Then:\n\n- The first guest eats a chocolate cookie. After that, there are $ 2 $ vanilla cookies and $ 1 $ chocolate cookie.\n- The second guest eats a chocolate cookie. After that, there are $ 2 $ vanilla cookies and $ 0 $ chocolate cookies.\n- The last guest selects a chocolate cookie, but there are no chocolate cookies. So, the guest gets angry.\n\nSo, this order can't be chosen by Anna.\n\nLet's consider the order $ \\{2, 2, 1\\} $ of types of guests. Then:\n\n- The first guest eats a vanilla cookie. After that, there is $ 1 $ vanilla cookie and $ 2 $ chocolate cookies.\n- The second guest eats a vanilla cookie. After that, there are $ 0 $ vanilla cookies and $ 2 $ chocolate cookies.\n- The last guest eats a chocolate cookie. After that, there are $ 0 $ vanilla cookies and $ 1 $ chocolate cookie.\n\nSo, the answer to this test case is \"Yes\".\n\nIn the fifth test case, it is illustrated, that the number of cookies ( $ a + b $ ) can be equal to zero, but the number of guests ( $ n + m $ ) can't be equal to zero.\n\nIn the sixth test case, be careful about the overflow of $ 32 $ -bit integer type.",
    "translation": "在一个宴会上，Anna 准备了 $a$ 块香草饼干和 $b$ 块巧克力饼干。她邀请了 $n$ 位第一类客人和 $m$ 位第二类客人来参加宴会。两类客人的爱好有不同。如果有 $v$ 块香草饼干，$c$ 块巧克力饼干，那么：\r\n\r\n- 如果 $v>c$，第一类客人会选择香草饼干，否则会选择巧克力饼干。\r\n- 如果 $v>c$，第二类客人会选择巧克力饼干，否则会选择香草饼干。\r\n\r\n在这之后，对于每位客人：\r\n\r\n- 如果至少有一块他所选择的饼干，拿走一块。\r\n- 如果没有，客人会很生气，他会回家，不会拿走任何东西。\r\n\r\nAnna 想知道是否存在一种客人选择饼干的顺序，这样所有客人都不会生气。\r\n\r\n多组数据，数据组数 $t \\leq 1000$，$0 \\leq a,b,n,m \\leq 10^{18},n+m \\neq 0$\r\n\r\n翻译 by Meatherm"
}