{
    "description": "Having read half of the book called \"Storm and Calm\" on the IT lesson, Innocentius was absolutely determined to finish the book on the maths lessons. All was fine until the math teacher Ms. Watkins saw Innocentius reading fiction books instead of solving equations of the fifth degree. As during the last maths class Innocentius suggested the algorithm of solving equations of the fifth degree in the general case, Ms. Watkins had no other choice but to give him a new task.\n\nThe teacher asked to write consecutively (without spaces) all words from the \"Storm and Calm\" in one long string $ s $ . She thought that a string is good if the number of vowels in the string is no more than twice more than the number of consonants. That is, the string with $ v $ vowels and $ c $ consonants is good if and only if $ v<=2c $ .\n\nThe task Innocentius had to solve turned out to be rather simple: he should find the number of the longest good substrings of the string $ s $ .",
    "inputFormat": "The only input line contains a non-empty string $ s $ consisting of no more than $ 2·10^{5} $ uppercase and lowercase Latin letters. We shall regard letters \"a\", \"e\", \"i\", \"o\", \"u\" and their uppercase variants as vowels.",
    "outputFormat": "Print on a single line two numbers without a space: the maximum length of a good substring and the number of good substrings with this length. If no good substring exists, print \"No solution\" without the quotes.\n\nTwo substrings are considered different if their positions of occurrence are different. So if some string occurs more than once, then it should be counted more than once.",
    "samples": [
        [
            "Abo\n",
            "3 1\n"
        ],
        [
            "OEIS\n",
            "3 1\n"
        ],
        [
            "auBAAbeelii\n",
            "9 3\n"
        ],
        [
            "AaaBRAaaCAaaDAaaBRAaa\n",
            "18 4\n"
        ],
        [
            "EA\n",
            "No solution\n"
        ]
    ],
    "hint": "In the first sample there is only one longest good substring: \"Abo\" itself. The other good substrings are \"b\", \"Ab\", \"bo\", but these substrings have shorter length.\n\nIn the second sample there is only one longest good substring: \"EIS\". The other good substrings are: \"S\", \"IS\".",
    "translation": "给定字符串s，求出其最长连续子串满足：v<2*c  v是子串中元音字母的个数，c是辅音字母的个数。（注意：大小写字母均可能出现在s中且元音字母包括'a','e','i','o','u'和它们的大写形式）\n\n输出最长连续子串的长度以及个数。"
}