{
    "description": "You are given a string $ s $ consisting of lowercase Latin letters. Let the length of $ s $ be $ |s| $ . You may perform several operations on this string.\n\nIn one operation, you can choose some index $ i $ and remove the $ i $ -th character of $ s $ ( $ s_i $ ) if at least one of its adjacent characters is the previous letter in the Latin alphabet for $ s_i $ . For example, the previous letter for b is a, the previous letter for s is r, the letter a has no previous letters. Note that after each removal the length of the string decreases by one. So, the index $ i $ should satisfy the condition $ 1 \\le i \\le |s| $ during each operation.\n\nFor the character $ s_i $ adjacent characters are $ s_{i-1} $ and $ s_{i+1} $ . The first and the last characters of $ s $ both have only one adjacent character (unless $ |s| = 1 $ ).\n\nConsider the following example. Let $ s= $ bacabcab.\n\n1. During the first move, you can remove the first character $ s_1= $ b because $ s_2= $ a. Then the string becomes $ s= $ acabcab.\n2. During the second move, you can remove the fifth character $ s_5= $ c because $ s_4= $ b. Then the string becomes $ s= $ acabab.\n3. During the third move, you can remove the sixth character $ s_6= $ 'b' because $ s_5= $ a. Then the string becomes $ s= $ acaba.\n4. During the fourth move, the only character you can remove is $ s_4= $ b, because $ s_3= $ a (or $ s_5= $ a). The string becomes $ s= $ acaa and you cannot do anything with it.\n\nYour task is to find the maximum possible number of characters you can remove if you choose the sequence of operations optimally.",
    "inputFormat": "The first line of the input contains one integer $ |s| $ ( $ 1 \\le |s| \\le 100 $ ) — the length of $ s $ .\n\nThe second line of the input contains one string $ s $ consisting of $ |s| $ lowercase Latin letters.",
    "outputFormat": "Print one integer — the maximum possible number of characters you can remove if you choose the sequence of moves optimally.",
    "samples": [
        [
            "8\nbacabcab",
            "4"
        ],
        [
            "4\nbcda",
            "3"
        ],
        [
            "6\nabbbbb",
            "5"
        ]
    ],
    "hint": "The first example is described in the problem statement. Note that the sequence of moves provided in the statement is not the only, but it can be shown that the maximum possible answer to this test is $ 4 $ .\n\nIn the second example, you can remove all but one character of $ s $ . The only possible answer follows.\n\n1. During the first move, remove the third character $ s_3= $ d, $ s $ becomes bca.\n2. During the second move, remove the second character $ s_2= $ c, $ s $ becomes ba.\n3. And during the third move, remove the first character $ s_1= $ b, $ s $ becomes a.",
    "translation": "给出字符串 $s$，$1\\le|s|\\le100$ 。\n\n定义一次变换为，选中第 $i$ 个字符移除，字符串长度减少 $1$，选中字符需要满足 $s_{i-1},s_{i+1}$ 中至少有一个是 $s_i$ 的前驱。\n\n求最多可进行几次操作。"
}