{
    "description": "You have $ n $ students under your control and you have to compose exactly two teams consisting of some subset of your students. Each student had his own skill, the $ i $ -th student skill is denoted by an integer $ a_i $ (different students can have the same skills).\n\nSo, about the teams. Firstly, these two teams should have the same size. Two more constraints:\n\n- The first team should consist of students with distinct skills (i.e. all skills in the first team are unique).\n- The second team should consist of students with the same skills (i.e. all skills in the second team are equal).\n\nNote that it is permissible that some student of the first team has the same skill as a student of the second team.\n\nConsider some examples (skills are given):\n\n- $ [1, 2, 3] $ , $ [4, 4] $ is not a good pair of teams because sizes should be the same;\n- $ [1, 1, 2] $ , $ [3, 3, 3] $ is not a good pair of teams because the first team should not contain students with the same skills;\n- $ [1, 2, 3] $ , $ [3, 4, 4] $ is not a good pair of teams because the second team should contain students with the same skills;\n- $ [1, 2, 3] $ , $ [3, 3, 3] $ is a good pair of teams;\n- $ [5] $ , $ [6] $ is a good pair of teams.\n\nYour task is to find the maximum possible size $ x $ for which it is possible to compose a valid pair of teams, where each team size is $ x $ (skills in the first team needed to be unique, skills in the second team should be the same between them). A student cannot be part of more than one team.\n\nYou have to answer $ t $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of the test case contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of students. The second line of the test case contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le n $ ), where $ a_i $ is the skill of the $ i $ -th student. Different students can have the same skills.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ ( $ \\sum n \\le 2 \\cdot 10^5 $ ).",
    "outputFormat": "For each test case, print the answer — the maximum possible size $ x $ for which it is possible to compose a valid pair of teams, where each team size is $ x $ .",
    "samples": [
        [
            "4\n7\n4 2 4 1 4 3 4\n5\n2 1 5 4 3\n1\n1\n4\n1 1 1 3",
            "3\n1\n0\n2"
        ]
    ],
    "hint": "In the first test case of the example, it is possible to construct two teams of size $ 3 $ : the first team is $ [1, 2, 4] $ and the second team is $ [4, 4, 4] $ . Note, that there are some other ways to construct two valid teams of size $ 3 $ .",
    "translation": "给定一个由$n(n≤2·10^5)$个整数$a_1a_2a_3...a_n$组成的序列，选出两个**长度相同**的子序列（两个子序列不能同时包含相同位置的数），使得其中一个子序列内元素相同，另一个子序列内元素不同，求子序列的最长长度。"
}