{
    "description": "How many stars are there in the sky? A young programmer Polycarpus can't get this question out of his head! He took a photo of the starry sky using his digital camera and now he analyzes the resulting monochrome digital picture. The picture is represented by a rectangular matrix consisting of $ n $ lines each containing $ m $ characters. A character equals '1', if the corresponding photo pixel is white and '0', if it is black.\n\nPolycarpus thinks that he has found a star on the photo if he finds a white pixel surrounded by four side-neighboring pixels that are also white:\n\n `<br></br> 1 <br></br>111<br></br> 1 <br></br>` a star on the photoPolycarpus whats to cut out a rectangular area from the photo and give his mom as a present. This area should contain no less than $ k $ stars. The stars can intersect, have shared white pixels on the photo. The boy will cut out the rectangular area so that its borders will be parallel to the sides of the photo and the cuts will go straight between the pixel borders.\n\nNow Polycarpus keeps wondering how many ways there are to cut an area out of the photo so that it met the conditions given above. Help Polycarpus find this number.",
    "inputFormat": "The first line of the input data contains three integers $ n,m $ and $ k $ ( $ 1<=n,m<=500;1<=k<=nm $ ). Then follow $ n $ lines, containing the description of the given photo as a sequence of lines. Each line contains $ m $ characters '0' or '1'.",
    "outputFormat": "Print the required number of areas on the given photo.",
    "samples": [
        [
            "4 6 2\n111000\n111100\n011011\n000111\n",
            "6\n"
        ],
        [
            "5 5 4\n11111\n11111\n11111\n11111\n11111\n",
            "9\n"
        ]
    ],
    "hint": "We'll number the rows and columns below starting from 1, the coordinates $ (p,q) $ will denote a cell in row $ p $ , column $ q $ .\n\nIn the first sample Polycarpus should cut out any area containing a rectangle whose opposite corners lie in cells $ (1,1) $ and ( $ 3,4 $ ). Only rectangles with opposite corners in $ (1,1) $ and ( $ x,y $ ), where $ x>=3 $ and $ y>=4 $ fit the conditions.\n\nIn the second sample any rectangle whose each side is no less than four, will do. The possible rectangle sizes are $ 4×4 $ , $ 4×5 $ , $ 5×4 $ and $ 5×5 $ . Such figures can be cut in 4 ways, 2 ways, 2 ways and 1 way correspondingly.\n\nPlease do not use the %lld specificator to read or write 64-bit integers in C++. It is preferred to use cin, cout streams or the %I64d specificator.",
    "translation": "### 题目描述\n\n求一个 $n\\times m$ 的字符矩阵内，有多少个不同的矩形包含不少于 $k$ 个下述图形：\n\n```\n 1\n111\n 1\n```\n\n注意，这些图形可以相互重叠，但是不能完全重叠。\n\n### 输入格式\n\n第一行三个正整数，$n,m,k$。\n\n接下来 $n$ 行，每行 $m$ 个字符描述矩阵。这些字符只可能是```0```或```1```。\n\n### 输出格式\n\n一行一个正整数，代表询问的答案。\n\n（提示：本题请用```%I64d```或```cout```输出```long long```）"
}