{
    "description": "Johnny has recently found an ancient, broken computer. The machine has only one register, which allows one to put in there one variable. Then in one operation, you can shift its bits left or right by at most three positions. The right shift is forbidden if it cuts off some ones. So, in fact, in one operation, you can multiply or divide your number by $ 2 $ , $ 4 $ or $ 8 $ , and division is only allowed if the number is divisible by the chosen divisor.\n\nFormally, if the register contains a positive integer $ x $ , in one operation it can be replaced by one of the following:\n\n- $ x \\cdot 2 $\n- $ x \\cdot 4 $\n- $ x \\cdot 8 $\n- $ x / 2 $ , if $ x $ is divisible by $ 2 $\n- $ x / 4 $ , if $ x $ is divisible by $ 4 $\n- $ x / 8 $ , if $ x $ is divisible by $ 8 $\n\nFor example, if $ x = 6 $ , in one operation it can be replaced by $ 12 $ , $ 24 $ , $ 48 $ or $ 3 $ . Value $ 6 $ isn't divisible by $ 4 $ or $ 8 $ , so there're only four variants of replacement.\n\nNow Johnny wonders how many operations he needs to perform if he puts $ a $ in the register and wants to get $ b $ at the end.",
    "inputFormat": "The input consists of multiple test cases. The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases. The following $ t $ lines contain a description of test cases.\n\nThe first and only line in each test case contains integers $ a $ and $ b $ ( $ 1 \\leq a, b \\leq 10^{18} $ ) — the initial and target value of the variable, respectively.",
    "outputFormat": "Output $ t $ lines, each line should contain one integer denoting the minimum number of operations Johnny needs to perform. If Johnny cannot get $ b $ at the end, then write $ -1 $ .",
    "samples": [
        [
            "10\n10 5\n11 44\n17 21\n1 1\n96 3\n2 128\n1001 1100611139403776\n1000000000000000000 1000000000000000000\n7 1\n10 8",
            "1\n1\n-1\n0\n2\n2\n14\n0\n-1\n-1"
        ]
    ],
    "hint": "In the first test case, Johnny can reach $ 5 $ from $ 10 $ by using the shift to the right by one (i.e. divide by $ 2 $ ).\n\nIn the second test case, Johnny can reach $ 44 $ from $ 11 $ by using the shift to the left by two (i.e. multiply by $ 4 $ ).\n\nIn the third test case, it is impossible for Johnny to reach $ 21 $ from $ 17 $ .\n\nIn the fourth test case, initial and target values are equal, so Johnny has to do $ 0 $ operations.\n\nIn the fifth test case, Johnny can reach $ 3 $ from $ 96 $ by using two shifts to the right: one by $ 2 $ , and another by $ 3 $ (i.e. divide by $ 4 $ and by $ 8 $ ).",
    "translation": "给定 $a,b$。你可以把 $a$ 的值设为以下几种之一：\n\n- $a\\cdot2$\n- $a\\cdot4$\n- $a\\cdot8$\n- $a \\div 2$（如果它被 $2$ 整除）\n- $a \\div 4$（如果它被 $4$ 整除）\n- $a \\div 8$（如果它被 $8$ 整除）\n\n你需要求出至少需要几次操作才能把 $a$ 变成 $b$。如果无解，输出 `-1`，表示这是不可能的。\n\n多组数据，数据组数 $t \\leq 1000$，$1 \\leq a,b\\leq 10^{18}$\n\n翻译 by Meatherm"
}