{
    "description": "The only difference between the easy and hard versions is that tokens of type O do not appear in the input of the easy version.\n\nErrichto gave Monogon the following challenge in order to intimidate him from taking his top contributor spot on Codeforces.\n\nIn a Tic-Tac-Toe grid, there are $ n $ rows and $ n $ columns. Each cell of the grid is either empty or contains a token. There are two types of tokens: X and O. If there exist three tokens of the same type consecutive in a row or column, it is a winning configuration. Otherwise, it is a draw configuration.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1450C2/39afc6239351b009b5f556b0fc6f685f7842a873.png) The patterns in the first row are winning configurations. The patterns in the second row are draw configurations. In an operation, you can change an X to an O, or an O to an X. Let $ k $ denote the total number of tokens in the grid. Your task is to make the grid a draw in at most $ \\lfloor \\frac{k}{3}\\rfloor $ (rounding down) operations.\n\nYou are not required to minimize the number of operations.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1\\le t\\le 100 $ ) — the number of test cases.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1\\le n\\le 300 $ ) — the size of the grid.\n\nThe following $ n $ lines each contain a string of $ n $ characters, denoting the initial grid. The character in the $ i $ -th row and $ j $ -th column is '.' if the cell is empty, or it is the type of token in the cell: 'X' or 'O'.\n\nIt is guaranteed that not all cells are empty.\n\nThe sum of $ n $ across all test cases does not exceed $ 300 $ .",
    "outputFormat": "For each test case, print the state of the grid after applying the operations.\n\nWe have proof that a solution always exists. If there are multiple solutions, print any.",
    "samples": [
        [
            "3\n3\n.O.\nOOO\n.O.\n6\nXXXOOO\nXXXOOO\nXX..OO\nOO..XX\nOOOXXX\nOOOXXX\n5\n.OOO.\nOXXXO\nOXXXO\nOXXXO\n.OOO.",
            ".O.\nOXO\n.O.\nOXXOOX\nXOXOXO\nXX..OO\nOO..XX\nOXOXOX\nXOOXXO\n.OXO.\nOOXXO\nXXOXX\nOXXOO\n.OXO."
        ]
    ],
    "hint": "In the first test case, there are initially three 'O' consecutive in the second row and the second column. By changing the middle token to 'X' we make the grid a draw, and we only changed $ 1\\le \\lfloor 5/3\\rfloor $ token.\n\nIn the second test case, the final grid is a draw. We only changed $ 8\\le \\lfloor 32/3\\rfloor $ tokens.\n\nIn the third test case, the final grid is a draw. We only changed $ 7\\le \\lfloor 21/3\\rfloor $ tokens.",
    "translation": "给定一张 $n$ 行 $n$ 列的棋盘，每个格子可能是空的或包含一个标志，标志有 $\\text{X}$ 和 $\\text{O}$ 两种。\n\n如果有三个相同的标志排列在一行或一列上的三个连续的位置，则称这个棋盘是一个 **胜局**，\n否则称其为 **平局**。\n\n![示意图](https://i.loli.net/2021/02/18/F6Dto8diKIZmRSv.png)\n\n例如，上图第一行的局面都是胜局，而第二行的局面都是平局。\n\n在一次操作中，你可以将一个 $\\text X$ 改成 $\\text O$，或将一个 $\\text O$ 改成 $\\text X$。\n\n设棋盘中标志的总数为 $k$，你需要用不超过 $\\lfloor \\frac{k}{3}\\rfloor$\n次操作把给定的局面变成平局。\n\n$1\\leq n\\leq 300$。"
}