{
    "description": "Pink Floyd are pulling a prank on Roger Waters. They know he doesn't like [walls](https://www.youtube.com/watch?v=YR5ApYxkU-U), he wants to be able to walk freely, so they are blocking him from exiting his room which can be seen as a grid.\n\nRoger Waters has a square grid of size $ n\\times n $ and he wants to traverse his grid from the upper left ( $ 1,1 $ ) corner to the lower right corner ( $ n,n $ ). Waters can move from a square to any other square adjacent by a side, as long as he is still in the grid. Also except for the cells ( $ 1,1 $ ) and ( $ n,n $ ) every cell has a value $ 0 $ or $ 1 $ in it.\n\nBefore starting his traversal he will pick either a $ 0 $ or a $ 1 $ and will be able to only go to cells values in which are equal to the digit he chose. The starting and finishing cells ( $ 1,1 $ ) and ( $ n,n $ ) are exempt from this rule, he may go through them regardless of picked digit. Because of this the cell ( $ 1,1 $ ) takes value the letter 'S' and the cell ( $ n,n $ ) takes value the letter 'F'.\n\nFor example, in the first example test case, he can go from ( $ 1, 1 $ ) to ( $ n, n $ ) by using the zeroes on this path: ( $ 1, 1 $ ), ( $ 2, 1 $ ), ( $ 2, 2 $ ), ( $ 2, 3 $ ), ( $ 3, 3 $ ), ( $ 3, 4 $ ), ( $ 4, 4 $ )\n\nThe rest of the band (Pink Floyd) wants Waters to not be able to do his traversal, so while he is not looking they will invert at most two cells in the grid (from $ 0 $ to $ 1 $ or vice versa). They are afraid they will not be quick enough and asked for your help in choosing the cells.  Note that you cannot invert cells $ (1, 1) $ and $ (n, n) $ .\n\nWe can show that there always exists a solution for the given constraints.\n\nAlso note that Waters will pick his digit of the traversal after the band has changed his grid, so he must not be able to reach ( $ n,n $ ) no matter what digit he picks.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 50 $ ). Description of the test cases follows.\n\nThe first line of each test case contains one integers $ n $ ( $ 3 \\le n \\le 200 $ ).\n\nThe following $ n $ lines of each test case contain the binary grid, square ( $ 1, 1 $ ) being colored in 'S' and square ( $ n, n $ ) being colored in 'F'.\n\nThe sum of values of $ n $ doesn't exceed $ 200 $ .",
    "outputFormat": "For each test case output on the first line an integer $ c $ ( $ 0 \\le c \\le 2 $ ) — the number of inverted cells.\n\nIn $ i $ -th of the following $ c $ lines, print the coordinates of the $ i $ -th cell you inverted. You may not invert the same cell twice.  Note that you cannot invert cells $ (1, 1) $ and $ (n, n) $ .",
    "samples": [
        [
            "3\n4\nS010\n0001\n1000\n111F\n3\nS10\n101\n01F\n5\nS0101\n00000\n01111\n11111\n0001F",
            "1\n3 4\n2\n1 2\n2 1\n0"
        ]
    ],
    "hint": "For the first test case, after inverting the cell, we get the following grid:\n\n```\n<pre class=\"verbatim\"><br></br>S010<br></br>0001<br></br>1001<br></br>111F<br></br>\n```",
    "translation": "你现在从起点（1，1）出发，你要到达（n,n)的终点，你每次可以选择0，1两个颜色，选定之后，你只能走该颜色的格子，你每次可以向九宫格内的点移动，你可以选择最多两个点让他的颜色从1变0，从0变1，让你构造一个方案使得起点不能到达终点。。。"
}