{
    "description": "Athenaeus has just finished creating his latest musical composition and will present it tomorrow to the people of Athens. Unfortunately, the melody is rather dull and highly likely won't be met with a warm reception.\n\nHis song consists of $ n $ notes, which we will treat as positive integers. The diversity of a song is the number of different notes it contains. As a patron of music, Euterpe watches over composers and guides them throughout the process of creating new melodies. She decided to help Athenaeus by changing his song to make it more diverse.\n\nBeing a minor goddess, she cannot arbitrarily change the song. Instead, for each of the $ n $ notes in the song, she can either leave it as it is or increase it by $ 1 $ .\n\nGiven the song as a sequence of integers describing the notes, find out the maximal, achievable diversity.",
    "inputFormat": "The input consists of multiple test cases. The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 10\\,000 $ ) — the number of test cases. Then $ t $ test cases follow, each one is described in two lines.\n\nIn the first line of each test case there is a single integer $ n $ ( $ 1 \\leq n \\leq 10^5 $ ) denoting the length of the song. The next line contains a sequence of $ n $ integers $ x_1, x_2, \\ldots, x_n $ $ (1 \\leq x_1 \\leq x_2 \\leq \\ldots \\leq x_n \\leq 2 \\cdot n) $ , describing the song.\n\nThe sum of $ n $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, you should output a single line containing precisely one integer, the maximal diversity of the song, i.e. the maximal possible number of different elements in the final sequence.",
    "samples": [
        [
            "5\n6\n1 2 2 2 5 6\n2\n4 4\n6\n1 1 3 4 4 5\n1\n1\n6\n1 1 1 2 2 2",
            "5\n2\n6\n1\n3"
        ]
    ],
    "hint": "In the first test case, Euterpe can increase the second, fifth and sixth element to obtain the sequence $ 1, \\underline{3}, 2, 2, \\underline{6}, \\underline{7} $ , which has $ 5 $ different elements (increased elements are underlined).\n\nIn the second test case, Euterpe can increase the first element to obtain the sequence $ \\underline{5}, 4 $ , which has $ 2 $ different elements.\n\nIn the third test case, Euterpe can increase the second, fifth and sixth element to obtain the sequence $ 1, \\underline{2}, 3, 4, \\underline{5}, \\underline{6} $ , which has $ 6 $ different elements.",
    "translation": "给出一个长度为 $n$ 的序列 $x_1,x_2,...,x_n$。\n\n你可以执行若干次操作（可以不操作），每次你可以选择一个位置 $i\\ (1 \\le i \\le n)$，并将 $x_i$ 加 $1$。**每个位置最多只能操作一次。**\n\n你需要通过一些操作，使得最后的 $x$ 序列**去重后**剩余的元素最多。\n\n本题一共有 $t$ 组数据，$\\sum n \\le10^5$，同一组数据中有 $1 \\le x_i \\le 2 \\times n$ 且 **$x_i$ 单调递增**。\n\n翻译提供：HoshizoraZ"
}