{
    "description": "During the study of the Martians Petya clearly understood that the Martians are absolutely lazy. They like to sleep and don't like to wake up.\n\nImagine a Martian who has exactly $ n $ eyes located in a row and numbered from the left to the right from $ 1 $ to $ n $ . When a Martian sleeps, he puts a patch on each eye (so that the Martian morning doesn't wake him up). The inner side of each patch has an uppercase Latin letter. So, when a Martian wakes up and opens all his eyes he sees a string $ s $ consisting of uppercase Latin letters. The string's length is $ n $ .\n\n\"Ding dong!\" — the alarm goes off. A Martian has already woken up but he hasn't opened any of his eyes. He feels that today is going to be a hard day, so he wants to open his eyes and see something good. The Martian considers only $ m $ Martian words beautiful. Besides, it is hard for him to open all eyes at once so early in the morning. So he opens two non-overlapping segments of consecutive eyes. More formally, the Martian chooses four numbers $ a $ , $ b $ , $ c $ , $ d $ , ( $ 1<=a<=b&lt;c<=d<=n $ ) and opens all eyes with numbers $ i $ such that $ a<=i<=b $ or $ c<=i<=d $ . After the Martian opens the eyes he needs, he reads all the visible characters from the left to the right and thus, he sees some word.\n\nLet's consider all different words the Martian can see in the morning. Your task is to find out how many beautiful words are among them.",
    "inputFormat": "The first line contains a non-empty string $ s $ consisting of uppercase Latin letters. The strings' length is $ n $ ( $ 2<=n<=10^{5} $ ). The second line contains an integer $ m $ ( $ 1<=m<=100 $ ) — the number of beautiful words. Next $ m $ lines contain the beautiful words $ p_{i} $ , consisting of uppercase Latin letters. Their length is from $ 1 $ to $ 1000 $ . All beautiful strings are pairwise different.",
    "outputFormat": "Print the single integer — the number of different beautiful strings the Martian can see this morning.",
    "samples": [
        [
            "ABCBABA\n2\nBAAB\nABBA\n",
            "1\n"
        ]
    ],
    "hint": "Let's consider the sample test. There the Martian can get only the second beautiful string if he opens segments of eyes $ a=1,b=2 $ and $ c=4,d=5 $ or of he opens segments of eyes $ a=1,b=2 $ and $ c=6,d=7 $ .",
    "translation": "输入第一行给定一个长度为 $n\\ \\ (1\\leq n \\leq 1e5)$ 的字符串 $s$，该串仅由大写字母组成\n\n第二行给定一个数 $m\\ \\ (1 \\leq m \\leq 100)$，接下来 $m$ 行表示 $m$ 个询问，每行一个字符串 $p_i\\ \\ (1 \\leq |p_i| \\leq 1000)$，满足 $p_i$ 互不相同\n\n一个询问 $p_i$ 可行当且仅当存在 $a,b,c,d$ 满足$1\\leq a\\leq b \\lt c \\leq d \\leq n$ 且 $s_as_{a+1}\\dots s_{b}s_{c}s_{c+1}\\dots s_d = p_i$，即可以找到两个不相交的区间，满足这两个区间对应的子串拼起来和 $p_i$ 相同\n\n输出一行表示可行的询问的数量"
}