{
    "description": "This is an interactive problem. You have to use a flush operation right after printing each line. For example, in C++ you should use the function fflush(stdout), in Java — System.out.flush(), in Pascal — flush(output) and in Python — sys.stdout.flush().\n\nMr. Chanek wants to buy a flamingo to accompany his chickens on his farm. Before going to the pet shop, Mr. Chanek stops at an animal festival to have fun. It turns out there is a carnival game with a flamingo as the prize.\n\nThere are $ N $ mysterious cages, which are numbered from $ 1 $ to $ N $ . Cage $ i $ has $ A_i $ $ (0 \\le A_i \\le 10^3) $ flamingoes inside $ (1 \\le i \\le N) $ . However, the game master keeps the number of flamingoes inside a secret. To win the flamingo, Mr. Chanek must guess the number of flamingoes in each cage.\n\nCoincidentally, Mr. Chanek has $ N $ coins. Each coin can be used to ask once, what is the total number of flamingoes inside cages numbered $ L $ to $ R $ inclusive? With $ L < R $ .",
    "inputFormat": "Use standard input to read the responses of your questions.\n\nInitially, the judge will give an integer $ N $ $ (3 \\le N \\le 10^3) $ , the number of cages, and the number of coins Mr. Chanek has.\n\nFor each of your questions, the jury will give an integer that denotes the number of flamingoes from cage $ L $ to $ R $ inclusive.\n\nIf your program does not guess the flamingoes or ask other questions, you will get \"Wrong Answer\". Of course, if your program asks more questions than the allowed number, your program will get \"Wrong Answer\".",
    "outputFormat": "To ask questions, your program must use standard output.\n\nThen, you can ask at most $ N $ questions. Questions are asked in the format \"? L R\", ( $ 1 \\le L < R \\le N $ ).\n\nTo guess the flamingoes, print a line that starts with \"!\" followed by $ N $ integers where the $ i $ -th integer denotes the number of flamingo in cage $ i $ . After answering, your program must terminate or will receive the \"idle limit exceeded\" verdict. You can only guess the flamingoes once.",
    "samples": [
        [
            "6\n \n5\n \n15\n \n10\n ",
            " \n? 1 2\n \n? 5 6\n \n? 3 4\n \n! 1 4 4 6 7 8"
        ]
    ],
    "hint": "In the sample input, the correct flamingoes amount is $ [1, 4, 4, 6, 7, 8] $ .",
    "translation": "### 题目描述\n\n本题为交互题目,请注意每次输出后清空缓冲区.\n\n有 $N$ 个数字$a_{1},a_{2},...,a_{N}(0 \\leq a_{i} \\leq 10^3)$,这些数字都是未知的.\n\n现在你可以给出最多 $N$ 次询问,每次询问给出两个整数 $L,R(L<R)$ 表示询问$a_{L},a_{L+1},...,a_{R}$ 的值,最终你需要求出$a_{1},a_{2},...,a_{N}$的值.\n\n### 输入输出格式\n\n请用标准输入读入对于每次询问返回的数值.\n\n初始你会被给予一个正整数$N(3 \\leq N \\leq 10^3)$,表示数字数量和最多询问的次数.\n\n如果你的程序要问问题,你的程序应该用标准输出.你最多可以询问$N$次,格式为\"$?$ $L$ $R$\"$(1 \\leq L<R \\leq N)$.对于每次询问评测机会返回你的询问的答案(即$a_{L},a_{L+1},...,a_{R}$的数值)\n\n如果你的程序要输出答案,输出一个字符'!'之后输出$N$个数字,其中第$i$个数字表示$a_{i}$.\n\n你的程序应在输出答案后终止运行.\n\n同时,你的程序会因$...$判错:\n\n- 询问次数超过了$N$次或者询问不合法.\n\n- 没有输出最终的答案或答案不符合要求.\n\n- 在输出最终答案后不终止运行."
}