{
    "description": "Jett is tired after destroying the town and she wants to have a rest. She likes high places, that's why for having a rest she wants to get high and she decided to craft staircases.\n\nStaircase is a squared figure that consists of square cells. Each staircase consists of an arbitrary number of stairs. If a staircase has $ n $ stairs, then it is made of $ n $ columns, the first column is $ 1 $ cell high, the second column is $ 2 $ cells high, $ \\ldots $ , the $ n $ -th column if $ n $ cells high. The lowest cells of all stairs must be in the same row.\n\nA staircase with $ n $ stairs is called nice, if it may be covered by $ n $ disjoint squares made of cells. All squares should fully consist of cells of a staircase.\n\n This is how a nice covered staircase with $ 7 $ stairs looks like: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1419B/20e8f39717a3a82bb8f73bd6c4f499217c03a037.png)Find out the maximal number of different nice staircases, that can be built, using no more than $ x $ cells, in total. No cell can be used more than once.",
    "inputFormat": "The first line contains a single integer $ t $ $ (1 \\le t \\le 1000) $ — the number of test cases.\n\nThe description of each test case contains a single integer $ x $ $ (1 \\le x \\le 10^{18}) $ — the number of cells for building staircases.",
    "outputFormat": "For each test case output a single integer — the number of different nice staircases, that can be built, using not more than $ x $ cells, in total.",
    "samples": [
        [
            "4\n1\n8\n6\n1000000000000000000",
            "1\n2\n1\n30"
        ]
    ],
    "hint": "In the first test case, it is possible to build only one staircase, that consists of $ 1 $ stair. It's nice. That's why the answer is $ 1 $ .\n\nIn the second test case, it is possible to build two different nice staircases: one consists of $ 1 $ stair, and another consists of $ 3 $ stairs. This will cost $ 7 $ cells. In this case, there is one cell left, but it is not possible to use it for building any nice staircases, that have not been built yet. That's why the answer is $ 2 $ .\n\nIn the third test case, it is possible to build only one of two nice staircases: with $ 1 $ stair or with $ 3 $ stairs. In the first case, there will be $ 5 $ cells left, that may be used only to build a staircase with $ 2 $ stairs. This staircase is not nice, and Jett only builds nice staircases. That's why in this case the answer is $ 1 $ . If Jett builds a staircase with $ 3 $ stairs, then there are no more cells left, so the answer is $ 1 $ again.",
    "translation": "题目给出 $ t $ 组数据，对于每一组数据：\n把呈阶梯状的图形称为“阶梯”，把最长边为 $ X $ 的阶梯称为“X级阶梯”。如图是一个7级阶梯。如果一个“X级阶梯”可被 $ X $ 个边长为正整数的正方形恰好覆盖，那么称之为“好阶梯”。\n现有 $ n $ 个边长为 $ 1 $ 的正方形，问最多可以搭出多少个不同的“好阶梯”？"
}