{
    "description": "Michael is accused of violating the social distancing rules and creating a risk of spreading coronavirus. He is now sent to prison. Luckily, Michael knows exactly what the prison looks like from the inside, especially since it's very simple.\n\nThe prison can be represented as a rectangle $ a\\times b $ which is divided into $ ab $ cells, each representing a prison cell, common sides being the walls between cells, and sides on the perimeter being the walls leading to freedom. Before sentencing, Michael can ask his friends among the prison employees to make (very well hidden) holes in some of the walls (including walls between cells and the outermost walls). Michael wants to be able to get out of the prison after this, no matter which cell he is placed in. However, he also wants to break as few walls as possible.\n\nYour task is to find out the smallest number of walls to be broken so that there is a path to the outside from every cell after this.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1\\leq t\\leq 100 $ ) — the number of test cases.\n\nEach of the following $ t $ lines contains two integers $ a $ and $ b $ ( $ 1\\leq a, b\\leq 100 $ ), representing a corresponding test case.",
    "outputFormat": "For each test case print the single integer on a separate line — the answer to the problem.",
    "samples": [
        [
            "2\n2 2\n1 3",
            "4\n3"
        ]
    ],
    "hint": "Some possible escape plans for the example test cases are shown below. Broken walls are shown in gray, not broken walls are shown in black.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1484A/a4659585fb5a010bae617b961924fcd595e6f78a.png)\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1484A/4c54b6f42b6a89eb061e6459fc4f87678206d125.png)",
    "translation": "### 题意简述\n有一个 $a\\times b$ 的监狱，请你打通一些墙（即单元格的**边**）使得每个牢房（即**单元格**）**都能通向外界**。\n\n给定 $a$ 和 $b$，请你求出在这种条件下**最少**需要打通几道墙。\n\n**本题有多组数据。**\n\n### 数据范围\n$1 \\leq t, a, b \\leq 100$"
}