{
    "description": "In the Land of Fire there are $ n $ villages and $ n-1 $ bidirectional road, and there is a path between any pair of villages by roads. There are only two types of roads: stone ones and sand ones. Since the Land of Fire is constantly renovating, every morning workers choose a single road and flip its type (so it becomes a stone road if it was a sand road and vice versa). Also everyone here loves ramen, that's why every morning a ramen pavilion is set in the middle of every stone road, and at the end of each day all the pavilions are removed.\n\nFor each of the following $ m $ days, after another road is flipped, Naruto and Jiraiya choose a simple path — that is, a route which starts in a village and ends in a (possibly, the same) village, and doesn't contain any road twice. Since Naruto and Jiraiya also love ramen very much, they buy a single cup of ramen on each stone road and one of them eats it. Since they don't want to offend each other, they only choose routes where they can eat equal number of ramen cups. Since they both like traveling, they choose any longest possible path. After every renovation find the maximal possible length of a path (that is, the number of roads in it) they can follow.",
    "inputFormat": "The first line contains the only positive integer $ n $ ( $ 2 \\leq n \\leq 500\\,000 $ ) standing for the number of villages in the Land of Fire.\n\nEach of the following $ (n-1) $ lines contains a description of another road, represented as three positive integers $ u $ , $ v $ and $ t $ ( $ 1 \\leq u, v \\leq n $ , $ t \\in \\{0,1\\} $ ). The first two numbers denote the villages connected by the road, and the third denotes the initial type of the road: $ 0 $ for the sand one and $ 1 $ for the stone one. Roads are numbered from $ 1 $ to $ (n-1) $ in the order from the input.\n\nThe following line contains a positive integer $ m $ ( $ 1 \\leq m \\leq 500\\,000 $ ) standing for the number of days Naruto and Jiraiya travel for.\n\nEach of the following $ m $ lines contains the single integer $ id $ ( $ 1 \\leq id \\leq n-1 $ ) standing for the index of the road whose type is flipped on the morning of corresponding day.\n\nIt is guaranteed that there is a road path between any pair of villages.",
    "outputFormat": "Output $ m $ lines. In the $ i $ -th of them print the only integer denoting the maximal possible length of any valid path on the $ i $ -th day.",
    "samples": [
        [
            "5\n1 2 0\n1 3 0\n3 5 0\n3 4 0\n5\n3\n4\n1\n3\n4",
            "3\n2\n3\n3\n2"
        ]
    ],
    "hint": "After the renovation of the $ 3 $ -rd road the longest path consists of the roads $ 1 $ , $ 2 $ and $ 4 $ .\n\nAfter the renovation of the $ 4 $ -th road one of the longest paths consists of the roads $ 1 $ and $ 2 $ .\n\nAfter the renovation of the $ 1 $ -st road one of the longest paths consists of the roads $ 1 $ , $ 2 $ and $ 3 $ .\n\nAfter the renovation of the $ 3 $ -rd road the longest path consists of the roads $ 1 $ , $ 2 $ and $ 4 $ .\n\nAfter the renovation of the $ 4 $ -rd road one of the longest paths consists of the roads $ 2 $ and $ 4 $ .",
    "translation": "给定一棵n个点n-1条边的树，每条边都有标记0或1。现在有m次操作，每次操作将第id条边的标记异或1。在每次操作后输出当前树上最长的有偶数个1的路径（不能重复经过某条边）包含多少条边。"
}