{
    "description": "You are given a string $ s $ consisting of $ n $ characters. These characters are among the first $ k $ lowercase letters of the Latin alphabet. You have to perform $ n $ operations with the string.\n\nDuring the $ i $ -th operation, you take the character that initially occupied the $ i $ -th position, and perform one of the following actions with it:\n\n- swap it with the previous character in the string (if it exists). This operation is represented as L;\n- swap it with the next character in the string (if it exists). This operation is represented as R;\n- cyclically change it to the previous character in the alphabet (b becomes a, c becomes b, and so on; a becomes the $ k $ -th letter of the Latin alphabet). This operation is represented as D;\n- cyclically change it to the next character in the alphabet (a becomes b, b becomes c, and so on; the $ k $ -th letter of the Latin alphabet becomes a). This operation is represented as U;\n- do nothing. This operation is represented as 0.\n\nFor example, suppose the initial string is test, $ k = 20 $ , and the sequence of operations is URLD. Then the string is transformed as follows:\n\n1. the first operation is U, so we change the underlined letter in test to the next one in the first $ 20 $ Latin letters, which is a. The string is now aest;\n2. the second operation is R, so we swap the underlined letter with the next one in the string aest. The string is now aset;\n3. the third operation is L, so we swap the underlined letter with the previous one in the string aset (note that this is now the $ 2 $ -nd character of the string, but it was initially the $ 3 $ -rd one, so the $ 3 $ -rd operation is performed to it). The resulting string is saet;\n4. the fourth operation is D, so we change the underlined letter in saet to the previous one in the first $ 20 $ Latin letters, which is s. The string is now saes.\n\nThe result of performing the sequence of operations is saes.\n\nGiven the string $ s $ and the value of $ k $ , find the lexicographically smallest string that can be obtained after applying a sequence of operations to $ s $ .",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nEach test case consists of two lines. The first line contains two integers $ n $ and $ k $ ( $ 1 \\le n \\le 500 $ ; $ 2 \\le k \\le 26 $ ).\n\nThe second line contains a string $ s $ consisting of $ n $ characters. Each character is one of the $ k $ first letters of the Latin alphabet (in lower case).",
    "outputFormat": "For each test case, print one line containing the lexicographically smallest string that can be obtained from $ s $ using one sequence of operations.",
    "samples": [
        [
            "6\n4 2\nbbab\n7 5\ncceddda\n6 5\necdaed\n7 4\ndcdbdaa\n8 3\nccabbaca\n5 7\neabba",
            "aaaa\nbaccacd\naabdac\naabacad\naaaaaaaa\nabadb"
        ]
    ],
    "hint": "",
    "translation": "题目给定一个长度为 $n$ 的字符串，并且字符集为英文字母中的前 $k$ 个     \n在第 $i$ 个操作中，你将对最初在第 $i$ 个位置的字符进行以下操作：\n* $\\text{L}$ 操作：将其与前一个字符交换（如果前一个字符存在   \n* $\\text{R}$ 操作：将其与后一个字符交换（如果后一个字符存在    \n* $\\text{D}$ 操作：将该字符替换为字符集中前一个字符（默认 $\\text{a}$ 的前一个字符为第 $k$ 个英文字母    \n* $\\text{U}$ 操作：将该字符替换为字符集中后一个字符（默认第 $k$ 个英文字母的后一个字符为 $\\text{a}$  \n* $\\text{O}$ 操作：什么都不做\n\n给定字符串 $s$ 和 $k$ 的值，找到对 $s$ 进行一系列操作后可以得到的字典序最小的字符串。"
}