{
    "description": "Masha has $ n $ types of tiles of size $ 2 \\times 2 $ . Each cell of the tile contains one integer. Masha has an infinite number of tiles of each type.\n\nMasha decides to construct the square of size $ m \\times m $ consisting of the given tiles. This square also has to be a symmetric with respect to the main diagonal matrix, and each cell of this square has to be covered with exactly one tile cell, and also sides of tiles should be parallel to the sides of the square. All placed tiles cannot intersect with each other. Also, each tile should lie inside the square. See the picture in Notes section for better understanding.\n\nSymmetric with respect to the main diagonal matrix is such a square $ s $ that for each pair $ (i, j) $ the condition $ s[i][j] = s[j][i] $ holds. I.e. it is true that the element written in the $ i $ -row and $ j $ -th column equals to the element written in the $ j $ -th row and $ i $ -th column.\n\nYour task is to determine if Masha can construct a square of size $ m \\times m $ which is a symmetric matrix and consists of tiles she has. Masha can use any number of tiles of each type she has to construct the square. Note that she can not rotate tiles, she can only place them in the orientation they have in the input.\n\nYou have to answer $ t $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of the test case contains two integers $ n $ and $ m $ ( $ 1 \\le n \\le 100 $ , $ 1 \\le m \\le 100 $ ) — the number of types of tiles and the size of the square Masha wants to construct.\n\nThe next $ 2n $ lines of the test case contain descriptions of tiles types. Types of tiles are written one after another, each type is written on two lines.\n\nThe first line of the description contains two positive (greater than zero) integers not exceeding $ 100 $ — the number written in the top left corner of the tile and the number written in the top right corner of the tile of the current type. The second line of the description contains two positive (greater than zero) integers not exceeding $ 100 $ — the number written in the bottom left corner of the tile and the number written in the bottom right corner of the tile of the current type.\n\nIt is forbidden to rotate tiles, it is only allowed to place them in the orientation they have in the input.",
    "outputFormat": "For each test case print the answer: \"YES\" (without quotes) if Masha can construct the square of size $ m \\times m $ which is a symmetric matrix. Otherwise, print \"NO\" (withtout quotes).",
    "samples": [
        [
            "6\n3 4\n1 2\n5 6\n5 7\n7 4\n8 9\n9 8\n2 5\n1 1\n1 1\n2 2\n2 2\n1 100\n10 10\n10 10\n1 2\n4 5\n8 4\n2 2\n1 1\n1 1\n1 2\n3 4\n1 2\n1 1\n1 1",
            "YES\nNO\nYES\nNO\nYES\nYES"
        ]
    ],
    "hint": "The first test case of the input has three types of tiles, they are shown on the picture below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1426B/72728526690beb02f77ef627d3bb81edbf677aaa.png)Masha can construct, for example, the following square of size $ 4 \\times 4 $ which is a symmetric matrix:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1426B/686ce8587905cfa738ef36a9bacc1857c8f2f69a.png)",
    "translation": "- 定义 $m\\times m$ 的矩阵为对称的当且仅当对于任意 $i,j\\in [1,m]$，都有 $s_{i,j}=s_{j,i}$。\n- 给出 $n$ 种大小为 $2\\times 2$ 的矩阵和 $m$，每种矩阵不限数量。若能用这些矩阵组成（不可旋转）$m\\times m$ 的对称矩阵，输出 `YES`，否则输出 `NO`。\n- 输入格式：先输入数据组数 $t$。每组数据第一行为 $n,m$，随后 $2n$ 行描述了 $n$ 种 $2\\times2$ 的矩阵，每个矩阵输入数据中依次为矩阵左上角、右上角、左下角、右下角。\n\n- 数据组数 $t\\le100$，$1\\le n,m\\le100$。"
}