{
    "description": "Greg the Dwarf has been really busy recently with excavations by the Neverland Mountain. However for the well-known reasons (as you probably remember he is a very unusual dwarf and he cannot stand sunlight) Greg can only excavate at night. And in the morning he should be in his crypt before the first sun ray strikes. That's why he wants to find the shortest route from the excavation point to his crypt. Greg has recollected how the Codeforces participants successfully solved the problem of transporting his coffin to a crypt. So, in some miraculous way Greg appeared in your bedroom and asks you to help him in a highly persuasive manner. As usual, you didn't feel like turning him down.\n\nAfter some thought, you formalized the task as follows: as the Neverland mountain has a regular shape and ends with a rather sharp peak, it can be represented as a cone whose base radius equals $ r $ and whose height equals $ h $ . The graveyard where Greg is busy excavating and his crypt can be represented by two points on the cone's surface. All you've got to do is find the distance between points on the cone's surface.\n\nThe task is complicated by the fact that the mountain's base on the ground level and even everything below the mountain has been dug through by gnome (one may wonder whether they've been looking for the same stuff as Greg...). So, one can consider the shortest way to pass not only along the side surface, but also along the cone's base (and in a specific case both points can lie on the cone's base — see the first sample test)\n\nGreg will be satisfied with the problem solution represented as the length of the shortest path between two points — he can find his way pretty well on his own. He gave you two hours to solve the problem and the time is ticking!",
    "inputFormat": "The first input line contains space-separated integers $ r $ and $ h $ ( $ 1<=r,h<=1000 $ ) — the base radius and the cone height correspondingly. The second and third lines contain coordinates of two points on the cone surface, groups of three space-separated real numbers. The coordinates of the points are given in the systems of coordinates where the origin of coordinates is located in the centre of the cone's base and its rotation axis matches the $ OZ $ axis. In this coordinate system the vertex of the cone is located at the point $ (0,0,h) $ , the base of the cone is a circle whose center is at the point $ (0,0,0) $ , lying on the $ XOY $ plane, and all points on the cone surface have a non-negative coordinate $ z $ . It is guaranteed that the distances from the points to the cone surface do not exceed $ 10^{-12} $ . All real numbers in the input have no more than 16 digits after decimal point.",
    "outputFormat": "Print the length of the shortest path between the points given in the input, with absolute or relative error not exceeding $ 10^{-6} $ .",
    "samples": [
        [
            "2 2\n1.0 0.0 0.0\n-1.0 0.0 0.0\n",
            "2.000000000"
        ],
        [
            "2 2\n1.0 0.0 0.0\n1.0 0.0 1.0\n",
            "2.414213562"
        ],
        [
            "2 2\n1.0 0.0 1.0\n-1.0 0.0 1.0\n",
            "2.534324263"
        ],
        [
            "2 2\n1.0 0.0 0.0\n0.0 1.0 1.0\n",
            "3.254470198"
        ]
    ],
    "hint": "",
    "translation": "现有一顶点为 $(0,0,h)$ 半径为 $r$ 的圆锥，给定上面两点，求两点沿圆锥表面连线中的最短距离。"
}