{
    "description": "At the school where Vasya is studying, preparations are underway for the graduation ceremony. One of the planned performances is a ball, which will be attended by pairs of boys and girls.\n\nEach class must present two couples to the ball. In Vasya's class, $ a $ boys and $ b $ girls wish to participate. But not all boys and not all girls are ready to dance in pairs.\n\nFormally, you know $ k $ possible one-boy-one-girl pairs. You need to choose two of these pairs so that no person is in more than one pair.\n\nFor example, if $ a=3 $ , $ b=4 $ , $ k=4 $ and the couples $ (1, 2) $ , $ (1, 3) $ , $ (2, 2) $ , $ (3, 4) $ are ready to dance together (in each pair, the boy's number comes first, then the girl's number), then the following combinations of two pairs are possible (not all possible options are listed below):\n\n- $ (1, 3) $ and $ (2, 2) $ ;\n- $ (3, 4) $ and $ (1, 3) $ ;\n\nBut the following combinations are not possible:\n\n- $ (1, 3) $ and $ (1, 2) $ — the first boy enters two pairs;\n- $ (1, 2) $ and $ (2, 2) $ — the second girl enters two pairs;\n\nFind the number of ways to select two pairs that match the condition above. Two ways are considered different if they consist of different pairs.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of each test case contains three integers $ a $ , $ b $ and $ k $ ( $ 1 \\le a, b, k \\le 2 \\cdot 10^5 $ ) — the number of boys and girls in the class and the number of couples ready to dance together.\n\nThe second line of each test case contains $ k $ integers $ a_1, a_2, \\ldots a_k $ . ( $ 1 \\le a_i \\le a $ ), where $ a_i $ is the number of the boy in the pair with the number $ i $ .\n\nThe third line of each test case contains $ k $ integers $ b_1, b_2, \\ldots b_k $ . ( $ 1 \\le b_i \\le b $ ), where $ b_i $ is the number of the girl in the pair with the number $ i $ .\n\nIt is guaranteed that the sums of $ a $ , $ b $ , and $ k $ over all test cases do not exceed $ 2 \\cdot 10^5 $ .\n\nIt is guaranteed that each pair is specified at most once in one test case.",
    "outputFormat": "For each test case, on a separate line print one integer — the number of ways to choose two pairs that match the condition above.",
    "samples": [
        [
            "3\n3 4 4\n1 1 2 3\n2 3 2 4\n1 1 1\n1\n1\n2 2 4\n1 1 2 2\n1 2 1 2",
            "4\n0\n2"
        ]
    ],
    "hint": "In the first test case, the following combinations of pairs fit:\n\n- $ (1, 2) $ and $ (3, 4) $ ;\n- $ (1, 3) $ and $ (2, 2) $ ;\n- $ (1, 3) $ and $ (3, 4) $ ;\n- $ (2, 2) $ and $ (3, 4) $ .\n\nThere is only one pair in the second test case.\n\nIn the third test case, the following combinations of pairs fit:\n\n- $ (1, 1) $ and $ (2, 2) $ ;\n- $ (1, 2) $ and $ (2, 1) $ .",
    "translation": "### 题意\n在毕业典礼上，有 $a$ 个男孩和 $b$ 个女孩准备跳舞，不是所有的男孩和女孩都准备结伴跳舞。\n\n\n现在你知道 $k$ 个可能的舞伴，你需要选择其中的两对，以便使没有人重复地出现在舞伴里，求可能的数量。\n\n### 输入格式\n第一行一个整数 $t$ 表示数据组数\n\n每个数据的第一行三个整数 $a,b,k$ ，分别表示男孩数，女孩数和舞伴数。\n\n每个数据的第二行 $a_1,a_2,...,a_k$ 表示男孩 $a_i$ 在第 $i$ 对舞伴里\n\n每个数据的第三行 $b_1,b_2,...,b_k$ 表示女孩 $b_i$ 在第 $i$ 对舞伴里\n\n### 输出格式\n一行一个整数表示每个数据的方案数\n\n### 说明/提示\n$1 \\leq t \\leq 10^4$\n\n$1\\leq a,b,k \\leq 2\\cdot 10^5$"
}