{
    "description": "You have to paint with shades of grey the tiles of an $ n\\times n $ wall. The wall has $ n $ rows of tiles, each with $ n $ tiles.\n\nThe tiles on the boundary of the wall (i.e., on the first row, last row, first column and last column) are already painted and you shall not change their color. All the other tiles are not painted. Some of the tiles are broken, you shall not paint those tiles. It is guaranteed that the tiles on the boundary are not broken.\n\nYou shall paint all the non-broken tiles that are not already painted. When you paint a tile you can choose from $ 10^9 $ shades of grey, indexed from $ 1 $ to $ 10^9 $ . You can paint multiple tiles with the same shade. Formally, painting the wall is equivalent to assigning a shade (an integer between $ 1 $ and $ 10^9 $ ) to each non-broken tile that is not already painted.\n\nThe contrast between two tiles is the absolute value of the difference between the shades of the two tiles. The total contrast of the wall is the sum of the contrast of all the pairs of adjacent non-broken tiles (two tiles are adjacent if they share a side).\n\nCompute the minimum possible total contrast of the wall.",
    "inputFormat": "The first line contains $ n $ ( $ 3\\le n\\le 200 $ ) – the number of rows and columns.\n\nThen $ n $ lines, each containing $ n $ integers, follow. The $ i $ -th of these lines describe the $ i $ -th row of tiles. It contains the $ n $ integers $ a_{ij} $ ( $ -1\\le a_{ij} \\le 10^9) $ . The value of $ a_{ij} $ described the tile on the $ i $ -th row and $ j $ -th column:\n\n- If $ a_{ij}=0 $ , then the tile is not painted and shall be painted.\n- If $ a_{ij}=-1 $ , then the tile is broken and shall not be painted.\n- If $ 1\\le a_{ij}\\le 10^9 $ , then the tile is already painted with the shade $ a_{ij} $ .\n\n It is guaranteed that the tiles on the boundary are already painted, the tiles not on the boundary are not already painted, and the tiles on the boundary are not broken.",
    "outputFormat": "Print a single integer – the minimum possible total contrast of the wall.",
    "samples": [
        [
            "3\n1 7 6\n4 0 6\n1 1 1",
            "26"
        ],
        [
            "3\n10 100 1\n1 -1 100\n10 10 10",
            "396"
        ],
        [
            "5\n6 6 5 4 4\n6 0 0 0 4\n7 0 0 0 3\n8 0 0 0 2\n8 8 1 2 2",
            "34"
        ],
        [
            "7\n315055237 841510063 581663979 148389224 405375301 243686840 882512379\n683199716 -1 -1 0 0 0 346177625\n496442279 0 0 0 0 0 815993623\n223938231 0 0 -1 0 0 16170511\n44132173 0 -1 0 0 0 130735659\n212201259 0 0 -1 0 0 166102576\n123213235 506794677 467013743 410119347 791447348 80193382 142887538",
            "10129482893"
        ]
    ],
    "hint": "Explanation of the first testcase: The initial configuration of the tiles is (tiles to paint are denoted by ?):\n\n ```\n<pre class=\"verbatim\"><br></br>1 7 6<br></br>4 ? 6<br></br>1 1 1<br></br>\n```\n\n  A possible way to paint the tile achieving the minimum possible contrast of $ 26 $ is:  ```\n<pre class=\"verbatim\"><br></br>1 7 6<br></br>4 5 6<br></br>1 1 1<br></br>\n```\n\nExplanation of the second testcase: Since all tiles are either painted or broken, there is nothing to do. The total contrast is $ 396 $ .\n\nExplanation of the third testcase: The initial configuration of the tiles is (tiles to paint are denoted by ?):\n\n ```\n<pre class=\"verbatim\"><br></br>6 6 5 4 4<br></br>6 ? ? ? 4<br></br>7 ? ? ? 3<br></br>8 ? ? ? 2<br></br>8 8 1 2 2<br></br>\n```\n\n  A possible way to paint the tiles achieving the minimum possible contrast of $ 34 $ is:  ```\n<pre class=\"verbatim\"><br></br>6 6 5 4 4<br></br>6 6 5 4 4<br></br>7 7 5 3 3<br></br>8 8 2 2 2<br></br>8 8 1 2 2<br></br>\n```",
    "translation": "给定一个 $n \\times n$ 的棋盘，其边界上所有位置均填好了数字，你需要在剩余 $(n - 2) \\times (n - 2)$ 个位置上填数，部分位置已经“破损”，在输入时用 $-1$ 描述，此处无法填数。\n\n对于一种填数方案，定义一对相邻（四连通）的均不为“破损”的格子的贡献为其填入的数字的差值的绝对值，定义此填数方案的权值为各个相邻的格子的贡献之和。\n\n你需要最小化权值，输出可以得到的最小权值。\n\n保证 $3 \\le n \\le 200$，$-1 \\le a_{i, j} \\le {10}^9$。\n\n- 保证边界上的方格均未“破损”。"
}