{
    "description": "This is an interactive problem.\n\nKochiya Sanae is playing with magnets. Realizing that some of those magnets are demagnetized, she is curious to find them out.\n\nThere are $ n $ magnets, which can be of the following $ 3 $ types:\n\n- N\n- S\n- - — these magnets are demagnetized.\n\nNote that you don't know the types of these magnets beforehand.\n\nYou have a machine which can measure the force between the magnets, and you can use it at most $ n+\\lfloor \\log_2n\\rfloor $ times.\n\nYou can put some magnets to the left part of the machine and some to the right part of the machine, and launch the machine. Obviously, you can put one magnet to at most one side (you don't have to put all magnets). You can put the same magnet in different queries.\n\nThen the machine will tell the force these magnets produce. Formally, let $ n_1,s_1 $ be the number of N and S magnets correspondently on the left and $ n_2,s_2 $ — on the right. Then the force between them would be $ n_1n_2+s_1s_2-n_1s_2-n_2s_1 $ . Please note that the force is a signed value.\n\nHowever, when the absolute value of the force is strictly larger than $ n $ , the machine will crash into pieces.\n\nYou need to find all magnets of type - (all demagnetized ones), without breaking the machine.\n\nNote that the interactor is not adaptive. The types of the magnets are fixed before the start of the interaction and do not change with queries.\n\nIt is guaranteed that there are at least $ 2 $ magnets whose type is not -, and at least $ 1 $ magnet of type -.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases.",
    "outputFormat": "For each test case you should start by reading an integer $ n $ ( $ 3 \\leq n \\leq 2000 $ ) — the number of the magnets.\n\nIt is guaranteed that the total sum of all $ n $ over all test cases doesn't exceed $ 2000 $ .\n\nAfter that you can put some magnets into the machine and make a query from the statement.\n\nYou have to print each query in three lines:\n\n- In the first line print \"? l r\" (without quotes) where $ l $ and $ r $ ( $ 1 \\leq l,r < n $ , $ l+r \\leq n $ ) respectively denote the number of the magnets you put to left and right.\n- In the second line print $ l $ integers $ a_1, \\dots, a_l $ ( $ 1 \\leq a_i \\leq n $ , $ a_i \\neq a_j $ if $ i \\neq j $ ) — the indices of the magnets you put to left.\n- In the third line print $ r $ integers $ b_1, \\dots, b_r $ ( $ 1 \\leq b_i \\leq n $ , $ b_i \\neq b_j $ if $ i \\neq j $ ) — the indices of the magnets you put to right.\n- The same magnet can't be put to both sides in the same query. Formally, you should guarantee that $ a_i \\neq b_j $ for any $ i $ and $ j $ . However, you may leave some magnets unused.\n\nAfter printing a query do not forget to output end of line and flush the output. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see documentation for other languages.\n\nAfter this, you should read an integer $ F $ — the force these magnets produce.\n\nNote that if your query is invalid(either the query limit exceeds, the machine crashes or the arguments are invalid), the interactor will terminate immediately. In this case terminate your program to receive verdict Wrong Answer instead of arbitrary verdicts.\n\nIf you are confident about your answer, use the following format to report it:\n\n- \"! k A\", where $ k $ is the number of magnets you found, and $ A $ is an array consisting of $ k $ different integers from $ 1 $ to $ n $ denoting the indices of the magnets of type - that you found. You may print elements of $ A $ in arbitrary order.\n- After that, if this is the last test case, you have to terminate your program; otherwise you should immediately continue to deal with the next test case.\n\nNote that the interactor is not adaptive. The types of the magnets are fixed before the start of interaction and do not change with queries.\n\nHacks\n\nTo hack a solution, use the following format:\n\nThe first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases in your hack.\n\nThen follow the descriptions of the $ t $ test cases, each printed in two lines:\n\n- The first line contains a single integer $ n $ ( $ 3 \\leq n \\leq 2000 $ ) — the number of magnets.\n- The second line contains a string $ S $ of length $ n $ consisting of only N, S and -, denoting the magnets' types.\n- Each of your test case should guarantee that there are at least $ 2 $ magnets whose type is not -, and at least $ 1 $ magnet of type -. Meanwhile, the total sum of $ n $ in all test cases should not exceed $ 2000 $ .",
    "samples": [
        [
            "1\n4\n\n\n\n0\n\n\n\n1\n\n\n\n0\n\n\n\n0",
            "? 1 1\n3\n4\n\n? 1 2\n1\n2 3\n\n? 1 1\n1\n4\n\n? 1 1\n1\n3\n\n! 2 3 4"
        ]
    ],
    "hint": "The empty lines in the sample are just for you to better understand the interaction process. You're not required to print them.\n\nIn the sample, the types of the magnets are NN--.\n\nAt first, you put the third magnet on the left and the fourth one on the right. Both of them have type -, thus no force is produced.\n\nThen you put the first magnet on the left and the second and third one on the right. The third magnet has type -, while the other two magnets are of type N, so the force produced is $ 1 $ .\n\nIn the following two queries, the force is $ 0 $ since there is only a magnet with property - on the right.\n\nThen we can determine that the magnets of type - are the third and the fourth one, so we should print ! 2 3 4 and exit.",
    "translation": "**官方题面**\n\n_这是一个交互题。_\n\n早苗有 $n$ 块磁石，编号为 $1,2,\\cdots,n$。每块磁石的磁极可能是正极，负极，也可能没有磁性。她希望你能帮她找出所有没有磁性的磁石。\n\n万幸的是，你有一台磁力检测仪。你每次可以将每个磁石放在这台机器的左托盘，右托盘或者不放。\n\n机器将会返回此时的磁力强度。设托盘左边有 $n_1$ 个磁石为正极，$s_1$ 个磁石为负极，托盘右边中有 $n_2$ 磁石为正极，$s_2$ 个磁石为负极，则返回的磁力强度为 $ n_1n_2+s_1s_2-n_1s_2-n_2s_1 $。\n\n如果一次测试中磁力强度的绝对值大于 $n$，这台机器就会坏掉。\n\n你需要在  $n+\\lfloor\\log_2n\\rfloor$ 次测试内找到所有没有磁性的磁石的编号，同时不能弄坏机器。\n\n**保证存在至少 $2$ 块磁石有磁性且至少 $1$ 块磁石没有磁性。**\n\n-------------------------------\n\n仅一行，包含一个正整数 $T$（$1\\leq T\\leq 100$），表示数据的组数。\n\n----------------------------------------\n\n对于每组数据，你需要先读入一个正整数 $n$（$3\\leq n\\leq 2000$），代表磁石的数量，保证每组数据的 $n$ 之和不超过 $2000$。\n\n接下来，你可以向交互库提出若干次询问。对于每个询问，你需要输出三行：\n\n* 第一行输出 ``? L R``，其中 $L$ 代表放在左托盘的磁石个数，$R$ 代表放在右托盘的磁石个数。\n* 第二行输出 $L$ 个数 $a_1,a_2,\\cdots,a_L$，代表放在左托盘的磁石编号。\n* 第三行输出 $R$ 个数 $b_1,b_2,\\cdots,b_R$，代表放在右托盘的磁石编号。\n\n显然，你需要保证 $a_i\\neq b_j$。\n\n接下来，你需要刷新缓冲区。\n\n（刷新缓冲区教程）\n\n最后，你需要读入一个整数 $F$，代表这次测试的磁性大小。\n\n如果你已经确定了答案，输出一行 ``! k A``  表示答案，其中 $k$ 代表没有磁性的磁石数量，$A$ 为一个长度为 $k$ 的序列，代表所有没有磁性的磁石编号。如果这不是最后一组数据，你应该继续处理下一组数据。如果这是最后一组数据，你应该立刻结束你的程序。\n\n**此题中，交互库是固定的。** 每个磁石的状态不随着你的测试而改变。\n\n------------------------------\n\n如果你想叉别人，你需要用以下的方式上传数据：\n\n第一行，输入一个正整数 $T$（$1\\leq T\\leq 100$），表示数据的组数。\n\n接下来输入 $T$ 组数据，每组两行。\n\n第一行输入一个正整数 $n$（$3\\leq n\\leq 2000$），代表磁石的数量，保证每组数据的 $n$ 之和不超过 $2000$。\n\n第二行输入一个长度为 $n$ 的字符串 $S$，描述每个磁石的磁极。\n\n对于第 $i$ 个字符，如果第 $i$ 个磁石为正极，输出 ``N``，如果第 $i$ 个磁石为负极，输出 ``S``，如果第 $i$ 个磁石没有磁性，输出 ``-``。\n\n你应该保证存在至少 $2$ 块磁石有磁性且至少 $1$ 块磁石没有磁性。\n\n-----------------------------\n\n在样例中，前两个磁石为正极，后两个磁石没有磁性。\n\n第一次测试中，左托盘和右托盘各有一个没有磁性的磁石，$n_1=s_1=n_2=s_2=0$，因此磁力为 $0$。\n\n第二次测试中，左托盘有一个正极磁石，右托盘有一个正极磁石和一个没有磁性的磁石，$n_1=n_2=1,s_1=s_2=0$，因此磁力为 $1$。\n\n剩余的测试中，右边的托盘都只有一个没有磁性的磁石，因此磁力为 $0$。\n\n因此我们确定了第三个和第四个磁石没有磁力，输出 ``! 2 3 4``。"
}