{
    "description": "BubbleSquare social network is celebrating $ 13^{th} $ anniversary and it is rewarding its members with special edition BubbleSquare tokens. Every member receives one personal token. Also, two additional tokens are awarded to each member for every friend they have on the network. Yet, there is a twist – everyone should end up with different number of tokens from all their friends. Each member may return one received token. Also, each two friends may agree to each return one or two tokens they have obtained on behalf of their friendship.",
    "inputFormat": "First line of input contains two integer numbers $ n $ and $ k $ ( $ 2 $ $ \\leq $ $ n $ $ \\leq $ $ 12500 $ , $ 1 $ $ \\leq $ $ k $ $ \\leq $ $ 1000000 $ ) - number of members in network and number of friendships.\n\nNext $ k $ lines contain two integer numbers $ a_i $ and $ b_i $ ( $ 1 $ $ \\leq $ $ a_i $ , $ b_i $ $ \\leq $ $ n $ , $ a_i $ $ \\neq $ $ b_i $ ) - meaning members $ a_i $ and $ b_i $ are friends.",
    "outputFormat": "First line of output should specify the number of members who are keeping their personal token.\n\nThe second line should contain space separated list of members who are keeping their personal token.\n\nEach of the following $ k $ lines should contain three space separated numbers, representing friend pairs and number of tokens each of them gets on behalf of their friendship.",
    "samples": [
        [
            "2 1\n1 2",
            "1\n1 \n1 2 0"
        ],
        [
            "3 3\n1 2\n1 3\n2 3",
            "0\n1 2 0\n2 3 1\n1 3 2"
        ]
    ],
    "hint": "In the first test case, only the first member will keep its personal token and no tokens will be awarded for friendship between the first and the second member.\n\nIn the second test case, none of the members will keep their personal token. The first member will receive two tokens (for friendship with the third member), the second member will receive one token (for friendship with the third member) and the third member will receive three tokens (for friendships with the first and the second member).",
    "translation": "题目大意：\n\n给出一张n个点，k条边的无自环图。你可以在每个点上放或者不放1个币，在每条边放0或1或2个币。每个点的权值为自己点上的币数量加与自己相连的边上的币数量。构造一种方案，使得图上任两个有边相连的点的权值不同。\n\n题目输出要求：\n\n第一行输出1个数num表示放上1个币的点数量。\n\n接下来一行num个数表示放上1个币的点的编号。\n\n接下来k行表示每条边放的币的数量。\n\n"
}