{
    "description": "The Dogeforces company has $ k $ employees. Each employee, except for lower-level employees, has at least $ 2 $ subordinates. Lower-level employees have no subordinates. Each employee, except for the head of the company, has exactly one direct supervisor. The head of the company is a direct or indirect supervisor of all employees. It is known that in Dogeforces, each supervisor receives a salary strictly more than all his subordinates.\n\nThe full structure of the company is a secret, but you know the number of lower-level employees and for each pair of lower-level employees, the salary of their common supervisor is known (if there are several such supervisors, then the supervisor with the minimum salary). You have to restore the structure of the company.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 500 $ ) — the number of lower-level employees.\n\nThis is followed by $ n $ lines, where $ i $ -th line contains $ n $ integers $ a_{i,1}, a_{i,2}, \\dots, a_{i,n} $ ( $ 1 \\le a_{i,j} \\le 5000 $ ) — salary of the common supervisor of employees with numbers $ i $ and $ j $ . It is guaranteed that $ a_{i,j} = a_{j,i} $ . Note that $ a_{i,i} $ is equal to the salary of the $ i $ -th employee.",
    "outputFormat": "In the first line, print a single integer $ k $ — the number of employees in the company.\n\nIn the second line, print $ k $ integers $ c_1, c_2, \\dots, c_k $ , where $ c_i $ is the salary of the employee with the number $ i $ .\n\nIn the third line, print a single integer $ r $ — the number of the employee who is the head of the company.\n\nIn the following $ k-1 $ lines, print two integers $ v $ and $ u $ ( $ 1 \\le v, u \\le k $ ) — the number of the employee and his direct supervisor.\n\nNote that the lower-level employees have numbers from $ 1 $ to $ n $ , and for the rest of the employees, you have to assign numbers from $ n+1 $ to $ k $ . If there are several correct company structures, you can print any of them.",
    "samples": [
        [
            "3\n2 5 7\n5 1 7\n7 7 4",
            "5\n2 1 4 7 5 \n4\n1 5\n2 5\n5 4\n3 4"
        ]
    ],
    "hint": "One of the possible structures in the first example: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1494D/b4b5e03fae4e04d10365f74dfd3682f3acad7010.png)",
    "translation": "题意：有一棵树，满足每个非叶子结点至少有两个儿子。每个点有权值，满足父亲的权值严格大于儿子的权值。\n\n已知这棵树有 $n$ 个叶子，并给出这 $n$ 个叶子两两之间 $\\text{lca}$ 的权值。\n\n求出这棵树的结点数，根，形态，以及每个点的权值。\n\n$2 \\le n \\le 500$"
}