{
    "description": "Three swimmers decided to organize a party in the swimming pool! At noon, they started to swim from the left side of the pool.\n\nIt takes the first swimmer exactly $ a $ minutes to swim across the entire pool and come back, exactly $ b $ minutes for the second swimmer and $ c $ minutes for the third. Hence, the first swimmer will be on the left side of the pool after $ 0 $ , $ a $ , $ 2a $ , $ 3a $ , ... minutes after the start time, the second one will be at $ 0 $ , $ b $ , $ 2b $ , $ 3b $ , ... minutes, and the third one will be on the left side of the pool after $ 0 $ , $ c $ , $ 2c $ , $ 3c $ , ... minutes.\n\nYou came to the left side of the pool exactly $ p $ minutes after they started swimming. Determine how long you have to wait before one of the swimmers arrives at the left side of the pool.",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases. Next $ t $ lines contains test case descriptions, one per line.\n\nEach line contains four integers $ p $ , $ a $ , $ b $ and $ c $ ( $ 1 \\leq p, a, b, c \\leq 10^{18} $ ), time in minutes after the start, when you came to the pool and times in minutes it take the swimmers to cross the entire pool and come back.",
    "outputFormat": "For each test case, output one integer — how long you have to wait (in minutes) before one of the swimmers arrives at the left side of the pool.",
    "samples": [
        [
            "4\n9 5 4 8\n2 6 10 9\n10 2 5 10\n10 9 9 9",
            "1\n4\n0\n8"
        ]
    ],
    "hint": "In the first test case, the first swimmer is on the left side in $ 0, 5, 10, 15, \\ldots $ minutes after the start time, the second swimmer is on the left side in $ 0, 4, 8, 12, \\ldots $ minutes after the start time, and the third swimmer is on the left side in $ 0, 8, 16, 24, \\ldots $ minutes after the start time. You arrived at the pool in $ 9 $ minutes after the start time and in a minute you will meet the first swimmer on the left side.\n\nIn the second test case, the first swimmer is on the left side in $ 0, 6, 12, 18, \\ldots $ minutes after the start time, the second swimmer is on the left side in $ 0, 10, 20, 30, \\ldots $ minutes after the start time, and the third swimmer is on the left side in $ 0, 9, 18, 27, \\ldots $ minutes after the start time. You arrived at the pool $ 2 $ minutes after the start time and after $ 4 $ minutes meet the first swimmer on the left side.\n\nIn the third test case, you came to the pool $ 10 $ minutes after the start time. At the same time, all three swimmers are on the left side. A rare stroke of luck!\n\nIn the fourth test case, all swimmers are located on the left side in $ 0, 9, 18, 27, \\ldots $ minutes after the start time. You arrived at the pool $ 10 $ minutes after the start time and after $ 8 $ minutes meet all three swimmers on the left side.",
    "translation": "#### 题目描述\n\n三个人在游泳，第 $0$ 分钟这三个人人在游泳池的左侧，之后他们开始来回游，游一个来回分别需要 $a,b,c$ 分钟。\n\n你在第 $p$ 分钟到达游泳池的左侧，请问最少经过多少分钟，你看见一个人在游泳池的左侧？\n\n#### 输入格式\n\n本题多测。第一行一个 $t$ 表示数据组数。\n\n接下来 $t$ 行，每行四个整数 $p,a,b,c$。\n\n#### 输出格式\n\n$t$ 行，每行一个整数表示答案。\n\n#### 数据范围\n\n$1\\le t \\le1000$，$1\\le p,a,b,c\\le10^{18}$。"
}