{
    "description": "A Pythagorean triple is a triple of integer numbers $ (a, b, c) $ such that it is possible to form a right triangle with the lengths of the first cathetus, the second cathetus and the hypotenuse equal to $ a $ , $ b $ and $ c $ , respectively. An example of the Pythagorean triple is $ (3, 4, 5) $ .\n\nVasya studies the properties of right triangles, and he uses a formula that determines if some triple of integers is Pythagorean. Unfortunately, he has forgotten the exact formula; he remembers only that the formula was some equation with squares. So, he came up with the following formula: $ c = a^2 - b $ .\n\nObviously, this is not the right formula to check if a triple of numbers is Pythagorean. But, to Vasya's surprise, it actually worked on the triple $ (3, 4, 5) $ : $ 5 = 3^2 - 4 $ , so, according to Vasya's formula, it is a Pythagorean triple.\n\nWhen Vasya found the right formula (and understood that his formula is wrong), he wondered: how many are there triples of integers $ (a, b, c) $ with $ 1 \\le a \\le b \\le c \\le n $ such that they are Pythagorean both according to his formula and the real definition? He asked you to count these triples.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of one line containing one integer $ n $ ( $ 1 \\le n \\le 10^9 $ ).",
    "outputFormat": "For each test case, print one integer — the number of triples of integers $ (a, b, c) $ with $ 1 \\le a \\le b \\le c \\le n $ such that they are Pythagorean according both to the real definition and to the formula Vasya came up with.",
    "samples": [
        [
            "3\n3\n6\n9",
            "0\n1\n1"
        ]
    ],
    "hint": "The only Pythagorean triple satisfying $ c = a^2 - b $ with $ 1 \\le a \\le b \\le c \\le 9 $ is $ (3, 4, 5) $ ; that's why the answer for $ n = 3 $ is $ 0 $ , and the answer for $ n = 6 $ (and for $ n = 9 $ ) is $ 1 $ .",
    "translation": "我们规定一个仅包含整数的三元组 $(a,b,c)$ 为“勾股三元组”仅当 $1\\leq a\\leq b\\leq c$ 且 $a^2+b^2=c^2$，比如 $(3,4,5)$ 就是“勾股三元组”。\n\nVasya最近刚刚学习了勾股定理，然后就把判断“勾股三元组”的方法记错了，他记成了 $a^2-b=c$，但惊奇的是，对于某些“勾股三元组”，这个式子是成立的（比如刚刚提到的 $(3,4,5)$）。现在给定 $n$，求出有多少“勾股三元组” $(a,b,c)$ 满足 $a,b,c\\leq n$ 且 $a^2-b=c$。\n\n$T$ 组询问。\n\n$1\\leq T\\leq10^4,1\\leq n\\leq10^9;$"
}