{
    "description": "As meticulous Gerald sets the table and caring Alexander sends the postcards, Sergey makes snowmen. Each showman should consist of three snowballs: a big one, a medium one and a small one. Sergey's twins help him: they've already made $ n $ snowballs with radii equal to $ r_{1} $ , $ r_{2} $ , ..., $ r_{n} $ . To make a snowman, one needs any three snowballs whose radii are pairwise different. For example, the balls with radii $ 1 $ , $ 2 $ and $ 3 $ can be used to make a snowman but $ 2 $ , $ 2 $ , $ 3 $ or $ 2 $ , $ 2 $ , $ 2 $ cannot. Help Sergey and his twins to determine what maximum number of snowmen they can make from those snowballs.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of snowballs. The next line contains $ n $ integers — the balls' radii $ r_{1} $ , $ r_{2} $ , ..., $ r_{n} $ ( $ 1<=r_{i}<=10^{9} $ ). The balls' radii can coincide.",
    "outputFormat": "Print on the first line a single number $ k $ — the maximum number of the snowmen. Next $ k $ lines should contain the snowmen's descriptions. The description of each snowman should consist of three space-separated numbers — the big ball's radius, the medium ball's radius and the small ball's radius. It is allowed to print the snowmen in any order. If there are several solutions, print any of them.",
    "samples": [
        [
            "7\n1 2 3 4 5 6 7\n",
            "2\n3 2 1\n6 5 4\n"
        ],
        [
            "3\n2 2 3\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "现在来做雪人，每个雪人由三个不同大小的雪球构成：一个大的，一个中等的，一个小的。现在有$n$个雪球半径分别为$r_1, r_2, ..., r_n$为了做雪人，三个雪球的大小必须两两不同。例如，半径分别为 $1,2,3$ 的雪球可以做成雪人，但$2,2,3$或$2,2,2$不行。现在需要尽可能做更多雪人。  \n#### Input  \n第一行是一个整数$n(1<=n<=10^5)$雪球的数量. 接下来有n行整数 — 雪球的半径$r_1, r_2, ..., r_n(1<=r_i<=10^9)$  \n#### Output  \n第一行是一个数$k$最大的雪人数. 接下来$k$行是每个雪人的描述大雪球的半径，中等雪球的半径，小雪球的半径. 允许按任意顺序输出雪人描述. 如果有多种方案，输出任意一个\n"
}