{
    "description": "Meka-Naruto plays a computer game. His character has the following ability: given an enemy hero, deal $ a $ instant damage to him, and then heal that enemy $ b $ health points at the end of every second, for exactly $ c $ seconds, starting one second after the ability is used. That means that if the ability is used at time $ t $ , the enemy's health decreases by $ a $ at time $ t $ , and then increases by $ b $ at time points $ t + 1 $ , $ t + 2 $ , ..., $ t + c $ due to this ability.\n\nThe ability has a cooldown of $ d $ seconds, i. e. if Meka-Naruto uses it at time moment $ t $ , next time he can use it is the time $ t + d $ . Please note that he can only use the ability at integer points in time, so all changes to the enemy's health also occur at integer times only.\n\nThe effects from different uses of the ability may stack with each other; that is, the enemy which is currently under $ k $ spells gets $ k\\cdot b $ amount of heal this time. Also, if several health changes occur at the same moment, they are all counted at once.\n\nNow Meka-Naruto wonders if he can kill the enemy by just using the ability each time he can (that is, every $ d $ seconds). The enemy is killed if their health points become $ 0 $ or less. Assume that the enemy's health is not affected in any way other than by Meka-Naruto's character ability. What is the maximal number of health points the enemy can have so that Meka-Naruto is able to kill them?",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1\\leq t\\leq 10^5 $ ) standing for the number of testcases.\n\nEach test case is described with one line containing four numbers $ a $ , $ b $ , $ c $ and $ d $ ( $ 1\\leq a, b, c, d\\leq 10^6 $ ) denoting the amount of instant damage, the amount of heal per second, the number of heals and the ability cooldown, respectively.",
    "outputFormat": "For each testcase in a separate line print $ -1 $ if the skill can kill an enemy hero with an arbitrary number of health points, otherwise print the maximal number of health points of the enemy that can be killed.",
    "samples": [
        [
            "7\n1 1 1 1\n2 2 2 2\n1 2 3 4\n4 3 2 1\n228 21 11 3\n239 21 11 3\n1000000 1 1000000 1",
            "1\n2\n1\n5\n534\n-1\n500000500000"
        ]
    ],
    "hint": "In the first test case of the example each unit of damage is cancelled in a second, so Meka-Naruto cannot deal more than 1 damage.\n\nIn the fourth test case of the example the enemy gets:\n\n- $ 4 $ damage ( $ 1 $ -st spell cast) at time $ 0 $ ;\n- $ 4 $ damage ( $ 2 $ -nd spell cast) and $ 3 $ heal ( $ 1 $ -st spell cast) at time $ 1 $ (the total of $ 5 $ damage to the initial health);\n- $ 4 $ damage ( $ 3 $ -nd spell cast) and $ 6 $ heal ( $ 1 $ -st and $ 2 $ -nd spell casts) at time $ 2 $ (the total of $ 3 $ damage to the initial health);\n- and so on.\n\nOne can prove that there is no time where the enemy gets the total of $ 6 $ damage or more, so the answer is $ 5 $ . Please note how the health is recalculated: for example, $ 8 $ -health enemy would not die at time $ 1 $ , as if we first subtracted $ 4 $ damage from his health and then considered him dead, before adding $ 3 $ heal.\n\nIn the sixth test case an arbitrarily healthy enemy can be killed in a sufficient amount of time.\n\nIn the seventh test case the answer does not fit into a 32-bit integer type.",
    "translation": "你在打游戏。有一个敌人,它有一个初始生命。\n\n+ 你每次可以发起进攻，使得敌人的生命值 $-a$。\n+ 敌人会恢复生命，如果你在 $t$ 时刻发起进攻 $t+1,t+2,\\cdots,t+c$ 时刻敌人可以恢复生命 $b$。\n+ 你的进攻需要“冷却”，如果你在 $t$ 时刻发起进攻，下一次进攻需要在 $t+d$ 时刻。\n\n敌人生命值减少和恢复都在同一时刻进行。如果在任意时刻敌人的生命值 $\\le 0$ ，你就赢了。\n\n问敌人最大有多少初始生命时，你可以获胜。如果答案为无穷大，则输出 $-1$。$t$ 组数据。\n\n$1\\le t\\le 100000,1\\le a,b,c,d\\le 1000000000$。"
}