{
    "description": "After your debut mobile game \"Nim\" blew up, you decided to make a sequel called \"Nim 2\". This game will expand on the trusted Nim game formula, adding the much awaited second heap!\n\nIn the game, there are two heaps, each containing a non-negative number of stones. Two players make moves in turn. On their turn, a player can take any positive number of stones from either one of the heaps. A player who is unable to move loses the game.\n\nTo make the game easier to playtest, you've introduced developer shortcuts. There are $ n $ shortcut positions $ (x_1, y_1), \\ldots, (x_n, y_n) $ . These change the game as follows: suppose that before a player's turn the first and second heap contain $ x $ and $ y $ stones respectively. If the pair $ (x, y) $ is equal to one of the pairs $ (x_i, y_i) $ , then the player about to move loses instantly, otherwise they are able to make moves as normal. Note that in the above explanation the two heaps and all pairs are ordered, that is, $ x $ must refer to the size of the first heap, and $ y $ must refer to the size of the second heap.\n\nThe game release was followed by too much celebration, and next thing you know is developer shortcuts made their way to the next official update of the game! Players now complain that the AI opponent has become unbeatable at certain stages of the game. You now have to write a program to figure out which of the given initial positions can be won by the starting player, assuming both players act optimally.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 10^5 $ ) — the number of shortcut positions, and the number of initial positions that need to be evaluated.\n\nThe following $ n $ lines describe shortcut positions. The $ i $ -th of these lines contains two integers $ x_i, y_i $ ( $ 0 \\leq x_i, y_i \\leq 10^9 $ ). It is guaranteed that all shortcut positions are distinct.\n\nThe following $ m $ lines describe initial positions. The $ i $ -th of these lines contains two integers $ a_i, b_i $ ( $ 0 \\leq a_i, b_i \\leq 10^9 $ ) — the number of stones in the first and second heap respectively. It is guaranteed that all initial positions are distinct. However, initial positions are not necessarily distinct from shortcut positions.",
    "outputFormat": "For each initial position, on a separate line print \"WIN\" if the starting player is able to win from this position, and \"LOSE\" otherwise.",
    "samples": [
        [
            "3 5\n3 0\n0 1\n2 2\n0 0\n1 1\n2 2\n3 3\n5 4",
            "LOSE\nWIN\nLOSE\nWIN\nLOSE"
        ]
    ],
    "hint": "",
    "translation": "两堆石子，先手后手轮流在一堆中取石子，不能不取。题目给出$n$种两堆石头的状态$(x_i,y_i)$，当一个人取石头之前，两堆石头的状态为$(0,0)$或者以上$n$种状态，这个人输了。   \n假设两者都足够聪明，$q$次询问$a_i,b_i$表示初始两堆石子的数量为$a_i,b_i$，先手必胜还是必败，前者输出`WIN`后者输出`LOSE`。"
}