{
    "description": "You are given a $ n \\times n $ chessboard. Rows and columns of the board are numbered from $ 1 $ to $ n $ . Cell $ (x, y) $ lies on the intersection of column number $ x $ and row number $ y $ .\n\nRook is a chess piece, that can in one turn move any number of cells vertically or horizontally. There are $ m $ rooks ( $ m < n $ ) placed on the chessboard in such a way that no pair of rooks attack each other. I.e. there are no pair of rooks that share a row or a column.\n\nIn one turn you can move one of the rooks any number of cells vertically or horizontally. Additionally, it shouldn't be attacked by any other rook after movement. What is the minimum number of moves required to place all the rooks on the main diagonal?\n\nThe main diagonal of the chessboard is all the cells $ (i, i) $ , where $ 1 \\le i \\le n $ .",
    "inputFormat": "The first line contains the number of test cases $ t $ ( $ 1 \\leq t \\leq 10^3 $ ). Description of the $ t $ test cases follows.\n\nThe first line of each test case contains two integers $ n $ and $ m $ — size of the chessboard and the number of rooks ( $ 2 \\leq n \\leq 10^5 $ , $ 1 \\leq m < n $ ). Each of the next $ m $ lines contains two integers $ x_i $ and $ y_i $ — positions of rooks, $ i $ -th rook is placed in the cell $ (x_i, y_i) $ ( $ 1 \\leq x_i, y_i \\leq n $ ). It's guaranteed that no two rooks attack each other in the initial placement.\n\nThe sum of $ n $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each of $ t $ test cases print a single integer — the minimum number of moves required to place all the rooks on the main diagonal.\n\nIt can be proved that this is always possible.",
    "samples": [
        [
            "4\n3 1\n2 3\n3 2\n2 1\n1 2\n5 3\n2 3\n3 1\n1 2\n5 4\n4 5\n5 1\n2 2\n3 3",
            "1\n3\n4\n2"
        ]
    ],
    "hint": "Possible moves for the first three test cases:\n\n1. $ (2, 3) \\to (2, 2) $\n2. $ (2, 1) \\to (2, 3) $ , $ (1, 2) \\to (1, 1) $ , $ (2, 3) \\to (2, 2) $\n3. $ (2, 3) \\to (2, 4) $ , $ (2, 4) \\to (4, 4) $ , $ (3, 1) \\to (3, 3) $ , $ (1, 2) \\to (1, 1) $",
    "translation": "题目大意：  \n给你一个$n*n$的棋盘，上面有$m(m<n)$个棋子，每个棋子都在不同的行和列，且每个棋子都可以进行水平和竖直方向的移动，求最少移动多少次才能使得每个棋子位于棋盘的主对角线上。  \n输入：  \n第一行一个字母$t$，表示有$t$组数据。  \n接下来第一行两个字母$n$和$m$，表示棋盘大小和棋子的数量。  \n接下来$m$行，每行两个字母$x$和$y$，表示第$i$个棋子的位置。"
}