{
    "description": "You are storing an integer array of length $ m $ in a database. To maintain internal integrity and protect data, the database stores $ n $ copies of this array.\n\nUnfortunately, the recent incident may have altered the stored information in every copy in the database.\n\nIt's believed, that the incident altered at most two elements in every copy. You need to recover the original array based on the current state of the database.\n\nIn case there are multiple ways to restore the array, report any. If there is no array that differs from every copy in no more than two positions, report that as well.",
    "inputFormat": "The first line contains integers $ n $ and $ m $ ( $ 2 \\le n $ ; $ 1 \\le m $ ; $ n \\cdot m \\le 250\\,000 $ ) — the number of copies and the size of the array.\n\nEach of the following $ n $ lines describes one of the currently stored copies in the database, it consists of $ m $ integers $ s_{i, 1}, s_{i, 2}, \\dots, s_{i, m} $ ( $ 1 \\le s_{i, j} \\le 10^9 $ ).",
    "outputFormat": "If there is an array consistent with all given copies, print \"Yes\" and then the array itself. The array must have length $ m $ and contain integers between $ 1 $ and $ 10^9 $ only.\n\nOtherwise, print \"No\".\n\nIf there are multiple possible arrays, print any of them.",
    "samples": [
        [
            "3 4\n1 10 10 100\n1 1 1 100\n10 100 1 100",
            "Yes\n1 10 1 100"
        ],
        [
            "10 7\n1 1 1 1 1 1 1\n1 1 1 1 1 1 2\n1 1 1 1 1 2 2\n1 1 1 1 2 2 1\n1 1 1 2 2 1 1\n1 1 2 2 1 1 1\n1 2 2 1 1 1 1\n2 2 1 1 1 1 1\n2 1 1 1 1 1 1\n1 1 1 1 1 1 1",
            "Yes\n1 1 1 1 1 1 1"
        ],
        [
            "2 5\n2 2 1 1 1\n1 1 2 2 2",
            "No"
        ]
    ],
    "hint": "In the first example, the array $ [1, 10, 1, 100] $ differs from first and second copies in just one position, and from the third copy in two positions.\n\nIn the second example, array $ [1, 1, 1, 1, 1, 1, 1] $ is the same as the first copy and differs from all other copies in at most two positions.\n\nIn the third example, there is no array differing in at most two positions from every database's copy.",
    "translation": "给定 $n$ 个长度为 $m$ 的序列 $a$，构造一个序列 $s$，满足 $\\forall \\ 1 \\le i \\le m,s_i\\in[1,10^9]$。\n且对于任意序列，$\\sum_{i=1}^{m}[a_i\\ne s_i]\\le 2$。若有多组解，输出任意一组均可；若无解，输出 `No`。\n\n对于 $100\\%$ 的数据，$n \\ge 2,\\ m \\ge 1,\\ n⋅m\\le2.5\\times10^5$。"
}