{
    "description": "There are $ n $ piranhas with sizes $ a_1, a_2, \\ldots, a_n $ in the aquarium. Piranhas are numbered from left to right in order they live in the aquarium.\n\nScientists of the Berland State University want to find if there is dominant piranha in the aquarium. The piranha is called dominant if it can eat all the other piranhas in the aquarium (except itself, of course). Other piranhas will do nothing while the dominant piranha will eat them.\n\nBecause the aquarium is pretty narrow and long, the piranha can eat only one of the adjacent piranhas during one move. Piranha can do as many moves as it needs (or as it can). More precisely:\n\n- The piranha $ i $ can eat the piranha $ i-1 $ if the piranha $ i-1 $ exists and $ a_{i - 1} < a_i $ .\n- The piranha $ i $ can eat the piranha $ i+1 $ if the piranha $ i+1 $ exists and $ a_{i + 1} < a_i $ .\n\nWhen the piranha $ i $ eats some piranha, its size increases by one ( $ a_i $ becomes $ a_i + 1 $ ).\n\nYour task is to find any dominant piranha in the aquarium or determine if there are no such piranhas.\n\nNote that you have to find any (exactly one) dominant piranha, you don't have to find all of them.\n\nFor example, if $ a = [5, 3, 4, 4, 5] $ , then the third piranha can be dominant. Consider the sequence of its moves:\n\n- The piranha eats the second piranha and $ a $ becomes $ [5, \\underline{5}, 4, 5] $ (the underlined piranha is our candidate).\n- The piranha eats the third piranha and $ a $ becomes $ [5, \\underline{6}, 5] $ .\n- The piranha eats the first piranha and $ a $ becomes $ [\\underline{7}, 5] $ .\n- The piranha eats the second piranha and $ a $ becomes $ [\\underline{8}] $ .\n\nYou have to answer $ t $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 2 \\cdot 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of the test case contains one integer $ n $ ( $ 2 \\le n \\le 3 \\cdot 10^5 $ ) — the number of piranhas in the aquarium. The second line of the test case contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ), where $ a_i $ is the size of the $ i $ -th piranha.\n\nIt is guaranteed that the sum of $ n $ does not exceed $ 3 \\cdot 10^5 $ ( $ \\sum n \\le 3 \\cdot 10^5 $ ).",
    "outputFormat": "For each test case, print the answer: -1 if there are no dominant piranhas in the aquarium or index of any dominant piranha otherwise. If there are several answers, you can print any.",
    "samples": [
        [
            "6\n5\n5 3 4 4 5\n3\n1 1 1\n5\n4 4 3 4 4\n5\n5 5 4 3 2\n3\n1 1 2\n5\n5 4 3 5 5",
            "3\n-1\n4\n3\n3\n1"
        ]
    ],
    "hint": "The first test case of the example is described in the problem statement.\n\nIn the second test case of the example, there are no dominant piranhas in the aquarium.\n\nIn the third test case of the example, the fourth piranha can firstly eat the piranha to the left and the aquarium becomes $ [4, 4, 5, 4] $ , then it can eat any other piranha in the aquarium.",
    "translation": "有 $n$ 条食人鱼，从左到右依次编号为 $a_1,a_2,…,a_n$（水族馆狭长，只能从左到右依次分布，$a_i$ 表示第 $i$ 条鱼的体积） 。如果一条鱼能吃掉其它的所有鱼，我们称之为优势鱼。\n\n每条鱼可以吃很多次，但只能吃掉邻近的鱼\n\n- 存在 $a_{i-1}$ 且 $a_{i-1} < a_i$ 则可以 $a_i$ 可以吃掉 $a_{i-1}\n\n- 存在 $a_{i+1}$ 且 $a_{i+1} < a_i$ 则可以 $a_i$ 可以吃掉 $a_{i+1}\n\n每吃一条鱼自己的体积就会加一\n\n找到任意一个的占优势的鱼，有则输出是第几条，没有则输出 $”-1\"$ （不带引号）\n\n有多组样例输入"
}