{
    "description": "All techniques in the ninja world consist of hand seals. At the moment Naruto is learning a new technique, which consists of $ n\\cdot m $ different seals, denoted by distinct numbers. All of them were written in an $ n\\times m $ table.\n\nThe table is lost now. Naruto managed to remember elements of each row from left to right, and elements of each column from top to bottom, but he doesn't remember the order of rows and columns. Please restore the table consistent with this data so that Naruto will be able to learn the new technique.",
    "inputFormat": "The first line of the input contains the only integer $ t $ ( $ 1\\leq t\\leq 100\\,000 $ ) denoting the number of test cases. Their descriptions follow.\n\nThe first line of each test case description consists of two space-separated integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 500 $ ) standing for the number of rows and columns in the table, respectively. All hand seals are encoded by the positive integers from $ 1 $ to $ n\\cdot m $ .\n\nThe following $ n $ lines contain $ m $ space separated integers each, denoting elements of an arbitrary row in the table left to right.\n\nThe following $ m $ lines contain $ n $ space separated integers each, denoting elements of an arbitrary column in the table top to bottom.\n\nSum of $ nm $ over all test cases does not exceed $ 250\\,000 $ . It is guaranteed that each row occurs in the input exactly once, as well as each column. It is also guaranteed that each number from $ 1 $ to $ nm $ occurs exactly once in all rows, as well as in all columns. Finally, it is guaranteed that a table consistent with the input exists.",
    "outputFormat": "For each test case, output $ n $ lines with $ m $ space-separated integers each, denoting the restored table. One can show that the answer is always unique.",
    "samples": [
        [
            "2\n2 3\n6 5 4\n1 2 3\n1 6\n2 5\n3 4\n3 1\n2\n3\n1\n3 1 2",
            "1 2 3 \n6 5 4 \n3 \n1 \n2"
        ]
    ],
    "hint": "Consider the first test case. The matrix is $ 2 \\times 3 $ . You are given the rows and columns in arbitrary order.\n\nOne of the rows is $ [6, 5, 4] $ . One of the rows is $ [1, 2, 3] $ .\n\nOne of the columns is $ [1, 6] $ . One of the columns is $ [2, 5] $ . One of the columns is $ [3, 4] $ .\n\nYou are to reconstruct the matrix. The answer is given in the output.",
    "translation": "## 题意简述\n有一张 $ n\\times m $ 的表格，每一格写着不同的数字。但是表格被打乱了！现在给出从左到右每一行的元素，从上到下每一列的元素，但行和列的顺序是打乱的。请还原这张表。\n## 输入格式\n输入的第一行包括一个整数 $T$ $(1\\le T \\le100000)$表示测试用例的数量。\n\n每个测试用例的第一行包含两个整数 $n,m$ $(1\\le n,m \\le500)$ 分别表示表格行数和列数。\n\n下列 $n$ 行每行包含 $m$ 个整数，表示表中从左到右的任意行的元素。\n\n下列 $m$ 行每行包含 $n$ 个整数，表示表中从上到下的任意列的元素。\n\n保证每一行和每一列仅出现一次。\n\n## 输出格式\n对于每个测试用例，输出一个 $n\\times m$ 的表格，表示还原后的表格。答案是唯一的。"
}