{
    "description": "As Gerald, Alexander, Sergey and Gennady are already busy with the usual New Year chores, Edward hastily decorates the New Year Tree. And any decent New Year Tree must be decorated with a good garland. Edward has lamps of $ m $ colors and he wants to make a garland from them. That garland should represent a sequence whose length equals $ L $ . Edward's tree is $ n $ layers high and Edward plans to hang the garland so as to decorate the first layer with the first $ l_{1} $ lamps, the second layer — with the next $ l_{2} $ lamps and so on. The last $ n $ -th layer should be decorated with the last $ l_{n} $ lamps, ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF140E/42a70ee20282a88c2096038b0f0078e30892d44c.png)\n\nEdward adores all sorts of math puzzles, so he suddenly wondered: how many different ways to assemble the garland are there given that the both following two conditions are met:\n\n1. Any two lamps that follow consecutively in the same layer should have different colors.\n2. The sets of used colors in every two neighbouring layers must be different. We consider unordered sets (not multisets), where every color occurs no more than once. So the number of lamps of particular color does not matter.\n\nHelp Edward find the answer to this nagging problem or else he won't manage to decorate the Tree by New Year. You may consider that Edward has an unlimited number of lamps of each of $ m $ colors and it is not obligatory to use all $ m $ colors. The garlands are considered different if they differ in at least one position when represented as sequences. Calculate the answer modulo $ p $ .",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ p $ ( $ 1<=n,m<=10^{6} $ , $ 2<=p<=10^{9} $ ) which are the number of the tree's layers, the number of the lamps' colors and module correspondingly. The next line contains $ n $ integers $ l_{i} $ ( $ 1<=l_{i}<=5000 $ , ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF140E/b9f4d7d302951a9e7fafe6d7d5d8bce460e70c01.png)).",
    "outputFormat": "Print the only integer — the number of garlands modulo $ p $ .",
    "samples": [
        [
            "3 2 1000\n3 1 2\n",
            "8\n"
        ],
        [
            "2 3 1000\n2 2\n",
            "24\n"
        ],
        [
            "1 1 1000\n5\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample the following variants are possible: 121|1|12, 121|1|21, 121|2|12, 121|2|21, 212|1|12, 212|1|21, 212|2|12, 212|2|21. In the second sample the following variants are possible: 12|13, 12|23, 12|31, 12|32 and so on.\n\n Figure for the first sample: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF140E/43a99e6af3db8b6061dcc0d84dc8f7d3d9524c52.png)",
    "translation": "现在小 $A$ 手上有 $m$ 种小球，他要用这些小球装饰一棵圣诞树。\n\n这是一棵神奇的圣诞树，一共有 $n$ 层，每层由 $l_i$ 个小球组成。\n\n对于每一层内部，相邻的小球的都不相同。\n\n同时，外部来看，相邻的两层的小球集合不相同。\n\n现在小 $A$ 想要知道一共有多少种合法装饰方案，答案对 $p$ 取模。\n\n数据范围： ($1≤n,m≤10^6,2≤p≤10^9,1≤l_i≤5000,\\sum\\limits^n_{i=1}l_i≤10^7$)\n"
}