{
    "description": "A robot is standing at the origin of the infinite two-dimensional plane. Each second the robot moves exactly $ 1 $ meter in one of the four cardinal directions: north, south, west, and east. For the first step the robot can choose any of the four directions, but then at the end of every second it has to turn 90 degrees left or right with respect to the direction it just moved in. For example, if the robot has just moved north or south, the next step it takes has to be either west or east, and vice versa.\n\nThe robot makes exactly $ n $ steps from its starting position according to the rules above. How many different points can the robot arrive to at the end? The final orientation of the robot can be ignored.",
    "inputFormat": "The only line contains a single integer $ n $ ( $ 1 \\leq n \\leq 1000 $ ) — the number of steps the robot makes.",
    "outputFormat": "Print a single integer — the number of different possible locations after exactly $ n $ steps.",
    "samples": [
        [
            "1",
            "4"
        ],
        [
            "2",
            "4"
        ],
        [
            "3",
            "12"
        ]
    ],
    "hint": "In the first sample case, the robot will end up 1 meter north, south, west, or east depending on its initial direction.\n\nIn the second sample case, the robot will always end up $ \\sqrt{2} $ meters north-west, north-east, south-west, or south-east.",
    "translation": "一个机器人站在二维平面的原点。\n\n机器人每秒钟可以向东，西，南，北四个方向移动 $1$ 米。\n\n第一步，机器人可以选择四个方向中的任何一个，但是在每一秒结束时，它必须向左或向右转 $90$ 度。例如，如果机器人只是向南或向北移动，下一步就必须向西或向东移动，反之亦然。\n\n机器人按照上述规则从起始位置走出 $n$ 步。若机器人的最终方向忽略不计，它能到达多少个不同的终点？"
}