{
    "description": "You have a blackboard and initially only an odd number $ x $ is written on it. Your goal is to write the number $ 1 $ on the blackboard.\n\nYou may write new numbers on the blackboard with the following two operations.\n\n- You may take two numbers (not necessarily distinct) already on the blackboard and write their sum on the blackboard. The two numbers you have chosen remain on the blackboard.\n- You may take two numbers (not necessarily distinct) already on the blackboard and write their [bitwise XOR](https://en.wikipedia.org/wiki/Bitwise_operation#XOR) on the blackboard. The two numbers you have chosen remain on the blackboard.\n\n Perform a sequence of operations such that at the end the number $ 1 $ is on the blackboard.",
    "inputFormat": "The single line of the input contains the odd integer $ x $ ( $ 3 \\le x \\le 999,999 $ ).",
    "outputFormat": "Print on the first line the number $ q $ of operations you perform. Then $ q $ lines should follow, each describing one operation.\n\n- The \"sum\" operation is described by the line \" $ a $ + $ b $ \", where $ a, b $ must be integers already present on the blackboard.\n- The \"xor\" operation is described by the line \" $ a $ ^ $ b $ \", where $ a, b $ must be integers already present on the blackboard.\n\nThe operation symbol (+ or ^) must be separated from $ a, b $ by a whitespace.You can perform at most $ 100,000 $ operations (that is, $ q\\le 100,000 $ ) and all numbers written on the blackboard must be in the range $ [0, 5\\cdot10^{18}] $ . It can be proven that under such restrictions the required sequence of operations exists. You can output any suitable sequence of operations.",
    "samples": [
        [
            "3",
            "5\n3 + 3\n3 ^ 6\n3 + 5\n3 + 6\n8 ^ 9"
        ],
        [
            "123",
            "10\n123 + 123\n123 ^ 246\n141 + 123\n246 + 123\n264 ^ 369\n121 + 246\n367 ^ 369\n30 + 30\n60 + 60\n120 ^ 121"
        ]
    ],
    "hint": "",
    "translation": "一开始黑板上有一个正奇数 $x\\ (3\\le x<10^6)$，每次你可以选定黑板上已有的正整数 $a,b$，将 $a+b$ 或 $a \\oplus b$ 写在黑板上，其中 $\\oplus$ 表示异或运算，最终目标是将 $1$ 写在黑板上。要求写数字不超过 $10^5$ 次且写上的数字不超过 $5*10^{18}$ 。"
}