{
    "description": "You have a knapsack with the capacity of $ W $ . There are also $ n $ items, the $ i $ -th one has weight $ w_i $ .\n\nYou want to put some of these items into the knapsack in such a way that their total weight $ C $ is at least half of its size, but (obviously) does not exceed it. Formally, $ C $ should satisfy: $ \\lceil \\frac{W}{2}\\rceil \\le C \\le W $ .\n\nOutput the list of items you will put into the knapsack or determine that fulfilling the conditions is impossible.\n\nIf there are several possible lists of items satisfying the conditions, you can output any. Note that you don't have to maximize the sum of weights of items in the knapsack.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). Description of the test cases follows.\n\nThe first line of each test case contains integers $ n $ and $ W $ ( $ 1 \\le n \\le 200\\,000 $ , $ 1\\le W \\le 10^{18} $ ).\n\nThe second line of each test case contains $ n $ integers $ w_1, w_2, \\dots, w_n $ ( $ 1 \\le w_i \\le 10^9 $ ) — weights of the items.\n\nThe sum of $ n $ over all test cases does not exceed $ 200\\,000 $ .",
    "outputFormat": "For each test case, if there is no solution, print a single integer $ -1 $ .\n\nIf there exists a solution consisting of $ m $ items, print $ m $ in the first line of the output and $ m $ integers $ j_1 $ , $ j_2 $ , ..., $ j_m $ ( $ 1 \\le j_i \\le n $ , all $ j_i $ are distinct) in the second line of the output — indices of the items you would like to pack into the knapsack.\n\nIf there are several possible lists of items satisfying the conditions, you can output any. Note that you don't have to maximize the sum of weights items in the knapsack.",
    "samples": [
        [
            "3\n1 3\n3\n6 2\n19 8 19 69 9 4\n7 12\n1 1 1 17 1 1 1",
            "1\n1\n-1\n6\n1 2 3 5 6 7"
        ]
    ],
    "hint": "In the first test case, you can take the item of weight $ 3 $ and fill the knapsack just right.\n\nIn the second test case, all the items are larger than the knapsack's capacity. Therefore, the answer is $ -1 $ .\n\nIn the third test case, you fill the knapsack exactly in half.",
    "translation": "您有 $n$ $(1≤n≤200$ $000)$ 个物品，第 $i$ 个物品的重量为 $w_i$ $(1≤w_i≤10^9)$。同时您还有一个容量为 $W$ $(1≤W≤10^{18})$的背包。\n\n我们希望将一些物品加入背包中，使其总重量超过 $W$ 的一半，但不超过 $W$ 。\n\n如果有，请输出物品的个数以及物品的编号；如果没有，输出 \"-1\" （不必输出双引号）。\n\n**注意：如果存在多个满足条件的物品列表，输出其中任意一个**"
}