{
    "description": "Students of Winter Informatics School are going to live in a set of houses connected by underground passages. Teachers are also going to live in some of these houses, but they can not be accommodated randomly. For safety reasons, the following must hold:\n\n- All passages between two houses will be closed, if there are no teachers in both of them. All other passages will stay open.\n- It should be possible to travel between any two houses using the underground passages that are open.\n- Teachers should not live in houses, directly connected by a passage.\n\nPlease help the organizers to choose the houses where teachers will live to satisfy the safety requirements or determine that it is impossible.",
    "inputFormat": "The first input line contains a single integer $ t $ — the number of test cases ( $ 1 \\le t \\le 10^5 $ ).\n\nEach test case starts with two integers $ n $ and $ m $ ( $ 2 \\le n \\le 3 \\cdot 10^5 $ , $ 0 \\le m \\le 3 \\cdot 10^5 $ ) — the number of houses and the number of passages.\n\nThen $ m $ lines follow, each of them contains two integers $ u $ and $ v $ ( $ 1 \\le u, v \\le n $ , $ u \\neq v $ ), describing a passage between the houses $ u $ and $ v $ . It is guaranteed that there are no two passages connecting the same pair of houses.\n\nThe sum of values $ n $ over all test cases does not exceed $ 3 \\cdot 10^5 $ , and the sum of values $ m $ over all test cases does not exceed $ 3 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, if there is no way to choose the desired set of houses, output \"NO\". Otherwise, output \"YES\", then the total number of houses chosen, and then the indices of the chosen houses in arbitrary order.",
    "samples": [
        [
            "2\n3 2\n3 2\n2 1\n4 2\n1 4\n2 3",
            "YES\n2\n1 3 \nNO"
        ],
        [
            "1\n17 27\n1 8\n2 9\n3 10\n4 11\n5 12\n6 13\n7 14\n8 9\n8 14\n8 15\n9 10\n9 15\n10 11\n10 15\n10 17\n11 12\n11 17\n12 13\n12 16\n12 17\n13 14\n13 16\n14 16\n14 15\n15 16\n15 17\n16 17",
            "YES\n8\n1 3 4 5 6 9 14 17"
        ]
    ],
    "hint": "The picture below shows the second example test.\n\n ![](https://espresso.codeforces.com/a897ddb7078dd022b869fc31de83d3960c42a931.png)",
    "translation": "给定一个 $n$ 个节点，$m$ 条无向边的图，现在你要给一些点染色，使得：\n\n- 一条边所连接的两个点不能都被染色。\n- 在所有连接两个不被染色的点的边都被删除的情况下，这个图满足任意两个点互相可达。\n\n如果有染色方案满足上述要求，输出一行 `YES` 之后输出要染色的点的数量，并以任意顺序输出所有被染色的点的编号;否则输出一行 `NO`。\n\n$T$ 组询问。\n\n$1\\leq T\\leq 10^5;2\\leq n\\leq 3\\times10^5;0\\leq m\\leq 3\\times10^5.$\n\n$\\sum n,\\sum m\\leq 3\\times10^5.$"
}