{
    "description": "The only difference between the easy and hard versions is that tokens of type O do not appear in the input of the easy version.\n\nErrichto gave Monogon the following challenge in order to intimidate him from taking his top contributor spot on Codeforces.\n\nIn a Tic-Tac-Toe grid, there are $ n $ rows and $ n $ columns. Each cell of the grid is either empty or contains a token. There are two types of tokens: X and O. If there exist three tokens of the same type consecutive in a row or column, it is a winning configuration. Otherwise, it is a draw configuration.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1450C1/39afc6239351b009b5f556b0fc6f685f7842a873.png) The patterns in the first row are winning configurations. The patterns in the second row are draw configurations. In an operation, you can change an X to an O, or an O to an X. Let $ k $ denote the total number of tokens in the grid. Your task is to make the grid a draw in at most $ \\lfloor \\frac{k}{3}\\rfloor $ (rounding down) operations.\n\nYou are not required to minimize the number of operations.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1\\le t\\le 100 $ ) — the number of test cases.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1\\le n\\le 300 $ ) — the size of the grid.\n\nThe following $ n $ lines each contain a string of $ n $ characters, denoting the initial grid. The character in the $ i $ -th row and $ j $ -th column is '.' if the cell is empty, or it is the type of token in the cell: 'X' or 'O'.\n\nIt is guaranteed that not all cells are empty.\n\nIn the easy version, the character 'O' does not appear in the input.\n\nThe sum of $ n $ across all test cases does not exceed $ 300 $ .",
    "outputFormat": "For each test case, print the state of the grid after applying the operations.\n\nWe have proof that a solution always exists. If there are multiple solutions, print any.",
    "samples": [
        [
            "3\n3\n.X.\nXXX\n.X.\n6\nXX.XXX\nXXXXXX\nXXX.XX\nXXXXXX\nXX.X.X\nXXXXXX\n5\nXXX.X\n.X..X\nXXX.X\n..X..\n..X..",
            ".X.\nXOX\n.X.\nXX.XXO\nXOXXOX\nOXX.XX\nXOOXXO\nXX.X.X\nOXXOXX\nXOX.X\n.X..X\nXXO.O\n..X..\n..X.."
        ]
    ],
    "hint": "In the first test case, there are initially three 'X' consecutive in the second row and the second column. By changing the middle token to 'O' we make the grid a draw, and we only changed $ 1\\le \\lfloor 5/3\\rfloor $ token.\n\nIn the second test case, we change only $ 9\\le \\lfloor 32/3\\rfloor $ tokens, and there does not exist any three 'X' or 'O' consecutive in a row or column, so it is a draw.\n\nIn the third test case, we change only $ 3\\le \\lfloor 12/3\\rfloor $ tokens, and the resulting grid is a draw.",
    "translation": "此题的简单版本与困难版本的不同只有困难版本的初始棋盘中含有 o 棋子，而简单版本没有。\n\n这里有一个 $n$ 行 $n$ 列的井字棋棋盘，棋盘中的每一个格子要么是空的，要么包含一个棋子。 这里有两种棋子分别为 x 和 o 。如果有三个同种类的棋子连续横着或竖着排列，则称这是获胜局。（注意：斜着不算）\n如果棋盘中没有这样的连续三个同种类的排列，则称这是一个平局。\n\n在一次操作中，你可以将一个 x 棋子变为 o 棋子。令 $k$ 为初始棋盘中棋子的总数，你可以做最多 $\\left\\lfloor\\dfrac{k}{3}\\right\\rfloor$ 次上述操作使得最后的局面为平局。注意：你不需要最小化操作次数。"
}