{
    "description": "Gildong is playing with his dog, Badugi. They're at a park that has $ n $ intersections and $ n-1 $ bidirectional roads, each $ 1 $ meter in length and connecting two intersections with each other. The intersections are numbered from $ 1 $ to $ n $ , and for every $ a $ and $ b $ ( $ 1 \\le a, b \\le n $ ), it is possible to get to the $ b $ -th intersection from the $ a $ -th intersection using some set of roads.\n\nGildong has put one snack at every intersection of the park. Now Gildong will give Badugi a mission to eat all of the snacks. Badugi starts at the $ 1 $ -st intersection, and he will move by the following rules:\n\n- Badugi looks for snacks that are as close to him as possible. Here, the distance is the length of the shortest path from Badugi's current location to the intersection with the snack. However, Badugi's sense of smell is limited to $ k $ meters, so he can only find snacks that are less than or equal to $ k $ meters away from himself. If he cannot find any such snack, he fails the mission.\n- Among all the snacks that Badugi can smell from his current location, he chooses a snack that minimizes the distance he needs to travel from his current intersection. If there are multiple such snacks, Badugi will choose one arbitrarily.\n- He repeats this process until he eats all $ n $ snacks. After that, he has to find the $ 1 $ -st intersection again which also must be less than or equal to $ k $ meters away from the last snack he just ate. If he manages to find it, he completes the mission. Otherwise, he fails the mission.\n\nUnfortunately, Gildong doesn't know the value of $ k $ . So, he wants you to find the minimum value of $ k $ that makes it possible for Badugi to complete his mission, if Badugi moves optimally.",
    "inputFormat": "Each test contains one or more test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ).\n\nThe first line of each test case contains one integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — the number of intersections of the park.\n\nThe next $ n-1 $ lines contain two integers $ u $ and $ v $ ( $ 1 \\le u,v \\le n $ , $ u \\ne v $ ) each, which means there is a road between intersection $ u $ and $ v $ . All roads are bidirectional and distinct.\n\nIt is guaranteed that:\n\n- For each test case, for every $ a $ and $ b $ ( $ 1 \\le a, b \\le n $ ), it is possible to get to the $ b $ -th intersection from the $ a $ -th intersection.\n- The sum of $ n $ in all test cases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print one integer — the minimum possible value of $ k $ such that Badugi can complete the mission.",
    "samples": [
        [
            "3\n3\n1 2\n1 3\n4\n1 2\n2 3\n3 4\n8\n1 2\n2 3\n3 4\n1 5\n5 6\n6 7\n5 8",
            "2\n3\n3"
        ]
    ],
    "hint": "In the first case, Badugi can complete his mission with $ k=2 $ by moving as follows:\n\n1. Initially, Badugi is at the $ 1 $ -st intersection. The closest snack is obviously at the $ 1 $ -st intersection, so he just eats it.\n2. Next, he looks for the closest snack, which can be either the one at the $ 2 $ -nd or the one at the $ 3 $ -rd intersection. Assume that he chooses the $ 2 $ -nd intersection. He moves to the $ 2 $ -nd intersection, which is $ 1 $ meter away, and eats the snack.\n3. Now the only remaining snack is on the $ 3 $ -rd intersection, and he needs to move along $ 2 $ paths to get to it.\n4. After eating the snack at the $ 3 $ -rd intersection, he needs to find the $ 1 $ -st intersection again, which is only $ 1 $ meter away. As he gets back to it, he completes the mission.\n\nIn the second case, the only possible sequence of moves he can make is $ 1 $ – $ 2 $ – $ 3 $ – $ 4 $ – $ 1 $ . Since the distance between the $ 4 $ -th intersection and the $ 1 $ -st intersection is $ 3 $ , $ k $ needs to be at least $ 3 $ for Badugi to complete his mission.\n\nIn the third case, Badugi can make his moves as follows: $ 1 $ – $ 5 $ – $ 6 $ – $ 7 $ – $ 8 $ – $ 2 $ – $ 3 $ – $ 4 $ – $ 1 $ . It can be shown that this is the only possible sequence of moves for Badugi to complete his mission with $ k=3 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1453E/41c4ff4d910e8ed4dbc3cb32cd3891fb337b98b3.png)",
    "translation": "一只狗在一个树形结构的公园（ $n$ 个路口 $n-1$ 条无向边）内觅食，要求每个节点都经过一次，最后回到节点 $1$ ，他遵守以下移动规则：\n\n- 每次前往距离自己最近的还未经过的节点，但是距离不能超过 $k$ ，也就是说，如果没有距离为 $k$ 以内的未经过的节点，则失败。\n\n- 如果有多个相同距离的最近未经过节点，则任意选择前往。\n\n- 在走完最后一个节点后回到起点 $1$ ，要求回到起点 $1$ 的距离也不超过 $k$ ，否则也失败。\n\n现在要求求出能保证完成任务的最小 $k$ 是多少。\n\n$n\\leq 2\\times 10^5$"
}