{
    "description": "Gildong has an interesting machine that has an array $ a $ with $ n $ integers. The machine supports two kinds of operations:\n\n1. Increase all elements of a suffix of the array by $ 1 $ .\n2. Decrease all elements of a suffix of the array by $ 1 $ .\n\nA suffix is a subsegment (contiguous elements) of the array that contains $ a_n $ . In other words, for all $ i $ where $ a_i $ is included in the subsegment, all $ a_j $ 's where $ i \\lt j \\le n $ must also be included in the subsegment.\n\nGildong wants to make all elements of $ a $ equal — he will always do so using the minimum number of operations necessary. To make his life even easier, before Gildong starts using the machine, you have the option of changing one of the integers in the array to any other integer. You are allowed to leave the array unchanged. You want to minimize the number of operations Gildong performs. With your help, what is the minimum number of operations Gildong will perform?\n\nNote that even if you change one of the integers in the array, you should not count that as one of the operations because Gildong did not perform it.",
    "inputFormat": "Each test contains one or more test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ).\n\nEach test case contains two lines. The first line of each test case consists of an integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — the number of elements of the array $ a $ .\n\nThe second line of each test case contains $ n $ integers. The $ i $ -th integer is $ a_i $ ( $ -5 \\cdot 10^8 \\le a_i \\le 5 \\cdot 10^8 $ ).\n\nIt is guaranteed that the sum of $ n $ in all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print one integer — the minimum number of operations Gildong has to perform in order to make all elements of the array equal.",
    "samples": [
        [
            "7\n2\n1 1\n3\n-1 0 2\n4\n99 96 97 95\n4\n-3 -5 -2 1\n6\n1 4 3 2 4 1\n5\n5 0 0 0 5\n9\n-367741579 319422997 -415264583 -125558838 -300860379 420848004 294512916 -383235489 425814447",
            "0\n1\n3\n4\n6\n5\n2847372102"
        ]
    ],
    "hint": "In the first case, all elements of the array are already equal. Therefore, we do not change any integer and Gildong will perform zero operations.\n\nIn the second case, we can set $ a_3 $ to be $ 0 $ , so that the array becomes $ [-1,0,0] $ . Now Gildong can use the $ 2 $ -nd operation once on the suffix starting at $ a_2 $ , which means $ a_2 $ and $ a_3 $ are decreased by $ 1 $ , making all elements of the array $ -1 $ .\n\nIn the third case, we can set $ a_1 $ to $ 96 $ , so that the array becomes $ [96,96,97,95] $ . Now Gildong needs to:\n\n- Use the $ 2 $ -nd operation on the suffix starting at $ a_3 $ once, making the array $ [96,96,96,94] $ .\n- Use the $ 1 $ -st operation on the suffix starting at $ a_4 $ $ 2 $ times, making the array $ [96,96,96,96] $ .\n\nIn the fourth case, we can change the array into $ [-3,-3,-2,1] $ . Now Gildong needs to:\n\n- Use the $ 2 $ -nd operation on the suffix starting at $ a_4 $ $ 3 $ times, making the array $ [-3,-3,-2,-2] $ .\n- Use the $ 2 $ -nd operation on the suffix starting at $ a_3 $ once, making the array $ [-3,-3,-3,-3] $ .",
    "translation": "给你一个整数序列，其中有$n$个元素。你需要对这个序列进行操作。\n\n1 在所有操作开始前，你可以选择一个数，并修改他的值，这个值你可以自己定。本操作无花费。\n\n2 选择一个下表$i$，将所有下表不大于$i$的元素加上一个整数$x$,$x$可以你自己定。这次操作花费为$x$的绝对值。\n\n本题给你一个序列，要你求要将这个序列中的元素统一，至少花费多少。\n\n输入格式：\n\n第一行一个整数，测试数据数量。\n\n对于每个测试数据，第一行一个整数$n$，元素的个数。接下来一行$n$个整数，为元素的值。\n\n输出格式：\n\n对于每组数据，输出最小花费，占一行。\n\n注意，元素值可能为负数或$0$。"
}