{
    "description": "You are given two strings $ s $ and $ t $ consisting of lowercase Latin letters. The length of $ t $ is $ 2 $ (i.e. this string consists only of two characters).\n\nIn one move, you can choose any character of $ s $ and replace it with any lowercase Latin letter. More formally, you choose some $ i $ and replace $ s_i $ (the character at the position $ i $ ) with some character from 'a' to 'z'.\n\nYou want to do no more than $ k $ replacements in such a way that maximizes the number of occurrences of $ t $ in $ s $ as a subsequence.\n\nRecall that a subsequence is a sequence that can be derived from the given sequence by deleting zero or more elements without changing the order of the remaining elements.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 2 \\le n \\le 200 $ ; $ 0 \\le k \\le n $ ) — the length of $ s $ and the maximum number of moves you can make. The second line of the input contains the string $ s $ consisting of $ n $ lowercase Latin letters. The third line of the input contains the string $ t $ consisting of two lowercase Latin letters.",
    "outputFormat": "Print one integer — the maximum possible number of occurrences of $ t $ in $ s $ as a subsequence if you replace no more than $ k $ characters in $ s $ optimally.",
    "samples": [
        [
            "4 2\nbbaa\nab",
            "3"
        ],
        [
            "7 3\nasddsaf\nsd",
            "10"
        ],
        [
            "15 6\nqwertyhgfdsazxc\nqa",
            "16"
        ],
        [
            "7 2\nabacaba\naa",
            "15"
        ]
    ],
    "hint": "In the first example, you can obtain the string \"abab\" replacing $ s_1 $ with 'a' and $ s_4 $ with 'b'. Then the answer is $ 3 $ .\n\nIn the second example, you can obtain the string \"ssddsdd\" and get the answer $ 10 $ .\n\nIn the fourth example, you can obtain the string \"aaacaaa\" and get the answer $ 15 $ .",
    "translation": "## 题目描述\n\n你将会得到两个字符串$s$ 和 $t$，并保证其中的字符都是小写拉丁字母。$t$ 的长度是 $2$。\n\n一个操作代表你可以用一个任意的字符代替 $s$ 中任意一个字符（都是小写字母）。\n\n你最多可以进行 $k$ 次操作，也可以不进行。\n\n求进行替换之后最多可以在 $s$ 中出现多少个 $t$ 作为他的子序列。这里的子序列是指去掉原来字符串里的一些字符，不改变相对位置得到的串。\n\n## 输入格式\n\n第一行包括两个数 $n$，$k$ ($2\\le n,k\\le 200$)。\n\n接下来的两行分别是 $s$，$t$。\n\n## 输出格式\n\n输出一行一个数，表示最多用 $k$ 次操作之后，出现子序列是 $t$ 的最多的次数。"
}