{
    "description": "So nearly half of the winter is over and Maria is dreaming about summer. She's fed up with skates and sleds, she was dreaming about Hopscotch all night long. It's a very popular children's game. The game field, the court, looks as is shown in the figure (all blocks are square and are numbered from bottom to top, blocks in the same row are numbered from left to right). Let us describe the hopscotch with numbers that denote the number of squares in the row, staring from the lowest one: 1-1-2-1-2-1-2-(1-2)..., where then the period is repeated (1-2).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF141B/3cab0cfd180f2a7ceceec93813314c6b7ddd8ea0.png)The coordinate system is defined as shown in the figure. Side of all the squares are equal and have length $ a $ .\n\nMaria is a very smart and clever girl, and she is concerned with quite serious issues: if she throws a stone into a point with coordinates $ (x,y) $ , then will she hit some square? If the answer is positive, you are also required to determine the number of the square.\n\nIt is believed that the stone has fallen into the square if it is located strictly inside it. In other words a stone that has fallen on the square border is not considered a to hit a square.",
    "inputFormat": "The only input line contains three integers: $ a $ , $ x $ , $ y $ , where $ a $ ( $ 1<=a<=100 $ ) is the side of the square, $ x $ and $ y $ ( $ -10^{6}<=x<=10^{6},0<=y<=10^{6} $ ) are coordinates of the stone.",
    "outputFormat": "Print the number of the square, inside which the stone fell. If the stone is on a border of some stone or outside the court, print \"-1\" without the quotes.",
    "samples": [
        [
            "1 0 0\n",
            "-1\n"
        ],
        [
            "3 1 1\n",
            "1\n"
        ],
        [
            "3 0 10\n",
            "5\n"
        ],
        [
            "3 0 7\n",
            "-1\n"
        ],
        [
            "3 4 0\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "有 $n$ 个形状和大小都一致的正方体积木，积木堆积的样式是第一层只有一个正方体，然后上面就开始循环了，循环体为：第一层是一个正方体，第二层是两个正方体。如下图所示：\r\n![](https://cdn.luogu.org/upload/vjudge_pic/CF141B/3cab0cfd180f2a7ceceec93813314c6b7ddd8ea0.png)\r\n现在给你三个数 $a,x,y$ 表示正方体的边长，然后让你输出坐标 $(x,y)$ 对应的数。如果在积木的边界上或者是不在正方体上输出$-1$。"
}