{
    "description": "Recently a new building with a new layout was constructed in Monocarp's hometown. According to this new layout, the building consists of three types of apartments: three-room, five-room, and seven-room apartments. It's also known that each room of each apartment has exactly one window. In other words, a three-room apartment has three windows, a five-room — five windows, and a seven-room — seven windows.\n\nMonocarp went around the building and counted $ n $ windows. Now he is wondering, how many apartments of each type the building may have.\n\nUnfortunately, Monocarp only recently has learned to count, so he is asking you to help him to calculate the possible quantities of three-room, five-room, and seven-room apartments in the building that has $ n $ windows. If there are multiple answers, you can print any of them.\n\nHere are some examples:\n\n- if Monocarp has counted $ 30 $ windows, there could have been $ 2 $ three-room apartments, $ 2 $ five-room apartments and $ 2 $ seven-room apartments, since $ 2 \\cdot 3 + 2 \\cdot 5 + 2 \\cdot 7 = 30 $ ;\n- if Monocarp has counted $ 67 $ windows, there could have been $ 7 $ three-room apartments, $ 5 $ five-room apartments and $ 3 $ seven-room apartments, since $ 7 \\cdot 3 + 5 \\cdot 5 + 3 \\cdot 7 = 67 $ ;\n- if Monocarp has counted $ 4 $ windows, he should have mistaken since no building with the aforementioned layout can have $ 4 $ windows.",
    "inputFormat": "Th first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nThe only line of each test case contains one integer $ n $ ( $ 1 \\le n \\le 1000 $ ) — the number of windows in the building.",
    "outputFormat": "For each test case, if a building with the new layout and the given number of windows just can't exist, print $ -1 $ .\n\nOtherwise, print three non-negative integers — the possible number of three-room, five-room, and seven-room apartments. If there are multiple answers, print any of them.",
    "samples": [
        [
            "4\n30\n67\n4\n14",
            "2 2 2\n7 5 3\n-1\n0 0 2"
        ]
    ],
    "hint": "",
    "translation": "$T$ 次询问，对于每一次询问：\n\n给定 $n$ ，求 $3x+5y+7z=n$ 的一个非负整数解。"
}