{
    "description": "Alice and Bob received $ n $ candies from their parents. Each candy weighs either 1 gram or 2 grams. Now they want to divide all candies among themselves fairly so that the total weight of Alice's candies is equal to the total weight of Bob's candies.\n\nCheck if they can do that.\n\nNote that candies are not allowed to be cut in half.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the number of candies that Alice and Bob received.\n\nThe next line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ — the weights of the candies. The weight of each candy is either $ 1 $ or $ 2 $ .\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, output on a separate line:\n\n- \"YES\", if all candies can be divided into two sets with the same weight;\n- \"NO\" otherwise.\n\nYou can output \"YES\" and \"NO\" in any case (for example, the strings yEs, yes, Yes and YES will be recognized as positive).",
    "samples": [
        [
            "5\n2\n1 1\n2\n1 2\n4\n1 2 1 2\n3\n2 2 2\n3\n2 1 2",
            "YES\nNO\nYES\nNO\nNO"
        ]
    ],
    "hint": "In the first test case, Alice and Bob can each take one candy, then both will have a total weight of $ 1 $ .\n\nIn the second test case, any division will be unfair.\n\nIn the third test case, both Alice and Bob can take two candies, one of weight $ 1 $ and one of weight $ 2 $ .\n\nIn the fourth test case, it is impossible to divide three identical candies between two people.\n\nIn the fifth test case, any division will also be unfair.",
    "translation": "### 题目描述\nAlice 和 Bob 从他们的父母那里收到 $n$ 颗糖果。每一颗糖果重达 $1$ 或 $2$ 克。现在，他们想要公平地将糖果分为两组，使得两组糖果的重量只和相等。\n\n请你判断是否可以实现。注意，糖果都不能被切成两半。\n\n### 输入格式\n输入第一行一个整数 $t$（$1\\le t\\le 10^4$），表示测试数据的组数。\n\n接下来，每组数据第一行一个整数 $n$（$1\\le n\\le 100$），表示两人收到的糖果数量。\n\n接下来一行 $n$ 个整数 $a_1,a_2,\\dots,a_n$，表示每颗糖果的重量。糖果的重量为 $1$ 或 $2$。\n\n### 输出格式\n输出共 $t$ 行。对于每组测试数据，输出一行一个字符串、如果可以分成重量相等的两组，则输出 `YES`，否则输出 `NO`。\n\ntranslate by @[1289H2051N343O375S8](https://www.luogu.com.cn/user/45475)。"
}