{
    "description": "Alice and Bob have decided to play the game \"Rock, Paper, Scissors\".\n\nThe game consists of several rounds, each round is independent of each other. In each round, both players show one of the following things at the same time: rock, paper or scissors. If both players showed the same things then the round outcome is a draw. Otherwise, the following rules applied:\n\n- if one player showed rock and the other one showed scissors, then the player who showed rock is considered the winner and the other one is considered the loser;\n- if one player showed scissors and the other one showed paper, then the player who showed scissors is considered the winner and the other one is considered the loser;\n- if one player showed paper and the other one showed rock, then the player who showed paper is considered the winner and the other one is considered the loser.\n\nAlice and Bob decided to play exactly $ n $ rounds of the game described above. Alice decided to show rock $ a_1 $ times, show scissors $ a_2 $ times and show paper $ a_3 $ times. Bob decided to show rock $ b_1 $ times, show scissors $ b_2 $ times and show paper $ b_3 $ times. Though, both Alice and Bob did not choose the sequence in which they show things. It is guaranteed that $ a_1 + a_2 + a_3 = n $ and $ b_1 + b_2 + b_3 = n $ .\n\nYour task is to find two numbers:\n\n1. the minimum number of round Alice can win;\n2. the maximum number of rounds Alice can win.",
    "inputFormat": "The first line of the input contains one integer $ n $ ( $ 1 \\le n \\le 10^{9} $ ) — the number of rounds.\n\nThe second line of the input contains three integers $ a_1, a_2, a_3 $ ( $ 0 \\le a_i \\le n $ ) — the number of times Alice will show rock, scissors and paper, respectively. It is guaranteed that $ a_1 + a_2 + a_3 = n $ .\n\nThe third line of the input contains three integers $ b_1, b_2, b_3 $ ( $ 0 \\le b_j \\le n $ ) — the number of times Bob will show rock, scissors and paper, respectively. It is guaranteed that $ b_1 + b_2 + b_3 = n $ .",
    "outputFormat": "Print two integers: the minimum and the maximum number of rounds Alice can win.",
    "samples": [
        [
            "2\n0 1 1\n1 1 0",
            "0 1"
        ],
        [
            "15\n5 5 5\n5 5 5",
            "0 15"
        ],
        [
            "3\n0 0 3\n3 0 0",
            "3 3"
        ],
        [
            "686\n479 178 29\n11 145 530",
            "22 334"
        ],
        [
            "319\n10 53 256\n182 103 34",
            "119 226"
        ]
    ],
    "hint": "In the first example, Alice will not win any rounds if she shows scissors and then paper and Bob shows rock and then scissors. In the best outcome, Alice will win one round if she shows paper and then scissors, and Bob shows rock and then scissors.\n\nIn the second example, Alice will not win any rounds if Bob shows the same things as Alice each round.\n\nIn the third example, Alice always shows paper and Bob always shows rock so Alice will win all three rounds anyway.",
    "translation": "Alice和Bob进行剪刀石头布的游戏，总共进行$n$局。\n\nAlice出石头$a_1$次，出剪刀$a_2$次，出布$a_3$次。\n\nBob出石头$b_1$次，出剪刀$b_2$次，出布$b_3$次。\n\n问Alice最少赢多少次，最多赢多少次。\n\n## 输入格式：\n\n第一行输入$n$\n\n第二行输入$a_1$，$a_2$，$a_3$\n\n第二行输入$b_1$，$b_2$，$b_3$"
}