{
    "description": "Gildong has a square board consisting of $ n $ rows and $ n $ columns of square cells, each consisting of a single digit (from $ 0 $ to $ 9 $ ). The cell at the $ j $ -th column of the $ i $ -th row can be represented as $ (i, j) $ , and the length of the side of each cell is $ 1 $ . Gildong likes big things, so for each digit $ d $ , he wants to find a triangle such that:\n\n- Each vertex of the triangle is in the center of a cell.\n- The digit of every vertex of the triangle is $ d $ .\n- At least one side of the triangle is parallel to one of the sides of the board. You may assume that a side of length $ 0 $ is parallel to both sides of the board.\n- The area of the triangle is maximized.\n\nOf course, he can't just be happy with finding these triangles as is. Therefore, for each digit $ d $ , he's going to change the digit of exactly one cell of the board to $ d $ , then find such a triangle. He changes it back to its original digit after he is done with each digit. Find the maximum area of the triangle he can make for each digit.\n\nNote that he can put multiple vertices of the triangle on the same cell, and the triangle can be a [degenerate triangle](https://cutt.ly/NhbjZ2l); i.e. the area of the triangle can be $ 0 $ . Also, note that he is allowed to change the digit of a cell from $ d $ to $ d $ .",
    "inputFormat": "Each test contains one or more test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ).\n\nThe first line of each test case contains one integer $ n $ ( $ 1 \\le n \\le 2000 $ ) — the number of rows and columns of the board.\n\nThe next $ n $ lines of each test case each contain a string of $ n $ digits without spaces. The $ j $ -th digit of the $ i $ -th line is the digit of the cell at $ (i, j) $ . Each digit is one of the characters from $ 0 $ to $ 9 $ .\n\nIt is guaranteed that the sum of $ n^2 $ in all test cases doesn't exceed $ 4 \\cdot 10^6 $ .",
    "outputFormat": "For each test case, print one line with $ 10 $ integers. The $ i $ -th integer is the maximum area of triangle Gildong can make when $ d = i-1 $ , multiplied by $ 2 $ .",
    "samples": [
        [
            "5\n3\n000\n122\n001\n2\n57\n75\n4\n0123\n4012\n3401\n2340\n1\n9\n8\n42987101\n98289412\n38949562\n87599023\n92834718\n83917348\n19823743\n38947912",
            "4 4 1 0 0 0 0 0 0 0\n0 0 0 0 0 1 0 1 0 0\n9 6 9 9 6 0 0 0 0 0\n0 0 0 0 0 0 0 0 0 0\n18 49 49 49 49 15 0 30 42 42"
        ]
    ],
    "hint": "In the first case, for $ d=0 $ , no matter which cell he chooses to use, the triangle with vertices at $ (1, 1) $ , $ (1, 3) $ , and $ (3, 1) $ is the biggest triangle with area of $ \\cfrac{2 \\cdot 2}{2} = 2 $ . Since we should print it multiplied by $ 2 $ , the answer for $ d=0 $ is $ 4 $ .\n\nFor $ d=1 $ , Gildong can change the digit of the cell at $ (1, 3) $ into $ 1 $ , making a triangle with vertices on all three $ 1 $ 's that has an area of $ 2 $ .\n\nFor $ d=2 $ , Gildong can change the digit of one of the following six cells into $ 2 $ to make a triangle with an area of $ \\cfrac{1}{2} $ : $ (1, 1) $ , $ (1, 2) $ , $ (1, 3) $ , $ (3, 1) $ , $ (3, 2) $ , and $ (3, 3) $ .\n\nFor the remaining digits (from $ 3 $ to $ 9 $ ), the cell Gildong chooses to change will be the only cell that contains that digit. Therefore the triangle will always be a degenerate triangle with an area of $ 0 $ .\n\nIn the third case, for $ d=4 $ , note that the triangle will be bigger than the answer if Gildong changes the digit of the cell at $ (1, 4) $ and use it along with the cells at $ (2, 1) $ and $ (4, 3) $ , but this is invalid because it violates the condition that at least one side of the triangle must be parallel to one of the sides of the board.",
    "translation": "有一个 $n \\times n$ 的矩阵，矩阵中的数字都为 $[0,9]$。\n\n对于一个数字 $d$，我们可以先将矩阵中任意一个数改变为 $d$，然后需要找到一个三角形满足。\n\n- 三角形至少有一条边与矩阵的边平行。\n\n- 三角形三个顶点都必须位于数字为 $d$ 的位置上。\n\n每次寻找完三角形后需要将修改的位置复原，现在对于每个 $d \\in [0,9]$，你需要依次找到面积最大的满足条件的三角形，对于每个 $d$，输出所找到的三角形的面积的两倍。\n\n三角形的三个顶点允许位于同一位置中，此时面积为 $0$。"
}