{
    "description": "A big football championship will occur soon! $ n $ teams will compete in it, and each pair of teams will play exactly one game against each other.\n\nThere are two possible outcomes of a game:\n\n- the game may result in a tie, then both teams get $ 1 $ point;\n- one team might win in a game, then the winning team gets $ 3 $ points and the losing team gets $ 0 $ points.\n\nThe score of a team is the number of points it gained during all games that it played.\n\nYou are interested in a hypothetical situation when all teams get the same score at the end of the championship. A simple example of that situation is when all games result in ties, but you want to minimize the number of ties as well.\n\nYour task is to describe a situation (choose the result of each game) so that all teams get the same score, and the number of ties is the minimum possible.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases.\n\nThen the test cases follow. Each test case is described by one line containing one integer $ n $ ( $ 2 \\le n \\le 100 $ ) — the number of teams.",
    "outputFormat": "For each test case, print $ \\frac{n(n - 1)}{2} $ integers describing the results of the games in the following order: the first integer should correspond to the match between team $ 1 $ and team $ 2 $ , the second — between team $ 1 $ and team $ 3 $ , then $ 1 $ and $ 4 $ , ..., $ 1 $ and $ n $ , $ 2 $ and $ 3 $ , $ 2 $ and $ 4 $ , ..., $ 2 $ and $ n $ , and so on, until the game between the team $ n - 1 $ and the team $ n $ .\n\nThe integer corresponding to the game between the team $ x $ and the team $ y $ should be $ 1 $ if $ x $ wins, $ -1 $ if $ y $ wins, or $ 0 $ if the game results in a tie.\n\nAll teams should get the same score, and the number of ties should be the minimum possible. If there are multiple optimal answers, print any of them. It can be shown that there always exists a way to make all teams have the same score.",
    "samples": [
        [
            "2\n2\n3",
            "0 \n1 -1 1"
        ]
    ],
    "hint": "In the first test case of the example, both teams get $ 1 $ point since the game between them is a tie.\n\nIn the second test case of the example, team $ 1 $ defeats team $ 2 $ (team $ 1 $ gets $ 3 $ points), team $ 1 $ loses to team $ 3 $ (team $ 3 $ gets $ 3 $ points), and team $ 2 $ wins against team $ 3 $ (team $ 2 $ gets $ 3 $ points).",
    "translation": "某个足球比赛即将开始，这场比赛会有 $n$ 个球队参与（编号 $1$ 到 $n$），每个球队都会与其他的所有球队对决正好一场。对于每局比赛，如果分出胜负则胜者得 $3$ 分，负者得 $0$ 分，如果没有分出胜负就双方各得 $1$ 分。最终，一个球队的积分就是这个球队所参与的所有球局中所得的分数之和。\n\n你要构造一种局面，使得所有球队的积分完全相同，同时平局数最小。\n\n$T$ 组数据。对于本题每组数据你要输出一行共 $\\dfrac{n\\times(n-1)}{2}$ 个整数，表示第 $1$ 支球队与第 $2$ 支球队，第 $1$ 支与第 $3$ 支，...,第 $1$ 支与第 $n$ 支，第 $2$ 支与第 $3$ 支，...，的对决结果，$1$ 表示前者获胜，$0$ 表示平局， $-1$ 表示后者获胜。\n\n$1\\leq T,n\\leq100;$"
}