{
    "description": "A lighthouse keeper Peter commands an army of $ n $ battle lemmings. He ordered his army to stand in a line and numbered the lemmings from $ 1 $ to $ n $ from left to right. Some of the lemmings hold shields. Each lemming cannot hold more than one shield.\n\nThe more protected Peter's army is, the better. To calculate the protection of the army, he finds the number of protected pairs of lemmings, that is such pairs that both lemmings in the pair don't hold a shield, but there is a lemming with a shield between them.\n\nNow it's time to prepare for defence and increase the protection of the army. To do this, Peter can give orders. He chooses a lemming with a shield and gives him one of the two orders:\n\n- give the shield to the left neighbor if it exists and doesn't have a shield;\n- give the shield to the right neighbor if it exists and doesn't have a shield.\n\nIn one second Peter can give exactly one order.\n\nIt's not clear how much time Peter has before the defence. So he decided to determine the maximal value of army protection for each $ k $ from $ 0 $ to $ \\frac{n(n-1)}2 $ , if he gives no more that $ k $ orders. Help Peter to calculate it!",
    "inputFormat": "First line contains a single integer $ n $ ( $ 1 \\le n \\le 80 $ ), the number of lemmings in Peter's army.\n\nSecond line contains $ n $ integers $ a_i $ ( $ 0 \\le a_i \\le 1 $ ). If $ a_i = 1 $ , then the $ i $ -th lemming has a shield, otherwise $ a_i = 0 $ .",
    "outputFormat": "Print $ \\frac{n(n-1)}2 + 1 $ numbers, the greatest possible protection after no more than $ 0, 1, \\dots, \\frac{n(n-1)}2 $ orders.",
    "samples": [
        [
            "5\n1 0 0 0 1",
            "0 2 3 3 3 3 3 3 3 3 3"
        ],
        [
            "12\n0 0 0 0 1 1 1 1 0 1 1 0",
            "9 12 13 14 14 14 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15 15"
        ]
    ],
    "hint": "Consider the first example.\n\nThe protection is initially equal to zero, because for each pair of lemmings without shields there is no lemmings with shield.\n\nIn one second Peter can order the first lemming give his shield to the right neighbor. In this case, the protection is two, as there are two protected pairs of lemmings, $ (1, 3) $ and $ (1, 4) $ .\n\nIn two seconds Peter can act in the following way. First, he orders the fifth lemming to give a shield to the left neighbor. Then, he orders the first lemming to give a shield to the right neighbor. In this case Peter has three protected pairs of lemmings — $ (1, 3) $ , $ (1, 5) $ and $ (3, 5) $ .\n\nYou can make sure that it's impossible to give orders in such a way that the protection becomes greater than three.",
    "translation": "## 题目描述\n\n有 $n$ 个守卫排成一行，编号为 $1$ 到 $n$。这些守卫里有的拿着盾牌，有的没有。**一个守卫只能同时拿一个盾牌**。\n\n称一对守卫是被保护的，当且仅当这两个守卫都没拿盾牌，但他们之间有守卫拿了盾牌。\n\n每一秒，指挥官可以下达两种命令中的一种，分别是：\n\n- 选一个带盾牌的守卫，把它的盾牌给他左边的守卫\n- 选一个带盾牌的守卫，把它的盾牌给他右边的守卫\n\n请求出时刻 $0$ 到 $\\frac{n \\times (n - 1)}{2}$ 中每个时刻最多有多少对守卫是被保护的。\n\n"
}