{
    "description": "Vasya goes to visit his classmate Petya. Vasya knows that Petya's apartment number is $ n $ .\n\nThere is only one entrance in Petya's house and the distribution of apartments is the following: the first floor contains $ 2 $ apartments, every other floor contains $ x $ apartments each. Apartments are numbered starting from one, from the first floor. I.e. apartments on the first floor have numbers $ 1 $ and $ 2 $ , apartments on the second floor have numbers from $ 3 $ to $ (x + 2) $ , apartments on the third floor have numbers from $ (x + 3) $ to $ (2 \\cdot x + 2) $ , and so on.\n\nYour task is to find the number of floor on which Petya lives. Assume that the house is always high enough to fit at least $ n $ apartments.\n\nYou have to answer $ t $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe only line of the test case contains two integers $ n $ and $ x $ ( $ 1 \\le n, x \\le 1000 $ ) — the number of Petya's apartment and the number of apartments on each floor of the house except the first one (there are two apartments on the first floor).",
    "outputFormat": "For each test case, print the answer: the number of floor on which Petya lives.",
    "samples": [
        [
            "4\n7 3\n1 5\n22 5\n987 13",
            "3\n1\n5\n77"
        ]
    ],
    "hint": "Consider the first test case of the example: the first floor contains apartments with numbers $ 1 $ and $ 2 $ , the second one contains apartments with numbers $ 3 $ , $ 4 $ and $ 5 $ , the third one contains apartments with numbers $ 6 $ , $ 7 $ and $ 8 $ . Therefore, Petya lives on the third floor.\n\nIn the second test case of the example, Petya lives in the apartment $ 1 $ which is on the first floor.",
    "translation": "- 除第一层有 $1,2$ 两个房间外，其余层皆有 $x$ 个房间。这些房间的门牌号从第一层起逐层递增。\n- 给出 $n$ 和 $x$，求出门牌号为 $n$ 的房间在第几层。\n- 数据组数 $t\\le1000$，$1\\le n,x\\le1000$。"
}