{
    "description": "Lately, Mr. Chanek frequently plays the game Arena of Greed. As the name implies, the game's goal is to find the greediest of them all, who will then be crowned king of Compfestnesia.\n\nThe game is played by two people taking turns, where Mr. Chanek takes the first turn. Initially, there is a treasure chest containing $ N $ gold coins. The game ends if there are no more gold coins in the chest. In each turn, the players can make one of the following moves:\n\n- Take one gold coin from the chest.\n- Take half of the gold coins on the chest. This move is only available if the number of coins in the chest is even.\n\nBoth players will try to maximize the number of coins they have. Mr. Chanek asks your help to find the maximum number of coins he can get at the end of the game if both he and the opponent plays optimally.",
    "inputFormat": "The first line contains a single integer $ T $ $ (1 \\le T \\le 10^5) $ denotes the number of test cases.\n\nThe next $ T $ lines each contain a single integer $ N $ $ (1 \\le N \\le 10^{18}) $ .",
    "outputFormat": "$ T $ lines, each line is the answer requested by Mr. Chanek.",
    "samples": [
        [
            "2\n5\n6",
            "2\n4"
        ]
    ],
    "hint": "For the first case, the game is as follows:\n\n1. Mr. Chanek takes one coin.\n2. The opponent takes two coins.\n3. Mr. Chanek takes one coin.\n4. The opponent takes one coin.\n\nFor the second case, the game is as follows:\n\n1. Mr. Chanek takes three coins.\n2. The opponent takes one coin.\n3. Mr. Chanek takes one coin.\n4. The opponent takes one coin.",
    "translation": "最初，有一个宝箱，里面装着 $N$ 枚金币。如果箱子里没有金币，游戏就结束了。在每一回合中，玩家可以进行以下动作之一：\n\n1.从箱子里拿出一枚金币。\n\n2.把箱子上一半的金币拿走。只有当箱子里的硬币数是偶数时，这个移动才可用。\n\n两个玩家都会尽量使他们拥有的硬币数量最大化。查内克先生请你帮忙找出在游戏结束时他能得到的硬币的最大数量，如果他和对手都玩得很好。"
}