{
    "description": "The hobbits Frodo and Sam are carrying the One Ring to Mordor. In order not to be spotted by orcs, they decided to go through the mountains.\n\nThe mountain relief can be represented as a polyline with $ n $ points $ (x_i, y_i) $ , numbered from $ 1 $ to $ n $ ( $ x_i < x_{i + 1} $ for $ 1 \\le i \\le n - 1 $ ). Hobbits start their journey at the point $ (x_1, y_1) $ and should reach the point $ (x_n, y_n) $ to complete their mission.\n\nThe problem is that there is a tower with the Eye of Sauron, which watches them. The tower is located at the point $ (x_n, y_n) $ and has the height $ H $ , so the Eye is located at the point $ (x_n, y_n + H) $ . In order to complete the mission successfully, the hobbits have to wear cloaks all the time when the Sauron Eye can see them, i. e. when there is a direct line from the Eye to the hobbits which is not intersected by the relief.\n\nThe hobbits are low, so their height can be considered negligibly small, but still positive, so when a direct line from the Sauron Eye to the hobbits only touches the relief, the Eye can see them.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1468G/6125df61b8e9323ee46f8b93d743d2617a04d6a9.png)The Sauron Eye can't see hobbits when they are in the left position, but can see them when they are in the right position.The hobbits do not like to wear cloaks, so they wear them only when they can be spotted by the Eye. Your task is to calculate the total distance the hobbits have to walk while wearing cloaks.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ H $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ; $ 1 \\le H \\le 10^4 $ ) — the number of vertices in polyline and the tower height.\n\nThe next $ n $ lines contain two integers $ x_i, y_i $ each ( $ 0 \\le x_i \\le 4 \\cdot 10^5 $ ; $ 0 \\le y_i \\le 10^4 $ ) — the coordinates of the polyline vertices. It is guaranteed that $ x_i < x_{i + 1} $ for $ 1 \\le i \\le n - 1 $ .",
    "outputFormat": "Print one real number — the total distance the hobbits have to walk while wearing cloaks. Your answer will be considered correct if its absolute or relative error does not exceed $ 10^{-6} $ — formally, if your answer is $ a $ , and the jury's answer is $ b $ , your answer will be accepted if $ \\dfrac{|a - b|}{\\max(1, b)} \\le 10^{-6} $ .",
    "samples": [
        [
            "6 10\n10 40\n20 10\n25 30\n30 15\n50 15\n65 30",
            "70.4034587602"
        ],
        [
            "9 5\n0 0\n5 10\n15 10\n20 0\n25 11\n30 0\n35 10\n50 10\n60 5",
            "27.2787986124"
        ],
        [
            "2 10000\n0 10000\n400000 0",
            "400124.9804748512"
        ]
    ],
    "hint": "",
    "translation": "给出一条折线 $L$，折线由 $n$ 个点 $(x_1, y_1) \\rightarrow \\ldots \\rightarrow (x_n, y_n)$ 构成，其中 $x_i < x_{i + 1}$。\n\n在 $(x_n, y_n + H)$ 处有一个光源，向全方位发射光线。光线为直线，且遇到折线 $L$ 就会停止（即不会穿透）。\n\n求折线 $L$ 上，被光照到部分的长度。"
}