{
    "description": "The progress is not standing still in Berland. Recently all garbage containers in Bertown, the capital of Berland, were replaced by differentiated recycling bins, each accepting some category of waste. While this will definitely improve the ecological situation, for some citizens it's difficult to get used to the habit of sorting waste.\n\nMonocarp is one of those citizens who tries to get used to waste sorting. Today he has to take out the trash from his house. There are three containers near the Monocarp's house, the first one accepts paper waste, the second one accepts plastic waste, and the third one — all other types of waste. It is possible to fit $ c_1 $ items into the first container, $ c_2 $ items into the second container and $ c_3 $ items into the third container.\n\nMonocarp has a lot of items to throw into containers. Some are made of paper, so Monocarp has to put them into the first container (he has $ a_1 $ such items), some are made of plastic, so he has to put them into the second container (he has $ a_2 $ such items), and some are neither paper nor plastic — so Monocarp has to put them into the third container (he has $ a_3 $ such items).\n\nUnfortunately, there are also two categories of items that Monocarp is unsure of: he has $ a_4 $ items which are partially made of paper, so he will put each of these items either into the first container or into the third container. Similarly, he has $ a_5 $ items partially made of plastic, so he has to put each of them either into the second container or into the third container. Obviously, this choice is made separately for each item — for example, Monocarp can throw several partially-plastic items into the second container, and all other partially-plastic items — into the third one.\n\nNow Monocarp wonders: is it possible to put each item into some container so that the first container will hold no more than $ c_1 $ items, the second one — no more than $ c_2 $ items, and the third one — no more than $ c_3 $ items?",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 3 \\cdot 10^4 $ ) — the number of test cases.\n\nEach test case consists of two lines. The first line of each test case contains three integers $ c_1 $ , $ c_2 $ , $ c_3 $ ( $ 0 \\le c_1, c_2, c_3 \\le 10^8 $ ) — the capacities of the containers.\n\nThe second line of each test case contains five integers $ a_1 $ , $ a_2 $ , $ a_3 $ , $ a_4 $ , $ a_5 $ ( $ 0 \\le a_i \\le 10^8 $ ), where $ a_i $ is the number of items of the $ i $ -th category Monocarp has to throw out ( $ i = 1 $ is paper waste, $ i = 2 $ is plastic waste, $ i = 3 $ is general waste, $ i = 4 $ is partially-paper waste, $ i = 5 $ is partially-plastic waste).",
    "outputFormat": "For each test case, print either YES if it is possible to fit all items into containers, or NO otherwise. You may print each letter in any case (for example, YES, Yes, yes, yEs will all be recognized as positive answer).",
    "samples": [
        [
            "7\n1 2 3\n1 2 3 0 0\n2 2 3\n1 2 3 1 0\n2 2 3\n1 2 3 0 1\n1 2 5\n1 2 3 1 1\n0 0 0\n0 0 0 0 0\n0 0 4\n1 0 0 0 0\n13 37 42\n0 0 0 40 47",
            "YES\nYES\nNO\nYES\nYES\nNO\nYES"
        ]
    ],
    "hint": "Explanations for the example test cases:\n\n1. Monocarp can put $ 1 $ item of paper waste into the first container, $ 2 $ items of plastic waste into the second container, and $ 3 $ items of general waste into the third container;\n2. Monocarp can put $ 1 $ item of paper waste and $ 1 $ item of partially-paper waste into the first container, $ 2 $ items of plastic waste into the second container, and $ 3 $ items of general waste into the third container;\n3. there is no answer since either the second container should contain $ 3 $ items, or the third container should contain $ 4 $ items;\n4. Monocarp can put $ 1 $ item of paper waste into the first container, $ 2 $ items of plastic waste into the second container, and $ 3 $ items of general waste, $ 1 $ item of partially-paper waste and $ 1 $ item of partially-plastic waste into the third container;\n5. there is no waste at all, so all containers can be left empty;\n6. there's no answer since it's impossible to put a paper item into the third container;\n7. Monocarp can put $ 10 $ items of partially-paper waste into the first container, $ 37 $ items of partially-plastic waste into the second container, and $ 30 $ items of partially-paper waste and $ 10 $ items of partially-plastic waste into the third container.",
    "translation": "### 题目描述\n有三个桶，五种垃圾，每个桶有固定的容量。\n\n$1$垃圾放入$1$号桶中，$2$垃圾放入$2$号桶中，$3$垃圾放入$3$号桶中，$4$垃圾可以放入$1$、$3$号桶中，$5$垃圾可以放入$2$、$3$号桶中。\n\n对于给定的桶容量$c$和垃圾量$a$，请问垃圾是否可以全部放入桶中？\n\n### 输入格式\n**本题有多组数据**\n\n第一行包含一个整数$t（1\\le t\\le 3 * 10^4）$——测试用例的数量。\n\n每个测试用例由两行组成。每个测试用例的第一行包含三个整数$c_1,c_2,c_3（0\\le c_1、c_2、c_3\\le 10^8）$——容器的容量。\n\n每个测试用例的第二行包含五个整数$a_1、a_2、a_3、a_4、a_5（0\\le a_i\\le 10^8）$，其中$a_ i$是必须丢弃的第$i$类垃圾的数量。\n\n### 输出格式\n对于每个测试用例，如果可以将所有项目装入容器，则打印 $YES$，否则打印 $NO$。您可以在任何情况下打印每个字母（例如,$YES,Yes,yes,yEs$都将被视为肯定答案）。"
}