{
    "description": "It's our faculty's 34th anniversary! To celebrate this great event, the Faculty of Computer Science, University of Indonesia (Fasilkom), held CPC - Coloring Pavements Competition. The gist of CPC is two players color the predetermined routes of Fasilkom in Blue and Red. There are $ N $ Checkpoints and $ M $ undirected predetermined routes. Routes $ i $ connects checkpoint $ U_i $ and $ V_i $ , for $ (1 \\le i \\le M) $ . It is guaranteed that any pair of checkpoints are connected by using one or more routes.\n\nThe rules of CPC is as follows:\n\n- Two players play in each round. One player plays as blue, the other plays as red. For simplicity, let's call these players $ Blue $ and $ Red $ .\n- $ Blue $ will color every route in he walks on blue, $ Red $ will color the route he walks on red. Both players start at checkpoint number $ 1 $ . Initially, all routes are gray.\n- Each phase, from their current checkpoint, $ Blue $ and $ Red $ select a different gray route and moves to the checkpoint on the other end of the route simultaneously.\n- The game ends when $ Blue $ or $ Red $ can no longer move. That is, there is no two distinct gray routes they can choose to continue moving.\n\nChaneka is interested in participating. However, she does not want to waste much energy. So, She is only interested in the number of final configurations of the routes after each round. Turns out, counting this is also exhausting, so Chaneka asks you to figure this out!\n\nTwo final configurations are considered different if there is a route $ U $ in a different color in the two configurations.",
    "inputFormat": "The first line contains two integers $ N $ and $ M $ . $ N $ $ (2 \\le N \\le 2 \\cdot 10^3) $ denotes the number of checkpoints, $ M $ $ (1 \\le M \\le 2 \\cdot N) $ denotes the number of routes. It is guaranteed that every checkpoint except checkpoint $ 1 $ has exactly two routes connecting it.\n\nThe next $ M $ lines each contains two integers $ U_i $ and $ V_i $ $ (1 \\le U_i, V_i \\le N, U_i \\ne V_i) $ , which denotes the checkpoint that route $ i $ connects.\n\nIt is guaranteed that for every pair of checkpoints, there exists a path connecting them directly or indirectly using the routes.",
    "outputFormat": "Output a single integer which denotes the number of final configurations after each round of CPC modulo $ 10^9 + 7 $",
    "samples": [
        [
            "5 6\n1 2\n2 3\n3 4\n4 1\n1 5\n5 1",
            "8"
        ]
    ],
    "hint": "Every possible final configuration for the example is listed below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1425B/ebea898d61825b68e5285a648bb127c44df665b0.png)The blue-colored numbers give the series of moves $ Blue $ took, and the red-colored numbers give the series of moves $ Red $ took.",
    "translation": "每回合有两名选手比赛。一个蓝色，另一个红色。\r\n\r\n蓝色会给他走的每一条路涂上蓝色，红色会把他走的路涂成红色。两个玩家都从1号检查站开始。最初，所有路线都是灰色的。\r\n\r\n每个阶段，从当前的检查点，蓝色和红色选择不同的灰色路线，并同时移动到路线另一端的检查点。\r\n\r\n当蓝色或红色不再移动时游戏结束。也就是说，他们没有两条截然不同的灰色路线可以选择继续前进。\r\n\r\n求每一轮的路线数。"
}