{
    "description": "Another dull quarantine day was going by when BThero decided to start researching matrices of size $ n \\times m $ . The rows are numerated $ 1 $ through $ n $ from top to bottom, and the columns are numerated $ 1 $ through $ m $ from left to right. The cell in the $ i $ -th row and $ j $ -th column is denoted as $ (i, j) $ .\n\nFor each cell $ (i, j) $ BThero had two values:\n\n1. The cost of the cell, which is a single positive integer.\n2. The direction of the cell, which is one of characters L, R, D, U. Those characters correspond to transitions to adjacent cells $ (i, j - 1) $ , $ (i, j + 1) $ , $ (i + 1, j) $ or $ (i - 1, j) $ , respectively. No transition pointed outside of the matrix.\n\nLet us call a cell $ (i_2, j_2) $ reachable from $ (i_1, j_1) $ , if, starting from $ (i_1, j_1) $ and repeatedly moving to the adjacent cell according to our current direction, we will, sooner or later, visit $ (i_2, j_2) $ .\n\nBThero decided to create another matrix from the existing two. For a cell $ (i, j) $ , let us denote $ S_{i, j} $ as a set of all reachable cells from it (including $ (i, j) $ itself). Then, the value at the cell $ (i, j) $ in the new matrix will be equal to the sum of costs of all cells in $ S_{i, j} $ .\n\nAfter quickly computing the new matrix, BThero immediately sent it to his friends. However, he did not save any of the initial matrices! Help him to restore any two valid matrices, which produce the current one.",
    "inputFormat": "The first line of input file contains a single integer $ T $ ( $ 1 \\le T \\le 100 $ ) denoting the number of test cases. The description of $ T $ test cases follows.\n\nFirst line of a test case contains two integers $ n $ and $ m $ ( $ 1 \\le n \\cdot m \\le 10^5 $ ).\n\nEach of the following $ n $ lines contain exactly $ m $ integers — the elements of the produced matrix. Each element belongs to the segment $ [2, 10^9] $ .\n\nIt is guaranteed that $ \\sum{(n \\cdot m)} $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, if an answer does not exist, print a single word NO. Otherwise, print YES and both matrices in the same format as in the input.\n\n- The first matrix should be the cost matrix and the second matrix should be the direction matrix.\n- All integers in the cost matrix should be positive.\n- All characters in the direction matrix should be valid. No direction should point outside of the matrix.",
    "samples": [
        [
            "2\n3 4\n7 6 7 8\n5 5 4 4\n5 7 4 4\n1 1\n5",
            "YES\n1 1 1 1\n2 1 1 1\n3 2 1 1\nR D L L\nD R D L\nU L R U\nNO"
        ]
    ],
    "hint": "",
    "translation": "对于大小为 $n\\cdot m$ 的矩阵 $A$ 和 $B$，其中 $A$ 的每个元素为一个权值 $w(i,j)$，$B$ 的每个元素为一个方向 ```L/R/D/U```\n\n初始你在 $(i,j)$，若 $B_{i,j}=L$，你可以走到 $(i,j-1)$ 处，依次类推。\n\n定义 $S_{i,j}$ 表示从 $(i,j)$ 出发能够到达的点的 $A_{i,j}$ 的和。\n\n给定矩阵 $S$，构造 $A$ 和 $B$ 使得其生成的矩阵为 $S$\n\n$A$ 的每个元素均为正整数。\n\n$1\\le n\\cdot m\\le 10^5,S_{i,j}\\in [2,10^9]$\n"
}