{
    "description": "You are playing a new computer game in which you have to fight monsters. In a dungeon you are trying to clear, you met three monsters; the first of them has $ a $ health points, the second has $ b $ health points, and the third has $ c $ .\n\nTo kill the monsters, you can use a cannon that, when fired, deals $ 1 $ damage to the selected monster. Every $ 7 $ -th (i. e. shots with numbers $ 7 $ , $ 14 $ , $ 21 $ etc.) cannon shot is enhanced and deals $ 1 $ damage to all monsters, not just one of them. If some monster's current amount of health points is $ 0 $ , it can't be targeted by a regular shot and does not receive damage from an enhanced shot.\n\nYou want to pass the dungeon beautifully, i. e., kill all the monsters with the same enhanced shot (i. e. after some enhanced shot, the health points of each of the monsters should become equal to $ 0 $ for the first time). Each shot must hit a monster, i. e. each shot deals damage to at least one monster.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of a single line that contains three integers $ a $ , $ b $ and $ c $ ( $ 1 \\le a, b, c \\le 10^8 $ ) — the number of health points each monster has.",
    "outputFormat": "For each test case, print YES if you can kill all the monsters with the same enhanced shot. Otherwise, print NO. You may print each letter in any case (for example, YES, Yes, yes, yEs will all be recognized as positive answer).",
    "samples": [
        [
            "3\n3 2 4\n1 1 1\n10 1 7",
            "YES\nNO\nNO"
        ]
    ],
    "hint": "In the first test case, you can do as follows: $ 1 $ -th shot to the first monster, $ 2 $ -th shot to the second monster, $ 3 $ -th shot to the third monster, $ 4 $ -th shot to the first monster, $ 5 $ -th shot to the third monster, $ 6 $ -th shot to the third monster, and $ 7 $ -th enhanced shot will kill all the monsters.\n\nIn the second test case, you can't kill monsters with the same enhanced shot, because the total number of health points of monsters is $ 3 $ , and you will kill them in the first 3 shots.",
    "translation": "- 三个怪兽分别 $a,b,c$ 点血量。\n\n- 每次开炮可以选中一个血量不为 $0$ 的怪兽攻击，造成 $1$ 点伤害。\n\n- 每 $7$ 次开炮为增强版，将会对所有血量不为 $0$ 的怪兽造成 $1$ 点伤害。\n\n- 是否存在某种方案，使得在某次增强版开炮后，每只怪兽血量都第一次降为 $0$。输出 ```YES``` 或 ```NO```。\n\n- $T$ 组测试数据。"
}