{
    "description": "Berland regional ICPC contest has just ended. There were $ m $ participants numbered from $ 1 $ to $ m $ , who competed on a problemset of $ n $ problems numbered from $ 1 $ to $ n $ .\n\nNow the editorial is about to take place. There are two problem authors, each of them is going to tell the tutorial to exactly $ k $ consecutive tasks of the problemset. The authors choose the segment of $ k $ consecutive tasks for themselves independently of each other. The segments can coincide, intersect or not intersect at all.\n\nThe $ i $ -th participant is interested in listening to the tutorial of all consecutive tasks from $ l_i $ to $ r_i $ . Each participant always chooses to listen to only the problem author that tells the tutorials to the maximum number of tasks he is interested in. Let this maximum number be $ a_i $ . No participant can listen to both of the authors, even if their segments don't intersect.\n\nThe authors want to choose the segments of $ k $ consecutive tasks for themselves in such a way that the sum of $ a_i $ over all participants is maximized.",
    "inputFormat": "The first line contains three integers $ n, m $ and $ k $ ( $ 1 \\le n, m \\le 2000 $ , $ 1 \\le k \\le n $ ) — the number of problems, the number of participants and the length of the segment of tasks each of the problem authors plans to tell the tutorial to.\n\nThe $ i $ -th of the next $ m $ lines contains two integers $ l_i $ and $ r_i $ ( $ 1 \\le l_i \\le r_i \\le n $ ) — the segment of tasks the $ i $ -th participant is interested in listening to the tutorial to.",
    "outputFormat": "Print a single integer — the maximum sum of $ a_i $ over all participants.",
    "samples": [
        [
            "10 5 3\n1 3\n2 4\n6 9\n6 9\n1 8",
            "14"
        ],
        [
            "10 3 3\n2 4\n4 6\n3 5",
            "8"
        ],
        [
            "4 4 1\n3 3\n1 1\n2 2\n4 4",
            "2"
        ],
        [
            "5 4 5\n1 2\n2 3\n3 4\n4 5",
            "8"
        ]
    ],
    "hint": "In the first example the first author can tell the tutorial to problems from $ 1 $ to $ 3 $ and the second one — from $ 6 $ to $ 8 $ . That way the sequence of $ a_i $ will be $ [3, 2, 3, 3, 3] $ . Notice that the last participant can't listen to both author, he only chooses the one that tells the maximum number of problems he's interested in.\n\nIn the second example the first one can tell problems $ 2 $ to $ 4 $ , the second one — $ 4 $ to $ 6 $ .\n\nIn the third example the first one can tell problems $ 1 $ to $ 1 $ , the second one — $ 2 $ to $ 2 $ . Or $ 4 $ to $ 4 $ and $ 3 $ to $ 3 $ . Every pair of different problems will get the same sum of $ 2 $ .\n\nIn the fourth example the first one can tell problems $ 1 $ to $ 5 $ , the second one — $ 1 $ to $ 5 $ as well.",
    "translation": "【题目描述】\n\nICPC 刚刚结束，某校 $m$ 名参赛选手，从 $1$ 到 $m$ 编号，要回去补文化课了。文化课有 $1...n$ 共 $n$ 个知识点。学校安排了两个教师，他们每个人要告诉学生他们要上的 $k$ 个连续的知识点。教师独立选择 $k$ 个连续知识点。两个教师选择的知识点可以重合、相交或根本不相交。第 $i$ 个学生只对 $l_i...r_i$ 的知识点有兴趣。每个学生总是选择只听教师教授的知识点中他感兴趣的最大数量的知识点，令知识这个最大数为 $a_i$。需要注意的是，两个教师是同时开课的，即没有学生可以听两个教师的课，即使他们的知识点没有交叉。两个教师希望自己选择 $k$ 个连续的知识点，使得所有学生的 $a_i$ 之和最大。\n\n【输入】\n\n第一行三个正整数 $n$,$m$,$k$。\n接下来 $m$ 行，每行两个正整数 $l_i$,$r_i$。\n\n【输出】\n\n输出 $a_i$ 之和的最大值"
}