{
    "description": "Let's say you are standing on the $ XY $ -plane at point $ (0, 0) $ and you want to reach point $ (n, n) $ .\n\nYou can move only in two directions:\n\n- to the right, i. e. horizontally and in the direction that increase your $ x $ coordinate,\n- or up, i. e. vertically and in the direction that increase your $ y $ coordinate.\n\nIn other words, your path will have the following structure:\n\n- initially, you choose to go to the right or up;\n- then you go some positive integer distance in the chosen direction (distances can be chosen independently);\n- after that you change your direction (from right to up, or from up to right) and repeat the process.\n\nYou don't like to change your direction too much, so you will make no more than $ n - 1 $ direction changes.\n\nAs a result, your path will be a polygonal chain from $ (0, 0) $ to $ (n, n) $ , consisting of at most $ n $ line segments where each segment has positive integer length and vertical and horizontal segments alternate.\n\nNot all paths are equal. You have $ n $ integers $ c_1, c_2, \\dots, c_n $ where $ c_i $ is the cost of the $ i $ -th segment.\n\nUsing these costs we can define the cost of the path as the sum of lengths of the segments of this path multiplied by their cost, i. e. if the path consists of $ k $ segments ( $ k \\le n $ ), then the cost of the path is equal to $ \\sum\\limits_{i=1}^{k}{c_i \\cdot length_i} $ (segments are numbered from $ 1 $ to $ k $ in the order they are in the path).\n\nFind the path of the minimum cost and print its cost.",
    "inputFormat": "The first line contains the single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nThe first line of each test case contains the single integer $ n $ ( $ 2 \\le n \\le 10^5 $ ).\n\nThe second line of each test case contains $ n $ integers $ c_1, c_2, \\dots, c_n $ ( $ 1 \\le c_i \\le 10^9 $ ) — the costs of each segment.\n\nIt's guaranteed that the total sum of $ n $ doesn't exceed $ 10^5 $ .",
    "outputFormat": "For each test case, print the minimum possible cost of the path from $ (0, 0) $ to $ (n, n) $ consisting of at most $ n $ alternating segments.",
    "samples": [
        [
            "3\n2\n13 88\n3\n2 3 1\n5\n4 3 2 1 4",
            "202\n13\n19"
        ]
    ],
    "hint": "In the first test case, to reach $ (2, 2) $ you need to make at least one turn, so your path will consist of exactly $ 2 $ segments: one horizontal of length $ 2 $ and one vertical of length $ 2 $ . The cost of the path will be equal to $ 2 \\cdot c_1 + 2 \\cdot c_2 = 26 + 176 = 202 $ .\n\nIn the second test case, one of the optimal paths consists of $ 3 $ segments: the first segment of length $ 1 $ , the second segment of length $ 3 $ and the third segment of length $ 2 $ .\n\nThe cost of the path is $ 1 \\cdot 2 + 3 \\cdot 3 + 2 \\cdot 1 = 13 $ .\n\nIn the third test case, one of the optimal paths consists of $ 4 $ segments: the first segment of length $ 1 $ , the second one — $ 1 $ , the third one — $ 4 $ , the fourth one — $ 4 $ . The cost of the path is $ 1 \\cdot 4 + 1 \\cdot 3 + 4 \\cdot 2 + 4 \\cdot 1 = 19 $ .",
    "translation": "n✖n的矩阵\n让你从（0，0）走到（n,n)\n每次只能向上走或者向右走且步长至少为1，而且走完之后必须换方向\n最多换n-1次方向，也就是走n段路\n每段都都有一个权值，这段路的计算代价为这次走的长度×这段路的权值（c[i])\n，求最小的代价"
}