{
    "description": "One drew a closed polyline on a plane, that consisted only of vertical and horizontal segments (parallel to the coordinate axes). The segments alternated between horizontal and vertical ones (a horizontal segment was always followed by a vertical one, and vice versa). The polyline did not contain strict self-intersections, which means that in case any two segments shared a common point, that point was an endpoint for both of them (please consult the examples in the notes section).\n\nUnfortunately, the polyline was erased, and you only know the lengths of the horizonal and vertical segments. Please construct any polyline matching the description with such segments, or determine that it does not exist.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 200 $ ) —the number of test cases.\n\nThe first line of each test case contains one integer $ h $ ( $ 1 \\leq h \\leq 1000 $ ) — the number of horizontal segments. The following line contains $ h $ integers $ l_1, l_2, \\dots, l_h $ ( $ 1 \\leq l_i \\leq 1000 $ ) — lengths of the horizontal segments of the polyline, in arbitrary order.\n\nThe following line contains an integer $ v $ ( $ 1 \\leq v \\leq 1000 $ ) — the number of vertical segments, which is followed by a line containing $ v $ integers $ p_1, p_2, \\dots, p_v $ ( $ 1 \\leq p_i \\leq 1000 $ ) — lengths of the vertical segments of the polyline, in arbitrary order.\n\nTest cases are separated by a blank line, and the sum of values $ h + v $ over all test cases does not exceed $ 1000 $ .",
    "outputFormat": "For each test case output Yes, if there exists at least one polyline satisfying the requirements, or No otherwise. If it does exist, in the following $ n $ lines print the coordinates of the polyline vertices, in order of the polyline traversal: the $ i $ -th line should contain two integers $ x_i $ and $ y_i $ — coordinates of the $ i $ -th vertex.\n\nNote that, each polyline segment must be either horizontal or vertical, and the segments should alternate between horizontal and vertical. The coordinates should not exceed $ 10^9 $ by their absolute value.",
    "samples": [
        [
            "2\n2\n1 1\n2\n1 1\n\n2\n1 2\n2\n3 3",
            "Yes\n1 0\n1 1\n0 1\n0 0\nNo"
        ],
        [
            "2\n4\n1 1 1 1\n4\n1 1 1 1\n\n3\n2 1 1\n3\n2 1 1",
            "Yes\n1 0\n1 1\n2 1\n2 2\n1 2\n1 1\n0 1\n0 0\nYes\n0 -2\n2 -2\n2 -1\n1 -1\n1 0\n0 0"
        ],
        [
            "2\n4\n1 4 1 2\n4\n3 4 5 12\n\n4\n1 2 3 6\n2\n1 3",
            "Yes\n2 0\n2 3\n3 3\n3 7\n4 7\n4 12\n0 12\n0 0\nNo"
        ]
    ],
    "hint": "In the first test case of the first example, the answer is Yes — for example, the following picture illustrates a square that satisfies the requirements:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1444D/511e3cc6ecd7cbf8bef9022e593d85929ba09d17.png)In the first test case of the second example, the desired polyline also exists. Note that, the polyline contains self-intersections, but only in the endpoints:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1444D/0fcb4ab165879349d64b5ec435afdbdfe4bad9ed.png)In the second test case of the second example, the desired polyline could be like the one below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1444D/8889270100914e11d3c483d0ff3b94b9e989e1a1.png)Note that the following polyline is not a valid one, since it contains self-intersections that are not endpoints for some of the segments:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1444D/0176b8a3571481194d4ceebd3813157b1aae2d53.png)",
    "translation": "$t$ 组数据。\n\n给定 $h$ 条水平线段，长度依次为 $l_1,l_2,\\ldots,l_h$ 和 $v$ 条竖直线段 $p_1,p_2,\\ldots,p_v$，要求求出一种方案使竖直线段和水平线段交替首尾相接，且不在除端点外的其它地方有交点。"
}