{
    "description": "$ n $ fishermen have just returned from a fishing vacation. The $ i $ -th fisherman has caught a fish of weight $ a_i $ .\n\nFishermen are going to show off the fish they caught to each other. To do so, they firstly choose an order in which they show their fish (each fisherman shows his fish exactly once, so, formally, the order of showing fish is a permutation of integers from $ 1 $ to $ n $ ). Then they show the fish they caught according to the chosen order. When a fisherman shows his fish, he might either become happy, become sad, or stay content.\n\nSuppose a fisherman shows a fish of weight $ x $ , and the maximum weight of a previously shown fish is $ y $ ( $ y = 0 $ if that fisherman is the first to show his fish). Then:\n\n- if $ x \\ge 2y $ , the fisherman becomes happy;\n- if $ 2x \\le y $ , the fisherman becomes sad;\n- if none of these two conditions is met, the fisherman stays content.\n\nLet's call an order in which the fishermen show their fish emotional if, after all fishermen show their fish according to this order, each fisherman becomes either happy or sad. Calculate the number of emotional orders modulo $ 998244353 $ .",
    "inputFormat": "The first line contains one integer $ n $ ( $ 2 \\le n \\le 5000 $ ).\n\nThe second line contains $ n $ integers $ a_1 $ , $ a_2 $ , ..., $ a_n $ ( $ 1 \\le a_i \\le 10^9 $ ).",
    "outputFormat": "Print one integer — the number of emotional orders, taken modulo $ 998244353 $ .",
    "samples": [
        [
            "4\n1 1 4 9",
            "20"
        ],
        [
            "4\n4 3 2 1",
            "0"
        ],
        [
            "3\n4 2 1",
            "6"
        ],
        [
            "8\n42 1337 13 37 420 666 616 97",
            "19200"
        ]
    ],
    "hint": "",
    "translation": "有n$(n\\le 5000)$个渔民，每个渔民钓了一条重$a_i$的鱼，渔民按任意顺序展示他们的鱼。\n\n若当前渔民的鱼的重量为$x$，之前展示过的鱼的最大重量$y$ \n\n一个排列满足条件当且仅当对于每个$x$，满足$2y\\le x$或$2x\\le y$\n\n问有多少个排列满足条件，对$998244353$取模"
}