{
    "description": "Alice and Bob are playing a fun game of tree tag.\n\nThe game is played on a tree of $ n $ vertices numbered from $ 1 $ to $ n $ . Recall that a tree on $ n $ vertices is an undirected, connected graph with $ n-1 $ edges.\n\nInitially, Alice is located at vertex $ a $ , and Bob at vertex $ b $ . They take turns alternately, and Alice makes the first move. In a move, Alice can jump to a vertex with distance at most $ da $ from the current vertex. And in a move, Bob can jump to a vertex with distance at most $ db $ from the current vertex. The distance between two vertices is defined as the number of edges on the unique simple path between them. In particular, either player is allowed to stay at the same vertex in a move. Note that when performing a move, a player only occupies the starting and ending vertices of their move, not the vertices between them.\n\nIf after at most $ 10^{100} $ moves, Alice and Bob occupy the same vertex, then Alice is declared the winner. Otherwise, Bob wins.\n\nDetermine the winner if both players play optimally.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). Description of the test cases follows.\n\nThe first line of each test case contains five integers $ n,a,b,da,db $ ( $ 2\\le n\\le 10^5 $ , $ 1\\le a,b\\le n $ , $ a\\ne b $ , $ 1\\le da,db\\le n-1 $ ) — the number of vertices, Alice's vertex, Bob's vertex, Alice's maximum jumping distance, and Bob's maximum jumping distance, respectively.\n\nThe following $ n-1 $ lines describe the edges of the tree. The $ i $ -th of these lines contains two integers $ u $ , $ v $ ( $ 1\\le u, v\\le n, u\\ne v $ ), denoting an edge between vertices $ u $ and $ v $ . It is guaranteed that these edges form a tree structure.\n\nIt is guaranteed that the sum of $ n $ across all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, output a single line containing the winner of the game: \"Alice\" or \"Bob\".",
    "samples": [
        [
            "4\n4 3 2 1 2\n1 2\n1 3\n1 4\n6 6 1 2 5\n1 2\n6 5\n2 3\n3 4\n4 5\n9 3 9 2 5\n1 2\n1 6\n1 9\n1 3\n9 5\n7 9\n4 8\n4 3\n11 8 11 3 3\n1 2\n11 9\n4 9\n6 5\n2 10\n3 2\n5 9\n8 3\n7 4\n7 10",
            "Alice\nBob\nAlice\nAlice"
        ]
    ],
    "hint": "In the first test case, Alice can win by moving to vertex $ 1 $ . Then wherever Bob moves next, Alice will be able to move to the same vertex on the next move.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1404B/49586895aed4babac3e35aba1e1c4162a3ac0674.png)In the second test case, Bob has the following strategy to win. Wherever Alice moves, Bob will always move to whichever of the two vertices $ 1 $ or $ 6 $ is farthest from Alice.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1404B/514885d88075ac42c59e9da88fb4903131f99500.png)",
    "translation": "有一棵 $n$ 个点的树， Alice 和 Bob 初始在这棵树上的节点 $a$, $b$。\n\n他们可以在树上轮流移动一段距离不超过 $da$ 和 $db$ 的路径。\n\n路径长度的定义是两点之间树上简单路径的边数。\n\n如果 Alice 能在 $10^{100}$ 次内追到 Bob ，那么则算 Alice 赢，否则算 Bob 赢。\n"
}