{
    "description": "You have $ n $ barrels lined up in a row, numbered from left to right from one. Initially, the $ i $ -th barrel contains $ a_i $ liters of water.\n\nYou can pour water from one barrel to another. In one act of pouring, you can choose two different barrels $ x $ and $ y $ (the $ x $ -th barrel shouldn't be empty) and pour any possible amount of water from barrel $ x $ to barrel $ y $ (possibly, all water). You may assume that barrels have infinite capacity, so you can pour any amount of water in each of them.\n\nCalculate the maximum possible difference between the maximum and the minimum amount of water in the barrels, if you can pour water at most $ k $ times.\n\nSome examples:\n\n- if you have four barrels, each containing $ 5 $ liters of water, and $ k = 1 $ , you may pour $ 5 $ liters from the second barrel into the fourth, so the amounts of water in the barrels are $ [5, 0, 5, 10] $ , and the difference between the maximum and the minimum is $ 10 $ ;\n- if all barrels are empty, you can't make any operation, so the difference between the maximum and the minimum amount is still $ 0 $ .",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nThe first line of each test case contains two integers $ n $ and $ k $ ( $ 1 \\le k < n \\le 2 \\cdot 10^5 $ ) — the number of barrels and the number of pourings you can make.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 0 \\le a_i \\le 10^{9} $ ), where $ a_i $ is the initial amount of water the $ i $ -th barrel has.\n\nIt's guaranteed that the total sum of $ n $ over test cases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print the maximum possible difference between the maximum and the minimum amount of water in the barrels, if you can pour water at most $ k $ times.",
    "samples": [
        [
            "2\n4 1\n5 5 5 5\n3 2\n0 0 0",
            "10\n0"
        ]
    ],
    "hint": "",
    "translation": "$T$ 次询问，对于每一次询问：\n\n有 $n$ 个水桶，第 $i$ 个水桶有 $a_i$ 单位的水，有 $k$ 次机会把一个桶里的水倒在另一个桶里（任意单位，可以不执行完），询问最后最大水桶水量和最小水桶水量的差的最大值。\n\n$1\\leq k < n\\leq 2\\cdot10^5,0\\leq a_i \\leq10^9$"
}