{
    "description": "As Gerald ..., in other words, on a New Year Eve Constantine prepared an unusual present for the Beautiful Lady. The present is the magic New Year snowflake that can make any dream come true.\n\nThe New Year snowflake consists of tiny ice crystals, which can be approximately regarded as points on the plane. The beauty of the New Year snowflake is that it has a center of symmetry. This is a point such that for each crystal of the snowflake exists another crystal, symmetrical to it relative to that point. One of the crystals can be placed directly in the center of symmetry.\n\nWhile Constantine was choosing a snowflake among millions of other snowflakes, no less symmetrical and no less magical, then endured a difficult path through the drifts to the house of his mistress, while he was waiting with bated breath for a few long moments before the Beautiful Lady opens the door, some of the snowflake crystals melted and naturally disappeared. Constantine is sure that there were no more than $ k $ of such crystals, because he handled the snowflake very carefully. Now he is ready to demonstrate to the Beautiful Lady all the power of nanotechnology and restore the symmetry of snowflakes.\n\nYou are given the coordinates of the surviving snowflake crystals, given in nanometers. Your task is to identify all possible positions of the original center of symmetry.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1<=n<=200000 $ , $ 0<=k<=10 $ ) — the number of the surviving snowflake crystals and the maximum number of melted crystals, correspondingly. Next $ n $ lines contain the coordinates of the crystals that are left in the following form: \" $ x_{i} $ $ y_{i} $ \". The coordinates are integers and do not exceed $ 5·10^{8} $ in absolute value. All given points are different.",
    "outputFormat": "The first line contains an integer $ c $ — the number of possible symmetry centers. Next $ c $ lines should contain the centers' descriptions. Each symmetry center is described by a couple of coordinates \" $ x $ $ y $ \", separated by a space. Print the coordinates with absolute error not exceeding $ 10^{-6} $ . You are allowed to print the symmetry centers in any order. All printed points should be different. If there exist an infinite number of possible symmetry centers, print the single number \"-1\".",
    "samples": [
        [
            "4 0\n0 0\n0 1\n1 0\n1 1\n",
            "1\n0.5 0.5\n"
        ],
        [
            "4 2\n0 0\n0 1\n1 0\n1 1\n",
            "5\n0.0 0.5\n0.5 0.0\n0.5 0.5\n0.5 1.0\n1.0 0.5\n"
        ],
        [
            "4 4\n0 0\n0 1\n1 0\n1 1\n",
            "-1\n"
        ]
    ],
    "hint": ""
}