{
    "description": "For the simplicity, let's say that the \"Death Note\" is a notebook that kills a person when their name is written in it.\n\nIt's easy to kill with it, but it's pretty hard to keep track of people you haven't killed and still plan to. You decided to make a \"Death Database Management System\" — a computer program that provides the easy access to the database of possible victims. Let me describe its specifications to you.\n\nLet's define a victim entity: a victim has a name (not necessarily unique) that consists only of lowercase Latin letters and an integer suspicion value.\n\nAt the start of the program the user enters a list of $ n $ victim names into a database, each suspicion value is set to $ 0 $ .\n\nThen the user makes queries of two types:\n\n- $ 1~i~x $ — set the suspicion value of the $ i $ -th victim to $ x $ ;\n- $ 2~q $ — given a string $ q $ find the maximum suspicion value of a victim whose name is a contiguous substring of $ q $ .\n\nJust to remind you, this program doesn't kill people, it only helps to search for the names to write down in an actual notebook. Thus, the list of the victims in the database doesn't change throughout the queries.\n\nWhat are you waiting for? Write that program now!",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 3 \\cdot 10^5 $ ) — the number of victims and the number of queries, respectively.\n\nEach of the next $ n $ lines contains a single string $ s_i $ — the name of the $ i $ -th victim. Each name consists only of lowercase Latin letters.\n\nEach of the next $ m $ lines contains a query of one of two types:\n\n- $ 1~i~x $ ( $ 1 \\le i \\le n $ , $ 0 \\le x \\le 10^9 $ ) — change the suspicion value of the $ i $ -th victim to $ x $ ;\n- $ 2~q $ — given a string $ q $ consisting only of lowercase Latin letters find the maximum suspicion value of a victim whose name is a contiguous substring of $ q $ .\n\nThere is at least one query of the second type. The total length of the strings $ s_i $ doesn't exceed $ 3 \\cdot 10^5 $ . The total length of the strings $ q $ doesn't exceed $ 3 \\cdot 10^5 $ .",
    "outputFormat": "For each query of the second type print an integer value. If there is no victim name that is a contiguous substring of $ q $ , then print $ -1 $ . Otherwise, print the maximum suspicion value of a victim whose name is a contiguous substring of $ q $ .",
    "samples": [
        [
            "5 8\nkurou\ntakuo\ntakeshi\nnaomi\nshingo\n2 nakiraomi\n2 abanaomicaba\n1 3 943\n2 takuotakeshishingo\n1 5 135832\n2 shingotakeshi\n1 5 0\n2 shingotakeshi",
            "-1\n0\n943\n135832\n943"
        ],
        [
            "6 15\na\nab\nba\nb\na\nba\n2 aa\n1 4 4\n2 bbb\n1 2 1\n1 2 18\n2 b\n2 c\n1 6 10\n2 aba\n2 abbbba\n1 2 12\n2 bbaaab\n1 1 11\n1 5 5\n2 baa",
            "0\n4\n4\n-1\n18\n18\n12\n11"
        ]
    ],
    "hint": "",
    "translation": "## 题目背景\n\n（下面有简化描述，不想看长背景就直接去下面）\n\n(与题意无关)简单来说，“死亡笔记”是一个能把名字被写在笔记上的人杀死的笔记。\n\n用这个笔记杀人很容易，但没法用它记录你计划杀死但尚未杀死的人（写上人名就直接杀了）。所以你决定开发一个“死亡数据管理系统”-一个能方便地提供潜在受害者信息的系统。下面为你描述这个系统。\n\n## 题目描述\n一个受害者由两个信息描述：仅由小写英文字母组成的姓名（不保证唯一）和受怀疑程度。\n\n最开始，系统的使用者输入n个受害者的姓名，他们的受怀疑程度最初都为0。\n\n然后使用者会进行两种操作：\n\n- 1 i x 将第i个受害者的受怀疑程度改为x\n- 2 q 给出一个字符串q，询问所有姓名是q的子串的受害者的受怀疑程度的最大值\n\n**注意**，这个系统不负责杀人，因此在整个过程中受害者都是固定的\n\n## 简化描述\n\n给出$n,m$，然后给出n个字符串，每个字符串都有一个权值，最初权值都为0\n\n然后有m个操作，操作有两种类型\n\n- 1 i x 将第i个字符串的权值修改为x\n\n- 2 q 给出一个字符串q，求所有**是q的子串**的字符串的**权值的最大值**\n\n## 输入格式\n第一行给出$n,m$，分别是受害者数量和操作数量\n\n接下来n行每行一个字符串s，表示第i个受害者的姓名，保证为小写英文字母\n\n接下来m行为m个询问，格式如**题目描述**（或**简化描述**）中所写\n\n## 输出格式\n对于每个操作2，如果不存在姓名是询问串q的子串的受害者，则输出'-1'，否则输出权值的最大值，每个**操作**的输出**占一行**\n\n## 数据范围\n$1\\le n,m\\le 3\\times10^5$\n\n$\\sum length(s_i)\\le3\\times 10^5$，即输入的受害者姓名串s的长度和不超过$3\\times10^5$\n\n操作1中$1\\le i\\le n \\space,\\space 0\\le x \\le 10^9$\n\n操作2中$\\sum length(q)\\le3\\times 10^5$，即询问串长度和不超过$3\\times 10^5$"
}