{
    "description": "You are given an integer $ k $ and an undirected tree, consisting of $ n $ vertices.\n\nThe length of a simple path (a path in which each vertex appears at most once) between some pair of vertices is the number of edges in this path. A diameter of a tree is the maximum length of a simple path between all pairs of vertices of this tree.\n\nYou are about to remove a set of edges from the tree. The tree splits into multiple smaller trees when the edges are removed. The set of edges is valid if all the resulting trees have diameter less than or equal to $ k $ .\n\nTwo sets of edges are different if there is an edge such that it appears in only one of the sets.\n\nCount the number of valid sets of edges modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 2 \\le n \\le 5000 $ , $ 0 \\le k \\le n - 1 $ ) — the number of vertices of the tree and the maximum allowed diameter, respectively.\n\nEach of the next $ n-1 $ lines contains a description of an edge: two integers $ v $ and $ u $ ( $ 1 \\le v, u \\le n $ , $ v \\neq u $ ).\n\nThe given edges form a tree.",
    "outputFormat": "Print a single integer — the number of valid sets of edges modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "4 3\n1 2\n1 3\n1 4",
            "8"
        ],
        [
            "2 0\n1 2",
            "1"
        ],
        [
            "6 2\n1 6\n2 4\n2 6\n3 6\n5 6",
            "25"
        ],
        [
            "6 3\n1 2\n1 5\n2 3\n3 4\n5 6",
            "29"
        ]
    ],
    "hint": "In the first example the diameter of the given tree is already less than or equal to $ k $ . Thus, you can choose any set of edges to remove and the resulting trees will have diameter less than or equal to $ k $ . There are $ 2^3 $ sets, including the empty one.\n\nIn the second example you have to remove the only edge. Otherwise, the diameter will be $ 1 $ , which is greater than $ 0 $ .\n\nHere are the trees for the third and the fourth examples:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1499F/79b28352721e574665f54dbdbe68df4e7a2b22d3.png)",
    "translation": "给定一棵 $n$ 个节点的树和一个正整数 $k$。求有多少种边的集合，使得在将此集合中的所有边断开后，形成的所有连通块的直径都不大于 $k$。\n\n两个边的集合不同当且仅当存在一条边在一个集合中而不在另一个集合中。\n\n答案对 $998244353$ 取模。"
}