{
    "description": "After his wife's tragic death, Eurydice, Orpheus descended to the realm of death to see her. Reaching its gates was uneasy, but passing through them proved to be even more challenging. Mostly because of Cerberus, the three-headed hound of Hades.\n\nOrpheus, a famous poet, and musician plans to calm Cerberus with his poetry and safely walk past him. He created a very peculiar poem for Cerberus. It consists only of lowercase English letters.\n\nWe call a poem's substring a palindrome if and only if it reads the same backwards and forwards. A string $ a $ is a substring of a string $ b $ if $ a $ can be obtained from $ b $ by deleting several (possibly zero or all) characters from the beginning and several (possibly zero or all) characters from the end.\n\nUnfortunately, Cerberus dislikes palindromes of length greater than $ 1 $ . For example in the poem abaa the hound of Hades wouldn't like substrings aba and aa.\n\nOrpheus can only calm Cerberus if the hound likes his poetry. That's why he wants to change his poem so that it does not contain any palindrome substrings of length greater than $ 1 $ .\n\nOrpheus can modify the poem by replacing a letter at any position with any lowercase English letter. He can use this operation arbitrarily many times (possibly zero). Since there can be many palindromes in his poem, he may have to make some corrections. But how many, exactly? Given the poem, determine the minimal number of letters that have to be changed so that the poem does not contain any palindromes of length greater than $ 1 $ .",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\leq t \\leq 10^5 $ ) denoting the number of test cases, then $ t $ test cases follow.\n\nThe first and only line of each test case contains a non-empty string of lowercase English letters, Orpheus' poem.\n\nThe sum of the length of Orpheus' poems in all test cases will not exceed $ 10^5 $ .",
    "outputFormat": "You should output $ t $ lines, $ i $ -th line should contain a single integer, answer to the $ i $ -th test case.",
    "samples": [
        [
            "7\nbabba\nabaac\ncodeforces\nzeroorez\nabcdcba\nbbbbbbb\na",
            "1\n1\n0\n1\n1\n4\n0"
        ]
    ],
    "hint": "In the first test case, we can replace the third character with c and obtain a palindrome-less poem bacba.\n\nIn the second test case, we can replace the third character with d and obtain a palindrome-less poem abdac.\n\nIn the third test case, the initial poem already doesn't contain any palindromes, so Orpheus doesn't need to change anything there.",
    "translation": "**该题有 $t$ 组数据。**\n\n每组数据给出一个由小写字母组成的字符串 $s$。\n\n每次可以将串 $s$ 中任意一个位置的字符修改为另一个小写字母。\n\n问最少要修改多少次，才可以使得串 $s$ 中不存在**长度大于 $1$** 的回文子串。\n\n$t \\le 10^5$，$\\sum|s| \\le 10^5$。\n\n翻译提供：HoshizoraZ"
}