{
    "description": "Recently, Petya learned about a new game \"Slay the Dragon\". As the name suggests, the player will have to fight with dragons. To defeat a dragon, you have to kill it and defend your castle. To do this, the player has a squad of $ n $ heroes, the strength of the $ i $ -th hero is equal to $ a_i $ .\n\nAccording to the rules of the game, exactly one hero should go kill the dragon, all the others will defend the castle. If the dragon's defense is equal to $ x $ , then you have to send a hero with a strength of at least $ x $ to kill it. If the dragon's attack power is $ y $ , then the total strength of the heroes defending the castle should be at least $ y $ .\n\nThe player can increase the strength of any hero by $ 1 $ for one gold coin. This operation can be done any number of times.\n\nThere are $ m $ dragons in the game, the $ i $ -th of them has defense equal to $ x_i $ and attack power equal to $ y_i $ . Petya was wondering what is the minimum number of coins he needs to spend to defeat the $ i $ -th dragon.\n\nNote that the task is solved independently for each dragon (improvements are not saved).",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — number of heroes.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^{12} $ ), where $ a_i $ is the strength of the $ i $ -th hero.\n\nThe third line contains a single integer $ m $ ( $ 1 \\le m \\le 2 \\cdot 10^5 $ ) — the number of dragons.\n\nThe next $ m $ lines contain two integers each, $ x_i $ and $ y_i $ ( $ 1 \\le x_i \\le 10^{12}; 1 \\le y_i \\le 10^{18} $ ) — defense and attack power of the $ i $ -th dragon.",
    "outputFormat": "Print $ m $ lines, $ i $ -th of which contains a single integer — the minimum number of coins that should be spent to defeat the $ i $ -th dragon.",
    "samples": [
        [
            "4\n3 6 2 3\n5\n3 12\n7 9\n4 14\n1 10\n8 7",
            "1\n2\n4\n0\n2"
        ]
    ],
    "hint": "To defeat the first dragon, you can increase the strength of the third hero by $ 1 $ , then the strength of the heroes will be equal to $ [3, 6, 3, 3] $ . To kill the dragon, you can choose the first hero.\n\nTo defeat the second dragon, you can increase the forces of the second and third heroes by $ 1 $ , then the strength of the heroes will be equal to $ [3, 7, 3, 3] $ . To kill the dragon, you can choose a second hero.\n\nTo defeat the third dragon, you can increase the strength of all the heroes by $ 1 $ , then the strength of the heroes will be equal to $ [4, 7, 3, 4] $ . To kill the dragon, you can choose a fourth hero.\n\nTo defeat the fourth dragon, you don't need to improve the heroes and choose a third hero to kill the dragon.\n\nTo defeat the fifth dragon, you can increase the strength of the second hero by $ 2 $ , then the strength of the heroes will be equal to $ [3, 8, 2, 3] $ . To kill the dragon, you can choose a second hero.",
    "translation": "给定长度为 $n$ 的序列 $a$，$m$ 次询问，每次询问包含两个参数 $x,y$，你可以给序列任意位置 $+1$，最后你需要找出一个位置 $p$ ，满足\n\n- $a_p\\ge x$\n- $\\displaystyle\\sum_{i=1}^n a_i[i\\not= p] \\ge y$\n\n最小化 $+1$ 次数，输出其次数。\n\n**限制**：$2\\le n\\le2\\times 10^5,1\\le m\\le 2\\times10^5,1\\le a_i,x\\le 10^{12},1\\le y\\le 10^{18}$\n\nTranslated by 飞丞"
}