{
    "description": "It is given a positive integer $ n $ . In $ 1 $ move, one can select any single digit and remove it (i.e. one selects some position in the number and removes the digit located at this position). The operation cannot be performed if only one digit remains. If the resulting number contains leading zeroes, they are automatically removed.\n\nE.g. if one removes from the number $ 32925 $ the $ 3 $ -rd digit, the resulting number will be $ 3225 $ . If one removes from the number $ 20099050 $ the first digit, the resulting number will be $ 99050 $ (the $ 2 $ zeroes going next to the first digit are automatically removed).\n\nWhat is the minimum number of steps to get a number such that it is divisible by $ 25 $ and positive? It is guaranteed that, for each $ n $ occurring in the input, the answer exists. It is guaranteed that the number $ n $ has no leading zeros.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nEach test case consists of one line containing one integer $ n $ ( $ 25 \\le n \\le 10^{18} $ ). It is guaranteed that, for each $ n $ occurring in the input, the answer exists. It is guaranteed that the number $ n $ has no leading zeros.",
    "outputFormat": "For each test case output on a separate line an integer $ k $ ( $ k \\ge 0 $ ) — the minimum number of steps to get a number such that it is divisible by $ 25 $ and positive.",
    "samples": [
        [
            "5\n100\n71345\n3259\n50555\n2050047",
            "0\n3\n1\n3\n2"
        ]
    ],
    "hint": "In the first test case, it is already given a number divisible by $ 25 $ .\n\nIn the second test case, we can remove the digits $ 1 $ , $ 3 $ , and $ 4 $ to get the number $ 75 $ .\n\nIn the third test case, it's enough to remove the last digit to get the number $ 325 $ .\n\nIn the fourth test case, we can remove the three last digits to get the number $ 50 $ .\n\nIn the fifth test case, it's enough to remove the digits $ 4 $ and $ 7 $ .",
    "translation": "**题目描述：**\n\n给定一个**正整数** $n$，你可以对它进行操作。\n\n对于每一次操作，你可以将这个正整数其中的**任意**一个数位删去，之后这个数剩下的左右两边会相接。\n\n特别地：\n\n- 如果一个数仅剩下一个数位，则不能再对它进行操作；\n- 如果一个操作之后的数包含前导零，则这些前导零会被一并删除。\n\n例如：\n\n- 将 $32925$ 的第 $3$ 位删除后，它会变成 $3225$；\n- 将 $20099050$ 的第 $1$ 位删除后，它会变成 $99050$（两个前导零被一并删除了）。\n\n请你求出，最少经过多少次操作之后，可以得到一个能被 $25$ 整除的**正整数**。\n\n**输入格式：**\n\n本题包含多组数据。\n\n输入的第一行包含一个正整数 $t$，表示数据组数。\n\n接下来 $t$ 行，每行一个正整数 $n$。\n\n**输出格式：**\n\n对于每组数据，输出一行一个非负整数，表示答案。\n\n**数据范围：**\n\n- $1 \\le t \\le 10^4$；\n- $25 \\le n \\le 10^{18}$。\n\nTranslated by @BurningEnderDragon, 2021.10.14"
}