{
    "description": "Four players participate in the playoff tournament. The tournament is held according to the following scheme: the first player will play with the second, and the third player with the fourth, then the winners of the pairs will play in the finals of the tournament.\n\nIt is known that in a match between two players, the one whose skill is greater will win. The skill of the $ i $ -th player is equal to $ s_i $ and all skill levels are pairwise different (i. e. there are no two identical values in the array $ s $ ).\n\nThe tournament is called fair if the two players with the highest skills meet in the finals.\n\nDetermine whether the given tournament is fair.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nA single line of test case contains four integers $ s_1, s_2, s_3, s_4 $ ( $ 1 \\le s_i \\le 100 $ ) — skill of the players. It is guaranteed that all the numbers in the array are different.",
    "outputFormat": "For each testcase, output YES if the tournament is fair, or NO otherwise.",
    "samples": [
        [
            "4\n3 7 9 5\n4 5 6 9\n5 3 8 1\n6 5 3 2",
            "YES\nNO\nYES\nNO"
        ]
    ],
    "hint": "Consider the example:\n\n1. in the first test case, players $ 2 $ and $ 3 $ with skills $ 7 $ and $ 9 $ advance to the finals;\n2. in the second test case, players $ 2 $ and $ 4 $ with skills $ 5 $ and $ 9 $ advance to the finals. The player with skill $ 6 $ does not advance, but the player with skill $ 5 $ advances to the finals, so the tournament is not fair;\n3. in the third test case, players $ 1 $ and $ 3 $ with skills $ 5 $ and $ 8 $ advance to the finals;\n4. in the fourth test case, players $ 1 $ and $ 3 $ with skills $ 6 $ and $ 3 $ advance to the finals. The player with skill $ 5 $ does not advance, but the player with skill $ 3 $ advances to the finals, so the tournament is not fair.",
    "translation": "给定 $4$ 个人的能力值，第一个人与第二个人比赛，第三个人与第四个人比赛，两场比赛中能力值高的两人将获胜。若获胜的两个人是 $4$ 人中能力值最高的，则该比赛公平，输出 `YES`，否则输出 `NO`。  \n\n**本题有多组测试数据。**"
}