{
    "description": "Yuu Koito and Touko Nanami are newlyweds! On the wedding day, Yuu gifted Touko a directed tree with $ n $ nodes and rooted at $ 1 $ , and a labeling $ a $ which is some DFS order of the tree. Every edge in this tree is directed away from the root.\n\nAfter calling dfs(1) the following algorithm returns $ a $ as a DFS order of a tree rooted at $ 1 $ :\n\n```\n<pre class=\"verbatim\"><br></br>order := 0<br></br>a := array of length n <br></br><br></br>function dfs(u):<br></br>    order := order + 1<br></br>    a[u] := order<br></br>    for all v such that there is a directed edge (u -> v):<br></br>        dfs(v)<br></br>\n```\n\nNote that there may be different DFS orders for a given tree.\n\nTouko likes the present so much she decided to play with it! On each day following the wedding day, Touko performs this procedure once:\n\n- Among all directed edges $ u \\rightarrow v $ such that $ a_u < a_v $ , select the edge $ u' \\rightarrow v' $ with the lexicographically smallest pair $ (a_{u'}, a_{v'}) $ .\n- Swap $ a_{u'} $ and $ a_{v'} $ .\n\nDays have passed since their wedding, and Touko has somehow forgotten which date the wedding was and what was the original labeling $ a $ ! Fearing that Yuu might get angry, Touko decided to ask you to derive these two pieces of information using the current labeling.\n\nBeing her good friend, you need to find the number of days that have passed since the wedding, and the original labeling of the tree. However, there is a chance that Touko might have messed up her procedures, which result in the current labeling being impossible to obtain from some original labeling; in that case, please inform Touko as well.",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 2 \\le n \\le 3 \\cdot 10^5 $ ) — the number of nodes on the tree.\n\nThe second line contains $ n $ integers $ a_1 $ , $ a_2 $ , ..., $ a_n $ ( $ 1 \\le a_i \\le n $ , all $ a_i $ are distinct) — the current labeling of the tree.\n\nEach of the next $ n - 1 $ lines contains two integers $ u_i $ and $ v_i $ ( $ 1 \\le u, v \\le n $ , $ u \\neq v $ ), describing an directed edge from $ u_i $ to $ v_i $ . The edges form a directed tree rooted at $ 1 $ .",
    "outputFormat": "If the current labeling is impossible to arrive at from any DFS order, print NO.\n\nElse, on the first line, print YES. On the second line, print a single integer denoting the number of days since the wedding. On the third line, print $ n $ numbers space-separated denoting the original labeling of the tree.\n\nIf there are multiple correct outputs, print any. This means: you are allowed to output any pair (DFS order, number of days), such that we get the current configuration from the DFS order you provided in exactly the number of days you provided.",
    "samples": [
        [
            "7\n4 5 2 1 7 6 3\n1 5\n7 6\n1 2\n2 7\n3 4\n1 3",
            "YES\n5\n1 4 2 3 7 6 5"
        ],
        [
            "7\n7 6 5 3 1 4 2\n4 3\n2 5\n3 7\n1 4\n7 2\n2 6",
            "NO"
        ]
    ],
    "hint": "The following animation showcases the first sample test case. The white label inside the node represents the index of the node $ i $ , while the boxed orange label represents the value $ a_i $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1508E/3e50fa34f107fc2604db0e1747008bb1dad1f82b.png)",
    "translation": "你有一个 $n(2 \\le n \\le 3 \\times 10^5)$ 个节点，以 $1$ 为根的树和它的某一个 DFS 序（但你不知道具体是什么）。又有一个序列 $a$，初始时 $a_i$ 就是第 $i$ 个点在 DFS 序中的位置。\n\n某人对这个树进行了若干次操作，每次操作形如找到一个字典序最小的二元组 $(a_i,a_j)$（$需满足 a_i < a_j$），使得 $i$ 是 $j$ 树上的父亲 ，并且交换 $a_i,a_j$。\n\n现在给定你这棵树和操作若干次后的序列 $a'$，要求你判断是否存在一种 DFS 序使得进行若干次操作后的 $a$ 序列是给定的 $a'$。有解还需输出操作次数和初始的 $a$ 序列（如有多解输出任意一解即可）。"
}