{
    "description": "Morning desert sun horizonRise above the sands of time...\n\n\n\nFates Warning, \"Exodus\"\n\n\n\nAfter crossing the Windswept Wastes, Ori has finally reached the Windtorn Ruins to find the Heart of the Forest! However, the ancient repository containing this priceless Willow light did not want to open!\n\nOri was taken aback, but the Voice of the Forest explained to him that the cunning Gorleks had decided to add protection to the repository.\n\nThe Gorleks were very fond of the \"string expansion\" operation. They were also very fond of increasing subsequences.\n\nSuppose a string $ s_1s_2s_3 \\ldots s_n $ is given. Then its \"expansion\" is defined as the sequence of strings $ s_1 $ , $ s_1 s_2 $ , ..., $ s_1 s_2 \\ldots s_n $ , $ s_2 $ , $ s_2 s_3 $ , ..., $ s_2 s_3 \\ldots s_n $ , $ s_3 $ , $ s_3 s_4 $ , ..., $ s_{n-1} s_n $ , $ s_n $ . For example, the \"expansion\" the string 'abcd' will be the following sequence of strings: 'a', 'ab', 'abc', 'abcd', 'b', 'bc', 'bcd', 'c', 'cd', 'd'.\n\nTo open the ancient repository, Ori must find the size of the largest increasing subsequence of the \"expansion\" of the string $ s $ . Here, strings are compared lexicographically.\n\nHelp Ori with this task!\n\nA string $ a $ is lexicographically smaller than a string $ b $ if and only if one of the following holds:\n\n- $ a $ is a prefix of $ b $ , but $ a \\ne b $ ;\n- in the first position where $ a $ and $ b $ differ, the string $ a $ has a letter that appears earlier in the alphabet than the corresponding letter in $ b $ .",
    "inputFormat": "Each test contains multiple test cases.\n\nThe first line contains one positive integer $ t $ ( $ 1 \\le t \\le 10^3 $ ), denoting the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains one positive integer $ n $ ( $ 1 \\le n \\le 5000 $ ) — length of the string.\n\nThe second line of each test case contains a non-empty string of length $ n $ , which consists of lowercase latin letters.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 10^4 $ .",
    "outputFormat": "For every test case print one non-negative integer — the answer to the problem.",
    "samples": [
        [
            "7\n5\nacbac\n8\nacabacba\n12\naaaaaaaaaaaa\n10\nabacabadac\n8\ndcbaabcd\n3\ncba\n6\nsparky",
            "9\n17\n12\n29\n14\n3\n9"
        ]
    ],
    "hint": "In first test case the \"expansion\" of the string is: 'a', 'ac', 'acb', 'acba', 'acbac', 'c', 'cb', 'cba', 'cbac', 'b', 'ba', 'bac', 'a', 'ac', 'c'. The answer can be, for example, 'a', 'ac', 'acb', 'acba', 'acbac', 'b', 'ba', 'bac', 'c'.",
    "translation": "给定一个字符串 $s$，将 $s$ 的所有子串按照它在 $s$ 中的出现位置 $l,r$ 排成一列，其中 $l$ 为第一关键字 $r$ 为第二关键字。\n\n求这个字符串序列的最长上升子序列，其中大于的定义是字典序大于。"
}