{
    "description": "The Berland University is preparing to celebrate the 256-th anniversary of its founding! A specially appointed Vice Rector for the celebration prepares to decorate the campus. In the center of the campus $ n $ ice sculptures were erected. The sculptures are arranged in a circle at equal distances from each other, so they form a regular $ n $ -gon. They are numbered in clockwise order with numbers from 1 to $ n $ .\n\nThe site of the University has already conducted a voting that estimated each sculpture's characteristic of $ t_{i} $ — the degree of the sculpture's attractiveness. The values of $ t_{i} $ can be positive, negative or zero.\n\nWhen the university rector came to evaluate the work, he said that this might be not the perfect arrangement. He suggested to melt some of the sculptures so that:\n\n- the remaining sculptures form a regular polygon (the number of vertices should be between 3 and $ n $ ),\n- the sum of the $ t_{i} $ values of the remaining sculptures is maximized.\n\nHelp the Vice Rector to analyze the criticism — find the maximum value of $ t_{i} $ sum which can be obtained in this way. It is allowed not to melt any sculptures at all. The sculptures can not be moved.",
    "inputFormat": "The first input line contains an integer $ n $ ( $ 3<=n<=20000 $ ) — the initial number of sculptures. The second line contains a sequence of integers $ t_{1},t_{2},...,t_{n} $ , $ t_{i} $ — the degree of the $ i $ -th sculpture's attractiveness ( $ -1000<=t_{i}<=1000 $ ). The numbers on the line are separated by spaces.",
    "outputFormat": "Print the required maximum sum of the sculptures' attractiveness.",
    "samples": [
        [
            "8\n1 2 -3 4 -5 5 2 3\n",
            "14\n"
        ],
        [
            "6\n1 -2 3 -4 5 -6\n",
            "9\n"
        ],
        [
            "6\n1 2 3 4 5 6\n",
            "21\n"
        ]
    ],
    "hint": "In the first sample it is best to leave every second sculpture, that is, leave sculptures with attractivenesses: 2, 4, 5 и 3.",
    "translation": "有N[<=20000]个数等距围成一圈，\n\n可以删除其中的一些数，\n\n使剩下的数围成一个正m[3<=m<=N]边形。求剩下的数的最大值。"
}