{
    "description": "$ n $ students attended the first meeting of the Berland SU programming course ( $ n $ is even). All students will be divided into two groups. Each group will be attending exactly one lesson each week during one of the five working days (Monday, Tuesday, Wednesday, Thursday and Friday), and the days chosen for the groups must be different. Furthermore, both groups should contain the same number of students.\n\nEach student has filled a survey in which they told which days of the week are convenient for them to attend a lesson, and which are not.\n\nYour task is to determine if it is possible to choose two different week days to schedule the lessons for the group (the first group will attend the lesson on the first chosen day, the second group will attend the lesson on the second chosen day), and divide the students into two groups, so the groups have equal sizes, and for each student, the chosen lesson day for their group is convenient.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of testcases.\n\nThen the descriptions of $ t $ testcases follow.\n\nThe first line of each testcase contains one integer $ n $ ( $ 2 \\le n \\le 1\\,000 $ ) — the number of students.\n\nThe $ i $ -th of the next $ n $ lines contains $ 5 $ integers, each of them is $ 0 $ or $ 1 $ . If the $ j $ -th integer is $ 1 $ , then the $ i $ -th student can attend the lessons on the $ j $ -th day of the week. If the $ j $ -th integer is $ 0 $ , then the $ i $ -th student cannot attend the lessons on the $ j $ -th day of the week.\n\nAdditional constraints on the input: for each student, at least one of the days of the week is convenient, the total number of students over all testcases doesn't exceed $ 10^5 $ .",
    "outputFormat": "For each testcase print an answer. If it's possible to divide the students into two groups of equal sizes and choose different days for the groups so each student can attend the lesson in the chosen day of their group, print \"YES\" (without quotes). Otherwise, print \"NO\" (without quotes).",
    "samples": [
        [
            "2\n4\n1 0 0 1 0\n0 1 0 0 1\n0 0 0 1 0\n0 1 0 1 0\n2\n0 0 0 1 0\n0 0 0 1 0",
            "YES\nNO"
        ]
    ],
    "hint": "In the first testcase, there is a way to meet all the constraints. For example, the first group can consist of the first and the third students, they will attend the lessons on Thursday (the fourth day); the second group can consist of the second and the fourth students, and they will attend the lessons on Tuesday (the second day).\n\nIn the second testcase, it is impossible to divide the students into groups so they attend the lessons on different days.",
    "translation": "有 $n$ 名学生，分成人数相同的两组，每一组学生都要在星期一、星期二、星期三、星期四、星期五中的一天上一节课。\n\n现在 $n$ 名学生都写了一份表格，告诉你在星期一到星期五中，哪一些日子能听课，哪一些日子不能听课。\n\n现在告诉你 $n$ 名学生写的表格，请你回答，是否能将学生分成相同的两组，使得两组的人数是相等的，并且每一位学生都能够来听课。"
}