{
    "description": "During the hypnosis session, Nicholas suddenly remembered a positive integer $ n $ , which doesn't contain zeros in decimal notation.\n\nSoon, when he returned home, he got curious: what is the maximum number of digits that can be removed from the number so that the number becomes not prime, that is, either composite or equal to one?\n\nFor some numbers doing so is impossible: for example, for number $ 53 $ it's impossible to delete some of its digits to obtain a not prime integer. However, for all $ n $ in the test cases of this problem, it's guaranteed that it's possible to delete some of their digits to obtain a not prime number.\n\nNote that you cannot remove all the digits from the number.\n\nA prime number is a number that has no divisors except one and itself. A composite is a number that has more than two divisors. $ 1 $ is neither a prime nor a composite number.",
    "inputFormat": "Each test contains multiple test cases.\n\nThe first line contains one positive integer $ t $ ( $ 1 \\le t \\le 10^3 $ ), denoting the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains one positive integer $ k $ ( $ 1 \\le k \\le 50 $ ) — the number of digits in the number.\n\nThe second line of each test case contains a positive integer $ n $ , which doesn't contain zeros in decimal notation ( $ 10^{k-1} \\le n < 10^{k} $ ). It is guaranteed that it is always possible to remove less than $ k $ digits to make the number not prime.\n\nIt is guaranteed that the sum of $ k $ over all test cases does not exceed $ 10^4 $ .",
    "outputFormat": "For every test case, print two numbers in two lines. In the first line print the number of digits, that you have left in the number. In the second line print the digits left after all delitions.\n\nIf there are multiple solutions, print any.",
    "samples": [
        [
            "7\n3\n237\n5\n44444\n3\n221\n2\n35\n3\n773\n1\n4\n30\n626221626221626221626221626221",
            "2\n27\n1\n4\n1\n1\n2\n35\n2\n77\n1\n4\n1\n6"
        ]
    ],
    "hint": "In the first test case, you can't delete $ 2 $ digits from the number $ 237 $ , as all the numbers $ 2 $ , $ 3 $ , and $ 7 $ are prime. However, you can delete $ 1 $ digit, obtaining a number $ 27 = 3^3 $ .\n\nIn the second test case, you can delete all digits except one, as $ 4 = 2^2 $ is a composite number.",
    "translation": "## 题目描述\n\n给出一个正整数 $n$，$n$ 中不包含 $0$。求最大删去多少位使其变成一个合数或 $1$。数据保证一定存在答案。\n\n素数是指除 $1$ 和它本身外没有除数的数。合数是指一个有两个以上除数的数。$1$ 既不是质数也不是合数。\n\n## 输入格式\n\n第一行一个正整数 $t(1\\leq t \\leq 10^3)$，表示数据组数。\n\n每组数据第一行一个正整数 $k(1\\leq k\\leq 50)$，表示数字的位数。\n\n第二行一整正整数 $n(10^{k-1}\\leq n \\leq 10^{k})$。\n\n## 输出格式\n\n对于每组数据，第一行输出剩下的数的位数，第二行输出剩下的数。\n\n若有多组解，输出任意一个即可。"
}