{
    "description": "Omkar is creating a mosaic using colored square tiles, which he places in an $ n \\times n $ grid. When the mosaic is complete, each cell in the grid will have either a glaucous or sinoper tile. However, currently he has only placed tiles in some cells.\n\nA completed mosaic will be a mastapeece if and only if each tile is adjacent to exactly $ 2 $ tiles of the same color ( $ 2 $ tiles are adjacent if they share a side.) Omkar wants to fill the rest of the tiles so that the mosaic becomes a mastapeece. Now he is wondering, is the way to do this unique, and if it is, what is it?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\leq n \\leq 2000 $ ).\n\nThen follow $ n $ lines with $ n $ characters in each line. The $ i $ -th character in the $ j $ -th line corresponds to the cell in row $ i $ and column $ j $ of the grid, and will be $ S $ if Omkar has placed a sinoper tile in this cell, $ G $ if Omkar has placed a glaucous tile, $ . $ if it's empty.",
    "outputFormat": "On the first line, print UNIQUE if there is a unique way to get a mastapeece, NONE if Omkar cannot create any, and MULTIPLE if there is more than one way to do so. All letters must be uppercase.\n\nIf you print UNIQUE, then print $ n $ additional lines with $ n $ characters in each line, such that the $ i $ -th character in the $ j^{\\text{th}} $ line is $ S $ if the tile in row $ i $ and column $ j $ of the mastapeece is sinoper, and $ G $ if it is glaucous.",
    "samples": [
        [
            "4\nS...\n..G.\n....\n...S",
            "MULTIPLE"
        ],
        [
            "6\nS.....\n....G.\n..S...\n.....S\n....G.\nG.....",
            "NONE"
        ],
        [
            "10\n.S....S...\n..........\n...SSS....\n..........\n..........\n...GS.....\n....G...G.\n..........\n......G...\n..........",
            "UNIQUE\nSSSSSSSSSS\nSGGGGGGGGS\nSGSSSSSSGS\nSGSGGGGSGS\nSGSGSSGSGS\nSGSGSSGSGS\nSGSGGGGSGS\nSGSSSSSSGS\nSGGGGGGGGS\nSSSSSSSSSS"
        ],
        [
            "1\n.",
            "NONE"
        ]
    ],
    "hint": "For the first test case, Omkar can make the mastapeeces\n\nSSSS\n\nSGGS\n\nSGGS\n\nSSSS\n\nand\n\nSSGG\n\nSSGG\n\nGGSS\n\nGGSS.\n\nFor the second test case, it can be proven that it is impossible for Omkar to add tiles to create a mastapeece.\n\nFor the third case, it can be proven that the given mastapeece is the only mastapeece Omkar can create by adding tiles.\n\nFor the fourth test case, it's clearly impossible for the only tile in any mosaic Omkar creates to be adjacent to two tiles of the same color, as it will be adjacent to $ 0 $ tiles total.",
    "translation": "给您一个 $n \\times n$ 的网格，对所有格子进行黑白染色，每个格子都要与其相邻的格子中恰有 $2$ 个与其颜色相同。\n\n给您一部分颜色已经确定的格子，判断是否存在合法的染色方案且是否唯一，存在的话，请您给出构造。"
}