{
    "description": "The only difference between this problem and D1 is that you don't have to provide the way to construct the answer in D1, but you have to do it in this problem.\n\nThere's a table of $ n \\times m $ cells ( $ n $ rows and $ m $ columns). The value of $ n \\cdot m $ is even.\n\nA domino is a figure that consists of two cells having a common side. It may be horizontal (one of the cells is to the right of the other) or vertical (one of the cells is above the other).\n\nYou need to place $ \\frac{nm}{2} $ dominoes on the table so that exactly $ k $ of them are horizontal and all the other dominoes are vertical. The dominoes cannot overlap and must fill the whole table.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nEach test case consists of a single line. The line contains three integers $ n $ , $ m $ , $ k $ ( $ 1 \\le n,m \\le 100 $ , $ 0 \\le k \\le \\frac{nm}{2} $ , $ n \\cdot m $ is even) — the count of rows, columns and horizontal dominoes, respectively.",
    "outputFormat": "For each test case:\n\n- print \"NO\" if it's not possible to place the dominoes on the table in the described way;\n- otherwise, print \"YES\" on a separate line, then print $ n $ lines so that each of them contains $ m $ lowercase letters of the Latin alphabet — the layout of the dominoes on the table. Each cell of the table must be marked by the letter so that for every two cells having a common side, they are marked by the same letters if and only if they are occupied by the same domino. I.e. both cells of the same domino must be marked with the same letter, but two dominoes that share a side must be marked with different letters. If there are multiple solutions, print any of them.",
    "samples": [
        [
            "8\n4 4 2\n2 3 0\n3 2 3\n1 2 0\n2 4 2\n5 2 2\n2 17 16\n2 1 1",
            "YES\naccx\naegx\nbega\nbdda\nYES\naha\naha\nYES\nzz\naa\nzz\nNO\nYES\naaza\nbbza\nNO\nYES\nbbaabbaabbaabbaay\nddccddccddccddccy\nNO"
        ]
    ],
    "hint": "",
    "translation": "定义多米诺是像下图一样由两个单元格组成的图形。给定 $n,m,k$ （$n,m\\le 100,k\\le \\frac {nm}2$，$nm$ 为偶数），求是否可以将一个 $n\\times m$ 的方格（$n$ 行 $m$ 列）用多米诺密铺（不重不漏地铺满），其中横向的多米诺有 $k$ 个。若可以，则给出任意一种构造方案。\n\n![](https://cdn.jsdelivr.net/gh/william-song-shy/wodepicgotuchuang/image/20210724122654.png)\n\n横向的多米诺定义为两个单元格在同一行的多米诺，如上图就不是横向的多米诺，而是一个竖向的多米诺。\n\n输出方案时，输出一个由小写字母组成的 $n\\times m$ 的字母矩阵，两个相邻的单元格拥有相同的字母表明这两个单元格由一个多米诺覆盖，否则不算。\n\n**多组数据**"
}