{
    "description": "Today we will be playing a red and white colouring game (no, this is not the Russian Civil War; these are just the colours of the Canadian flag).\n\nYou are given an $ n \\times m $ grid of \"R\", \"W\", and \".\" characters. \"R\" is red, \"W\" is white and \".\" is blank. The neighbours of a cell are those that share an edge with it (those that only share a corner do not count).\n\nYour job is to colour the blank cells red or white so that every red cell only has white neighbours (and no red ones) and every white cell only has red neighbours (and no white ones). You are not allowed to recolour already coloured cells.",
    "inputFormat": "The first line contains $ t $ ( $ 1 \\le t \\le 100 $ ), the number of test cases.\n\nIn each test case, the first line will contain $ n $ ( $ 1 \\le n \\le 50 $ ) and $ m $ ( $ 1 \\le m \\le 50 $ ), the height and width of the grid respectively.\n\nThe next $ n $ lines will contain the grid. Each character of the grid is either 'R', 'W', or '.'.",
    "outputFormat": "For each test case, output \"YES\" if there is a valid grid or \"NO\" if there is not.\n\nIf there is, output the grid on the next $ n $ lines. If there are multiple answers, print any.\n\nIn the output, the \"YES\"s and \"NO\"s are case-insensitive, meaning that outputs such as \"yEs\" and \"nO\" are valid. However, the grid is case-sensitive.",
    "samples": [
        [
            "3\n4 6\n.R....\n......\n......\n.W....\n4 4\n.R.W\n....\n....\n....\n5 1\nR\nW\nR\nW\nR",
            "YES\nWRWRWR\nRWRWRW\nWRWRWR\nRWRWRW\nNO\nYES\nR\nW\nR\nW\nR"
        ]
    ],
    "hint": "The answer for the first example case is given in the example output, and it can be proven that no grid exists that satisfies the requirements of the second example case. In the third example all cells are initially coloured, and the colouring is valid.",
    "translation": "给定一个带有 `'R'`，`'W'` 和 `'.'` 的 $n$ 行 $m$ 列的字符矩阵。\n\n请你将**所有** `'.'` 的位置换成 `'R'` 或者 `'W'`，要求最终每个 `'R'` 的位置上下左右没有 `'R'`，每个 `'W'` 的位置上下左右没有 `'W'`。\n\n如果做不到，输出 `NO`。\n\n否则输出 `YES`，并且输出方案。\n\n**输入有 $t$ 组数据，$t \\le 100$。**\n\n对于每组数据，$n,m \\le 50$，输入字符只有 `'R'`，`'W'` 和 `'.'`。\n\n翻译提供 HoshizoraZ"
}