{
    "description": "Polycarp came up with a new programming language. There are only two types of statements in it:\n\n- \"x := s\": assign the variable named x the value s (where s is a string). For example, the statement var := hello assigns the variable named var the value hello. Note that s is the value of a string, not the name of a variable. Between the variable name, the := operator and the string contains exactly one space each.\n- \"x = a + b\": assign the variable named x the concatenation of values of two variables a and b. For example, if the program consists of three statements a := hello, b := world, c = a + b, then the variable c will contain the string helloworld. It is guaranteed that the program is correct and the variables a and b were previously defined. There is exactly one space between the variable names and the = and + operators.\n\nAll variable names and strings only consist of lowercase letters of the English alphabet and do not exceed $ 5 $ characters.\n\nThe result of the program is the number of occurrences of string haha in the string that was written to the variable in the last statement.\n\nPolycarp was very tired while inventing that language. He asks you to implement it. Your task is — for given program statements calculate the number of occurrences of string haha in the last assigned variable.",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\le t \\le 10^3 $ ). Then $ t $ test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 50 $ ) — the number of statements in the program. All variable names and strings are guaranteed to consist only of lowercase letters of the English alphabet and do not exceed $ 5 $ characters.\n\nThis is followed by $ n $ lines describing the statements in the format described above. It is guaranteed that the program is correct.",
    "outputFormat": "For each set of input data, output the number of occurrences of the haha substring in the string that was written to the variable in the last statement.",
    "samples": [
        [
            "4\n6\na := h\nb := aha\nc = a + b\nc = c + c\ne = c + c\nd = a + c\n15\nx := haha\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\nx = x + x\n1\nhaha := hah\n5\nhaahh := aaaha\nahhhh = haahh + haahh\nhaahh = haahh + haahh\nahhhh = ahhhh + haahh\nahhaa = haahh + ahhhh",
            "3\n32767\n0\n0"
        ]
    ],
    "hint": "In the first test case the resulting value of d is hhahahaha.",
    "translation": "$t$ 组数据，每组数据给定 $n$ 个操作,每个操作为以下两者之一：\n\n- `x = a + b` 表示将变量 `b` 和 `a` 中的字符串拼接后赋给 `x`。\n\n- `x := s` 表示将字符串 `s` 赋给 `x`。\n\n对于每组数据，求最后一次操作中变量 `x` 中的字符串所含有子串 `haha` 的个数。\n\n$t\\leq 10^3,n\\leq 50$。给出的所有变量名或字符串的长度均 $\\leq 5$，且所有字母都是小写字母。\n \nTranslated by LinkZelda。"
}