{
    "description": "You are given $ n $ lengths of segments that need to be placed on an infinite axis with coordinates.\n\nThe first segment is placed on the axis so that one of its endpoints lies at the point with coordinate $ 0 $ . Let's call this endpoint the \"start\" of the first segment and let's call its \"end\" as that endpoint that is not the start.\n\nThe \"start\" of each following segment must coincide with the \"end\" of the previous one. Thus, if the length of the next segment is $ d $ and the \"end\" of the previous one has the coordinate $ x $ , the segment can be placed either on the coordinates $ [x-d, x] $ , and then the coordinate of its \"end\" is $ x - d $ , or on the coordinates $ [x, x+d] $ , in which case its \"end\" coordinate is $ x + d $ .\n\nThe total coverage of the axis by these segments is defined as their overall union which is basically the set of points covered by at least one of the segments. It's easy to show that the coverage will also be a segment on the axis. Determine the minimal possible length of the coverage that can be obtained by placing all the segments on the axis without changing their order.",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases.\n\nThe next $ 2t $ lines contain descriptions of the test cases.\n\nThe first line of each test case description contains an integer $ n $ ( $ 1 \\le n \\le 10^4 $ ) — the number of segments. The second line of the description contains $ n $ space-separated integers $ a_i $ ( $ 1 \\le a_i \\le 1000 $ ) — lengths of the segments in the same order they should be placed on the axis.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 10^4 $ .",
    "outputFormat": "Print $ t $ lines, each line containing the answer to the corresponding test case. The answer to a test case should be a single integer — the minimal possible length of the axis coverage.",
    "samples": [
        [
            "6\n2\n1 3\n3\n1 2 3\n4\n6 2 3 9\n4\n6 8 4 5\n7\n1 2 4 6 7 7 3\n8\n8 6 5 1 2 2 3 6",
            "3\n3\n9\n9\n7\n8"
        ]
    ],
    "hint": "In the third sample test case the segments should be arranged as follows: $ [0, 6] \\rightarrow [4, 6] \\rightarrow [4, 7] \\rightarrow [-2, 7] $ . As you can see, the last segment $ [-2, 7] $ covers all the previous ones, and the total length of coverage is $ 9 $ .\n\nIn the fourth sample test case the segments should be arranged as $ [0, 6] \\rightarrow [-2, 6] \\rightarrow [-2, 2] \\rightarrow [2, 7] $ . The union of these segments also occupies the area $ [-2, 7] $ and has the length of $ 9 $ .",
    "translation": "有多组数据\n- 给你 $n$ 条线段，告诉你每条线段的**长度**。\n- 你需要把它们放在一条**无限长的数轴**上。\n- 放置需满足**当前线段的起点**是**前一个线段的终点**，特别的第一个线段的起点为 $0$。\n\n也就是说，若前一个线段的终点是 $x$,当前长度为 $d$, 那么这个线段必须放在 $[x-d,x]$ 终点变为 $x-d$，或 $[x, x + d]$ 终点变为 $x + d$。\n- 请问放置完后所有线段的最小覆盖长度是多少？\n- $1\\le t\\le 10^4, 1\\le n\\le 10^4$"
}