{
    "description": "You are given a simple undirected graph with $ n $ vertices, $ n $ is even. You are going to write a letter on each vertex. Each letter should be one of the first $ k $ letters of the Latin alphabet.\n\nA path in the graph is called Hamiltonian if it visits each vertex exactly once. A string is called palindromic if it reads the same from left to right and from right to left. A path in the graph is called palindromic if the letters on the vertices in it spell a palindromic string without changing the order.\n\nA string of length $ n $ is good if:\n\n- each letter is one of the first $ k $ lowercase Latin letters;\n- if you write the $ i $ -th letter of the string on the $ i $ -th vertex of the graph, there will exist a palindromic Hamiltonian path in the graph.\n\nNote that the path doesn't necesserily go through the vertices in order $ 1, 2, \\dots, n $ .\n\nCount the number of good strings.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ k $ ( $ 2 \\le n \\le 12 $ ; $ n $ is even; $ 0 \\le m \\le \\frac{n \\cdot (n-1)}{2} $ ; $ 1 \\le k \\le 12 $ ) — the number of vertices in the graph, the number of edges in the graph and the number of first letters of the Latin alphabet that can be used.\n\nEach of the next $ m $ lines contains two integers $ v $ and $ u $ ( $ 1 \\le v, u \\le n $ ; $ v \\neq u $ ) — the edges of the graph. The graph doesn't contain multiple edges and self-loops.",
    "outputFormat": "Print a single integer — number of good strings.",
    "samples": [
        [
            "4 3 3\n1 2\n2 3\n3 4",
            "9"
        ],
        [
            "4 6 3\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4",
            "21"
        ],
        [
            "12 19 12\n1 3\n2 6\n3 6\n3 7\n4 8\n8 5\n8 7\n9 4\n5 9\n10 1\n10 4\n10 6\n9 10\n11 1\n5 11\n7 11\n12 2\n12 5\n12 11",
            "456165084"
        ]
    ],
    "hint": "",
    "translation": "给你一个有 $n$ 个顶点的简单无向图（即无重边自环），$n$ 是偶数。你要在每个顶点上写一个字符。每个字符都应该是小写拉丁字母表中的头 $k$ 之一。\n\n对于图上的一条路径，如果恰好访问每个顶点一次，则称其为哈密顿路径。对于一个字符串，如果从左到右和从右到左读是一样的，则称其为回文串。对于一条哈密顿路径，如果按照路径的顺序将顶点上的字符连成一个字符串，这个字符串是一个回文串，则称其为回文哈密顿路径。\n\n对于一个长度为 $n$ 的字符串，若满足以下条件，则称其是”好的“：\n\n- 字符串中的每个字符都是小写拉丁字母表中的头 $k$ 之一；\n- 如果将字符串的第 $i$ 个字符写在图中编号为 $i$ 的顶点上，则图中会存在一条回文哈密顿路径。\n\n请注意，路径不必按 $1,2,\\cdots,n$ 的编号顺序穿过顶点。\n\n计算”好的“字符串的数量。"
}