{
    "description": "Sherlock Holmes and Dr. Watson played some game on a checkered board $ n×n $ in size. During the game they put numbers on the board's squares by some tricky rules we don't know. However, the game is now over and each square of the board contains exactly one number. To understand who has won, they need to count the number of winning squares. To determine if the particular square is winning you should do the following. Calculate the sum of all numbers on the squares that share this column (including the given square) and separately calculate the sum of all numbers on the squares that share this row (including the given square). A square is considered winning if the sum of the column numbers is strictly greater than the sum of the row numbers.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF157A/8e82a62fc40e8c85c587df26e27e37875a9c9b9b.png)For instance, lets game was ended like is shown in the picture. Then the purple cell is winning, because the sum of its column numbers equals $ 8+3+6+7=24 $ , sum of its row numbers equals $ 9+5+3+2=19 $ , and $ 24&gt;19 $ .",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=30 $ ). Each of the following $ n $ lines contain $ n $ space-separated integers. The $ j $ -th number on the $ i $ -th line represents the number on the square that belongs to the $ j $ -th column and the $ i $ -th row on the board. All number on the board are integers from $ 1 $ to $ 100 $ .",
    "outputFormat": "Print the single number — the number of the winning squares.",
    "samples": [
        [
            "1\n1\n",
            "0\n"
        ],
        [
            "2\n1 2\n3 4\n",
            "2\n"
        ],
        [
            "4\n5 7 8 4\n9 5 3 2\n1 6 6 4\n9 5 7 3\n",
            "6\n"
        ]
    ],
    "hint": "In the first example two upper squares are winning.\n\nIn the third example three left squares in the both middle rows are winning:\n\n`5 7 8 4<br></br><span class=\"tex-font-style-bf\"><span class=\"tex-font-style-it\"> $ 9 $   $ 5 $   $ 3 $ </span></span> 2<br></br><span class=\"tex-font-style-bf\"><span class=\"tex-font-style-it\"> $ 1 $   $ 6 $   $ 6 $ </span></span> 4<br></br>9 5 7 3<br></br>`",
    "translation": "## 题意\n福尔摩斯和华生在一个n * n的棋盘上玩添数游戏。在游戏期间，他们放置一些数到棋盘上，（其中的规则我们不知道）。然而，现在游戏结束了，棋盘中都有一个数字。要知道谁赢，他们需要计算获胜方块的数量。如果要确定特定的方块是否获胜，你需要做到以下几点。分别计算出这个方块所在的纵列上所有数的和（包括自身）和计算出这个方块所在的横列上所有数的和（包括自身）。如果纵列的和大于横列的和，那么这个方块就算一个获胜方块。\n如图所示，真是一个结束的棋局。\n然后，紫色格子获胜，因为其纵列之和（8+3+6+7=24）大于其横列（9+5+3+2=19）之和，以及24>1924>1924>19。\n## 输入格式\n第一行包含一个整数n（1<=n<=30）。\n接下来n行，每行n个数，每个数用空格隔开。第i行上的第j个数字表示棋盘上地i行第j列方格上的数字。棋盘上所有数字大于等于1，小于等于100。\n## 输出格式\n输出一个数字——获胜方块的数量。"
}