{
    "description": "Hemose was shopping with his friends Samez, AhmedZ, AshrafEzz, TheSawan and O\\_E in Germany. As you know, Hemose and his friends are problem solvers, so they are very clever. Therefore, they will go to all discount markets in Germany.\n\nHemose has an array of $ n $ integers. He wants Samez to sort the array in the non-decreasing order. Since it would be a too easy problem for Samez, Hemose allows Samez to use only the following operation:\n\n- Choose indices $ i $ and $ j $ such that $ 1 \\le i, j \\le n $ , and $ \\lvert i - j \\rvert \\geq x $ . Then, swap elements $ a_i $ and $ a_j $ .\n\nCan you tell Samez if there's a way to sort the array in the non-decreasing order by using the operation written above some finite number of times (possibly $ 0 $ )?",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ $ (1 \\leq t \\leq 10^5) $ . Description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ and $ x $ $ (1 \\leq x \\leq n \\leq 10^5) $ .\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, ..., a_n $ $ (1 \\leq a_i \\leq 10^9) $ .\n\nIt is guaranteed that the sum of $ n $ over all test cases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, you should output a single string.\n\nIf Samez can sort the array in non-decreasing order using the operation written above, output \"YES\" (without quotes). Otherwise, output \"NO\" (without quotes).\n\nYou can print each letter of \"YES\" and \"NO\" in any case (upper or lower).",
    "samples": [
        [
            "4\n3 3\n3 2 1\n4 3\n1 2 3 4\n5 2\n5 1 2 3 4\n5 4\n1 2 3 4 4",
            "NO\nYES\nYES\nYES"
        ]
    ],
    "hint": "In the first test case, you can't do any operations.\n\nIn the second test case, the array is already sorted.\n\nIn the third test case, you can do the operations as follows:\n\n- $ [5,1,2,3,4] $ , $ swap(a_1,a_3) $\n- $ [2,1,5,3,4] $ , $ swap(a_2,a_5) $\n- $ [2,4,5,3,1] $ , $ swap(a_2,a_4) $\n- $ [2,3,5,4,1] $ , $ swap(a_1,a_5) $\n- $ [1,3,5,4,2] $ , $ swap(a_2,a_5) $\n- $ [1,2,5,4,3] $ , $ swap(a_3,a_5) $\n- $ [1,2,3,4,5] $\n\n(Here $ swap(a_i, a_j) $ refers to swapping elements at positions $ i $ , $ j $ ).",
    "translation": "给你两个数 $n, x$，代表有 $n$ 个元素。\n\n然后输入 $n$ 个元素。\n\n现在问你，能否通过交换两个距离大于等于 $x$ 的数，使得数组可以按照非递减的顺序来排序。\n\n如果可以，输出 `YES`，否则，输出 `NO`。\n\n注：$a$ 和 $b$ 的距离是：$\n\\lvert a - b \\rvert$"
}