{
    "description": "You are given a digital clock with $ n $ digits. Each digit shows an integer from $ 0 $ to $ 9 $ , so the whole clock shows an integer from $ 0 $ to $ 10^n-1 $ . The clock will show leading zeroes if the number is smaller than $ 10^{n-1} $ .\n\nYou want the clock to show $ 0 $ with as few operations as possible. In an operation, you can do one of the following:\n\n- decrease the number on the clock by $ 1 $ , or\n- swap two digits (you can choose which digits to swap, and they don't have to be adjacent).\n\nYour task is to determine the minimum number of operations needed to make the clock show $ 0 $ .",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^3 $ ).\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 100 $ ) — number of digits on the clock.\n\nThe second line of each test case contains a string of $ n $ digits $ s_1, s_2, \\ldots, s_n $ ( $ 0 \\le s_1, s_2, \\ldots, s_n \\le 9 $ ) — the number on the clock.\n\nNote: If the number is smaller than $ 10^{n-1} $ the clock will show leading zeroes.",
    "outputFormat": "For each test case, print one integer: the minimum number of operations needed to make the clock show $ 0 $ .",
    "samples": [
        [
            "7\n3\n007\n4\n1000\n5\n00000\n3\n103\n4\n2020\n9\n123456789\n30\n001678294039710047203946100020",
            "7\n2\n0\n5\n6\n53\n115"
        ]
    ],
    "hint": "In the first example, it's optimal to just decrease the number $ 7 $ times.\n\nIn the second example, we can first swap the first and last position and then decrease the number by $ 1 $ .\n\nIn the third example, the clock already shows $ 0 $ , so we don't have to perform any operations.",
    "translation": "**题目描述**\n\n给定一个字符串，定义一次操作为将字符串的最后一位 $-1$，或交换字符串中的任意两位。求把字符串所有位变成 $0$ 的最少操作次数。\n\n**输入格式**\n\n第一行一个整数 $t$，为测试数据的组数。\n\n接下来 $2\\times t$ 行，每两行一个数字和一个字符串，分别表示字符串的长度和字符串。详细信息见题目描述。\n\n**输出格式**\n\n共 $t$ 行，一行一个正整数，为把字符串所有位变成 $0$ 的最少操作次数。\n\n**说明/提示**\n\n对于 $100\\%$ 的数据，$1\\le t\\le10^3$，$1\\le n\\le 100$，$0\\le s_1,s_2,\\cdots,s_n\\le 9$。\n\n对于第一组询问，只需要将末尾操作 $7$ 次即可符合要求。输出 $7$。\n\n对于第二组询问，交换首位和末尾，再将末尾 $-1$，共进行 $2$ 次操作。输出 $2$。\n\n对于第三组询问，字符串已经全部为 $0$，故不需要进行任何操作。输出 $0$。\n\ntranslate by @[159号程序员](https://www.luogu.com.cn/user/334586)"
}