{
    "description": "Moamen has an array of $ n $ distinct integers. He wants to sort that array in non-decreasing order by doing the following operations in order exactly once:\n\n1. Split the array into exactly $ k $ non-empty subarrays such that each element belongs to exactly one subarray.\n2. Reorder these subarrays arbitrary.\n3. Merge the subarrays in their new order.\n\nA sequence $ a $ is a subarray of a sequence $ b $ if $ a $ can be obtained from $ b $ by deletion of several (possibly, zero or all) elements from the beginning and several (possibly, zero or all) elements from the end.\n\nCan you tell Moamen if there is a way to sort the array in non-decreasing order using the operations written above?",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^3 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ and $ k $ ( $ 1 \\le k \\le n \\le 10^5 $ ).\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le |a_i| \\le 10^9 $ ). It is guaranteed that all numbers are distinct.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 3\\cdot10^5 $ .",
    "outputFormat": "For each test case, you should output a single string.\n\nIf Moamen can sort the array in non-decreasing order, output \"YES\" (without quotes). Otherwise, output \"NO\" (without quotes).\n\nYou can print each letter of \"YES\" and \"NO\" in any case (upper or lower).",
    "samples": [
        [
            "3\n5 4\n6 3 4 2 1\n4 2\n1 -4 0 -2\n5 1\n1 2 3 4 5",
            "Yes\nNo\nYes"
        ]
    ],
    "hint": "In the first test case, $ a = [6, 3, 4, 2, 1] $ , and $ k = 4 $ , so we can do the operations as follows:\n\n1. Split $ a $ into $ \\{ [6], [3, 4], [2], [1] \\} $ .\n2. Reorder them: $ \\{ [1], [2], [3,4], [6] \\} $ .\n3. Merge them: $ [1, 2, 3, 4, 6] $ , so now the array is sorted.\n\nIn the second test case, there is no way to sort the array by splitting it into only $ 2 $ subarrays.\n\nAs an example, if we split it into $ \\{ [1, -4], [0, -2] \\} $ , we can reorder them into $ \\{ [1, -4], [0, -2] \\} $ or $ \\{ [0, -2], [1, -4] \\} $ . However, after merging the subarrays, it is impossible to get a sorted array.",
    "translation": "给定一个大小为 $n$ 的数组。你可以将其分为 $k$ 个子数组，并按照每个子数组的字典序重新排列这些子数组，再顺次拼接，得到一个新的数组。问是否存在一种划分子数组的方案，使得重新拼接后的数组是单调不降的？\n\n$t$ 组数据，$1\\leqslant t\\leqslant 1000$，$1\\leqslant k\\leqslant n\\leqslant 10^5$，$0\\leqslant |a_i|\\leqslant 10^9$，$\\sum n\\leqslant 3\\times 10^5$。\n\nTranslated by Eason_AC  \n2021.8.11"
}