{
    "description": "This is an interactive problem.\n\nThis is an easy version of the problem. The difference from the hard version is that in the easy version $ t=1 $ and the number of queries is limited to $ 20 $ .\n\nPolycarp is playing a computer game. In this game, an array consisting of zeros and ones is hidden. Polycarp wins if he guesses the position of the $ k $ -th zero from the left $ t $ times.\n\nPolycarp can make no more than $ 20 $ requests of the following type:\n\n- ? $ l $ $ r $ — find out the sum of all elements in positions from $ l $ to $ r $ ( $ 1 \\le l \\le r \\le n $ ) inclusive.\n\nIn this (easy version) of the problem, this paragraph doesn't really make sense since $ t=1 $ always. To make the game more interesting, each guessed zero turns into one and the game continues on the changed array. More formally, if the position of the $ k $ -th zero was $ x $ , then after Polycarp guesses this position, the $ x $ -th element of the array will be replaced from $ 0 $ to $ 1 $ . Of course, this feature affects something only for $ t>1 $ .\n\nHelp Polycarp win the game.",
    "inputFormat": "",
    "outputFormat": "First, your program must read two integers $ n $ and $ t $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ , $ t=1 $ ).\n\nThen $ t $ lines follow, each of which contains one integer $ k $ ( $ 1 \\le k \\le n $ ). It is guaranteed that at the moment of the request the array contains at least $ k $ zeros. In order to get the next value of $ k $ , you must output the answer for the current value of $ k $ .\n\nAfter that, you can make no more than $ 20 $ requests.\n\nUse the following format to output the answer (it is not a request, it doesn't count in $ 20 $ ):\n\n- ! $ x $ — position of the $ k $ -th zero.\n\nPositions in the array are numbered from left to right from $ 1 $ to $ n $ inclusive.\n\nAfter printing $ t $ answers, your program should exit immediately.\n\nIn this task, the interactor is not adaptive. This means that within the same test, the hidden array and the queries do not change.\n\nIn case of an incorrect query, -1 will be displayed. When this value is received, your program must immediately exit normally (for example, by calling exit(0)), otherwise, the testing system may issue an arbitrary verdict.\n\nIf the number of requests is exceeded, the verdict wrong answer will be displayed.\n\nYour solution may get the verdict Idleness limit exceeded if you don't print anything or forget to flush the output buffer.\n\nTo flush the output buffer, you need to do the following immediately after the query output and the end-of-line character:\n\n- fflush(stdout) or cout.flush() in C ++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see the documentation for other languages.\n\nHacks\n\nUse the following format for hacks:\n\nOn the first line print the string $ s $ ( $ 1 \\le |s| \\le 2 \\cdot 10^5 $ ), consisting of zeros and ones, and an integer $ t $ ( $ t = 1 $ ) — hidden array and number of requests, respectively. In the next $ t $ lines output the number $ k $ ( $ 1 \\le k \\le |s| $ ).\n\nThe hacked solution will not have direct access to the hidden array.",
    "samples": [
        [
            "6 1\n2\n\n2\n\n1\n\n1\n\n0\n\n0",
            "? 4 6\n\n? 1 1\n\n? 1 2\n\n? 2 2\n\n? 5 5\n\n! 5"
        ]
    ],
    "hint": "In the first test, the $ [1, 0, 1, 1, 0, 1] $ array is hidden. In this test $ k=2 $ .",
    "translation": "交互题。给定 $n,t,k$（由于这里是简单版，保证 $t=1$，即 $t$ 没啥用），有一个长度为 $n$ 的标号为 $1\\cdots n$ 的仅含 $01$ 的数组，你每次可以询问 $l$ 到 $r$ 的和，需要得出数组中第 $k$ 个 $0$ 的下标。最多询问 $20$ 次。"
}