{
    "description": "You are given a matrix, consisting of $ n $ rows and $ m $ columns. The rows are numbered top to bottom, the columns are numbered left to right.\n\nEach cell of the matrix can be either free or locked.\n\nLet's call a path in the matrix a staircase if it:\n\n- starts and ends in the free cell;\n- visits only free cells;\n- has one of the two following structures: \n  1. the second cell is $ 1 $ to the right from the first one, the third cell is $ 1 $ to the bottom from the second one, the fourth cell is $ 1 $ to the right from the third one, and so on;\n  2. the second cell is $ 1 $ to the bottom from the first one, the third cell is $ 1 $ to the right from the second one, the fourth cell is $ 1 $ to the bottom from the third one, and so on.\n\nIn particular, a path, consisting of a single cell, is considered to be a staircase.\n\nHere are some examples of staircases:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1598E/30e6b70a090f9657a06b957e8113944b3c2b16f3.png)Initially all the cells of the matrix are free.\n\nYou have to process $ q $ queries, each of them flips the state of a single cell. So, if a cell is currently free, it makes it locked, and if a cell is currently locked, it makes it free.\n\nPrint the number of different staircases after each query. Two staircases are considered different if there exists such a cell that appears in one path and doesn't appear in the other path.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ q $ ( $ 1 \\le n, m \\le 1000 $ ; $ 1 \\le q \\le 10^4 $ ) — the sizes of the matrix and the number of queries.\n\nEach of the next $ q $ lines contains two integers $ x $ and $ y $ ( $ 1 \\le x \\le n $ ; $ 1 \\le y \\le m $ ) — the description of each query.",
    "outputFormat": "Print $ q $ integers — the $ i $ -th value should be equal to the number of different staircases after $ i $ queries. Two staircases are considered different if there exists such a cell that appears in one path and doesn't appear in the other path.",
    "samples": [
        [
            "2 2 8\n1 1\n1 1\n1 1\n2 2\n1 1\n1 2\n2 1\n1 1",
            "5\n10\n5\n2\n5\n3\n1\n0"
        ],
        [
            "3 4 10\n1 4\n1 2\n2 3\n1 2\n2 3\n3 2\n1 3\n3 4\n1 3\n3 1",
            "49\n35\n24\n29\n49\n39\n31\n23\n29\n27"
        ],
        [
            "1000 1000 2\n239 634\n239 634",
            "1332632508\n1333333000"
        ]
    ],
    "hint": "",
    "translation": "给定一个n*m的网格，每个格子为黑色或白色，初始时所有格子均为白色。\n\n定义满足如下条件的路径为楼梯：\n\n* 起点和终点均为白色\n* 路径上的所有点均为白色\n* 满足以下两种结构之一\n  \n  1.第二个格子在第一个格子右面，第三个格子在第二个格子下面，第四个格子在第三个格子右面，以此类推……\n  \n  2.第二个格子在第一个格子下面，第三个格子在第二个格子右面，第四个格子在第三个格子下面，以此类推……\n  \n此外，一个单独的白色格子也被视为一个楼梯。\n\n给定q个询问，每个询问给定整数x、y，并将格子（x,y）颜色翻转。\n\n输出每次操作后网格中不同楼梯的个数（操作不独立）。"
}