{
    "description": "A tree is a connected graph without cycles. A rooted tree has a special vertex called the root. The parent of a vertex $ v $ (different from root) is the previous to $ v $ vertex on the shortest path from the root to the vertex $ v $ . Children of the vertex $ v $ are all vertices for which $ v $ is the parent.\n\nA vertex is a leaf if it has no children. We call a vertex a bud, if the following three conditions are satisfied:\n\n- it is not a root,\n- it has at least one child, and\n- all its children are leaves.\n\nYou are given a rooted tree with $ n $ vertices. The vertex $ 1 $ is the root. In one operation you can choose any bud with all its children (they are leaves) and re-hang them to any other vertex of the tree. By doing that you delete the edge connecting the bud and its parent and add an edge between the bud and the chosen vertex of the tree. The chosen vertex cannot be the bud itself or any of its children. All children of the bud stay connected to the bud.\n\nWhat is the minimum number of leaves it is possible to get if you can make any number of the above-mentioned operations (possibly zero)?",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — the number of the vertices in the given tree.\n\nEach of the next $ n-1 $ lines contains two integers $ u $ and $ v $ ( $ 1 \\le u, v \\le n $ , $ u \\neq v $ ) meaning that there is an edge between vertices $ u $ and $ v $ in the tree.\n\nIt is guaranteed that the given graph is a tree.\n\nIt is guaranteed that the sum of $ n $ over all test cases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case print a single integer — the minimal number of leaves that is possible to get after some operations.",
    "samples": [
        [
            "5\n7\n1 2\n1 3\n1 4\n2 5\n2 6\n4 7\n6\n1 2\n1 3\n2 4\n2 5\n3 6\n2\n1 2\n7\n7 3\n1 5\n1 3\n4 6\n4 7\n2 1\n6\n2 1\n2 3\n4 5\n3 4\n3 6",
            "2\n2\n1\n2\n1"
        ]
    ],
    "hint": "In the first test case the tree looks as follows:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1566E/0d2a2e94983d55330dac54f278d1a33d1eb1221d.png)Firstly you can choose a bud vertex $ 4 $ and re-hang it to vertex $ 3 $ . After that you can choose a bud vertex $ 2 $ and re-hang it to vertex $ 7 $ . As a result, you will have the following tree with $ 2 $ leaves:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1566E/146e9305c79679a883d051dcc15fe610857df849.png)It can be proved that it is the minimal number of leaves possible to get.\n\nIn the second test case the tree looks as follows:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1566E/c78997ae531f85421ad1ff3c7eaaf49571559377.png)You can choose a bud vertex $ 3 $ and re-hang it to vertex $ 5 $ . As a result, you will have the following tree with $ 2 $ leaves:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1566E/b4fd18b6b31191b690cb273c6f18bb397eaf968d.png)It can be proved that it is the minimal number of leaves possible to get.",
    "translation": "对于一棵有根树，定义一个节点 $i$ 是叶子结点，仅当 $i$ 没有子节点。进一步定义一个节点 $i$ 是“可移动节点”，仅当 $i$ 不是根、不是叶子节点且其所有直接相连的子节点都是叶子结点。  \n你可以对任意“可移动节点” $i$ 进行下列操作任意次：\n\n- 断开 $i$ 与其父亲节点的边，选择任意一个不属于节点 $i$ 及其子树的节点 $j$ 并在 $i,j$ 之间连边。\n\n给定一棵以节点 $1$ 为根的 $n$ 个节点的有根树，求经过若干次操作后，这棵树最少有几个叶子结点。$T$ 组数据。\n\n保证：  \n$1\\leq T\\leq10^4;1\\leq n,\\sum n\\leq2\\times10^5;$  \n给定的是棵树。"
}