{
    "description": "The tycoon of a winery empire in Mondstadt, unmatched in every possible way. A thinker in the Knights of Favonius with an exotic appearance.\n\nThis time, the brothers are dealing with a strange piece of wood marked with their names. This plank of wood can be represented as a string of $ n $ characters. Each character is either a 'D' or a 'K'. You want to make some number of cuts (possibly $ 0 $ ) on this string, partitioning it into several contiguous pieces, each with length at least $ 1 $ . Both brothers act with dignity, so they want to split the wood as evenly as possible. They want to know the maximum number of pieces you can split the wood into such that the ratios of the number of occurrences of 'D' to the number of occurrences of 'K' in each chunk are the same.\n\nKaeya, the curious thinker, is interested in the solution for multiple scenarios. He wants to know the answer for every prefix of the given string. Help him to solve this problem!\n\nFor a string we define a ratio as $ a:b $ where 'D' appears in it $ a $ times, and 'K' appears $ b $ times. Note that $ a $ or $ b $ can equal $ 0 $ , but not both. Ratios $ a:b $ and $ c:d $ are considered equal if and only if $ a\\cdot d = b\\cdot c $ .\n\nFor example, for the string 'DDD' the ratio will be $ 3:0 $ , for 'DKD' — $ 2:1 $ , for 'DKK' — $ 1:2 $ , and for 'KKKKDD' — $ 2:4 $ . Note that the ratios of the latter two strings are equal to each other, but they are not equal to the ratios of the first two strings.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ). Description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\leq n \\leq 5 \\cdot 10^5 $ ) — the length of the wood.\n\nThe second line of each test case contains a string $ s $ of length $ n $ . Every character of $ s $ will be either 'D' or 'K'.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 5 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, output $ n $ space separated integers. The $ i $ -th of these numbers should equal the answer for the prefix $ s_{1},s_{2},\\dots,s_{i} $ .",
    "samples": [
        [
            "5\n3\nDDK\n6\nDDDDDD\n4\nDKDK\n1\nD\n9\nDKDKDDDDK",
            "1 2 1 \n1 2 3 4 5 6 \n1 1 1 2 \n1 \n1 1 1 2 1 2 1 1 3"
        ]
    ],
    "hint": "For the first test case, there is no way to partition 'D' or 'DDK' into more than one block with equal ratios of numbers of 'D' and 'K', while you can split 'DD' into 'D' and 'D'.\n\nFor the second test case, you can split each prefix of length $ i $ into $ i $ blocks 'D'.",
    "translation": "## 题目描述\n给你一个字符串 $S$，其中只包含 'K' 或 'D' 两种字符，要求划分这个字符串使得各部分的 $n(D):n(K)$ 相同，其中 $n(D)$ 表示 $S$ 中字符 'D' 出现的个数，最大化划分后形成的组数。\n\n求出 $S$ 的所有前缀中的上述答案。\n\n## 输入格式\n\n第一行一个整数 $T$，代表测试组数。\n\n接下来每一组第一行一个整数 $n$，代表字符串 $S$ 的长度，第二行一个字符串 $S$。\n\n## 输出格式\n一共输出 $T$ 行，对于每组数据，输出 $S$ 的所有前缀的答案。\n\n--by ¶凉笙"
}