{
    "description": "It is the easy version of the problem. The only difference is that in this version $ n = 1 $ .\n\nIn the cinema seats can be represented as the table with $ n $ rows and $ m $ columns. The rows are numbered with integers from $ 1 $ to $ n $ . The seats in each row are numbered with consecutive integers from left to right: in the $ k $ -th row from $ m (k - 1) + 1 $ to $ m k $ for all rows $ 1 \\le k \\le n $ .\n\n  $ 1 $\n\n $ 2 $  $ \\cdots $  $ m - 1 $  $ m $  $ m + 1 $\n\n $ m + 2 $  $ \\cdots $  $ 2 m - 1 $  $ 2 m $  $ 2m + 1 $\n\n $ 2m + 2 $  $ \\cdots $  $ 3 m - 1 $  $ 3 m $  $ \\vdots $\n\n $ \\vdots $  $ \\ddots $  $ \\vdots $  $ \\vdots $  $ m (n - 1) + 1 $\n\n $ m (n - 1) + 2 $  $ \\cdots $  $ n m - 1 $  $ n m $ The table with seats indicesThere are $ nm $ people who want to go to the cinema to watch a new film. They are numbered with integers from $ 1 $ to $ nm $ . You should give exactly one seat to each person.\n\nIt is known, that in this cinema as lower seat index you have as better you can see everything happening on the screen. $ i $ -th person has the level of sight $ a_i $ . Let's define $ s_i $ as the seat index, that will be given to $ i $ -th person. You want to give better places for people with lower sight levels, so for any two people $ i $ , $ j $ such that $ a_i < a_j $ it should be satisfied that $ s_i < s_j $ .\n\nAfter you will give seats to all people they will start coming to their seats. In the order from $ 1 $ to $ nm $ , each person will enter the hall and sit in their seat. To get to their place, the person will go to their seat's row and start moving from the first seat in this row to theirs from left to right. While moving some places will be free, some will be occupied with people already seated. The inconvenience of the person is equal to the number of occupied seats he or she will go through.\n\nLet's consider an example: $ m = 5 $ , the person has the seat $ 4 $ in the first row, the seats $ 1 $ , $ 3 $ , $ 5 $ in the first row are already occupied, the seats $ 2 $ and $ 4 $ are free. The inconvenience of this person will be $ 2 $ , because he will go through occupied seats $ 1 $ and $ 3 $ .\n\nFind the minimal total inconvenience (the sum of inconveniences of all people), that is possible to have by giving places for all people (all conditions should be satisfied).",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ and $ m $ ( $ n = 1 $ , $ 1 \\le m \\le 300 $ ) — the number of rows and places in each row respectively.\n\nThe second line of each test case contains $ n \\cdot m $ integers $ a_1, a_2, \\ldots, a_{n \\cdot m} $ ( $ 1 \\le a_i \\le 10^9 $ ), where $ a_i $ is the sight level of $ i $ -th person.\n\nIt's guaranteed that the sum of $ n \\cdot m $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case print a single integer — the minimal total inconvenience that can be achieved.",
    "samples": [
        [
            "4\n1 3\n1 2 3\n1 5\n2 1 5 3 3\n1 2\n2 1\n1 6\n2 3 2 1 1 1",
            "3\n6\n0\n1"
        ]
    ],
    "hint": "In the first test case, there is a single way to arrange people, because all sight levels are distinct. The first person will sit on the first seat, the second person will sit on the second place, the third person will sit on the third place. So inconvenience of the first person will be $ 0 $ , inconvenience of the second person will be $ 1 $ and inconvenience of the third person will be $ 2 $ . The total inconvenience is $ 0 + 1 + 2 = 3 $ .\n\nIn the second test case, people should sit as follows: $ s_1 = 2 $ , $ s_2 = 1 $ , $ s_3 = 5 $ , $ s_4 = 4 $ , $ s_5 = 3 $ . The total inconvenience will be $ 6 $ .",
    "translation": "给 $n\\times m$ 个座位依次编号（编号方式如题面表格所示），视力差的人座位编号要小（视力相同不要求）。$n\\times m$ 个人依次进入（先到所在行的编号较小端，再到所在位置），但如果此人座位所在行编号比它小的座位上已经有人坐着，就会带来一点 $\\lceil$ 不便 $\\rfloor$，求怎么安排 $\\lceil$ 不便 $\\rfloor$ 的值最小。"
}