{
    "description": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1523C/da6104a926a977751ae03a3b556f0cead9b4ecdd.png)William is a huge fan of planning ahead. That is why he starts his morning routine by creating a nested list of upcoming errands.\n\nA valid nested list is any list which can be created from a list with one item \"1\" by applying some operations. Each operation inserts a new item into the list, on a new line, just after one of existing items $ a_1 \\,.\\, a_2 \\,.\\, a_3 \\,.\\, \\,\\cdots\\, \\,.\\,a_k $ and can be one of two types:\n\n1. Add an item $ a_1 \\,.\\, a_2 \\,.\\, a_3 \\,.\\, \\cdots \\,.\\, a_k \\,.\\, 1 $ (starting a list of a deeper level), or\n2. Add an item $ a_1 \\,.\\, a_2 \\,.\\, a_3 \\,.\\, \\cdots \\,.\\, (a_k + 1) $ (continuing the current level).\n\n Operation can only be applied if the list does not contain two identical items afterwards. And also, if we consider every item as a sequence of numbers, then the sequence of items should always remain increasing in lexicographical order. Examples of valid and invalid lists that are shown in the picture can found in the \"Notes\" section.When William decided to save a Word document with the list of his errands he accidentally hit a completely different keyboard shortcut from the \"Ctrl-S\" he wanted to hit. It's not known exactly what shortcut he pressed but after triggering it all items in the list were replaced by a single number: the last number originally written in the item number.\n\nWilliam wants you to help him restore a fitting original nested list.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10 $ ). Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^3 $ ), which is the number of lines in the list.\n\nEach of the next $ n $ lines contains a single integer $ a_i $ ( $ 1 \\le a_i \\le n $ ), which is what remains of William's nested list.\n\nIt is guaranteed that in each test case at least one fitting list exists.\n\nIt is guaranteed that the sum of values $ n $ across all test cases does not exceed $ 10^3 $ .",
    "outputFormat": "For each test case output $ n $ lines which represent a valid nested list, which could become the data provided to you by William.\n\nIf there are multiple answers, print any.",
    "samples": [
        [
            "2\n4\n1\n1\n2\n3\n9\n1\n1\n1\n2\n2\n1\n2\n1\n2",
            "1\n1.1\n1.2\n1.3\n1\n1.1\n1.1.1\n1.1.2\n1.2\n1.2.1\n2\n2.1\n2.2"
        ]
    ],
    "hint": "In the second example test case one example of a fitting list is:\n\n1\n\n1.1\n\n1.1.1\n\n1.1.2\n\n1.2\n\n1.2.1\n\n2\n\n2.1\n\n2.2\n\nThis list can be produced by using the sequence of operations shown below: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1523C/53b6f0dc8acf3fde4c975f74ee95364a6e7138d2.png)\n\n1. Original list with a single item $ 1 $ .\n2. Insert item $ 2 $ by using the insertion operation of the second type after item $ 1 $ .\n3. Insert item $ 1.1 $ by using the insertion operation of the first type after item $ 1 $ .\n4. Insert item $ 1.2 $ by using the insertion operation of the second type after item $ 1.1 $ .\n5. Insert item $ 1.1.1 $ by using the insertion operation of the first type after item $ 1.1 $ .\n6. Insert item $ 1.1.2 $ by using the insertion operation of the second type after item $ 1.1.1 $ .\n7. Insert item $ 1.2.1 $ by using the insertion operation of the first type after item $ 1.2 $ .\n8. Insert item $ 2.1 $ by using the insertion operation of the first type after item $ 2 $ .\n9. Insert item $ 2.2 $ by using the insertion operation of the second type after item $ 2.1 $ .",
    "translation": "你有一个数字串，开始为空，每轮你可以进行下面两个操作中的一个：\n\n1. 从末尾删除若干个数字（可以为 $0$ 个）然后把删除后的数字串的最后一个元素加一。\n2. 将数字 $1$ 加入到数字串的末端。\n\n现在告诉你你一共进行了 $n$ 次这样的操作，并且告诉你每一次操作完后数字串末尾的数字，让你找到一种可行的方案，并输出每次操作后的数字串。\n\n翻译来自 @$\\color{red}\\texttt{Macesuted}$"
}