{
    "description": "Sergey attends lessons of the $ N $ -ish language. Each lesson he receives a hometask. This time the task is to translate some sentence to the $ N $ -ish language. Sentences of the $ N $ -ish language can be represented as strings consisting of lowercase Latin letters without spaces or punctuation marks.\n\nSergey totally forgot about the task until half an hour before the next lesson and hastily scribbled something down. But then he recollected that in the last lesson he learned the grammar of $ N $ -ish. The spelling rules state that $ N $ -ish contains some \"forbidden\" pairs of letters: such letters can never occur in a sentence next to each other. Also, the order of the letters doesn't matter (for example, if the pair of letters \"ab\" is forbidden, then any occurrences of substrings \"ab\" and \"ba\" are also forbidden). Also, each pair has different letters and each letter occurs in no more than one forbidden pair.\n\nNow Sergey wants to correct his sentence so that it doesn't contain any \"forbidden\" pairs of letters that stand next to each other. However, he is running out of time, so he decided to simply cross out some letters from the sentence. What smallest number of letters will he have to cross out? When a letter is crossed out, it is \"removed\" so that the letters to its left and right (if they existed), become neighboring. For example, if we cross out the first letter from the string \"aba\", we get the string \"ba\", and if we cross out the second letter, we get \"aa\".",
    "inputFormat": "The first line contains a non-empty string $ s $ , consisting of lowercase Latin letters — that's the initial sentence in $ N $ -ish, written by Sergey. The length of string $ s $ doesn't exceed $ 10^{5} $ .\n\nThe next line contains integer $ k $ ( $ 0<=k<=13 $ ) — the number of forbidden pairs of letters.\n\nNext $ k $ lines contain descriptions of forbidden pairs of letters. Each line contains exactly two different lowercase Latin letters without separators that represent the forbidden pairs. It is guaranteed that each letter is included in no more than one pair.",
    "outputFormat": "Print the single number — the smallest number of letters that need to be removed to get a string without any forbidden pairs of neighboring letters. Please note that the answer always exists as it is always possible to remove all letters.",
    "samples": [
        [
            "ababa\n1\nab\n",
            "2\n"
        ],
        [
            "codeforces\n2\ndo\ncs\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample you should remove two letters b.\n\nIn the second sample you should remove the second or the third letter. The second restriction doesn't influence the solution.",
    "translation": "题意：给你一串字符串，再给你k<=13个只有两个字符得串，且这些字符不重复，问你需要在原串中删除多少个字符才能保证原串中不含这k个串及其反向串。"
}