{
    "description": "As Sherlock Holmes was investigating a crime, he identified $ n $ suspects. He knows for sure that exactly one of them committed the crime. To find out which one did it, the detective lines up the suspects and numbered them from $ 1 $ to $ n $ . After that, he asked each one: \"Which one committed the crime?\". Suspect number $ i $ answered either \"The crime was committed by suspect number $ a_{i} $ \", or \"Suspect number $ a_{i} $ didn't commit the crime\". Also, the suspect could say so about himself ( $ a_{i}=i $ ).\n\nSherlock Holmes understood for sure that exactly $ m $ answers were the truth and all other answers were a lie. Now help him understand this: which suspect lied and which one told the truth?",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n<=10^{5},0<=m<=n $ ) — the total number of suspects and the number of suspects who told the truth. Next $ n $ lines contain the suspects' answers. The $ i $ -th line contains either \"+ $ a_{i} $ \" (without the quotes), if the suspect number $ i $ says that the crime was committed by suspect number $ a_{i} $ , or \"- $ a_{i} $ \" (without the quotes), if the suspect number $ i $ says that the suspect number $ a_{i} $ didn't commit the crime ( $ a_{i} $ is an integer, $ 1<=a_{i}<=n $ ).\n\nIt is guaranteed that at least one suspect exists, such that if he committed the crime, then exactly $ m $ people told the truth.",
    "outputFormat": "Print $ n $ lines. Line number $ i $ should contain \"Truth\" if suspect number $ i $ has told the truth for sure. Print \"Lie\" if the suspect number $ i $ lied for sure and print \"Not defined\" if he could lie and could tell the truth, too, depending on who committed the crime.",
    "samples": [
        [
            "1 1\n+1\n",
            "Truth\n"
        ],
        [
            "3 2\n-1\n-2\n-3\n",
            "Not defined\nNot defined\nNot defined\n"
        ],
        [
            "4 1\n+2\n-3\n+4\n-1\n",
            "Lie\nNot defined\nLie\nNot defined\n"
        ]
    ],
    "hint": "The first sample has the single person and he confesses to the crime, and Sherlock Holmes knows that one person is telling the truth. That means that this person is telling the truth.\n\nIn the second sample there are three suspects and each one denies his guilt. Sherlock Holmes knows that only two of them are telling the truth. Any one of them can be the criminal, so we don't know for any of them, whether this person is telling the truth or not.\n\nIn the third sample the second and the fourth suspect defend the first and the third one. But only one is telling the truth, thus, the first or the third one is the criminal. Both of them can be criminals, so the second and the fourth one can either be lying or telling the truth. The first and the third one are lying for sure as they are blaming the second and the fourth one.",
    "translation": "一共有N个人，其中有一人为罪犯。\n现在每个人说了N句话，内容是说谁是罪犯或\n谁不是罪犯(也可以说自己)。其中有M句真话。\n\n给定N和M以及N个数，设为a[1]~a[N]\n如果a[i]>0,代表第i个人说第a[i]个人是罪犯，反之代表第i个人说第-a[i]个人不是罪犯。\n输出有N行，如果第i个人说的一定是真话，输出\"Truth\"；\n如果第i个人说的一定是假话，输出\"Lie\";\n如果第i个人说的可能是真话也可能是假话则输出\"Not defined\"。"
}