{
    "description": "Grandma Capa has decided to knit a scarf and asked Grandpa Sher to make a pattern for it, a pattern is a string consisting of lowercase English letters. Grandpa Sher wrote a string $ s $ of length $ n $ .\n\nGrandma Capa wants to knit a beautiful scarf, and in her opinion, a beautiful scarf can only be knit from a string that is a palindrome. She wants to change the pattern written by Grandpa Sher, but to avoid offending him, she will choose one lowercase English letter and erase some (at her choice, possibly none or all) occurrences of that letter in string $ s $ .\n\nShe also wants to minimize the number of erased symbols from the pattern. Please help her and find the minimum number of symbols she can erase to make string $ s $ a palindrome, or tell her that it's impossible. Notice that she can only erase symbols equal to the one letter she chose.\n\nA string is a palindrome if it is the same from the left to the right and from the right to the left. For example, the strings 'kek', 'abacaba', 'r' and 'papicipap' are palindromes, while the strings 'abb' and 'iq' are not.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. The next $ 2 \\cdot t $ lines contain the description of test cases. The description of each test case consists of two lines.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the length of the string.\n\nThe second line of each test case contains the string $ s $ consisting of $ n $ lowercase English letters.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case print the minimum number of erased symbols required to make the string a palindrome, if it is possible, and $ -1 $ , if it is impossible.",
    "samples": [
        [
            "5\n8\nabcaacab\n6\nxyzxyz\n4\nabba\n8\nrprarlap\n10\nkhyyhhyhky",
            "2\n-1\n0\n3\n2"
        ]
    ],
    "hint": "In the first test case, you can choose a letter 'a' and erase its first and last occurrences, you will get a string 'bcaacb', which is a palindrome. You can also choose a letter 'b' and erase all its occurrences, you will get a string 'acaaca', which is a palindrome as well.\n\nIn the second test case, it can be shown that it is impossible to choose a letter and erase some of its occurrences to get a palindrome.\n\nIn the third test case, you don't have to erase any symbols because the string is already a palindrome.",
    "translation": "### 题目描述\n给一个由小写字母组成的字符串 $s$ ，选择一个字母，删去这个字符串中任意个这个字母，使这个字符串变成回文的。如果存在多个答案，输出删除的字母个数最少的答案。\n### 输入格式\n第一行输入一个正整数 $t$ ，表示数据组数。\n\n对于每一组数据，第一行输入一个正整数 $n$ 表示字符串长度，第二行输入长度为 $n$ 的字符串 $s$ 。\n### 输出格式\n对于每组数据输出一行一个整数，如果存在方案，输出最少删除的字母的个数，如果不存在，输出 $-1$　。\n### 数据范围\n$1\\le t\\le100,1\\le n\\le10^5,1\\le\\sum n\\le2\\times10^5$ 。\n### 样例解释\n第一组数据，删除 $2$ 个 $a$ ，字符串变为 $bcaacb$ 。\n\n第二组数据，方案不存在。\n\n第三组数据，字符串本身就是回文的。\n\n第四组数据，删除 $3$ 个 $r$ ，字符串变为 $palap$ 。\n\n第五组数据，删除 $2$ 个 $y$ ，字符串变为 $khyhhyhk$ 。"
}