{
    "description": "In optical communication networks, appropriate path planning can improve the utilization of communication resources and bring a smooth communication experience to users. The following figure shows an inter-satellite optical communication network. User messages are sent from one terrestrial base station (nodes $ 4 $ to $ 7 $ ) and transmitted through satellites (nodes $ 0 $ to $ 3 $ ) in space to another terrestrial base station (nodes $ 4 $ to $ 7 $ ).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1576A/2cc65ced0e74353c2100e6d66cb5433984d42a68.png)In the preceding figures, there are communication connections (edges for short) between base stations and satellites and between satellites. The base stations and satellites are referred to as nodes.\n\n User messages are transmitted on these edges and referred to as flows. Some users may make video calls with friends, and some users may send short messages to their family members. Therefore, the message traffic (called flow rate) of each user differs.\n\n There are many parallel edges (for example, edges $ 0 $ , $ 1 $ , and $ 2 $ ) between two nodes, and the capacity of each edge also differs. Larger capacity indicates that more user messages can be transmitted, as well as shorter transmission distance indicates lower latency and better communication quality.\n\n Nodes also have their internal structure. As shown below, some edges inside a node cannot communicate with each other because these edges (constrained edge pair) are not fully connected. For example, edge $ 5 $ and edge $ 7 $ inside node $ 2 $ cannot communicate with each other, and therefore flows cannot pass through node $ 2 $ by traversing the two unconnected edges.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1576A/9fd73919f21182d9014b9ef2ac2d6a4d47c22f61.png)Now, in the input network, the source node, target node, and required flow rate for each user flow are specified. Because network resources are limited, paths may not be successfully calculated for all user flows. We hope that you can provide a solution with the highest score.\n\nNote, that\n\n- all edges are undirected, so flows may come in both directions,\n- edges has both capacity and length (named distance),\n- several flows may use the same edge,\n- flows may come through the same edge in opposite directions simultaneously,\n- for the purpose of this problem, there is no difference between satellites and base stations, so flows may come through several base stations before reaching the destination station.\n\nConstraints\n\n1. The capacity of each edge is limited. The total rate of all flows carried by an edge cannot exceed the capacity of the edge. The capacity limits the total flows in both directions.\n2. The calculated flow path does not allow loops or cycles.\n3. Due to the hardware limitation inside satellites, the number of flows passing through a node (including source and target node) cannot exceed the site flow limit ( $ \\mathit{SFL} $ ) of the node. The value of $ \\mathit{SFL} $ is $ 200 $ .\n4. There are multiple parallel edges between two nodes, which may belong to different groups. Links in each group are managed by the same chip on a node, and there is a group flow limit ( $ \\mathit{GFL} $ ). The total number of different flows on all the edges in a group cannot exceed the $ \\mathit{GFL} $ of the group. The value of $ \\mathit{GFL} $ is $ 100 $ .\n5. By default, all edges are connected to each other in each node. But there are some constrained edge pairs — the pairs of edges inside specified nodes that cannot communicate with each other.\n6. You can make no more than $ 2 $ submissions on each $ 5 $ minutes interval.",
    "inputFormat": "The first line contains four integers separated by space: $ \\mathit{NodeCount} $ , $ \\mathit{EdgeCount} $ , $ \\mathit{ConstrainedCount} $ , and $ \\mathit{FlowCount} $ .\n\n- $ 8 \\le \\mathit{NodeCount} \\le 1400 $ ,\n- $ 15 \\le \\mathit{EdgeCount} \\le 15000 $ ,\n- $ 3 \\le \\mathit{ConstrainedCount} \\le 3600 $ ,\n- $ 1 \\le \\mathit{FlowCount} \\le 14000 $ .\n\nThe next $ \\mathit{EdgeCount} $ lines contain information about the network. Each line contains six integers: $ \\mathit{EdgeID} $ , $ \\mathit{GroupID} $ , $ \\mathit{StartNodeID} $ , $ \\mathit{EndNodeID} $ , $ \\mathit{Distance} $ , and $ \\mathit{Capacity} $ .\n\n- $ 0 \\le \\mathit{EdgeID} < \\mathit{EdgeCount} $ ,\n- $ 0 \\le \\mathit{GroupID} \\le 4500 $ ,\n- $ 0 \\le \\mathit{StartNodeID}, \\mathit{EndNodeID} < \\mathit{NodeCount} $ ,\n- $ \\mathit{StartNodeID} \\ne \\mathit{EndNodeID} $ ,\n- $ 100 \\le \\mathit{Distance} \\le 10000 $ ,\n- $ 1 < \\mathit{Capacity} \\le 10^5 $ .\n\nIt's guaranteed that only multiple edges may share the same $ \\mathit{GroupID} $ .\n\nThe next $ \\mathit{ConstrainedCount} $ lines contain information about the edge pairs that are not connected in the specified nodes of the network. All other edges are connected to each other by default. Each line contains three integers: $ \\mathit{NodeID} $ , $ \\mathit{EdgeID}_1 $ , and $ \\mathit{EdgeID}_2 $ .\n\n- $ 0 \\le \\mathit{NodeID} < \\mathit{NodeCount} $ ,\n- $ 0 \\le \\mathit{EdgeID}_1, \\mathit{EdgeID}_2 < \\mathit{EdgeCount} $ ,\n- $ \\mathit{EdgeID}_1 \\ne \\mathit{EdgeID}_2 $ .\n\nThe next $ \\mathit{FlowCount} $ lines contain information about the flows to be calculated. Each line contains four integers: $ \\mathit{FlowID} $ , $ \\mathit{SourceNode} $ , $ \\mathit{TargetNode} $ , and $ \\mathit{FlowRate} $ .\n\n- $ 0 \\le \\mathit{FlowID} < \\mathit{FlowCount} $ ,\n- $ 0 \\le \\mathit{SourceNode}, \\mathit{TargetNode} < \\mathit{NodeCount} $ ,\n- $ \\mathit{SourceNode} \\ne \\mathit{TargetNode} $ ,\n- $ 2 \\le \\mathit{FlowRate} \\le 12000 $\n\nDon't forget that the $ \\mathit{SFL} $ and $ \\mathit{GFL} $ mentioned above are also important parameters.\n\nFor the simplicity, both $ \\mathit{EdgeID} $ and $ \\mathit{FlowID} $ of the $ i $ -th ( $ 0 $ -indexed) edge (flow) is always equal to $ i $ .",
    "outputFormat": "In the first line, output the number of your success flows.\n\nNext, each line output edge information about the path that a flow passes through.\n\nThe format is as follows: $ \\mathit{FlowID}\\ \\mathit{EdgeID}_1\\ \\mathit{EdgeID}_2\\ \\mathit{EdgeID}_3\\ \\dots\\ \\mathit{EdgeID}_n $ .\n\nThere is no requirement on the output sequence between flow paths, but edges in one flow must be outputted in order, from source node to target node. Please output all successfully calculated flow paths. For other flows that are not output, the checker determines that you have not found appropriate paths for the flows by default.\n\nScoring\n\n1. The solutions that violate constraints, time out, or exceed the memory limit are invalid.\n2. According to the formula $ \\mathit{Score}=\\mathit{SuccessFlowNum}+\\max \\left(1-\\left(\\frac{\\mathit{AvgDistance}}{1000000}\\right),0\\right) $ , the solution with a higher score wins. (That is, the solution with more successfully planned flow paths wins. If two solutions have the same number of successfully planned flow paths, the solution with a smaller average of path distances wins. Output with $ 0 $ flow paths will be considered incorrect.)\n3. If two solutions have the same score, the solution submitted first wins.\n4. For multiple tests, the ranking is performed based on the sum of all tests. If the solution has no result on any test, it will be recorded as no result on the whole.\n5. Among your multiple submissions, the one with the highest score is the final score.\n6. The checker runs your solution on exactly one CPU core, so multithreading implementation will not provide any profit.\n7. You can make no more than $ 2 $ submissions on each $ 5 $ minutes interval.",
    "samples": [
        [
            "8 15 3 1\n0 0 0 1 100 1050\n1 1 0 1 200 2200\n2 1 0 1 200 99400\n3 2 0 3 100 450\n4 3 0 3 500 1120\n5 4 1 2 1000 40000\n6 5 2 3 600 10000\n7 5 2 3 600 10000\n8 6 1 4 120 2500\n9 6 1 4 120 450\n10 7 1 5 170 1250\n11 8 2 5 200 2500\n12 9 3 5 100 1250\n13 10 3 6 300 1150\n14 11 3 7 300 1100\n2 5 7\n2 6 7\n2 6 11\n0 4 6 100",
            "1\n0 8 0 3 13"
        ]
    ],
    "hint": "The total distance of a flow path is $ 620 $ ( $ 120 + 100 + 100 + 300 = 620 $ ). (Note: 0 9 10 12 13 is also a valid output result.)",
    "translation": "在一张通信网络中，有多个通信请求，需要给出一个方案，优先满足需求数最大量，再使路径平均长度最小。（按方案给分: $\\text{完成请求数} + \\max(0,1-\\frac{\\text{路径平均长度}}{1000000})$）  \n\n+ 每个请求包括：起始节点，到达节点，需求流量。  \n+ 每条边包含流量限制和长度，流量定义为正向流量与反向流量之和。 \n+ 可能有重边，边是无向的，而且可以共用。  \n+ 每个节点连接的边默认都可以互相通信，但提出一些要求，一些边不可以互相通信。    \n+ 每个节点有流量限制，并且每个节点连接的边分组，每个组有流量限制。  \n+ 给出的方案不许循环。  \n+ （原比赛中）每五分钟最多提交两次。"
}