{
    "description": "The only difference between this problem and D2 is that you don't have to provide the way to construct the answer in this problem, but you have to do it in D2.\n\nThere's a table of $ n \\times m $ cells ( $ n $ rows and $ m $ columns). The value of $ n \\cdot m $ is even.\n\nA domino is a figure that consists of two cells having a common side. It may be horizontal (one of the cells is to the right of the other) or vertical (one of the cells is above the other).\n\nYou need to find out whether it is possible to place $ \\frac{nm}{2} $ dominoes on the table so that exactly $ k $ of them are horizontal and all the other dominoes are vertical. The dominoes cannot overlap and must fill the whole table.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nEach test case consists of a single line. The line contains three integers $ n $ , $ m $ , $ k $ ( $ 1 \\le n,m \\le 100 $ , $ 0 \\le k \\le \\frac{nm}{2} $ , $ n \\cdot m $ is even) — the number of rows, columns and horizontal dominoes, respectively.",
    "outputFormat": "For each test case output \"YES\", if it is possible to place dominoes in the desired way, or \"NO\" otherwise.\n\nYou may print each letter in any case (YES, yes, Yes will all be recognized as positive answer, NO, no and nO will all be recognized as negative answer).",
    "samples": [
        [
            "8\n4 4 2\n2 3 0\n3 2 3\n1 2 0\n2 4 2\n5 2 2\n2 17 16\n2 1 1",
            "YES\nYES\nYES\nNO\nYES\nNO\nYES\nNO"
        ]
    ],
    "hint": "",
    "translation": "给你 $t$ 组数据。对于每组数据给你一个 $n \\times m$ 的网格（$n$ 为网格高度，$m$ 为网格宽度，且网格的数量为偶数），要求在网格中放置多米诺骨牌，每个骨牌占据 $1\\times2$ 的网格区域。对于这 $\\frac{nm}{2}$ 个骨牌，要求正好有 $k$ 个横着放置，而剩下的 $\\frac{nm}{2}-k$ 个竖着放置，正好铺满台面。现在要你给出对于每组 $n$, $m$ 和 $k$，是否有一种方案满足条件。如果有，输出 `YES`，反之输出 `NO`。"
}