{
    "description": "Bob really likes playing with arrays of numbers. That's why for his birthday, his friends bought him a really interesting machine – an array beautifier.\n\nThe array beautifier takes an array $ A $ consisting of $ N $ integers, and it outputs a new array $ B $ of length N that it constructed based on the array given to it. The array beautifier constructs the new array in the following way: it takes two numbers at different indices from the original array and writes their sum to the end of the new array. It does this step $ N $ times - resulting in an output array of length $ N $ . During this process, the machine can take the same index multiple times in different steps.\n\nBob was very excited about the gift that his friends gave him, so he put his favorite array in the machine. However, when the machine finished, Bob was not happy with the resulting array. He misses his favorite array very much, and hopes to get it back.\n\nGiven the array that the machine outputted, help Bob find an array that could be the original array that he put in the machine. Sometimes the machine makes mistakes, so it is possible that no appropriate input array exists for the array it has outputted. In such case, let Bob know that his array is forever lost.",
    "inputFormat": "The first line contains one positive integer $ N $ ( $ 2 \\leq N \\leq 10^3 $ ) – the length of Bob's array.\n\nThe second line contains $ N $ integers $ B_1 $ , $ B_2 $ , ..., $ B_N $ ( $ 1 \\leq B_i \\leq 10^6 $ ) – the elements of the array the machine outputted.",
    "outputFormat": "If an appropriate input array exists, print \"YES\", followed by the input array $ A_1 $ , $ A_2 $ , ..., $ A_N $ ( $ -10^9 \\leq A_i \\leq 10^9 $ ) in the next line. Otherwise, print \"NO\".",
    "samples": [
        [
            "2\n5 5",
            "YES\n2 3"
        ],
        [
            "3\n1 2 3",
            "YES\n0 1 2"
        ],
        [
            "3\n2 4 5",
            "NO"
        ],
        [
            "4\n1 3 5 7",
            "YES\n6 -3 4 1"
        ]
    ],
    "hint": "",
    "translation": "你有一个长度为 $n$ 的数组 $B$，你需要构造一个长度为 $n$ 的数组 $A$，使得 $B$ 中每一个元素都能由 $A$ 中两个位置不同的元素相加得到。"
}