{
    "description": "To celebrate your birthday you have prepared a festive table! Now you want to seat as many guests as possible.\n\nThe table can be represented as a rectangle with height $ h $ and width $ w $ , divided into $ h \\times w $ cells. Let $ (i, j) $ denote the cell in the $ i $ -th row and the $ j $ -th column of the rectangle ( $ 1 \\le i \\le h $ ; $ 1 \\le j \\le w $ ).\n\nInto each cell of the table you can either put a plate or keep it empty.\n\nAs each guest has to be seated next to their plate, you can only put plates on the edge of the table — into the first or the last row of the rectangle, or into the first or the last column. Formally, for each cell $ (i, j) $ you put a plate into, at least one of the following conditions must be satisfied: $ i = 1 $ , $ i = h $ , $ j = 1 $ , $ j = w $ .\n\nTo make the guests comfortable, no two plates must be put into cells that have a common side or corner. In other words, if cell $ (i, j) $ contains a plate, you can't put plates into cells $ (i - 1, j) $ , $ (i, j - 1) $ , $ (i + 1, j) $ , $ (i, j + 1) $ , $ (i - 1, j - 1) $ , $ (i - 1, j + 1) $ , $ (i + 1, j - 1) $ , $ (i + 1, j + 1) $ .\n\nPut as many plates on the table as possible without violating the rules above.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases.\n\nEach of the following $ t $ lines describes one test case and contains two integers $ h $ and $ w $ ( $ 3 \\le h, w \\le 20 $ ) — the height and the width of the table.",
    "outputFormat": "For each test case, print $ h $ lines containing $ w $ characters each. Character $ j $ in line $ i $ must be equal to $ 1 $ if you are putting a plate into cell $ (i, j) $ , and $ 0 $ otherwise. If there are multiple answers, print any.\n\nAll plates must be put on the edge of the table. No two plates can be put into cells that have a common side or corner. The number of plates put on the table under these conditions must be as large as possible.\n\nYou are allowed to print additional empty lines.",
    "samples": [
        [
            "3\n3 5\n4 4\n5 6",
            "10101\n00000\n10101\n\n0100\n0001\n1000\n0010\n\n010101\n000000\n100001\n000000\n101010"
        ]
    ],
    "hint": "For the first test case, example output contains the only way to put $ 6 $ plates on the table.\n\nFor the second test case, there are many ways to put $ 4 $ plates on the table, example output contains one of them.\n\nPutting more than $ 6 $ plates in the first test case or more than $ 4 $ plates in the second test case is impossible.",
    "translation": "#### 1、题目描述翻译\n\n有一张桌子，分为 $h$ 行 $w$ 列。\n\n桌子**边缘**上的某一行某一列可以放一个盘子（也可以不放）。但是，一个盘子的上面、下面、左面、右面、左上、右上、左下、右下都不能有盘子。\n\n问题来了：这个桌子，放盘子最多的方案是什么？请输出这个方案。当然，答案不止一种，你也不用全部输出，输出任意一个，即可。\n\n#### 2、输入格式翻译\n\n第一行一个数 $t$（$1\\le t\\le100$），表示测试数据组数。\n\n接下来 $t$ 行，每行两个数，分别代表 $h$ 和 $w$（$3\\le h,w\\le20$）。\n\n#### 3、输出格式翻译\n\n输出这个桌子放盘子最多的方案。盘子用 `1` 表示，空位用 `0` 表示。\n\n每个测试数据之间都要打印一个空行。\n\nTranslated by [dengzijun](https://www.luogu.com.cn/user/387836)"
}