{
    "description": "When he's not training for IOI, Little Alawn enjoys playing with puzzles of various types to stimulate his brain. Today, he's playing with a puzzle that consists of a $ 2 \\times n $ grid where each row is a permutation of the numbers $ 1,2,3,\\ldots,n $ .\n\nThe goal of Little Alawn's puzzle is to make sure no numbers on the same column or row are the same (we'll call this state of the puzzle as solved), and to achieve this he is able to swap the numbers in any column. However, after solving the puzzle many times, Little Alawn got bored and began wondering about the number of possible solved configurations of the puzzle he could achieve from an initial solved configuration only by swapping numbers in a column.\n\nUnfortunately, Little Alawn got stuck while trying to solve this harder problem, so he was wondering if you could help him with it. Find the answer modulo $ 10^9+7 $ .",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 2 \\le n \\le 4 \\cdot 10^5 $ ).\n\nThe next two lines of each test case describe the initial state of the puzzle grid. Each line will be a permutation of the numbers $ 1,2,3,\\ldots,n $ and the numbers in each column and row will be pairwise distinct.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 4 \\cdot 10^5 $ .",
    "outputFormat": "For each test case output a single integer, the number of possible solved configurations of the puzzle Little Alawn can achieve from an initial solved configuration only by swapping numbers in a column. As the answer can be very large, please output it modulo $ 10^9+7 $ .\n\nThe answer for each test case should be on a separate line.",
    "samples": [
        [
            "2\n4\n1 4 2 3\n3 2 1 4\n8\n2 6 5 1 4 3 7 8\n3 8 7 5 1 2 4 6",
            "2\n8"
        ]
    ],
    "hint": "The two possible puzzle configurations for example $ 1 $ are:\n\n- $ [1,4,2,3] $ in the first row and $ [3,2,1,4] $ in the second;\n- $ [3,2,1,4] $ in the first row and $ [1,4,2,3] $ in the second.",
    "translation": "题目给出一个 $2 \\times n$ 的数阵，每行都是 $1\\sim n$ 的排列，问你在经过操作之后，能够满足**没有相同数字在同一行**的数阵能有多少个。\n\n你可以进行的操作就是**交换一列中的两个数字**。\n\n由于答案可能会很大，所以你需要在输出之前模上 $10^9+7$ ，并且每个测试点有多组数据。"
}