{
    "description": "You have a string $ s $ and a chip, which you can place onto any character of this string.\n\nAfter placing the chip, you move it to the right several (maybe zero) times, i. e. you perform the following operation several times: if the current position of the chip is $ i $ , you move it to the position $ i + 1 $ . Of course, moving the chip to the right is impossible if it is already in the last position.\n\nAfter moving the chip to the right, you move it to the left several (maybe zero) times, i. e. you perform the following operation several times: if the current position of the chip is $ i $ , you move it to the position $ i - 1 $ . Of course, moving the chip to the left is impossible if it is already in the first position.\n\nWhen you place a chip or move it, you write down the character where the chip ends up after your action. For example, if $ s $ is abcdef, you place the chip onto the $ 3 $ -rd character, move it to the right $ 2 $ times and then move it to the left $ 3 $ times, you write down the string cdedcb.\n\nYou are given two strings $ s $ and $ t $ . Your task is to determine whether it's possible to perform the described operations with $ s $ so that you write down the string $ t $ as a result.",
    "inputFormat": "The first line contains one integer $ q $ ( $ 1 \\le q \\le 500 $ ) — the number of test cases.\n\nEach test case consists of two lines. The first line contains the string $ s $ ( $ 1 \\le |s| \\le 500 $ ), the second line contains the string $ t $ ( $ 1 \\le |t| \\le 2 \\cdot |s| - 1 $ ). Both strings consist of lowercase English characters.\n\nIt is guaranteed that the sum of $ |s| $ over all test cases does not exceed $ 500 $ .",
    "outputFormat": "For each test case, print \"YES\" if you can obtain the string $ t $ by performing the process mentioned in the statement with the string $ s $ , or \"NO\" if you cannot.\n\nYou may print each letter in any case (YES, yes, Yes will all be recognized as positive answer, NO, no and nO will all be recognized as negative answer).",
    "samples": [
        [
            "6\nabcdef\ncdedcb\naaa\naaaaa\naab\nbaaa\nab\nb\nabcdef\nabcdef\nba\nbaa",
            "YES\nYES\nNO\nYES\nYES\nNO"
        ]
    ],
    "hint": "Consider the examples.\n\nThe first test case is described in the statement.\n\nIn the second test case, you can place the chip on the $ 1 $ -st position, move it twice to the right, and then move it twice to the left.\n\nIn the fourth test case, you can place the chip on the $ 2 $ -nd position, and then don't move it at all.\n\nIn the fifth test case, you can place the chip on the $ 1 $ -st position, move it $ 5 $ times to the right, and then finish the process.",
    "translation": "你有两个字符串 $s,t$ 以及一个棋子。接下来你需要进行下列操作：\n\n1. 将棋子摆放在字符串 $s$ 的任意一个位置上；  \n2. 将棋子向右移若干次（可以是零次，不能移出字符串）；\n3. 将棋子向左移若干次（也可以是零次，也不能移出字符串）；\n\n在进行操作的过程中，你需要把棋子经过的字符按顺序写下来。例如，$s=\\texttt{\"abcdef\"}$，你把棋子放在第三个字符上，向右移动两次，再向左移动三次，得到的字符串就是 $\\texttt{\"cdedcb\"}$。  \n给定字符串 $s,t$，你需要求出是否存在一种放置、移动棋子的方案使得最终写下的字符串与 $t$ 相同。有输出 `YES`，没有输出 `NO`。$q$ 组数据。  \n$1\\leq q\\leq500;1\\leq |s|,\\sum|s|\\leq500;1\\leq |t|\\leq2\\times|s|-1;$"
}