{
    "description": "Little Janet likes playing with cubes. Actually, she likes to play with anything whatsoever, cubes or tesseracts, as long as they are multicolored. Each cube is described by two parameters — color $ c_{i} $ and size $ s_{i} $ . A Zebra Tower is a tower that consists of cubes of exactly two colors. Besides, the colors of the cubes in the tower must alternate (colors of adjacent cubes must differ). The Zebra Tower should have at least two cubes. There are no other limitations. The figure below shows an example of a Zebra Tower.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF159E/f33171cfff84c23150eb82e578a37293690a12de.png)A Zebra Tower's height is the sum of sizes of all cubes that form the tower. Help little Janet build the Zebra Tower of the maximum possible height, using the available cubes.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 2<=n<=10^{5} $ ) — the number of cubes. Next $ n $ lines contain the descriptions of the cubes, one description per line. A cube description consists of two space-separated integers $ c_{i} $ and $ s_{i} $ ( $ 1<=c_{i},s_{i}<=10^{9} $ ) — the $ i $ -th cube's color and size, correspondingly. It is guaranteed that there are at least two cubes of different colors.",
    "outputFormat": "Print the description of the Zebra Tower of the maximum height in the following form. In the first line print the tower's height, in the second line print the number of cubes that form the tower, and in the third line print the space-separated indices of cubes in the order in which they follow in the tower from the bottom to the top. Assume that the cubes are numbered from 1 to $ n $ in the order in which they were given in the input.\n\nIf there are several existing Zebra Towers with maximum heights, it is allowed to print any of them.\n\nPlease do not use the %lld specificator to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specificator.",
    "samples": [
        [
            "4\n1 2\n1 3\n2 4\n3 3\n",
            "9\n3\n2 3 1 \n"
        ],
        [
            "2\n1 1\n2 1\n",
            "2\n2\n2 1 \n"
        ]
    ],
    "hint": ""
}