{
    "description": "In a certain video game, the player controls a hero characterized by a single integer value: power. The hero will have to beat monsters that are also characterized by a single integer value: armor.\n\nOn the current level, the hero is facing $ n $ caves. To pass the level, the hero must enter all the caves in some order, each cave exactly once, and exit every cave safe and sound. When the hero enters cave $ i $ , he will have to fight $ k_i $ monsters in a row: first a monster with armor $ a_{i, 1} $ , then a monster with armor $ a_{i, 2} $ and so on, finally, a monster with armor $ a_{i, k_i} $ .\n\nThe hero can beat a monster if and only if the hero's power is strictly greater than the monster's armor. If the hero can't beat the monster he's fighting, the game ends and the player loses. Note that once the hero enters a cave, he can't exit it before he fights all the monsters in it, strictly in the given order.\n\nEach time the hero beats a monster, the hero's power increases by $ 1 $ .\n\nFind the smallest possible power the hero must start the level with to be able to enter all the caves in some order and beat all the monsters.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^5 $ ). Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the number of caves.\n\nThe $ i $ -th of the next $ n $ lines contains an integer $ k_i $ ( $ 1 \\le k_i \\le 10^5 $ ) — the number of monsters in the $ i $ -th cave, followed by $ k_i $ integers $ a_{i, 1}, a_{i, 2}, \\ldots, a_{i, k_i} $ ( $ 1 \\le a_{i, j} \\le 10^9 $ ) — armor levels of the monsters in cave $ i $ in order the hero has to fight them.\n\nIt is guaranteed that the sum of $ k_i $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case print a single integer — the smallest possible power the hero must start the level with to be able to enter all the caves in some order and beat all the monsters.",
    "samples": [
        [
            "2\n1\n1 42\n2\n3 10 15 8\n2 12 11",
            "43\n13"
        ]
    ],
    "hint": "In the first test case, the hero has to beat a single monster with armor $ 42 $ , it's enough to have power $ 43 $ to achieve that.\n\nIn the second test case, the hero can pass the level with initial power $ 13 $ as follows:\n\n- enter cave $ 2 $ : \n  - beat a monster with armor $ 12 $ , power increases to $ 14 $ ;\n  - beat a monster with armor $ 11 $ , power increases to $ 15 $ ;\n- enter cave $ 1 $ : \n  - beat a monster with armor $ 10 $ , power increases to $ 16 $ ;\n  - beat a monster with armor $ 15 $ , power increases to $ 17 $ ;\n  - beat a monster with armor $ 8 $ , power increases to $ 18 $ .",
    "translation": "$T$ 组数据，每次给定 $n$ 个任务，第 $i$ 个任务给定 $k_i$ 个怪物，每个怪物有一个能力值 $a_{i,j}$ 你要按顺序把这 $k_i$ 个怪物杀死，你能杀死一个怪物当且仅当你的能力值严格大于怪物的能力值，杀死一个怪物后，你的能力值将会 $+1$。\n\n你可以按任意顺序完成这 $n$ 个任务，你需要确定最小的初始能力值。\n\n$T\\leq 10^5,n\\leq 10^5,k_i\\leq10^5,\\sum k_i\\leq 10^5,a_{i,j}\\leq 10^9$。"
}