{
    "description": "Consider a simplified penalty phase at the end of a football match.\n\nA penalty phase consists of at most $ 10 $ kicks, the first team takes the first kick, the second team takes the second kick, then the first team takes the third kick, and so on. The team that scores more goals wins; if both teams score the same number of goals, the game results in a tie (note that it goes against the usual football rules). The penalty phase is stopped if one team has scored more goals than the other team could reach with all of its remaining kicks. For example, if after the $ 7 $ -th kick the first team has scored $ 1 $ goal, and the second team has scored $ 3 $ goals, the penalty phase ends — the first team cannot reach $ 3 $ goals.\n\nYou know which player will be taking each kick, so you have your predictions for each of the $ 10 $ kicks. These predictions are represented by a string $ s $ consisting of $ 10 $ characters. Each character can either be 1, 0, or ?. This string represents your predictions in the following way:\n\n- if $ s_i $ is 1, then the $ i $ -th kick will definitely score a goal;\n- if $ s_i $ is 0, then the $ i $ -th kick definitely won't score a goal;\n- if $ s_i $ is ?, then the $ i $ -th kick could go either way.\n\nBased on your predictions, you have to calculate the minimum possible number of kicks there can be in the penalty phase (that means, the earliest moment when the penalty phase is stopped, considering all possible ways it could go). Note that the referee doesn't take into account any predictions when deciding to stop the penalty phase — you may know that some kick will/won't be scored, but the referee doesn't.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1\\,000 $ ) — the number of test cases.\n\nEach test case is represented by one line containing the string $ s $ , consisting of exactly $ 10 $ characters. Each character is either 1, 0, or ?.",
    "outputFormat": "For each test case, print one integer — the minimum possible number of kicks in the penalty phase.",
    "samples": [
        [
            "4\n1?0???1001\n1111111111\n??????????\n0100000000",
            "7\n10\n6\n9"
        ]
    ],
    "hint": "Consider the example test:\n\nIn the first test case, consider the situation when the $ 1 $ -st, $ 5 $ -th and $ 7 $ -th kicks score goals, and kicks $ 2 $ , $ 3 $ , $ 4 $ and $ 6 $ are unsuccessful. Then the current number of goals for the first team is $ 3 $ , for the second team is $ 0 $ , and the referee sees that the second team can score at most $ 2 $ goals in the remaining kicks. So the penalty phase can be stopped after the $ 7 $ -th kick.\n\nIn the second test case, the penalty phase won't be stopped until all $ 10 $ kicks are finished.\n\nIn the third test case, if the first team doesn't score any of its three first kicks and the second team scores all of its three first kicks, then after the $ 6 $ -th kick, the first team has scored $ 0 $ goals and the second team has scored $ 3 $ goals, and the referee sees that the first team can score at most $ 2 $ goals in the remaining kicks. So, the penalty phase can be stopped after the $ 6 $ -th kick.\n\nIn the fourth test case, even though you can predict the whole penalty phase, the referee understands that the phase should be ended only after the $ 9 $ -th kick.",
    "translation": "现在一共有 $10$ 次罚球机会，其中奇数次属于队伍 $1$，偶数次属于队伍 $2$。\n\n在罚球开始前，你预先知道了每一次罚球是必定成功（字符 $1$），必定不成功（字符 $0$），还是由你操纵（字符 $?$）。当一次罚球成功时，所在的队伍就会得到 $1$ 分，最终得分高的队伍获胜。\n\n当裁判发现某个队伍必胜的时候，就会宣布停止罚球（注意，裁判并不能预知罚球结果）。现在，你希望罚球的轮数尽可能少，求出这个轮数。"
}