{
    "description": "You are an upcoming movie director, and you have just released your first movie. You have also launched a simple review site with two buttons to press — upvote and downvote.\n\nHowever, the site is not so simple on the inside. There are two servers, each with its separate counts for the upvotes and the downvotes.\n\n $ n $ reviewers enter the site one by one. Each reviewer is one of the following types:\n\n- type $ 1 $ : a reviewer has watched the movie, and they like it — they press the upvote button;\n- type $ 2 $ : a reviewer has watched the movie, and they dislike it — they press the downvote button;\n- type $ 3 $ : a reviewer hasn't watched the movie — they look at the current number of upvotes and downvotes of the movie on the server they are in and decide what button to press. If there are more downvotes than upvotes, then a reviewer downvotes the movie. Otherwise, they upvote the movie.\n\nEach reviewer votes on the movie exactly once.\n\nSince you have two servers, you can actually manipulate the votes so that your movie gets as many upvotes as possible. When a reviewer enters a site, you know their type, and you can send them either to the first server or to the second one.\n\nWhat is the maximum total number of upvotes you can gather over both servers if you decide which server to send each reviewer to?",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of testcases.\n\nThen the descriptions of $ t $ testcases follow.\n\nThe first line of each testcase contains a single integer $ n $ ( $ 1 \\le n \\le 50 $ ) — the number of reviewers.\n\nThe second line of each testcase contains $ n $ integers $ r_1, r_2, \\dots, r_n $ ( $ 1 \\le r_i \\le 3 $ ) — the types of the reviewers in the same order they enter the site.",
    "outputFormat": "For each testcase print a single integer — the maximum total number of upvotes you can gather over both servers if you decide which server to send each reviewer to.",
    "samples": [
        [
            "4\n1\n2\n3\n1 2 3\n5\n1 1 1 1 1\n3\n3 3 2",
            "0\n2\n5\n2"
        ]
    ],
    "hint": "In the first testcase of the example you can send the only reviewer to either of the servers — they'll downvote anyway. The movie won't receive any upvotes.\n\nIn the second testcase of the example you can send all reviewers to the first server:\n\n- the first reviewer upvotes;\n- the second reviewer downvotes;\n- the last reviewer sees that the number of downvotes is not greater than the number of upvotes — upvote themselves.\n\nThere are two upvotes in total. Alternatevely, you can send the first and the second reviewers to the first server and the last reviewer — to the second server:\n\n- the first reviewer upvotes on the first server;\n- the second reviewer downvotes on the first server;\n- the last reviewer sees no upvotes or downvotes on the second server — upvote themselves.",
    "translation": "### 题目描述\n\n你有一个投票网站，每个用户可以投推荐票或者反对票。你的网站有两个服务器，每个服务器中的票数相互独立。\n\n有 $n$ 个人会逐一来你的网站投票，这 $n$ 个人可以被分为三种类型：\n\n- 类型1：往所在的服务器投一张推荐票；\n- 类型2：往所在的服务器投一张反对票；\n- 类型3：若所在的服务器中反对票数量大于推荐票数量，那么他会在此投一张反对票；否则他会投一张推荐票。\n\n你现在已经知道每位用户的类型，并且可以手动将其分配到任一服务器，求两服务器中推荐票数之和的最大值。\n\n### 输入格式\n\n第一行包含一个整数 $t$ ( $1 \\le t \\le 10^4$ )，表示测试数据的数量。\n\n接下来输入 $t$ 组数据，每一组数据的第一行包含一个整数 $n$ ( $1 \\le n \\le 50$ )，表示用户数量。第二行包含 $n$ 个正整数 $r_1,r_2,...,r_n$ ( $1 \\le r \\le 3$ )，表示每一位用户的类型。\n\n### 输出格式\n\n$t$ 行，每行一个正整数，表示在每组数据种你可以获得的推荐票之和的最大值。"
}