{
    "description": "It is the hard version of the problem. The difference is that in this version, there are nodes with already chosen colors.\n\nTheofanis is starving, and he wants to eat his favorite food, sheftalia. However, he should first finish his homework. Can you help him with this problem?\n\nYou have a perfect binary tree of $ 2^k - 1 $ nodes — a binary tree where all vertices $ i $ from $ 1 $ to $ 2^{k - 1} - 1 $ have exactly two children: vertices $ 2i $ and $ 2i + 1 $ . Vertices from $ 2^{k - 1} $ to $ 2^k - 1 $ don't have any children. You want to color its vertices with the $ 6 $ Rubik's cube colors (White, Green, Red, Blue, Orange and Yellow).\n\nLet's call a coloring good when all edges connect nodes with colors that are neighboring sides in the Rubik's cube.\n\n ![](https://espresso.codeforces.com/81468de2d38e27a371abfa76db5ecd8938d6437a.png)![](https://espresso.codeforces.com/acbbacfbb22e480bc2bdcb3e0731504ff698a3f2.png)A picture of Rubik's cube and its 2D map.More formally:\n\n- a white node can not be neighboring with white and yellow nodes;\n- a yellow node can not be neighboring with white and yellow nodes;\n- a green node can not be neighboring with green and blue nodes;\n- a blue node can not be neighboring with green and blue nodes;\n- a red node can not be neighboring with red and orange nodes;\n- an orange node can not be neighboring with red and orange nodes;\n\nHowever, there are $ n $ special nodes in the tree, colors of which are already chosen.\n\nYou want to calculate the number of the good colorings of the binary tree. Two colorings are considered different if at least one node is colored with a different color.\n\nThe answer may be too large, so output the answer modulo $ 10^9+7 $ .",
    "inputFormat": "The first line contains the integers $ k $ ( $ 1 \\le k \\le 60 $ ) — the number of levels in the perfect binary tree you need to color.\n\nThe second line contains the integer $ n $ ( $ 1 \\le n \\le \\min(2^k - 1, 2000) $ ) — the number of nodes, colors of which are already chosen.\n\nThe next $ n $ lines contains integer $ v $ ( $ 1 \\le v \\le 2^k - 1 $ ) and string $ s $ — the index of the node and the color of the node ( $ s $ is one of the white, yellow, green, blue, red and orange).\n\nIt is guaranteed that each node $ v $ appears in the input at most once.",
    "outputFormat": "Print one integer — the number of the different colorings modulo $ 10^9+7 $ .",
    "samples": [
        [
            "3\n2\n5 orange\n2 white",
            "1024"
        ],
        [
            "2\n2\n1 white\n2 white",
            "0"
        ],
        [
            "10\n3\n1 blue\n4 red\n5 orange",
            "328925088"
        ]
    ],
    "hint": "In the picture below, you can see one of the correct colorings of the first test example.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1594E2/dcebca3c4893383a751dc627ead5632c7d038ce7.png)",
    "translation": "有一棵深度为 $k$ 的满二叉树（根节点深度为 $1$）。  \n你要用 $6$ 种颜色去染色，使得相邻节点颜色不同，并且也不会是魔方对面的两个面的颜色。  \n具体来说：  \n- 如果一个节点是白色的，那么相邻节点不能是白色的或黄色的。 \n- 如果一个节点是黄色的，那么相邻节点不能是白色的或黄色的。 \n- 如果一个节点是绿色的，那么相邻节点不能是绿色的或蓝色的。 \n- 如果一个节点是蓝色的，那么相邻节点不能是绿色的或蓝色的。 \n- 如果一个节点是红色的，那么相邻节点不能是红色的或橙色的。 \n- 如果一个节点是橙色的，那么相邻节点不能是红色的或橙色的。 \n\n现在已知了 $n$ 个节点的颜色信息（在 E1 中为 0），求给整棵树染色的方案数。"
}