{
    "description": "A bitstring is a string that contains only the characters 0 and 1.\n\nKoyomi Kanou is working hard towards her dream of becoming a writer. To practice, she decided to participate in the Binary Novel Writing Contest. The writing prompt for the contest consists of three bitstrings of length $ 2n $ . A valid novel for the contest is a bitstring of length at most $ 3n $ that contains at least two of the three given strings as subsequences.\n\nKoyomi has just received the three prompt strings from the contest organizers. Help her write a valid novel for the contest.\n\nA string $ a $ is a subsequence of a string $ b $ if $ a $ can be obtained from $ b $ by deletion of several (possibly, zero) characters.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ).\n\nEach of the following three lines contains a bitstring of length $ 2n $ . It is guaranteed that these three strings are pairwise distinct.\n\nIt is guaranteed that the sum of $ n $ across all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, print a single line containing a bitstring of length at most $ 3n $ that has at least two of the given bitstrings as subsequences.\n\nIt can be proven that under the constraints of the problem, such a bitstring always exists.\n\nIf there are multiple possible answers, you may output any of them.",
    "samples": [
        [
            "2\n1\n00\n11\n01\n3\n011001\n111010\n010001",
            "010\n011001010"
        ]
    ],
    "hint": "In the first test case, the bitstrings 00 and 01 are subsequences of the output string: 010 and 010. Note that 11 is not a subsequence of the output string, but this is not required.\n\nIn the second test case all three input strings are subsequences of the output string: 011001010, 011001010 and 011001010.",
    "translation": "给你一个正整数 $n$ 和三个长度为 $2\\times n$ 的 01 字符串 $s_1,s_2,s_3$。你需要构造一个 01 字符串 $S$，使得：\n\n- 字符串 $S$ 的长度不能超过 $3\\times n$。\n- $s_1,s_2,s_3$ 当中至少有两个字符串是 $S$ 的子序列。\n\n可以证明一定有解，有多种解时输出任意一种即可。$T$ 组数据。\n\n$1\\leq T\\leq10^4;1\\leq n,\\sum n\\leq10^5;$"
}