{
    "description": "You are given a book with $ n $ chapters.\n\nEach chapter has a specified list of other chapters that need to be understood in order to understand this chapter. To understand a chapter, you must read it after you understand every chapter on its required list.\n\nCurrently you don't understand any of the chapters. You are going to read the book from the beginning till the end repeatedly until you understand the whole book. Note that if you read a chapter at a moment when you don't understand some of the required chapters, you don't understand this chapter.\n\nDetermine how many times you will read the book to understand every chapter, or determine that you will never understand every chapter no matter how many times you read the book.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 2\\cdot10^4 $ ).\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 2\\cdot10^5 $ ) — number of chapters.\n\nThen $ n $ lines follow. The $ i $ -th line begins with an integer $ k_i $ ( $ 0 \\le k_i \\le n-1 $ ) — number of chapters required to understand the $ i $ -th chapter. Then $ k_i $ integers $ a_{i,1}, a_{i,2}, \\dots, a_{i, k_i} $ ( $ 1 \\le a_{i, j} \\le n, a_{i, j} \\ne i, a_{i, j} \\ne a_{i, l} $ for $ j \\ne l $ ) follow — the chapters required to understand the $ i $ -th chapter.\n\nIt is guaranteed that the sum of $ n $ and sum of $ k_i $ over all testcases do not exceed $ 2\\cdot10^5 $ .",
    "outputFormat": "For each test case, if the entire book can be understood, print how many times you will read it, otherwise print $ -1 $ .",
    "samples": [
        [
            "5\n4\n1 2\n0\n2 1 4\n1 2\n5\n1 5\n1 1\n1 2\n1 3\n1 4\n5\n0\n0\n2 1 2\n1 2\n2 2 1\n4\n2 2 3\n0\n0\n2 3 2\n5\n1 2\n1 3\n1 4\n1 5\n0",
            "2\n-1\n1\n2\n5"
        ]
    ],
    "hint": "In the first example, we will understand chapters $ \\{2, 4\\} $ in the first reading and chapters $ \\{1, 3\\} $ in the second reading of the book.\n\nIn the second example, every chapter requires the understanding of some other chapter, so it is impossible to understand the book.\n\nIn the third example, every chapter requires only chapters that appear earlier in the book, so we can understand everything in one go.\n\nIn the fourth example, we will understand chapters $ \\{2, 3, 4\\} $ in the first reading and chapter $ 1 $ in the second reading of the book.\n\nIn the fifth example, we will understand one chapter in every reading from $ 5 $ to $ 1 $ .",
    "translation": "### 题目描述\n\n给你一本有 $n$ 章的书。\n\n每一章都有一个为理解本章而需要理解的其他章节的特定列表。要理解一个章节，你必须在理解了所需列表中的每一章后再阅读。\n\n目前你还不了解任何章节。你要从头到尾反复阅读这本书，直到你理解整本书。请注意，如果您在阅读某一章节时不理解某些必要章节，则表示您暂时不能理解本章。\n\n输出你要读多少次书才能理解每一章。如果你永远不会理解整本书，那么输出 $-1$。\n\n### 输入格式\n\n第一行一个整数 $T$（$1≤t≤2⋅10^ \n4$），表示数据组数。\n\n对于每组数据，第一行输入一个整数 $n$（$1≤n≤2⋅10^5$），表示书的章节数。接下来 $n$ 行，第 $i$ 第一个整数 $k_i$（$0≤k_i≤n-1$），表示要理解第 $i$ 章所必须要理解的章节数。之后 $k_i$ 个整数，表示要理解第 $i$ 章所必须要理解的章节的编号。\n\n### 输出格式\n\n输出共 $T$ 行。对于每组数据，输出至少要看几遍书才能理解整本书。若该书无法理解，则输出 $-1$。\n\n**translated by @xieyikai2333**"
}