{
    "description": "You are given $ n $ strings $ s_1, s_2, \\ldots, s_n $ , each consisting of lowercase and uppercase English letters. In addition, it's guaranteed that each character occurs in each string at most twice. Find the longest common subsequence of these strings.\n\nA string $ t $ is a subsequence of a string $ s $ if $ t $ can be obtained from $ s $ by deletion of several (possibly, zero or all) symbols.",
    "inputFormat": "Each test consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 5 $ ) — the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 2 \\leq n \\leq 10 $ ) — the number of strings.\n\nEach of the next $ n $ lines contains the corresponding string $ s_i $ . Each $ s_i $ is non-empty, consists only of uppercase and lowercase English letters, and no character appears more than twice in each string.",
    "outputFormat": "For each test case print the answer in two lines:\n\nIn the first line print the length of the longest common subsequence.\n\nIn the second line print the longest common subsequence. If there are multiple such subsequences, print any of them.",
    "samples": [
        [
            "4\n2\nABC\nCBA\n2\nbacab\ndefed\n3\nabcde\naBcDe\nace\n2\ncodeforces\ntechnocup",
            "1\nA\n0\n\n3\nace\n3\ncoc"
        ]
    ],
    "hint": "In the first test case, the longest common subsequence is \"A\". There are no common subsequences of length $ 2 $ .\n\nIn the second test case, sets of characters of strings don't intersect, so any non-empty string can't be a common subsequence.",
    "translation": "- 给定 $n$ 个字符串 $s_i$，每个字符串只包含大写和小写英文字母，且每个字母在每个字符串中最多出现两次。\n- 求这些字符串的最长公共子序列。\n- 多组数据。"
}