{
    "description": "After the lessons $ n $ groups of schoolchildren went outside and decided to visit Polycarpus to celebrate his birthday. We know that the $ i $ -th group consists of $ s_{i} $ friends ( $ 1<=s_{i}<=4 $ ), and they want to go to Polycarpus together. They decided to get there by taxi. Each car can carry at most four passengers. What minimum number of cars will the children need if all members of each group should ride in the same taxi (but one taxi can take more than one group)?",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of groups of schoolchildren. The second line contains a sequence of integers $ s_{1},s_{2},...,s_{n} $ ( $ 1<=s_{i}<=4 $ ). The integers are separated by a space, $ s_{i} $ is the number of children in the $ i $ -th group.",
    "outputFormat": "Print the single number — the minimum number of taxis necessary to drive all children to Polycarpus.",
    "samples": [
        [
            "5\n1 2 4 3 3\n",
            "4\n"
        ],
        [
            "8\n2 3 4 4 2 1 3 1\n",
            "5\n"
        ]
    ],
    "hint": "In the first test we can sort the children into four cars like this:\n\n- the third group (consisting of four children),\n- the fourth group (consisting of three children),\n- the fifth group (consisting of three children),\n- the first and the second group (consisting of one and two children, correspondingly).\n\nThere are other ways to sort the groups into four cars.",
    "translation": "有n组学生，每组是1，2，3或4人。他们决定一起庆祝波利卡普的生日，做出租车去。每辆车可以坐不止一组学生，也可以不坐满，但每组学生必须坐在同一辆车上。 输入n，以及每组人数a[1],a[2],……,a[n]，输出最少要多少辆车。\n\n感谢@VisitorDaniel 提供的翻译"
}