{
    "description": "An array $ b $ of length $ k $ is called good if its arithmetic mean is equal to $ 1 $ . More formally, if $ $$$\\frac{b_1 + \\cdots + b_k}{k}=1. $ $ </p><p>Note that the value  $ \\\\frac{b\\_1+\\\\cdots+b\\_k}{k} $  is not rounded up or down. For example, the array  $ \\[1,1,1,2\\] $  has an arithmetic mean of  $ 1.25 $ , which is not equal to  $ 1 $ .</p><p>You are given an integer array  $ a $  of length  $ n$$$. In an operation, you can append a non-negative integer to the end of the array. What's the minimum number of operations required to make the array good?\n\nWe have a proof that it is always possible with finitely many operations.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\leq n \\leq 50 $ ) — the length of the initial array $ a $ .\n\nThe second line of each test case contains $ n $ integers $ a_1,\\ldots,a_n $ ( $ -10^4\\leq a_i \\leq 10^4 $ ), the elements of the array.",
    "outputFormat": "For each test case, output a single integer — the minimum number of non-negative integers you have to append to the array so that the arithmetic mean of the array will be exactly $ 1 $ .",
    "samples": [
        [
            "4\n3\n1 1 1\n2\n1 2\n4\n8 4 6 2\n1\n-2",
            "0\n1\n16\n1"
        ]
    ],
    "hint": "In the first test case, we don't need to add any element because the arithmetic mean of the array is already $ 1 $ , so the answer is $ 0 $ .\n\nIn the second test case, the arithmetic mean is not $ 1 $ initially so we need to add at least one more number. If we add $ 0 $ then the arithmetic mean of the whole array becomes $ 1 $ , so the answer is $ 1 $ .\n\nIn the third test case, the minimum number of elements that need to be added is $ 16 $ since only non-negative integers can be added.\n\nIn the fourth test case, we can add a single integer $ 4 $ . The arithmetic mean becomes $ \\frac{-2+4}{2} $ which is equal to $ 1 $ .",
    "translation": "若长度为 $k$ 的序列 $b$ 的平均值为 $1$，我们认为这个序列是好的。\n\n现在给你一个长度为 $n$ 的序列 $a$。每次操作时，你可以将一个非负整数追加到序列末尾。\n\n若要使原序列变好，求最小操作次数。\n\n可以证明存在有限步数使序列变好。"
}