{
    "description": "A new cottage village called «Flatville» is being built in Flatland. By now they have already built in «Flatville» $n$ square houses with the centres on the      $Ox$ -axis. The houses' sides are parallel to the coordinate axes. It's known that no two houses overlap, but they can touch each other.\n\nThe architect bureau, where Peter works, was commissioned to build a new house in «Flatville». The customer wants his future house to be on the $Ox$ -axis, to be square in shape, have a side $ t $ , and touch at least one of the already built houses. For sure, its sides should be parallel to the coordinate axes, its centre should be on the $ Ox $ -axis and it shouldn't overlap any of the houses in the village.\n\nPeter was given a list of all the houses in «Flatville». Would you help him find the amount of possible positions of the new house?",
    "inputFormat": "The first line of the input data contains numbers $ n $ and $ t $ ( $ 1<=n,t<=1000 $ ). Then there follow $ n $ lines, each of them contains two space-separated integer numbers: $ x_{i} $ $ a_{i} $ , where $ x_{i} $ — $ x $ -coordinate of the centre of the $ i $ -th house, and $ a_{i} $ — length of its side ( $ -1000<=x_{i}<=1000 $ , $ 1<=a_{i}<=1000 $ ).",
    "outputFormat": "Output the amount of possible positions of the new house.",
    "samples": [
        [
            "2 2\n0 4\n6 2\n",
            "4\n"
        ],
        [
            "2 2\n0 4\n5 2\n",
            "3\n"
        ],
        [
            "2 3\n0 4\n5 2\n",
            "2\n"
        ]
    ],
    "hint": "It is possible for the $ x $ -coordinate of the new house to have non-integer value.",
    "translation": "题目描述：给定一坐标轴，轴上有n座房子，每座房子的位置是xi，边长是ai，有个人想要贴着其中一座房子建造他自己的一座边长为t的房子，输出共有多少种建法\n输入:第一行两个整数n,t,之后n行分别有两个整数xi和ai\n输出:见题目描述\n注意：xi为每座房子的中心坐标\n\n1<=n,t<=1000\n−1000<=xi<=1000 \n1<=ai<=1000\n\n感谢 @稀神探女  提供的翻译。"
}