{
    "description": "This is an interactive problem!\n\nAs part of your contribution in the Great Bubble War, you have been tasked with finding the newly built enemy fortress. The world you live in is a giant $ 10^9 \\times 10^9 $ grid, with squares having both coordinates between $ 1 $ and $ 10^9 $ .\n\nYou know that the enemy base has the shape of a rectangle, with the sides parallel to the sides of the grid. The people of your world are extremely scared of being at the edge of the world, so you know that the base doesn't contain any of the squares on the edges of the grid (the $ x $ or $ y $ coordinate being $ 1 $ or $ 10^9 $ ).\n\nTo help you locate the base, you have been given a device that you can place in any square of the grid, and it will tell you the manhattan distance to the closest square of the base. The manhattan distance from square $ (a, b) $ to square $ (p, q) $ is calculated as $ |a−p|+|b−q| $ . If you try to place the device inside the enemy base, you will be captured by the enemy. Because of this, you need to make sure to never place the device inside the enemy base.\n\nUnfortunately, the device is powered by a battery and you can't recharge it. This means that you can use the device at most $ 40 $ times.",
    "inputFormat": "The input contains the answers to your queries.",
    "outputFormat": "Your code is allowed to place the device on any square in the grid by writing \"? $ i $ $ j $ \" $ (1 \\leq i,j \\leq 10^9) $ . In return, it will recieve the manhattan distance to the closest square of the enemy base from square $ (i,j) $ or $ -1 $ if the square you placed the device on is inside the enemy base or outside the grid.\n\nIf you recieve $ -1 $ instead of a positive number, exit immidiately and you will see the wrong answer verdict. Otherwise, you can get an arbitrary verdict because your solution will continue to read from a closed stream.\n\nYour solution should use no more than $ 40 $ queries.\n\nOnce you are sure where the enemy base is located, you should print \"! $ x $ $ y $ $ p $ $ q $ \" $ (1 \\leq x \\leq p\\leq 10^9, 1 \\leq y \\leq q\\leq 10^9) $ , where $ (x, y) $ is the square inside the enemy base with the smallest $ x $ and $ y $ coordinates, and $ (p, q) $ is the square inside the enemy base with the largest $ x $ and $ y $ coordinates. Note that answering doesn't count as one of the 40 queries.\n\nAfter printing a query or printing the answer, do not forget to output end of line and flush the output. Otherwise, you will get idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- See the documentation for other languages.",
    "samples": [
        [
            "1\n1\n2\n1",
            "? 2 2\n? 5 5\n? 4 7\n? 1 5\n! 2 3 4 5"
        ]
    ],
    "hint": "",
    "translation": "这是一道**交互题。**\n\n有一个 $10^9 \\times 10^9$ 的正方形网格，敌方基地是一个长方形，且不包含网格边缘的格子，你需要找出敌方基地的位置。\n\n你可以在任意位置放置一个侦查器，它会告诉你它与最近的敌方基地格子的曼哈顿距离，如果它被放置在了敌方基地内部，你就会被发现，所以**你需要避免将侦查器放在敌方基地内部**。\n\n## 交互方式\n打印一行 \"$?\\;i\\;j$\"，表示在 $(i,j)$ 处放置一个侦查器，如果 $(i,j)$ 在敌方基地内部或者超出网格边界，返回 $-1$，否则返回 $(i,j)$ 与最近的敌方基地格子的曼哈顿距离。\n\n得到答案后，打印一行 \"$!\\;x\\;y\\;p\\;q$\"，其中 $(x,y)$ 表示敌方基地左上角坐标，$(p,q)$ 表示敌方基地右下角坐标。"
}