{
    "description": "You have an axis-aligned rectangle room with width $ W $ and height $ H $ , so the lower left corner is in point $ (0, 0) $ and the upper right corner is in $ (W, H) $ .\n\nThere is a rectangular table standing in this room. The sides of the table are parallel to the walls, the lower left corner is in $ (x_1, y_1) $ , and the upper right corner in $ (x_2, y_2) $ .\n\nYou want to place another rectangular table in this room with width $ w $ and height $ h $ with the width of the table parallel to the width of the room.\n\nThe problem is that sometimes there is not enough space to place the second table without intersecting with the first one (there are no problems with tables touching, though).\n\nYou can't rotate any of the tables, but you can move the first table inside the room.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1555B/148c3af8c708a59f4665d57c0e4342daba4e07ae.png)Example of how you may move the first table.What is the minimum distance you should move the first table to free enough space for the second one?",
    "inputFormat": "The first line contains the single integer $ t $ ( $ 1 \\le t \\le 5000 $ ) — the number of the test cases.\n\nThe first line of each test case contains two integers $ W $ and $ H $ ( $ 1 \\le W, H \\le 10^8 $ ) — the width and the height of the room.\n\nThe second line contains four integers $ x_1 $ , $ y_1 $ , $ x_2 $ and $ y_2 $ ( $ 0 \\le x_1 < x_2 \\le W $ ; $ 0 \\le y_1 < y_2 \\le H $ ) — the coordinates of the corners of the first table.\n\nThe third line contains two integers $ w $ and $ h $ ( $ 1 \\le w \\le W $ ; $ 1 \\le h \\le H $ ) — the width and the height of the second table.",
    "outputFormat": "For each test case, print the minimum distance you should move the first table, or $ -1 $ if there is no way to free enough space for the second table.\n\nYour answer will be considered correct if its absolute or relative error doesn't exceed $ 10^{-6} $ .",
    "samples": [
        [
            "5\n8 5\n2 1 7 4\n4 2\n5 4\n2 2 5 4\n3 3\n1 8\n0 3 1 6\n1 5\n8 1\n3 0 6 1\n5 1\n8 10\n4 5 7 8\n8 5",
            "1.000000000\n-1\n2.000000000\n2.000000000\n0.000000000"
        ]
    ],
    "hint": "The configuration of the first test case is shown in the picture. But the movement of the first table is not optimal. One of the optimal movement, for example, is to move the table by $ (0, -1) $ , so the lower left corner will move from $ (2, 1) $ to $ (2, 0) $ . Then you can place the second table at $ (0, 3)-(4, 5) $ .\n\nIn the second test case, there is no way to fit both tables in the room without intersecting.\n\nIn the third test case, you can move the first table by $ (0, 2) $ , so the lower left corner will move from $ (0, 3) $ to $ (0, 5) $ .",
    "translation": "在一个横长 $W$ 纵长 $H$ 的房间中，以房间左下角为 $(0,0)$，以房间横长方向为横轴，以房间纵方向为纵轴，建立平面直角坐标系。\n\n在房间中有一个左下角在 $(x_1,y_1)$，右上角 $(x_2,y_2)$，边与坐标轴平行的长方形桌子。现在我们想再在房间中放入**另一个**横长 $w$ 纵长 $h$，边与坐标轴平行的桌子。问我们最小需要把第一个桌子移动多少距离？如果无解输出 `-1`。\n\n注意多测。"
}