{
    "description": "The only difference between the easy and hard versions is that the given string $ s $ in the easy version is initially a palindrome, this condition is not always true for the hard version.\n\nA palindrome is a string that reads the same left to right and right to left. For example, \"101101\" is a palindrome, while \"0101\" is not.\n\nAlice and Bob are playing a game on a string $ s $ of length $ n $ consisting of the characters '0' and '1'. Both players take alternate turns with Alice going first.\n\nIn each turn, the player can perform one of the following operations:\n\n1. Choose any $ i $ ( $ 1 \\le i \\le n $ ), where $ s[i] = $ '0' and change $ s[i] $ to '1'. Pay 1 dollar.\n2. Reverse the whole string, pay 0 dollars. This operation is only allowed if the string is currently not a palindrome, and the last operation was not reverse. That is, if Alice reverses the string, then Bob can't reverse in the next move, and vice versa.\n\nReversing a string means reordering its letters from the last to the first. For example, \"01001\" becomes \"10010\" after reversing.\n\nThe game ends when every character of string becomes '1'. The player who spends minimum dollars till this point wins the game and it is a draw if both spend equal dollars. If both players play optimally, output whether Alice wins, Bob wins, or if it is a draw.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^3 $ ). Then $ t $ test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^3 $ ).\n\nThe second line of each test case contains the string $ s $ of length $ n $ , consisting of the characters '0' and '1'. It is guaranteed that the string $ s $ contains at least one '0'.\n\nNote that there is no limit on the sum of $ n $ over test cases.",
    "outputFormat": "For each test case print a single word in a new line:\n\n- \"ALICE\", if Alice will win the game,\n- \"BOB\", if Bob will win the game,\n- \"DRAW\", if the game ends in a draw.",
    "samples": [
        [
            "3\n3\n110\n2\n00\n4\n1010",
            "ALICE\nBOB\nALICE"
        ]
    ],
    "hint": "In the first test case of example,\n\n- in the $ 1 $ -st move, Alice will use the $ 2 $ -nd operation to reverse the string, since doing the $ 1 $ -st operation will result in her loss anyway. This also forces Bob to use the $ 1 $ -st operation.\n- in the $ 2 $ -nd move, Bob has to perform the $ 1 $ -st operation, since the $ 2 $ -nd operation cannot be performed twice in a row. All characters of the string are '1', game over.\n\n Alice spends $ 0 $ dollars while Bob spends $ 1 $ dollar. Hence, Alice wins.In the second test case of example,\n\n- in the $ 1 $ -st move Alice has to perform the $ 1 $ -st operation, since the string is currently a palindrome.\n- in the $ 2 $ -nd move Bob reverses the string.\n- in the $ 3 $ -rd move Alice again has to perform the $ 1 $ -st operation. All characters of the string are '1', game over.\n\n Alice spends $ 2 $ dollars while Bob spends $ 0 $ dollars. Hence, Bob wins."
}