{
    "description": "Welcome to Rockport City!\n\nIt is time for your first ever race in the game against Ronnie. To make the race interesting, you have bet $ a $ dollars and Ronnie has bet $ b $ dollars. But the fans seem to be disappointed. The excitement of the fans is given by $ gcd(a,b) $ , where $ gcd(x, y) $ denotes the [greatest common divisor (GCD)](https://en.wikipedia.org/wiki/Greatest_common_divisor) of integers $ x $ and $ y $ . To make the race more exciting, you can perform two types of operations:\n\n1. Increase both $ a $ and $ b $ by $ 1 $ .\n2. Decrease both $ a $ and $ b $ by $ 1 $ . This operation can only be performed if both $ a $ and $ b $ are greater than $ 0 $ .\n\nIn one move, you can perform any one of these operations. You can perform arbitrary (possibly zero) number of moves. Determine the maximum excitement the fans can get and the minimum number of moves required to achieve it.\n\nNote that $ gcd(x,0)=x $ for any $ x \\ge 0 $ .",
    "inputFormat": "The first line of input contains a single integer $ t $ ( $ 1\\leq t\\leq 5\\cdot 10^3 $ ) — the number of test cases.\n\nThe first and the only line of each test case contains two integers $ a $ and $ b $ ( $ 0\\leq a, b\\leq 10^{18} $ ).",
    "outputFormat": "For each test case, print a single line containing two integers.\n\nIf the fans can get infinite excitement, print 0 0.\n\nOtherwise, the first integer must be the maximum excitement the fans can get, and the second integer must be the minimum number of moves required to achieve that excitement.",
    "samples": [
        [
            "4\n8 5\n1 2\n4 4\n3 9",
            "3 1\n1 0\n0 0\n6 3"
        ]
    ],
    "hint": "For the first test case, you can apply the first operation $ 1 $ time to get $ a=9 $ and $ b=6 $ . It can be shown that $ 3 $ is the maximum excitement possible.\n\nFor the second test case, no matter how many operations you apply, the fans will always have an excitement equal to $ 1 $ . Since the initial excitement is also $ 1 $ , you don't need to apply any operation.\n\nFor the third case, the fans can get infinite excitement by applying the first operation an infinite amount of times.\n\nFor the fourth test case, you can apply the second operation $ 3 $ times to get $ a=0 $ and $ b=6 $ . Since, $ gcd(0,6)=6 $ , the fans will get an excitement of $ 6 $ .",
    "translation": "给定非负整数 $a,b$，你可以进行下面的操作任意次：  \n\n1. 使 $a,b$ 都增加 $1$。\n2. 使 $a,b$ 都减少 $1$（要求操作前 $a,b$ 都大于 $0$）。\n\n求出经过若干次操作后 $\\gcd(a,b)$ 的最大值，并求出至少需要多少次操作以获得这个最大值。特别的，如果 $\\gcd(a,b)$ 可以变成无限大，输出 `0 0`。$T$ 组数据。  \n注意 $x\\geq 0$ 时 $\\gcd(x,0)=x$。\n\n数据范围：$1\\leq T\\leq5\\times10^3$，$0\\leq a,b\\leq10^{18}$。"
}