{
    "description": "Polycarp has found a table having an infinite number of rows and columns. The rows are numbered from $ 1 $ , starting from the topmost one. The columns are numbered from $ 1 $ , starting from the leftmost one.\n\nInitially, the table hasn't been filled and Polycarp wants to fix it. He writes integers from $ 1 $ and so on to the table as follows.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1560C/fbe22cdb57a9c1d91e54741c4b3ed27f17ef455a.png)The figure shows the placement of the numbers from $ 1 $ to $ 10 $ . The following actions are denoted by the arrows.The leftmost topmost cell of the table is filled with the number $ 1 $ . Then he writes in the table all positive integers beginning from $ 2 $ sequentially using the following algorithm.\n\nFirst, Polycarp selects the leftmost non-filled cell in the first row and fills it. Then, while the left neighbor of the last filled cell is filled, he goes down and fills the next cell. So he goes down until the last filled cell has a non-filled neighbor to the left (look at the vertical arrow going down in the figure above).\n\nAfter that, he fills the cells from the right to the left until he stops at the first column (look at the horizontal row in the figure above). Then Polycarp selects the leftmost non-filled cell in the first row, goes down, and so on.\n\nA friend of Polycarp has a favorite number $ k $ . He wants to know which cell will contain the number. Help him to find the indices of the row and the column, such that the intersection of the row and the column is the cell containing the number $ k $ .",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nEach test case consists of one line containing one integer $ k $ ( $ 1 \\le k \\le 10^9 $ ) which location must be found.",
    "outputFormat": "For each test case, output in a separate line two integers $ r $ and $ c $ ( $ r, c \\ge 1 $ ) separated by spaces — the indices of the row and the column containing the cell filled by the number $ k $ , respectively.",
    "samples": [
        [
            "7\n11\n14\n5\n4\n1\n2\n1000000000",
            "2 4\n4 3\n1 3\n2 1\n1 1\n1 2\n31623 14130"
        ]
    ],
    "hint": "",
    "translation": "全体正整数按照如下方式排列在表格中：\n\n![图片](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1560C/fbe22cdb57a9c1d91e54741c4b3ed27f17ef455a.png)\n\nPolycarp 会用以下方式把 $i$ 填充在表格中（设 $i-1$ 填在 $(x,y)$）：\n\n- 若 $i=1$，把它填进左上角，再填 $i+1$。\n\n- 否则，若 $x=1$，填在 $(x+1,y)$，再填 $i+1$。\n\n- 否则，若 $y=1$，填在 $(1,x+1)$，再填 $i+1$。\n\n- 否则，若 $x<y$，填在 $(x+1,y)$，再填 $i+1$。\n\n- 否则，若 $x\\ge y$，填在 $(x,y-1)$，再填 $i+1$。\n\n求出第 $k$ 个数所在的位置 $(x,y)$。"
}