{
    "description": "Igor is in 11th grade. Tomorrow he will have to write an informatics test by the strictest teacher in the school, Pavel Denisovich.\n\nIgor knows how the test will be conducted: first of all, the teacher will give each student two positive integers $ a $ and $ b $ ( $ a < b $ ). After that, the student can apply any of the following operations any number of times:\n\n- $ a := a + 1 $ (increase $ a $ by $ 1 $ ),\n- $ b := b + 1 $ (increase $ b $ by $ 1 $ ),\n- $ a := a \\ | \\ b $ (replace $ a $ with the [bitwise OR](https://en.wikipedia.org/wiki/Bitwise_operation#OR) of $ a $ and $ b $ ).\n\nTo get full marks on the test, the student has to tell the teacher the minimum required number of operations to make $ a $ and $ b $ equal.\n\nIgor already knows which numbers the teacher will give him. Help him figure out what is the minimum number of operations needed to make $ a $ equal to $ b $ .",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). Description of the test cases follows.\n\nThe only line for each test case contains two integers $ a $ and $ b $ ( $ 1 \\le a < b \\le 10^6 $ ).\n\nIt is guaranteed that the sum of $ b $ over all test cases does not exceed $ 10^6 $ .",
    "outputFormat": "For each test case print one integer — the minimum required number of operations to make $ a $ and $ b $ equal.",
    "samples": [
        [
            "5\n1 3\n5 8\n2 5\n3 19\n56678 164422",
            "1\n3\n2\n1\n23329"
        ]
    ],
    "hint": "In the first test case, it is optimal to apply the third operation.\n\nIn the second test case, it is optimal to apply the first operation three times.\n\nIn the third test case, it is optimal to apply the second operation and then the third operation.",
    "translation": "给定两个整数 $a,b$。你可以执行若干次操作，每次操作分为如下三种：\n\n- $a\\leftarrow a+1$。\n- $b\\leftarrow b+1$。\n- $a\\leftarrow a\\operatorname{or} b$。\n\n其中 $x\\leftarrow y$ 表示将 $x$ 的值替换为 $y$，即赋值操作。$\\operatorname{or}$ 表示按位或操作。\n\n请求出使得 $a$ 变为 $b$ 的最少操作次数。\n\n数据范围：\n\n- $t$ 组数据，$1\\leqslant t\\leqslant 10^4$。\n- $1\\leqslant a<b\\leqslant 10^6$。\n- $\\bf\\sum b\\leqslant 10^6$。\n\nTranslated by Eason_AC  \n2022.1.31"
}