{
    "description": "You are given a board of size $ 2 \\times n $ ( $ 2 $ rows, $ n $ columns). Some cells of the board contain chips. The chip is represented as '\\*', and an empty space is represented as '.'. It is guaranteed that there is at least one chip on the board.\n\nIn one move, you can choose any chip and move it to any adjacent (by side) cell of the board (if this cell is inside the board). It means that if the chip is in the first row, you can move it left, right or down (but it shouldn't leave the board). Same, if the chip is in the second row, you can move it left, right or up.\n\nIf the chip moves to the cell with another chip, the chip in the destination cell disappears (i. e. our chip captures it).\n\nYour task is to calculate the minimum number of moves required to leave exactly one chip on the board.\n\nYou have to answer $ t $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 2 \\cdot 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of the test case contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the length of the board. The second line of the test case contains the string $ s_1 $ consisting of $ n $ characters '\\*' (chip) and/or '.' (empty cell). The third line of the test case contains the string $ s_2 $ consisting of $ n $ characters '\\*' (chip) and/or '.' (empty cell).\n\nAdditional constraints on the input:\n\n- in each test case, there is at least one chip on a board;\n- the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ ( $ \\sum n \\le 2 \\cdot 10^5 $ ).",
    "outputFormat": "For each test case, print one integer — the minimum number of moves required to leave exactly one chip on the board.",
    "samples": [
        [
            "5\n1\n*\n.\n2\n.*\n**\n3\n*.*\n.*.\n4\n**.*\n**..\n5\n**...\n...**",
            "0\n2\n3\n5\n5"
        ]
    ],
    "hint": "",
    "translation": "## 题意翻译  \n### 题意简述\n给你一个大小为$2$×$n$的棋盘，\n棋子用'*'表示，空位用'.'表示。  \n在一次移动中，你可以选择任何棋子并将其移动到棋盘的任何相邻的格子，如果目的格子中有棋子则把他们合并为一个。  \n### 输入格式  \n第一行一个正整数$t$表示数据组数。  \n对于每组数据，第一行一个正整数$n$表示棋盘列数，接下来两行每行输入一个字符串$s$，\n表示棋盘初始状态。  \n### 输出格式  \n对于每组数据输出一个正整数表示在棋盘上正好留下一个棋子所需的最小移动数。  \n### 数据规模  \n$1$<=$t$<=$10^{4}$，$1$<=$n$<=$2\\cdot$$10^{5}$  \n所有测试案例的$n$之和不超过$2$$\\cdot$$10^{5}$\n($\\sum_{}^{}$$n$<=$2$$\\cdot$$10^{5}$)"
}