{
    "description": "Anton came to a chocolate factory. There he found a working conveyor and decided to run on it from the beginning to the end.\n\nThe conveyor is a looped belt with a total length of $ 2l $ meters, of which $ l $ meters are located on the surface and are arranged in a straight line. The part of the belt which turns at any moment (the part which emerges from under the floor to the surface and returns from the surface under the floor) is assumed to be negligibly short.\n\nThe belt is moving uniformly at speed $ v_{1} $ meters per second. Anton will be moving on it in the same direction at the constant speed of $ v_{2} $ meters per second, so his speed relatively to the floor will be $ v_{1}+v_{2} $ meters per second. Anton will neither stop nor change the speed or the direction of movement.\n\nHere and there there are chocolates stuck to the belt ( $ n $ chocolates). They move together with the belt, and do not come off it. Anton is keen on the chocolates, but he is more keen to move forward. So he will pick up all the chocolates he will pass by, but nothing more. If a chocolate is at the beginning of the belt at the moment when Anton starts running, he will take it, and if a chocolate is at the end of the belt at the moment when Anton comes off the belt, he will leave it.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF163C/ecea59876b6062e31fc2946453a849ab5fc36d2b.png) The figure shows an example with two chocolates. One is located in the position $ a_{1}=l-d $ , and is now on the top half of the belt, the second one is in the position $ a_{2}=2l-d $ , and is now on the bottom half of the belt. You are given the positions of the chocolates relative to the initial start position of the belt $ 0<=a_{1}&lt;a_{2}&lt;...&lt;a_{n}&lt;2l $ . The positions on the belt from $ 0 $ to $ l $ correspond to the top, and from $ l $ to $ 2l $ — to the the bottom half of the belt (see example). All coordinates are given in meters.\n\nAnton begins to run along the belt at a random moment of time. This means that all possible positions of the belt at the moment he starts running are equiprobable. For each $ i $ from $ 0 $ to $ n $ calculate the probability that Anton will pick up exactly $ i $ chocolates.",
    "inputFormat": "The first line contains space-separated integers $ n $ , $ l $ , $ v_{1} $ and $ v_{2} $ ( $ 1<=n<=10^{5} $ , $ 1<=l,v_{1},v_{2}<=10^{9} $ ) — the number of the chocolates, the length of the conveyor's visible part, the conveyor's speed and Anton's speed.\n\nThe second line contains a sequence of space-separated integers $ a_{1},a_{2},...,a_{n} $ ( $ 0<=a_{1}&lt;a_{2}&lt;...&lt;a_{n}&lt;2l $ ) — the coordinates of the chocolates.",
    "outputFormat": "Print $ n+1 $ numbers (one per line): the probabilities that Anton picks up exactly $ i $ chocolates, for each $ i $ from $ 0 $ (the first line) to $ n $ (the last line). The answer will be considered correct if each number will have absolute or relative error of at most than $ 10^{-9} $ .",
    "samples": [
        [
            "1 1 1 1\n0\n",
            "0.75000000000000000000\n0.25000000000000000000\n"
        ],
        [
            "2 3 1 2\n2 5\n",
            "0.33333333333333331000\n0.66666666666666663000\n0.00000000000000000000\n"
        ]
    ],
    "hint": "In the first sample test Anton can pick up a chocolate if by the moment he starts running its coordinate is less than 0.5; but if by the moment the boy starts running the chocolate's coordinate is greater than or equal to 0.5, then Anton won't be able to pick it up. As all positions of the belt are equiprobable, the probability of picking up the chocolate equals ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF163C/602b88373d9608e204fc61410e9f816ff376a2b2.png), and the probability of not picking it up equals ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF163C/70dca66c1e73c9ed2f574d47825bf5e09220d716.png).",
    "translation": "#### 题目描述：\n\n工厂中有一条长为 $2l$ 的传送带，前 $l$ 米面向上方，后 $l$ 米面向下方。传送带以 $v_1$ m/s的速度进行匀速运动，Anton以 $v_2$ m/s的速度在传送带上进行与其方向相同的匀速直线运动。传送带上有 $n$ 块巧克力（巧克力不会掉落且随传送带运动），Anton会捡起他经过的所有巧克力（该过程不消耗时间，包含起点而不包含终点的巧克力）。Anton有相等的概率选择任意位置作为起点。请你对于 $0\\le i\\le n$ ，求出Anton捡得 $i$ 块巧克力的概率。\n\n\n\n#### 输入格式：\n\n第一行四个正整数 $n,l,v_1,v_2$ （ $1\\le n\\le 10^5,1\\le l,v_1,v_2\\le 10^9$ ），分别表示巧克力个数、传送带正面长度、传送带速度与Anton速度。\n\n第二行 $n$ 个整数 $a_i$ （ $0\\le a_1<a_2<\\cdots <a_n< 2l$ ），表示巧克力坐标。\n\n\n\n#### 输出格式：\n\n输出 $n+1$ 行，第 $i$ 行一个实数，表示共捡起 $i$ 块巧克力的概率。\n\n若答案与正解之差的绝对值 $\\le 10^9$ ，则被判断正确。"
}