{
    "description": "Mike and Joe are playing a game with some stones. Specifically, they have $ n $ piles of stones of sizes $ a_1, a_2, \\ldots, a_n $ . These piles are arranged in a circle.\n\nThe game goes as follows. Players take turns removing some positive number of stones from a pile in clockwise order starting from pile $ 1 $ . Formally, if a player removed stones from pile $ i $ on a turn, the other player removes stones from pile $ ((i\\bmod n) + 1) $ on the next turn.\n\nIf a player cannot remove any stones on their turn (because the pile is empty), they lose. Mike goes first.\n\nIf Mike and Joe play optimally, who will win?",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ). Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 50 $ ) — the number of piles.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ) — the size of the piles.",
    "outputFormat": "For each test case print the winner of the game, either \"Mike\" or \"Joe\" on its own line (without quotes).",
    "samples": [
        [
            "2\n1\n37\n2\n100 100",
            "Mike\nJoe"
        ]
    ],
    "hint": "In the first test case, Mike just takes all $ 37 $ stones on his first turn.\n\nIn the second test case, Joe can just copy Mike's moves every time. Since Mike went first, he will hit $ 0 $ on the first pile one move before Joe does so on the second pile.",
    "translation": "Mike 和 Joe 正在玩石子，迈克先手。他们有 $n$ 堆大小为 $a_1 , a_2,\\ldots,a_n$ 的石子，堆呈圆形排列。\n\n玩家从第一堆开始，顺时针依次从一堆中取出一些正数的石头。如果一个玩家在回合中从第 $i$ 堆取石头，另一个玩家在下一轮从 $ ((i\\bmod n) + 1) $ 堆取石头。\n\n如果玩家在回合中无法取走任何石头（因为堆是空的），他就输了。\n\n假设 Mike 和 Joe 都采取最优策略，那么谁会赢？\n\n## 输入格式\n\n每个测试点包含多组数据。\n第一行包含数据组数 $ t $ ( $ 1 \\le t \\le 1000 $ )。\n\n每组数据的第一行包含一个整数 $ n $ ( $ 1$ $ \\le50$ ) 表示堆的数量。\n第二行包含 $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ) 表示每个堆的大小。\n\n## 输出格式\n\n对于每组数据，在输出获胜者，Mike 或 Joe 。"
}