{
    "description": "Byteland is a beautiful land known because of its beautiful trees.\n\nMisha has found a binary tree with $ n $ vertices, numbered from $ 1 $ to $ n $ . A binary tree is an acyclic connected bidirectional graph containing $ n $ vertices and $ n - 1 $ edges. Each vertex has a degree at most $ 3 $ , whereas the root is the vertex with the number $ 1 $ and it has a degree at most $ 2 $ .\n\nUnfortunately, the root got infected.\n\nThe following process happens $ n $ times:\n\n- Misha either chooses a non-infected (and not deleted) vertex and deletes it with all edges which have an end in this vertex or just does nothing.\n- Then, the infection spreads to each vertex that is connected by an edge to an already infected vertex (all already infected vertices remain infected).\n\nAs Misha does not have much time to think, please tell him what is the maximum number of vertices he can save from the infection (note that deleted vertices are not counted as saved).",
    "inputFormat": "There are several test cases in the input data. The first line contains a single integer $ t $ ( $ 1\\leq t\\leq 5000 $ ) — the number of test cases. This is followed by the test cases description.\n\nThe first line of each test case contains one integer $ n $ ( $ 2\\leq n\\leq 3\\cdot 10^5 $ ) — the number of vertices of the tree.\n\nThe $ i $ -th of the following $ n-1 $ lines in the test case contains two positive integers $ u_i $ and $ v_i $ ( $ 1 \\leq u_i, v_i \\leq n $ ), meaning that there exists an edge between them in the graph.\n\nIt is guaranteed that the graph is a binary tree rooted at $ 1 $ . It is also guaranteed that the sum of $ n $ over all test cases won't exceed $ 3\\cdot 10^5 $ .",
    "outputFormat": "For each test case, output the maximum number of vertices Misha can save.",
    "samples": [
        [
            "4\n2\n1 2\n4\n1 2\n2 3\n2 4\n7\n1 2\n1 5\n2 3\n2 4\n5 6\n5 7\n15\n1 2\n2 3\n3 4\n4 5\n4 6\n3 7\n2 8\n1 9\n9 10\n9 11\n10 12\n10 13\n11 14\n11 15",
            "0\n2\n2\n10"
        ]
    ],
    "hint": "In the first test case, the only possible action is to delete vertex $ 2 $ , after which we save $ 0 $ vertices in total.\n\nIn the second test case, if we delete vertex $ 2 $ , we can save vertices $ 3 $ and $ 4 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1689C/1f479df0f6df9637a1dfee43da055c650bdae647.png)",
    "translation": "给定一棵以$1$ 号节点为根的二叉树，总节点个数为 $n$。\n\n现在 $1$ 号节点感染了病毒，病毒每一回合都会去感染与该节点直接相连的节点，而你在这一回合里可以选择删除任意一个没有被病毒感染（尚未被删除）的点，这样就断开了它与其直接相连的点得关系.\n\n询问最多可以有多少不被病毒感染的点，被删除的点不算做不被病毒感染的点"
}