{
    "description": "Monocarp is playing a computer game once again. He is a wizard apprentice, who only knows a single spell. Luckily, this spell can damage the monsters.\n\nThe level he's currently on contains $ n $ monsters. The $ i $ -th of them appears $ k_i $ seconds after the start of the level and has $ h_i $ health points. As an additional constraint, $ h_i \\le k_i $ for all $ 1 \\le i \\le n $ . All $ k_i $ are different.\n\nMonocarp can cast the spell at moments which are positive integer amounts of second after the start of the level: $ 1, 2, 3, \\dots $ The damage of the spell is calculated as follows. If he didn't cast the spell at the previous second, the damage is $ 1 $ . Otherwise, let the damage at the previous second be $ x $ . Then he can choose the damage to be either $ x + 1 $ or $ 1 $ . A spell uses mana: casting a spell with damage $ x $ uses $ x $ mana. Mana doesn't regenerate.\n\nTo kill the $ i $ -th monster, Monocarp has to cast a spell with damage at least $ h_i $ at the exact moment the monster appears, which is $ k_i $ .\n\nNote that Monocarp can cast the spell even when there is no monster at the current second.\n\nThe mana amount required to cast the spells is the sum of mana usages for all cast spells. Calculate the least amount of mana required for Monocarp to kill all monsters.\n\nIt can be shown that it's always possible to kill all monsters under the constraints of the problem.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of testcases.\n\nThe first line of the testcase contains a single integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the number of monsters in the level.\n\nThe second line of the testcase contains $ n $ integers $ k_1 < k_2 < \\dots < k_n $ ( $ 1 \\le k_i \\le 10^9 $ ) — the number of second from the start the $ i $ -th monster appears at. All $ k_i $ are different, $ k_i $ are provided in the increasing order.\n\nThe third line of the testcase contains $ n $ integers $ h_1, h_2, \\dots, h_n $ ( $ 1 \\le h_i \\le k_i \\le 10^9 $ ) — the health of the $ i $ -th monster.\n\nThe sum of $ n $ over all testcases doesn't exceed $ 10^4 $ .",
    "outputFormat": "For each testcase, print a single integer — the least amount of mana required for Monocarp to kill all monsters.",
    "samples": [
        [
            "3\n1\n6\n4\n2\n4 5\n2 2\n3\n5 7 9\n2 1 2",
            "10\n6\n7"
        ]
    ],
    "hint": "In the first testcase of the example, Monocarp can cast spells $ 3, 4, 5 $ and $ 6 $ seconds from the start with damages $ 1, 2, 3 $ and $ 4 $ , respectively. The damage dealt at $ 6 $ seconds is $ 4 $ , which is indeed greater than or equal to the health of the monster that appears.\n\nIn the second testcase of the example, Monocarp can cast spells $ 3, 4 $ and $ 5 $ seconds from the start with damages $ 1, 2 $ and $ 3 $ , respectively.\n\nIn the third testcase of the example, Monocarp can cast spells $ 4, 5, 7, 8 $ and $ 9 $ seconds from the start with damages $ 1, 2, 1, 1 $ and $ 2 $ , respectively.",
    "translation": "有 $n$ 个敌人，你需要在第 $k_i$ 秒用至少 $h_i$ 的攻击力打败这个敌人。\n\n攻击力的计算方式如下：\n\n1. 第一秒时，你有 $1$ 攻击力\n2. 对于后面的任意一秒，若前一秒你的攻击力为 $x$，则这一秒你的攻击力可以为 $x+1$ 或 $1$\n\n一秒内，如果你的攻击力为 $x$ ，则你就需要消耗 $x$ 的能量。\n\n请问，在你打败所有敌人的情况下，最少需要消耗多少能量。\n\n翻译人： @[BFSDFS123](https://www.luogu.com.cn/user/358739)"
}