{
    "description": "After getting bored by playing with crayons, you decided to switch to Legos! Today, you're working with a long strip, with height $ 1 $ and length $ n $ , some positions of which are occupied by $ 1 $ by $ 1 $ Lego pieces.\n\nIn one second, you can either remove two adjacent Lego pieces from the strip (if both are present), or add two Lego pieces to adjacent positions (if both are absent). You can only add or remove Lego's at two adjacent positions at the same time, as otherwise your chubby fingers run into precision issues.\n\nYou want to know exactly how much time you'll spend playing with Legos. You value efficiency, so given some starting state and some ending state, you'll always spend the least number of seconds to transform the starting state into the ending state. If it's impossible to transform the starting state into the ending state, you just skip it (so you spend $ 0 $ seconds).\n\nThe issue is that, for some positions, you don't remember whether there were Legos there or not (in either the starting state, the ending state, or both). Over all pairs of (starting state, ending state) that are consistent with your memory, find the total amount of time it will take to transform the starting state to the ending state. Print this value modulo $ 1\\,000\\,000\\,007 $ ( $ 10^9 + 7 $ ).",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases. Then $ t $ cases follow.\n\nThe first line of each test case contains one integer $ n $ ( $ 2 \\leq n \\leq 2000 $ ) — the size of the Lego strip.\n\nThe second line of each test case contains a string $ s $ of length $ n $ , consisting of the characters 0, 1, and ? — your memory of the starting state:\n\n- 1 represents a position that definitely has a Lego piece,\n- 0 represents a position that definitely does not have a Lego piece,\n- and ? represents a position that you don't remember.\n\nThe third line of each test case contains a string $ t $ of length $ n $ , consisting of the characters 0, 1, and ? — your memory of the ending state. It follows a similar format to the starting state.\n\nIt's guaranteed that the sum of $ n $ over all test cases doesn't exceed $ 2000 $ .",
    "outputFormat": "For each test case, output a single integer — the answer to the problem modulo $ 1\\,000\\,000\\,007 $ ( $ 10^9 + 7 $ ).",
    "samples": [
        [
            "6\n2\n00\n11\n3\n???\n???\n3\n??1\n0?0\n4\n??0?\n??11\n5\n?????\n0??1?\n10\n?01??01?1?\n??100?1???",
            "1\n16\n1\n14\n101\n1674"
        ]
    ],
    "hint": "For the first test case, $ 00 $ is the only possible starting state, and $ 11 $ is the only possible ending state. It takes exactly one operation to change $ 00 $ to $ 11 $ .\n\nFor the second test case, some of the possible starting and ending state pairs are:\n\n- $ (000, 011) $ — takes $ 1 $ operation.\n- $ (001, 100) $ — takes $ 2 $ operations.\n- $ (010, 000) $ — takes $ 0 $ operations, as it's impossible to achieve the ending state.",
    "translation": "对于两个长度为 $n$ 的 $01$ 串 $s,t$ ，你可以对 $s$ 进行两种操作：把相邻两个 $0$ 变成 $1$ 或把相邻两个 $1$ 变成 $0$ ，定义 $s$ 到 $t$ 的距离为最少操作次数使得 $s$ 变成 $t$ ，如过没法变则距离为 $0$ 。\n\n现在你有两个不完整的字符串，可以把其中的 $?$ 变成 $0$ 或 $1$ ，求所有情况所得到的两个 $01$ 串的距离之和。"
}