{
    "description": "A group of $ n $ alpinists has just reached the foot of the mountain. The initial difficulty of climbing this mountain can be described as an integer $ d $ .\n\nEach alpinist can be described by two integers $ s $ and $ a $ , where $ s $ is his skill of climbing mountains and $ a $ is his neatness.\n\nAn alpinist of skill level $ s $ is able to climb a mountain of difficulty $ p $ only if $ p \\leq s $ . As an alpinist climbs a mountain, they affect the path and thus may change mountain difficulty. Specifically, if an alpinist of neatness $ a $ climbs a mountain of difficulty $ p $ the difficulty of this mountain becomes $ \\max(p, a) $ .\n\nAlpinists will climb the mountain one by one. And before the start, they wonder, what is the maximum number of alpinists who will be able to climb the mountain if they choose the right order. As you are the only person in the group who does programming, you are to answer the question.\n\nNote that after the order is chosen, each alpinist who can climb the mountain, must climb the mountain at that time.",
    "inputFormat": "The first line contains two integers $ n $ and $ d $ ( $ 1 \\leq n \\leq 500\\,000 $ ; $ 0 \\leq d \\leq 10^9 $ ) — the number of alpinists and the initial difficulty of the mountain.\n\nEach of the next $ n $ lines contains two integers $ s_i $ and $ a_i $ ( $ 0 \\leq s_i, a_i \\leq 10^9 $ ) that define the skill of climbing and the neatness of the $ i $ -th alpinist.",
    "outputFormat": "Print one integer equal to the maximum number of alpinists who can climb the mountain if they choose the right order to do so.",
    "samples": [
        [
            "3 2\n2 6\n3 5\n5 7",
            "2"
        ],
        [
            "3 3\n2 4\n6 4\n4 6",
            "2"
        ],
        [
            "5 0\n1 5\n4 8\n2 7\n7 6\n3 2",
            "3"
        ]
    ],
    "hint": "In the first example, alpinists $ 2 $ and $ 3 $ can climb the mountain if they go in this order. There is no other way to achieve the answer of $ 2 $ .\n\nIn the second example, alpinist $ 1 $ is not able to climb because of the initial difficulty of the mountain, while alpinists $ 2 $ and $ 3 $ can go up in any order.\n\nIn the third example, the mountain can be climbed by alpinists $ 5 $ , $ 3 $ and $ 4 $ in this particular order. There is no other way to achieve optimal answer.",
    "translation": "## 题目描述\n\n$n$ 个人相约去爬山。  \n山的初始攀登难度为 $d$。  \n每位登山者有两个属性：技巧 $s$ 和整洁度 $a$。\n\n技巧为 $s$ 的登山者能登上攀登难度为 $p$ 的山当且仅当 $p\\leq s$。  \n在一位整洁度为 $a$ 的登山者登上攀登难度为 $p$ 的山后，山的攀登难度会变为 $\\max(p,a)$。\n\n请给这些登山者指定一个爬山的先后顺序，最大化登上山的人数。  \n如果轮到一位登山者时他能登上山，则他一定会选择登山。\n\n## 输入格式\n\n第一行两个整数 $n,d$（$1\\leq n\\leq5\\times10^5$，$0\\leq d\\leq10^9$）。  \n接下来 $n$ 行每行两个整数 $s_i,a_i$，描述第 $i$ 个登山者的信息。\n\n## 输出格式\n\n一行一个整数，为登上山的人数的最大值。"
}