{
    "description": "Mihai has an $ 8 \\times 8 $ chessboard whose rows are numbered from $ 1 $ to $ 8 $ from top to bottom and whose columns are numbered from $ 1 $ to $ 8 $ from left to right.\n\nMihai has placed exactly one bishop on the chessboard. The bishop is not placed on the edges of the board. (In other words, the row and column of the bishop are between $ 2 $ and $ 7 $ , inclusive.)\n\nThe bishop attacks in all directions diagonally, and there is no limit to the distance which the bishop can attack. Note that the cell on which the bishop is placed is also considered attacked.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1692C/a628ab5b17df485b146f85dc0b0977dd4288932f.png)An example of a bishop on a chessboard. The squares it attacks are marked in red.Mihai has marked all squares the bishop attacks, but forgot where the bishop was! Help Mihai find the position of the bishop.",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\leq t \\leq 36 $ ) — the number of test cases. The description of test cases follows. There is an empty line before each test case.\n\nEach test case consists of $ 8 $ lines, each containing $ 8 $ characters. Each of these characters is either '\\#' or '.', denoting a square under attack and a square not under attack, respectively.",
    "outputFormat": "For each test case, output two integers $ r $ and $ c $ ( $ 2 \\leq r, c \\leq 7 $ ) — the row and column of the bishop.\n\nThe input is generated in such a way that there is always exactly one possible location of the bishop that is not on the edge of the board.",
    "samples": [
        [
            "3\n\n.....#..\n#...#...\n.#.#....\n..#.....\n.#.#....\n#...#...\n.....#..\n......#.\n\n#.#.....\n.#......\n#.#.....\n...#....\n....#...\n.....#..\n......#.\n.......#\n\n.#.....#\n..#...#.\n...#.#..\n....#...\n...#.#..\n..#...#.\n.#.....#\n#.......",
            "4 3\n2 2\n4 5"
        ]
    ],
    "hint": "The first test case is pictured in the statement. Since the bishop lies in the intersection row $ 4 $ and column $ 3 $ , the correct output is 4 3.",
    "translation": "## 题目描述\n有一个$8\\times8$的棋盘，列编号从左到右递增，行编号从上到下递增。\n\n给出一个棋盘，上面用$#$标明了主教的攻击范围。请你找出主教的位置坐标，并输出其行、列编号。\n\n保证：主教的行、列编号均在$2$与$7$之间。\n\n你需要回答$t$组测试数据。 $(1\\le t \\le 36)$"
}