{
    "description": "Madoka's father just reached $ 1 $ million subscribers on Mathub! So the website decided to send him a personalized award — The Mathhub's Bit Button!\n\nThe Bit Button is a rectangular table with $ n $ rows and $ m $ columns with $ 0 $ or $ 1 $ in each cell. After exploring the table Madoka found out that:\n\n- A subrectangle $ A $ is contained in a subrectangle $ B $ if there's no cell contained in $ A $ but not contained in $ B $ .\n- Two subrectangles intersect if there is a cell contained in both of them.\n- A subrectangle is called black if there's no cell with value $ 0 $ inside it.\n- A subrectangle is called nice if it's black and it's not contained in another black subrectangle.\n- The table is called elegant if there are no two nice intersecting subrectangles.\n\nFor example, in the first illustration the red subrectangle is nice, but in the second one it's not, because it's contained in the purple subrectangle.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1647B/527c997c3730172d58419587c380220df58d0b35.png)Help Madoka to determine whether the table is elegant.",
    "inputFormat": "Each test contains multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 200 $ ) — the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains two positive integers $ n, m $ ( $ 1 \\le n, m \\le 100 $ ).\n\nThe next $ n $ lines contain strings of length $ m $ consisting of zeros and ones — the description of the table.\n\nIt is guaranteed that the sum of the values of $ n $ and the sum of the values of $ m $ for all test cases do not exceed $ 777 $ .",
    "outputFormat": "For each test case print \"YES\" if its table is elegant or print \"NO\" otherwise.\n\nYou may print each letter in any case (for example, \"YES\", \"Yes\", \"yes\", \"yEs\" will all be recognized as positive answer).",
    "samples": [
        [
            "5\n3 3\n100\n011\n011\n3 3\n110\n111\n110\n1 5\n01111\n4 5\n11111\n01010\n01000\n01000\n3 2\n11\n00\n11",
            "YES\nNO\nYES\nNO\nYES"
        ]
    ],
    "hint": "In the second test case the table is not elegant, because the red and the purple subrectangles are nice and intersect.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1647B/274bbf1f30d832fb82dd64034e57adcb4cd9b242.png)In the fourth test case the table is not elegant, because the red and the purple subrectangles are nice and intersect.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1647B/6dc815ec1b802f77b63db126c6131ed14481d644.png)",
    "translation": "在一个 $01$ 矩阵中，称一个子矩形为黑色的，当且仅当其包含的都为黑色($1$)。称一个黑色子矩形为好的，当且仅当其不是另一个黑色子矩形的子矩形。称这个 $01$ 矩阵为优雅的，当且仅当不存在两个有公共格子的好的子矩形。\n\n你的任务是，判断一个矩阵是否为优雅的。"
}