{
    "description": "Daniel is watching a football team playing a game during their training session. They want to improve their passing skills during that session.\n\nThe game involves $ n $ players, making multiple passes towards each other. Unfortunately, since the balls were moving too fast, after the session Daniel is unable to know how many balls were involved during the game. The only thing he knows is the number of passes delivered by each player during all the session.\n\nFind the minimum possible amount of balls that were involved in the game.",
    "inputFormat": "There are several test cases in the input data. The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 5 \\cdot 10^4 $ ) — the number of test cases. This is followed by the test cases description.\n\nThe first line of each test case contains one integer $ n $ ( $ 2 \\leq n \\leq 10^5 $ ) — the number of players.\n\nThe second line of the test case contains a sequence of integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\leq a_i \\leq 10^9 $ ), where $ a_i $ is the number of passes delivered by the $ i $ -th player.\n\nIt is guaranteed that the sum of $ n $ over all test cases doesn't exceed $ 10^5 $ .",
    "outputFormat": "For each test case print a single integer — the answer to the problem.",
    "samples": [
        [
            "4\n4\n2 3 3 2\n3\n1 5 2\n2\n0 0\n4\n1000000000 1000000000 1000000000 1000000000",
            "1\n2\n0\n1"
        ]
    ],
    "hint": "In the first test case, with the only ball, the game can go like this:\n\n $ 2 \\rightarrow 1 \\rightarrow 3 \\rightarrow 4 \\rightarrow 1 \\rightarrow 2 \\rightarrow 3 \\rightarrow 4 \\rightarrow 2 \\rightarrow 3 \\rightarrow 2 $ .\n\nIn the second test case, there is no possible way to play the game with only one ball. One possible way to play with two balls:\n\n $ 2 \\rightarrow 1 \\rightarrow 2 \\rightarrow 3 \\rightarrow 2 \\rightarrow 1 $ .\n\n $ 2 \\rightarrow 3 \\rightarrow 2 \\rightarrow 1 $\n\nIn the third example, there were no passes, so $ 0 $ balls are possible.",
    "translation": "传球游戏。在游戏的过程中，有 $n$ 个人。他们将要互相传球。每个人**传出**球的次数是给定的（传入不算次数）。\n\n那么，最少需要多少个球可以满足这些传球的次数呢？\n\n比如说，第一组样例就可以只用一个球传出这种方案。\n\n而第二组样例则不行。"
}