{
    "description": "A string $ a=a_1a_2\\dots a_n $ is called even if it consists of a concatenation (joining) of strings of length $ 2 $ consisting of the same characters. In other words, a string $ a $ is even if two conditions are satisfied at the same time:\n\n- its length $ n $ is even;\n- for all odd $ i $ ( $ 1 \\le i \\le n - 1 $ ), $ a_i = a_{i+1} $ is satisfied.\n\nFor example, the following strings are even: \"\" (empty string), \"tt\", \"aabb\", \"oooo\", and \"ttrrrroouuuuuuuukk\". The following strings are not even: \"aaa\", \"abab\" and \"abba\".\n\nGiven a string $ s $ consisting of lowercase Latin letters. Find the minimum number of characters to remove from the string $ s $ to make it even. The deleted characters do not have to be consecutive.",
    "inputFormat": "The first line of input data contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) —the number of test cases in the test.\n\nThe descriptions of the test cases follow.\n\nEach test case consists of one string $ s $ ( $ 1 \\le |s| \\le 2 \\cdot 10^5 $ ), where $ |s| $ — the length of the string $ s $ . The string consists of lowercase Latin letters.\n\nIt is guaranteed that the sum of $ |s| $ on all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a single number — the minimum number of characters that must be removed to make $ s $ even.",
    "samples": [
        [
            "6\naabbdabdccc\nzyx\naaababbb\naabbcc\noaoaaaoo\nbmefbmuyw",
            "3\n3\n2\n0\n2\n7"
        ]
    ],
    "hint": "In the first test case you can remove the characters with indices $ 6 $ , $ 7 $ , and $ 9 $ to get an even string \"aabbddcc\".\n\nIn the second test case, each character occurs exactly once, so in order to get an even string, you must remove all characters from the string.\n\nIn the third test case, you can get an even string \"aaaabb\" by removing, for example, $ 4 $ -th and $ 6 $ -th characters, or a string \"aabbbb\" by removing the $ 5 $ -th character and any of the first three.",
    "translation": "$t$ 组数据，每组数据给定一个字符串，问你至少删去几个字母后可以使原字符串变成符合以下要求的字符串：设这个字符串为 $s$，字母个数为偶数 $n$，那么对于任意奇数 $i(1\\le i\\le n)$，有 $s_i=s_{i+1}$。"
}