{
    "description": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1634D/74895b22455b2b459cd8609f4caa3df7273f47e6.png)This is an interactive problem.\n\nWe picked an array of whole numbers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le 10^9 $ ) and concealed exactly one zero in it! Your goal is to find the location of this zero, that is, to find $ i $ such that $ a_i = 0 $ .\n\nYou are allowed to make several queries to guess the answer. For each query, you can think up three distinct indices $ i, j, k $ , and we will tell you the value of $ \\max(a_i, a_j, a_k) - \\min(a_i, a_j, a_k) $ . In other words, we will tell you the difference between the maximum and the minimum number among $ a_i $ , $ a_j $ and $ a_k $ .\n\nYou are allowed to make no more than $ 2 \\cdot n - 2 $ queries, and after that you have two tries to guess where the zero is. That is, you have to tell us two numbers $ i $ and $ j $ and you win if $ a_i = 0 $ or $ a_j = 0 $ .\n\nCan you guess where we hid the zero?\n\nNote that the array in each test case is fixed beforehand and will not change during the game. In other words, the interactor is not adaptive.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 500 $ ). Description of the test cases follows.\n\nThe first and only line of each test case contains an integer $ n $ ( $ 4 \\le n \\le 1000 $ ) — the length of the array that we picked.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 3000 $ .",
    "outputFormat": "For each test case, the interaction starts with reading $ n $ .\n\nTo make a query, print \"? $ i $ $ j $ $ k $ \" (without quotes, $ 1 \\le i, j, k \\le n $ , indices must be distinct). Then you should read our response from standard input, that is, $ \\max(a_i, a_j, a_k) - \\min(a_i, a_j, a_k) $ .\n\nIf the response is $ -1 $ , it means your program has made an invalid query or has run out of tries. Your program must terminate immediately after reading $ -1 $ , and you will get a verdict Wrong answer. Otherwise you may get any verdict, because the program will continue reading from the closed stream. Note that if the query is correct, the answer will never be $ -1 $ because $ \\max(a_i, a_j, a_k) - \\min(a_i, a_j, a_k) \\geq 0 $ .\n\nTo give the final answer, print \"! $ i $ $ j $ \" (without the quotes). Printing the same number twice (that is, $ i = j $ ) is allowed. Note that giving this answer is not counted towards the limit of $ 2 \\cdot n - 2 $ queries. After that, your program must continue to solve the remaining test cases, or exit if all test cases have been solved.\n\nAfter printing a query, don't forget to output line feed and flush the output buffer. Otherwise you will get the verdict Idleness limit exceeded. To flush the buffer, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- Read documentation for other languages.\n\nHacks\n\nThe first line must contain an integer $ t $ ( $ 1 \\le t \\le 500 $ ) — the count of test cases.\n\nThe first line of each test case must contain an integer $ n $ ( $ 4 \\le n \\le 1000 $ ) — the length of the hidden array.\n\nThe second line of each test case must contain $ n $ integers separated by spaces — $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le 10^9 $ ). There must also be exactly one zero in this array.\n\nThe sum of $ n $ over all test cases must not exceed $ 3000 $ .",
    "samples": [
        [
            "1\n\n4\n\n2\n\n3\n\n3\n\n2",
            "? 1 2 3\n\n? 2 3 4\n\n? 3 4 1\n\n? 4 1 2\n\n! 2 3"
        ]
    ],
    "hint": "Array from sample: $ [1, 2, 0, 3] $ .",
    "translation": "**这是一道交互题。**\n\n给定一个长度为 $n$ 的数组 $a$，其中恰好有一个 $0$。你每次询问可以给出三个数 $i,j,k$，交互库会返回 $\\max(a_i,a_j,a_k)-\\min(a_i,a_j,a_k)$ 的值。请通过最多 $2n-2$ 次询问确定 $0$ 所在的位置。\n\n你可以输出两个位置，只要有一个是正确的即可。\n\n数据范围：\n\n- $t$ 组数据，$1\\leqslant t\\leqslant 500$。\n- $4\\leqslant n\\leqslant 1000$。\n- $\\sum n\\leqslant 3000$。\n\nTranslated by Eason_AC  \n2022.2.9"
}