{
    "description": "Each of you probably has your personal experience of riding public transportation and buying tickets. After a person buys a ticket (which traditionally has an even number of digits), he usually checks whether the ticket is lucky. Let us remind you that a ticket is lucky if the sum of digits in its first half matches the sum of digits in its second half.\n\nBut of course, not every ticket can be lucky. Far from it! Moreover, sometimes one look at a ticket can be enough to say right away that the ticket is not lucky. So, let's consider the following unluckiness criterion that can definitely determine an unlucky ticket. We'll say that a ticket is definitely unlucky if each digit from the first half corresponds to some digit from the second half so that each digit from the first half is strictly less than the corresponding digit from the second one or each digit from the first half is strictly more than the corresponding digit from the second one. Each digit should be used exactly once in the comparisons. In other words, there is such bijective correspondence between the digits of the first and the second half of the ticket, that either each digit of the first half turns out strictly less than the corresponding digit of the second half or each digit of the first half turns out strictly more than the corresponding digit from the second half.\n\nFor example, ticket $ 2421 $ meets the following unluckiness criterion and will not be considered lucky (the sought correspondence is $ 2&gt;1 $ and $ 4&gt;2 $ ), ticket $ 0135 $ also meets the criterion (the sought correspondence is $ 0&lt;3 $ and $ 1&lt;5 $ ), and ticket $ 3754 $ does not meet the criterion.\n\nYou have a ticket in your hands, it contains $ 2n $ digits. Your task is to check whether it meets the unluckiness criterion.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=100 $ ). The second line contains a string that consists of $ 2n $ digits and defines your ticket.",
    "outputFormat": "In the first line print \"YES\" if the ticket meets the unluckiness criterion. Otherwise, print \"NO\" (without the quotes).",
    "samples": [
        [
            "2\n2421\n",
            "YES\n"
        ],
        [
            "2\n0135\n",
            "YES\n"
        ],
        [
            "2\n3754\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "\n给出一个 2×n 位的数字，如果前半部分的每个数字与下半部分的某个数字相对应，而且前半部分的每个数字严格小于下半部分的对应数字，或者前半部分的每个数字都严格大于下半部分的对应数字，那么我们就说，一张票是不吉利的。"
}