{
    "description": "In the work of a doctor, it is important to maintain the anonymity of clients and the results of tests. The test results are sent to everyone personally by email, but people are very impatient and they want to know the results right away.\n\nThat's why in the testing lab \"De-vitro\" doctors came up with an experimental way to report the results. Let's assume that $ n $ people took the tests in the order of the queue. Then the chief doctor Sam can make several statements, in each telling if there is a sick person among the people in the queue from $ l $ -th to $ r $ -th (inclusive), for some values $ l $ and $ r $ .\n\nDuring the process, Sam will check how well this scheme works and will be interested in whether it is possible to find out the test result of $ i $ -th person from the information he announced. And if it can be done, then is that patient sick or not.\n\nHelp Sam to test his scheme.",
    "inputFormat": "The first line contains two integers $ n $ , $ q $ ( $ 1 \\le n, q \\le 2 \\cdot 10^5 $ ) — the number of people and the number of queries.\n\nIn each of the next $ q $ lines, the description of the query is given. The first number in the line is $ t $ ( $ t = 0 $ or $ t = 1 $ ) — the type of the query.\n\nIf $ t = 0 $ , the line contains three more integers $ l, r, x $ ( $ 1 \\le l \\le r \\le n $ , $ x = 0 $ or $ x = 1 $ ). This query means that Sam tells that among the people in the queue from $ l $ -th to $ r $ -th (inclusive):\n\n- there was at least one sick person, if $ x=1 $ ,\n- there is no sick people, if $ x=0 $ .\n\nIf $ t = 1 $ , the line contains one more integer $ j $ ( $ 1 \\le j \\le n $ ) — the position of the patient in the queue, for which Sam wants to know the status.\n\nAll queries are correct, that means that there always exists an example of the queue of length $ n $ for which all reported results (statements from queries with $ t = 0 $ ) are true.",
    "outputFormat": "After each Sam question (query with $ t = 1 $ ) print:\n\n- \"NO\", if the patient is definitely not sick,\n- \"YES\", if the patient is definitely sick.\n- \"N/A\", if it is impossible to definitely identify the status of patient having the given information.",
    "samples": [
        [
            "6 9\n0 4 5 0\n1 5\n1 6\n0 4 6 1\n1 6\n0 2 5 1\n0 2 2 0\n1 3\n1 2",
            "NO\nN/A\nYES\nYES\nNO"
        ]
    ],
    "hint": "In the first test for the five first queries:\n\n1. Initially Sam tells that people $ 4 $ , $ 5 $ are not sick.\n2. In the next query Sam asks the status of the patient $ 5 $ . From the previous query, we know that the patient is definitely not sick.\n3. In the next query Sam asks the status of the patient $ 6 $ . We don't know any information about that patient now.\n4. After that Sam tells that there exists a sick patient among $ 4 $ , $ 5 $ , $ 6 $ .\n5. In the next query Sam asks the status of the patient $ 6 $ . Now we can tell that this patient is definitely sick.",
    "translation": "对于一排病人， 医生可以做三种操作：\n\n1. $l$, $r$, $0$ 表示第 $l$ 到 $r$ 个人中没有病人\n1. $l$, $r$, $1$ 表示第 $l$ 到 $r$ 个人中至少有一个病人生病\n1. 询问第 $j$ 个病人有没有生病\n\n对于每一个操作 3 ， 可以确定生病输出 ```YES``` , 可以确定不生病输出 ```NO``` , 否则输出 ```N/A```"
}