{
    "description": "Kristina has two arrays $ a $ and $ b $ , each containing $ n $ non-negative integers. She can perform the following operation on array $ a $ any number of times:\n\n- apply a decrement to each non-zero element of the array, that is, replace the value of each element $ a_i $ such that $ a_i > 0 $ with the value $ a_i - 1 $ ( $ 1 \\le i \\le n $ ). If $ a_i $ was $ 0 $ , its value does not change.\n\nDetermine whether Kristina can get an array $ b $ from an array $ a $ in some number of operations (probably zero). In other words, can she make $ a_i = b_i $ after some number of operations for each $ 1 \\le i \\le n $ ?\n\nFor example, let $ n = 4 $ , $ a = [3, 5, 4, 1] $ and $ b = [1, 3, 2, 0] $ . In this case, she can apply the operation twice:\n\n- after the first application of the operation she gets $ a = [2, 4, 3, 0] $ ;\n- after the second use of the operation she gets $ a = [1, 3, 2, 0] $ .\n\nThus, in two operations, she can get an array $ b $ from an array $ a $ .",
    "inputFormat": "The first line of the input contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) —the number of test cases in the test.\n\nThe descriptions of the test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 5 \\cdot 10^4 $ ).\n\nThe second line of each test case contains exactly $ n $ non-negative integers $ a_1, a_2, \\dots, a_n $ ( $ 0 \\le a_i \\le 10^9 $ ).\n\nThe third line of each test case contains exactly $ n $ non-negative integers $ b_1, b_2, \\dots, b_n $ ( $ 0 \\le b_i \\le 10^9 $ ).\n\nIt is guaranteed that the sum of $ n $ values over all test cases in the test does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, output on a separate line:\n\n- YES, if by doing some number of operations it is possible to get an array $ b $ from an array $ a $ ;\n- NO otherwise.\n\nYou can output YES and NO in any case (for example, strings yEs, yes, Yes and YES will be recognized as a positive response).",
    "samples": [
        [
            "6\n4\n3 5 4 1\n1 3 2 0\n3\n1 2 1\n0 1 0\n4\n5 3 7 2\n1 1 1 1\n5\n1 2 3 4 5\n1 2 3 4 6\n1\n8\n0\n1\n4\n6",
            "YES\nYES\nNO\nNO\nYES\nNO"
        ]
    ],
    "hint": "The first test case is analyzed in the statement.\n\nIn the second test case, it is enough to apply the operation to array $ a $ once.\n\nIn the third test case, it is impossible to get array $ b $ from array $ a $ .",
    "translation": "本题有多组测试数据。\n\n给定两个长度为 $n$ 的序列 $a$ 和 $b$。\n\n定义一次操作为将一个序列中的所有非零整数全都减少 1。  \n例如对于序列 $[3,5,4,1]$，我们对其进行两次操作之后得到的结果分别是 $[2,4,3,0]$ 和 $[1,3,2,0]$。\n\n现在我们需要求出是否可以通过对序列 $a$ 进行若干次操作（也可以不做）得到序列 $b$。\n\n如果可以的话就输出 `YES`，反之输出 `NO`，对大小写不做要求。"
}