{
    "description": "You have received data from a Bubble bot. You know your task is to make factory facilities, but before you even start, you need to know how big the factory is and how many rooms it has. When you look at the data you see that you have the dimensions of the construction, which is in rectangle shape: N x M.\n\nThen in the next N lines you have M numbers. These numbers represent factory tiles and they can go from 0 to 15. Each of these numbers should be looked in its binary form. Because from each number you know on which side the tile has walls. For example number 10 in it's binary form is 1010, which means that it has a wall from the North side, it doesn't have a wall from the East, it has a wall on the South side and it doesn't have a wall on the West side. So it goes North, East, South, West.\n\nIt is guaranteed that the construction always has walls on it's edges. The input will be correct.\n\nYour task is to print the size of the rooms from biggest to smallest.",
    "inputFormat": "The first line has two numbers which are N and M, the size of the construction. Both are integers:\n\n $ n $ ( $ 1 \\leq n \\leq 10^3 $ )\n\n $ m $ ( $ 1 \\leq m \\leq 10^3 $ )\n\nNext N x M numbers represent each tile of construction.",
    "outputFormat": "Once you finish processing the data your output consists of one line sorted from biggest to smallest room sizes.",
    "samples": [
        [
            "4 5\n9 14 11 12 13\n5 15 11 6 7\n5 9 14 9 14\n3 2 14 3 14",
            "9 4 4 2 1"
        ]
    ],
    "hint": "",
    "translation": "**题目描述**\n\n有一个 $N$ x $M$ 的工厂。然后在接下来的 $N$ 行中，输入 $M$ 个数字。  \n这些数字代表工厂的瓷砖，这些数字从 $0$ 到 $15$ （二进制为四位）。  \n\n每一个数字都以二进制形式查看。因为从每个数字中你可以知道这块瓷砖的哪一个方向有墙。  \n\n| 二进制位 | 说明                         |\n| -------- | ---------------------------- |\n| 第1位    | 为1表示**上边**有墙，0则没有 |\n| 第2位    | 为1表示**右边**有墙，0则没有 |\n| 第3位    | 为1表示**下边**有墙，0则没有 |\n| 第4位    | 为1表示**左边**有墙，0则没有 |\n\n例如，数字 $10$ 的二进制形式是 $1010$ ，这意味着它在上边有一堵墙，下边也有一堵墙，其他方向则没有。  \n\n每个相同的瓷砖表示一个房间，请输出所有房间的大小（房间尺寸从大到小进行排序）。\n\n以样例 $1$ 以为例：\n\n![样例1说明](https://s1.imagehub.cc/images/2021/10/12/CF1600J.png)\n\n所有房间的大小依次排序就是 $9 、4 、4 、2 、1$。\n\nTranslated from [Alan_CRL](https://www.luogu.com.cn/user/349225)"
}