{
    "description": "This is the hard version of Problem F. The only difference between the easy version and the hard version is the constraints.\n\nWe will call a non-empty string balanced if it contains the same number of plus and minus signs. For example: strings \"+--+\" and \"++-+--\" are balanced, and strings \"+--\", \"--\" and \"\" are not balanced.\n\nWe will call a string promising if the string can be made balanced by several (possibly zero) uses of the following operation:\n\n- replace two adjacent minus signs with one plus sign.\n\nIn particular, every balanced string is promising. However, the converse is not true: not every promising string is balanced.\n\nFor example, the string \"-+---\" is promising, because you can replace two adjacent minuses with plus and get a balanced string \"-++-\", or get another balanced string \"-+-+\".\n\nHow many non-empty substrings of the given string $ s $ are promising? Each non-empty promising substring must be counted in the answer as many times as it occurs in string $ s $ .\n\nRecall that a substring is a sequence of consecutive characters of the string. For example, for string \"+-+\" its substring are: \"+-\", \"-+\", \"+\", \"+-+\" (the string is a substring of itself) and some others. But the following strings are not its substring: \"--\", \"++\", \"-++\".",
    "inputFormat": "The first line of the input contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) —the number of test cases in the test.\n\nThen the descriptions of test cases follow.\n\nEach test case of input data consists of two lines. The first line consists of the number $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ): the length of $ s $ .\n\nThe second line of the test case contains the string $ s $ of length $ n $ , consisting only of characters \"+\" and \"-\".\n\nIt is guaranteed that the sum of values $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a single number: the number of the promising non-empty substrings of string $ s $ . Each non-empty promising substring must be counted in the answer as many times as it occurs in string $ s $ .",
    "samples": [
        [
            "5\n3\n+-+\n5\n-+---\n4\n----\n7\n--+---+\n6\n+++---",
            "2\n4\n2\n7\n4"
        ]
    ],
    "hint": "The following are the promising substrings for the first three test cases in the example:\n\n1. $ s[1 \\dots 2] $ =\"+-\", $ s[2 \\dots 3] $ =\"-+\";\n2. $ s[1 \\dots 2] $ =\"-+\", $ s[2 \\dots 3] $ =\"+-\", $ s[1 \\dots 5] $ =\"-+---\", $ s[3 \\dots 5] $ =\"---\";\n3. $ s[1 \\dots 3] $ =\"---\", $ s[2 \\dots 4] $ =\"---\".",
    "translation": "如果一个非空字符串包含了相同个数的加号与减号，我们把它称之为一个平衡字符串。\n比如`+--+`,`++-+--`都是平衡的，而字符串`+--`,`--`,` `都不是平衡的。\n\n如果一个字符串可以通过几个（可以是$0$个）操作而变得平衡，我们称它是有希望的。具体操作为：\n把两个相邻的减号替换为一个加号\n\n显然所有的平衡字符串都是有希望的，不过不是所有有希望的字符串都是平衡的。比如字符串`-+---`是一个有希望的字符串。因为\n你可以把两个相邻的减号替换为一个加号从而达到一个平衡字符串`-++-`或`-+-+`\n\n对于一个给定的字符串$s$,你要求出有它多少个非空子串是有希望的。如果一个子串在$s$中出现了多次，我们也要计算多次\n\n**输入格式**\n\n第一行输入一个正整数$t$($1 \\leq t \\leq 10^4$)，代表有多少个测试数据\n\n对于每一个测试数据，输入两行。\n\n第一行一个正整数$n$($1 \\leq n \\leq 2 \\times 10^5$),表示字符串$s$的长度\n\n第二行输入一个字符串$s$,仅由`+`,`-`构成\n\n保证对于所有测试数据，$n$的和不会超过$2 \\times 10^5$\n\n**输出格式**\n\n对于每一个输出数据，输出它多少个非空子串是有希望的。"
}