{
    "description": "There are $ n $ logs, the $ i $ -th log has a length of $ a_i $ meters. Since chopping logs is tiring work, errorgorn and maomao90 have decided to play a game.\n\nerrorgorn and maomao90 will take turns chopping the logs with errorgorn chopping first. On his turn, the player will pick a log and chop it into $ 2 $ pieces. If the length of the chosen log is $ x $ , and the lengths of the resulting pieces are $ y $ and $ z $ , then $ y $ and $ z $ have to be positive integers, and $ x=y+z $ must hold. For example, you can chop a log of length $ 3 $ into logs of lengths $ 2 $ and $ 1 $ , but not into logs of lengths $ 3 $ and $ 0 $ , $ 2 $ and $ 2 $ , or $ 1.5 $ and $ 1.5 $ .\n\nThe player who is unable to make a chop will be the loser. Assuming that both errorgorn and maomao90 play optimally, who will be the winner?",
    "inputFormat": "Each test contains multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\leq n \\leq 50 $ ) — the number of logs.\n\nThe second line of each test case contains $ n $ integers $ a_1,a_2, \\ldots, a_n $ ( $ 1 \\leq a_i \\leq 50 $ ) — the lengths of the logs.\n\nNote that there is no bound on the sum of $ n $ over all test cases.",
    "outputFormat": "For each test case, print \"errorgorn\" if errorgorn wins or \"maomao90\" if maomao90 wins. (Output without quotes).",
    "samples": [
        [
            "2\n4\n2 4 2 1\n1\n1",
            "errorgorn\nmaomao90"
        ]
    ],
    "hint": "In the first test case, errorgorn will be the winner. An optimal move is to chop the log of length $ 4 $ into $ 2 $ logs of length $ 2 $ . After this there will only be $ 4 $ logs of length $ 2 $ and $ 1 $ log of length $ 1 $ .\n\nAfter this, the only move any player can do is to chop any log of length $ 2 $ into $ 2 $ logs of length $ 1 $ . After $ 4 $ moves, it will be maomao90's turn and he will not be able to make a move. Therefore errorgorn will be the winner.\n\nIn the second test case, errorgorn will not be able to make a move on his first turn and will immediately lose, making maomao90 the winner.",
    "translation": "errorgorn 和 maomao90 在玩切木棍的游戏。\n\n现在有 $n$ 根木棍，每次操作的时候，任意一方可以选择一根木棍，并将它切成两段，但必须满足切完之后任意一段长度均为正整数。\n\n即长度为 $3$ 的木棍，可以切成长度为 $2$ 和 $1$ 的木棍，但不能切成 $3$ 和 $0$ 或 $1.5$ 和 $1.5$。\n\n若哪一方不能再切木棍为输，请你判断双方采取最优的策略谁会赢。\n\n注意：每个测试点共有 $t$ 组数据，开始时 errorgorn 先手。"
}