{
    "description": "You are given a string $ s $ consisting of characters 0 and/or 1.\n\nYou have to remove several (possibly zero) characters from the beginning of the string, and then several (possibly zero) characters from the end of the string. The string may become empty after the removals. The cost of the removal is the maximum of the following two values:\n\n- the number of characters 0 left in the string;\n- the number of characters 1 removed from the string.\n\nWhat is the minimum cost of removal you can achieve?",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of one line containing the string $ s $ ( $ 1 \\le |s| \\le 2 \\cdot 10^5 $ ), consisting of characters 0 and/or 1.\n\nThe total length of strings $ s $ in all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print one integer — the minimum cost of removal you can achieve.",
    "samples": [
        [
            "5\n101110110\n1001001001001\n0000111111\n00000\n1111",
            "1\n3\n0\n0\n0"
        ]
    ],
    "hint": "Consider the test cases of the example:\n\n1. in the first test case, it's possible to remove two characters from the beginning and one character from the end. Only one 1 is deleted, only one 0 remains, so the cost is $ 1 $ ;\n2. in the second test case, it's possible to remove three characters from the beginning and six characters from the end. Two characters 0 remain, three characters 1 are deleted, so the cost is $ 3 $ ;\n3. in the third test case, it's optimal to remove four characters from the beginning;\n4. in the fourth test case, it's optimal to remove the whole string;\n5. in the fifth test case, it's optimal to leave the string as it is.",
    "translation": "### 题目描述\n\n你有一个由 $1$ 和 $0$ 构成的字符串 $s$。\n\n你需要先从 $s$ 的开头移除若干字符，然后从 $s$ 的结尾移除若干字符。（当然，你可以不移除任何字符，也可以将整个 $s$ 移除掉）\n\n这样做的代价是从 $s$ 中移除的 $1$ 的个数和 $s$ 中剩余的 $0$ 的个数的最大值。\n\n求代价的最小值。\n\n### 输入格式\n\n第一行一个整数 $t$ 表示数据组数。$(1\\le t\\le 10^4)$\n\n接下来 $t$ 行，每行一个字符串 $s$ 表示这组数据的 $s$。$(1\\le |s|\\le 2⋅10^5)$\n\n$s$ 的总和不超过 $2⋅10^5$。\n\n### 输出格式\n\n对于每组数据，输出一个整数表示最小代价。\n\n### 说明/提示\n\n样例解释：\n\n`101110110` -> `(10) 111011 (0)`\n\n`1001001001001` -> `(100100) 1001 (001)`\n\n`0000111111` -> `(0000) 111111 ()`\n\n`00000` -> `(00000)()`\n\n`1111` -> `()1111()`"
}