{
    "description": "You are given a binary string (i. e. a string consisting of characters 0 and/or 1) $ s $ of length $ n $ . You can perform the following operation with the string $ s $ at most once: choose a substring (a contiguous subsequence) of $ s $ having exactly $ k $ characters 1 in it, and shuffle it (reorder the characters in the substring as you wish).\n\nCalculate the number of different strings which can be obtained from $ s $ by performing this operation at most once.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 2 \\le n \\le 5000 $ ; $ 0 \\le k \\le n $ ).\n\nThe second line contains the string $ s $ of length $ n $ , consisting of characters 0 and/or 1.",
    "outputFormat": "Print one integer — the number of different strings which can be obtained from $ s $ by performing the described operation at most once. Since the answer can be large, output it modulo $ 998244353 $ .",
    "samples": [
        [
            "7 2\n1100110",
            "16"
        ],
        [
            "5 0\n10010",
            "1"
        ],
        [
            "8 1\n10001000",
            "10"
        ],
        [
            "10 8\n0010011000",
            "1"
        ]
    ],
    "hint": "Some strings you can obtain in the first example:\n\n- to obtain 0110110, you can take the substring from the $ 1 $ -st character to the $ 4 $ -th character, which is 1100, and reorder its characters to get 0110;\n- to obtain 1111000, you can take the substring from the $ 3 $ -rd character to the $ 7 $ -th character, which is 00110, and reorder its characters to get 11000;\n- to obtain 1100101, you can take the substring from the $ 5 $ -th character to the $ 7 $ -th character, which is 110, and reorder its characters to get 101.\n\nIn the second example, $ k = 0 $ so you can only choose the substrings consisting only of 0 characters. Reordering them doesn't change the string at all, so the only string you can obtain is 10010.",
    "translation": "给定一个长度为 $n$ 的 $01$ 序列 $a$ ，你需要求出对 $a$ 进行**最多一次**以下操作后，可能的 $a$ 的数量，对 $998244353$ 取模：\n* 选定 $a$ 的一段连续的子段 $[l,r],1\\le l\\le r\\le n$ ，满足子段内有恰好 $k$ 个 $1$ （即 $\\sum_{i=l}^ra_i=k$ ）。\n\n* 将 $[l,r]$ 内的元素任意排列。"
}