{
    "description": "You are given a rooted tree consisting of $ n $ vertices. Vertices are numbered from $ 1 $ to $ n $ . Any vertex can be the root of a tree.\n\nA tree is a connected undirected graph without cycles. A rooted tree is a tree with a selected vertex, which is called the root.\n\nThe tree is specified by an array of parents $ p $ containing $ n $ numbers: $ p_i $ is a parent of the vertex with the index $ i $ . The parent of a vertex $ u $ is a vertex that is the next vertex on the shortest path from $ u $ to the root. For example, on the simple path from $ 5 $ to $ 3 $ (the root), the next vertex would be $ 1 $ , so the parent of $ 5 $ is $ 1 $ .\n\nThe root has no parent, so for it, the value of $ p_i $ is $ i $ (the root is the only vertex for which $ p_i=i $ ).\n\nFind such a set of paths that:\n\n- each vertex belongs to exactly one path, each path can contain one or more vertices;\n- in each path each next vertex — is a son of the current vertex (that is, paths always lead down — from parent to son);\n- number of paths is minimal.\n\nFor example, if $ n=5 $ and $ p=[3, 1, 3, 3, 1] $ , then the tree can be divided into three paths:\n\n1. $ 3 \\rightarrow 1 \\rightarrow 5 $ (path of $ 3 $ vertices),\n2. $ 4 $ (path of $ 1 $ vertices).\n3. $ 2 $ (path of $ 1 $ vertices).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1675D/b196ebd17b672e4b5d378bdd713910bded65862b.png)Example of splitting a root tree into three paths for $ n=5 $ , the root of the tree — node $ 3 $ .",
    "inputFormat": "The first line of input data contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the test.\n\nEach test case consists of two lines.\n\nThe first of them contains an integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ). It is the number of vertices in the tree.\n\nThe second line contains $ n $ integers $ p_1, p_2, \\dots, p_n $ ( $ 1 \\le p_i \\le n $ ). It is guaranteed that the $ p $ array encodes some rooted tree.\n\nIt is guaranteed that the sum of the values $ n $ over all test cases in the test does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case on the first line, output an integer $ m $ — the minimum number of non-intersecting leading down paths that can cover all vertices of the tree.\n\nThen print $ m $ pairs of lines containing path descriptions. In the first of them print the length of the path, in the second — the sequence of vertices specifying that path in the order from top to bottom. You can output the paths in any order.\n\nIf there are several answers, output any of them.",
    "samples": [
        [
            "6\n5\n3 1 3 3 1\n4\n1 1 4 1\n7\n1 1 2 3 4 5 6\n1\n1\n6\n4 4 4 4 1 2\n4\n2 2 2 2",
            "3\n3\n3 1 5\n1\n2\n1\n4\n\n2\n2\n1 2\n2\n4 3\n\n1\n7\n1 2 3 4 5 6 7\n\n1\n1\n1\n\n3\n3\n4 1 5\n2\n2 6\n1\n3\n\n3\n2\n2 1\n1\n3\n1\n4"
        ]
    ],
    "hint": "",
    "translation": "给定一棵由 $n$ 个顶点组成的有根树。顶点由 $1$ 到 $n$ 编号。任何顶点都可以是树的根。\n\n请在树上找出这样一组路径：\n\n- 每个顶点恰好属于一条路径，每条路径可以包含一个或多个顶点；\n- 在每条路径中，每个节点的下一个节点是当前节点的子节点（即路径总是向下 —— 从父节点到子节点）；\n- 路径的数量最少。"
}