{
    "description": "You are given a string $ s $ , consisting only of Latin letters 'a', and a string $ t $ , consisting of lowercase Latin letters.\n\nIn one move, you can replace any letter 'a' in the string $ s $ with a string $ t $ . Note that after the replacement string $ s $ might contain letters other than 'a'.\n\nYou can perform an arbitrary number of moves (including zero). How many different strings can you obtain? Print the number, or report that it is infinitely large.\n\nTwo strings are considered different if they have different length, or they differ at some index.",
    "inputFormat": "The first line contains a single integer $ q $ ( $ 1 \\le q \\le 10^4 $ ) — the number of testcases.\n\nThe first line of each testcase contains a non-empty string $ s $ , consisting only of Latin letters 'a'. The length of $ s $ doesn't exceed $ 50 $ .\n\nThe second line contains a non-empty string $ t $ , consisting of lowercase Latin letters. The length of $ t $ doesn't exceed $ 50 $ .",
    "outputFormat": "For each testcase, print the number of different strings $ s $ that can be obtained after an arbitrary amount of moves (including zero). If the number is infinitely large, print -1. Otherwise, print the number.",
    "samples": [
        [
            "3\naaaa\na\naa\nabc\na\nb",
            "1\n-1\n2"
        ]
    ],
    "hint": "In the first example, you can replace any letter 'a' with the string \"a\", but that won't change the string. So no matter how many moves you make, you can't obtain a string other than the initial one.\n\nIn the second example, you can replace the second letter 'a' with \"abc\". String $ s $ becomes equal to \"aabc\". Then the second letter 'a' again. String $ s $ becomes equal to \"aabcbc\". And so on, generating infinitely many different strings.\n\nIn the third example, you can either leave string $ s $ as is, performing zero moves, or replace the only 'a' with \"b\". String $ s $ becomes equal to \"b\", so you can't perform more moves on it.",
    "translation": "给一个只含小写字母 `a` 的字符串 $s$ 和一个用来替换的字符串 $t$ 。\n\n你可以将 $s$ 中任意**一个**字母 `a` 用 $t$ 来替换，替换的次数不限。\n\n对于每一个 $s$ 和 $t$ ，你可以得到几个不同的字符串？如果有无限个，输出 `-1` 。"
}