{
    "description": "The only difference with E1 is the question of the problem.\n\nVlad built a maze out of $ n $ rooms and $ n-1 $ bidirectional corridors. From any room $ u $ any other room $ v $ can be reached through a sequence of corridors. Thus, the room system forms an undirected tree.\n\nVlad invited $ k $ friends to play a game with them.\n\nVlad starts the game in the room $ 1 $ and wins if he reaches a room other than $ 1 $ , into which exactly one corridor leads. Friends are placed in the maze: the friend with number $ i $ is in the room $ x_i $ , and no two friends are in the same room (that is, $ x_i \\neq x_j $ for all $ i \\neq j $ ). Friends win if one of them meets Vlad in any room or corridor before he wins.\n\nFor one unit of time, each participant of the game can go through one corridor. All participants move at the same time. Participants may not move. Each room can fit all participants at the same time.\n\nFriends know the plan of a maze and intend to win. They don't want to waste too much energy. They ask you to determine if they can win and if they can, what minimum number of friends must remain in the maze so that they can always catch Vlad.\n\nIn other words, you need to determine the size of the minimum (by the number of elements) subset of friends who can catch Vlad or say that such a subset does not exist.",
    "inputFormat": "The first line of the input contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the input. The input contains an empty string before each test case.\n\nThe first line of the test case contains two numbers $ n $ and $ k $ ( $ 1 \\le k < n \\le 2\\cdot 10^5 $ ) — the number of rooms and friends, respectively.\n\nThe next line of the test case contains $ k $ integers $ x_1, x_2, \\dots, x_k $ ( $ 2 \\le x_i \\le n $ ) — numbers of rooms with friends. All $ x_i $ are different.\n\nThe next $ n-1 $ lines contain descriptions of the corridors, two numbers per line $ v_j $ and $ u_j $ ( $ 1 \\le u_j, v_j \\le n $ ) — numbers of rooms that connect the $ j $ corridor. All corridors are bidirectional. From any room, you can go to any other by moving along the corridors.\n\nIt is guaranteed that the sum of the values $ n $ over all test cases in the test is not greater than $ 2\\cdot10^5 $ .",
    "outputFormat": "Print $ t $ lines, each line containing the answer to the corresponding test case. The answer to a test case should be $ -1 $ if Vlad wins anyway and a minimal number of friends otherwise.",
    "samples": [
        [
            "4\n\n8 2\n5 3\n4 7\n2 5\n1 6\n3 6\n7 2\n1 7\n6 8\n\n8 4\n6 5 7 3\n4 7\n2 5\n1 6\n3 6\n7 2\n1 7\n6 8\n\n3 1\n2\n1 2\n2 3\n\n3 2\n2 3\n3 1\n1 2",
            "-1\n2\n1\n2"
        ]
    ],
    "hint": "In the first set of inputs, even if all the friends stay in the maze, Vlad can still win. Therefore, the answer is \"-1\".\n\nIn the second set of inputs it is enough to leave friends from rooms $ 6 $ and $ 7 $ . Then Vlad will not be able to win. The answer is \"2\".\n\nIn the third and fourth sets of inputs Vlad cannot win only if all his friends stay in the maze. Therefore the answers are \"1\" and \"2\".",
    "translation": "题目简述：现在有一棵树，其中 $1$ 号节点是树根，树上边都是双向边。树上有 $n$ 个点，您有 $k$ 位朋友。每个时刻，您和您的朋友都会顺着树上的边走向另一个节点。\n\n您会获胜当且仅当你走到了叶子节点。\n\n您会输当且仅当您被一个朋友在您获胜之前在任何房间或走廊遇到。\n\n问：至少在树中保留多少个朋友才能使您在游戏中失败？"
}