{
    "description": "You are given $ n $ words of equal length $ m $ , consisting of lowercase Latin alphabet letters. The $ i $ -th word is denoted $ s_i $ .\n\nIn one move you can choose any position in any single word and change the letter at that position to the previous or next letter in alphabetical order. For example:\n\n- you can change 'e' to 'd' or to 'f';\n- 'a' can only be changed to 'b';\n- 'z' can only be changed to 'y'.\n\nThe difference between two words is the minimum number of moves required to make them equal. For example, the difference between \"best\" and \"cost\" is $ 1 + 10 + 0 + 0 = 11 $ .\n\nFind the minimum difference of $ s_i $ and $ s_j $ such that $ (i < j) $ . In other words, find the minimum difference over all possible pairs of the $ n $ words.",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. The description of test cases follows.\n\nThe first line of each test case contains $ 2 $ integers $ n $ and $ m $ ( $ 2 \\leq n \\leq 50 $ , $ 1 \\leq m \\leq 8 $ ) — the number of strings and their length respectively.\n\nThen follows $ n $ lines, the $ i $ -th of which containing a single string $ s_i $ of length $ m $ , consisting of lowercase Latin letters.",
    "outputFormat": "For each test case, print a single integer — the minimum difference over all possible pairs of the given strings.",
    "samples": [
        [
            "6\n2 4\nbest\ncost\n6 3\nabb\nzba\nbef\ncdu\nooo\nzzz\n2 7\naaabbbc\nbbaezfe\n3 2\nab\nab\nab\n2 8\naaaaaaaa\nzzzzzzzz\n3 1\na\nu\ny",
            "11\n8\n35\n0\n200\n4"
        ]
    ],
    "hint": "For the second test case, one can show that the best pair is (\"abb\",\"bef\"), which has difference equal to $ 8 $ , which can be obtained in the following way: change the first character of the first string to 'b' in one move, change the second character of the second string to 'b' in $ 3 $ moves and change the third character of the second string to 'b' in $ 4 $ moves, thus making in total $ 1 + 3 + 4 = 8 $ moves.\n\nFor the third test case, there is only one possible pair and it can be shown that the minimum amount of moves necessary to make the strings equal is $ 35 $ .\n\nFor the fourth test case, there is a pair of strings which is already equal, so the answer is $ 0 $ .",
    "translation": "你有 $n$ 个长度为 $m$ 的单词，第 $i$ 个单词是 $s_i$。\n\n在一个操作中，你可以把任何一个单词的任何一个位置上的字母改成它相邻的字母，比如：\n\n- 你可以把 'e' 改成 'd' 或 'f'。\n- 你只能把 'a' 改成 'b'。\n- 你只能把 'z' 改成 'y'。\n\n$s_i$ 与 $s_j$ 的差异度为使 $s_i=s_j$ 所需的操作次数，如 \"best\" 与 \"cost\" 差异度为 $1+10+0+0=11$。\n\n你要找到 $s_i$ 与 $s_j$（满足 $i<j$）的差异度的最小值，也就是每一对单词差异度的最小值。"
}