{
    "description": "One day Prof. Slim decided to leave the kingdom of the GUC to join the kingdom of the GIU. He was given an easy online assessment to solve before joining the GIU. Citizens of the GUC were happy sad to see the prof leaving, so they decided to hack into the system and change the online assessment into a harder one so that he stays at the GUC. After a long argument, they decided to change it into the following problem.\n\nGiven an array of $ n $ integers $ a_1,a_2,\\ldots,a_n $ , where $ a_{i} \\neq 0 $ , check if you can make this array sorted by using the following operation any number of times (possibly zero). An array is sorted if its elements are arranged in a non-decreasing order.\n\n1. select two indices $ i $ and $ j $ ( $ 1 \\le i,j \\le n $ ) such that $ a_i $ and $ a_j $ have different signs. In other words, one must be positive and one must be negative.\n2. swap the signs of $ a_{i} $ and $ a_{j} $ . For example if you select $ a_i=3 $ and $ a_j=-2 $ , then they will change to $ a_i=-3 $ and $ a_j=2 $ .\n\nProf. Slim saw that the problem is still too easy and isn't worth his time, so he decided to give it to you to solve.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Then $ t $ test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^{5} $ ) — the length of the array $ a $ .\n\nThe next line contain $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ -10^9 \\le a_{i} \\le 10^9 $ , $ a_{i} \\neq 0 $ ) separated by spaces describing elements of the array $ a $ .\n\nIt is guaranteed that the sum of $ n $ over all test cases doesn't exceed $ 10^5 $ .",
    "outputFormat": "For each test case, print \"YES\" if the array can be sorted in the non-decreasing order, otherwise print \"NO\". You can print each letter in any case (upper or lower).",
    "samples": [
        [
            "4\n7\n7 3 2 -11 -13 -17 -23\n6\n4 10 25 47 71 96\n6\n71 -35 7 -4 -11 -25\n6\n-45 9 -48 -67 -55 7",
            "NO\nYES\nYES\nNO"
        ]
    ],
    "hint": "In the first test case, there is no way to make the array sorted using the operation any number of times.\n\nIn the second test case, the array is already sorted.\n\nIn the third test case, we can swap the sign of the $ 1 $ -st element with the sign of the $ 5 $ -th element, and the sign of the $ 3 $ -rd element with the sign of the $ 6 $ -th element, this way the array will be sorted.\n\nIn the fourth test case, there is no way to make the array sorted using the operation any number of times.",
    "translation": "#### 题目描述\n\n给定一个由$n$个整数$a_1, a_2, \\ldots, a_n (a_{i} \\neq 0)$构成的数组，问是否能通过任意次下面的操作将该数组排成一个非递减序列。\n\n操作：\n选定两个异号（一正一负）的数$a_i, a_j(1\\leq i, j\\leq n)$，交换$a_{i}$和$ a_{j}$的符号。例如当$a_i=3,a_j=-2$时， 进行该操作后$a_i=-3, a_j=2$。\n\n#### 输入格式\n\n第一行为一个整数$t ( 1 \\le t \\le 10^4)$，共$t$组数据。\n\n每组数据的第一行为一个整数$n( 1 \\le n \\le 10^{5})$，第二行为$n$个整数$a_1, a_2, \\ldots, a_n( -10^9 \\le a_{i} \\le 10^9, a_{i} \\neq 0)$。\n\n数据保证所有测试案例中$n$的和不超过$10^5$。\n\n#### 输出格式\n\n对每组数据，如果可行，输出\"YES\"，否则输出\"NO\"。（不区分大小写）"
}