{
    "description": "Polycarp bought a new expensive painting and decided to show it to his $ n $ friends. He hung it in his room. $ n $ of his friends entered and exited there one by one. At one moment there was no more than one person in the room. In other words, the first friend entered and left first, then the second, and so on.\n\nIt is known that at the beginning (before visiting friends) a picture hung in the room. At the end (after the $ n $ -th friend) it turned out that it disappeared. At what exact moment it disappeared — there is no information.\n\nPolycarp asked his friends one by one. He asked each one if there was a picture when he entered the room. Each friend answered one of three:\n\n- no (response encoded with 0);\n- yes (response encoded as 1);\n- can't remember (response is encoded with ?).\n\nEveryone except the thief either doesn't remember or told the truth. The thief can say anything (any of the three options).\n\nPolycarp cannot understand who the thief is. He asks you to find out the number of those who can be considered a thief according to the answers.",
    "inputFormat": "The first number $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the test.\n\nThe following is a description of test cases.\n\nThe first line of each test case contains one string $ s $ (length does not exceed $ 2 \\cdot 10^5 $ ) — a description of the friends' answers, where $ s_i $ indicates the answer of the $ i $ -th friend. Each character in the string is either 0 or 1 or ?.\n\nThe given regularity is described in the actual situation. In particular, on the basis of answers, at least one friend can be suspected of stealing a painting.\n\nIt is guaranteed that the sum of string lengths over the entire input data set does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "Output one positive (strictly more zero) number – the number of people who could steal the picture based on the data shown.",
    "samples": [
        [
            "8\n0\n1\n1110000\n?????\n1?1??0?0\n0?0???\n??11\n??0??",
            "1\n1\n2\n5\n4\n1\n1\n3"
        ]
    ],
    "hint": "In the first case, the answer is $ 1 $ since we had exactly $ 1 $ friend.\n\nThe second case is similar to the first.\n\nIn the third case, the suspects are the third and fourth friends (we count from one). It can be shown that no one else could be the thief.\n\nIn the fourth case, we know absolutely nothing, so we suspect everyone.",
    "translation": "房屋里有一幅画， $n$ 个人依次进入房间。前一个人出之后后一个人再进。 $n$ 个人都出房间后画不见了。每个人只知道自己是不是小偷和他在房间里时画还在不在。\n\n现在审问这 $n$ 个人，每个人可以回答 ``1`` 表示他在房子里时画在， ``0`` 表示不在， ``?`` 表示忘了。小偷会随便回答一个答案，其他人是诚实的。\n\n现在你需要求出，有几个人可能是小偷。\n\n询问数 $\\leq 10^4$ ， $\\sum n\\leq 2\\times 10^5$ 。保证输入合法。"
}