{
    "description": "Some country is populated by wizards. They want to organize a demonstration.\n\nThere are $ n $ people living in the city, $ x $ of them are the wizards who will surely go to the demonstration. Other city people ( $ n-x $ people) do not support the wizards and aren't going to go to the demonstration. We know that the city administration will react only to the demonstration involving at least $ y $ percent of the city people. Having considered the matter, the wizards decided to create clone puppets which can substitute the city people on the demonstration.\n\nSo all in all, the demonstration will involve only the wizards and their puppets. The city administration cannot tell the difference between a puppet and a person, so, as they calculate the percentage, the administration will consider the city to be consisting of only $ n $ people and not containing any clone puppets.\n\nHelp the wizards and find the minimum number of clones to create to that the demonstration had no less than $ y $ percent of the city people.",
    "inputFormat": "The first line contains three space-separated integers, $ n $ , $ x $ , $ y $ ( $ 1<=n,x,y<=10^{4},x<=n $ ) — the number of citizens in the city, the number of wizards and the percentage the administration needs, correspondingly.\n\nPlease note that $ y $ can exceed 100 percent, that is, the administration wants to see on a demonstration more people that actually live in the city ( $ &gt;n $ ).",
    "outputFormat": "Print a single integer — the answer to the problem, the minimum number of clones to create, so that the demonstration involved no less than $ y $ percent of $ n $ (the real total city population).",
    "samples": [
        [
            "10 1 14\n",
            "1\n"
        ],
        [
            "20 10 50\n",
            "0\n"
        ],
        [
            "1000 352 146\n",
            "1108\n"
        ]
    ],
    "hint": "In the first sample it is necessary that at least 14% of 10 people came to the demonstration. As the number of people should be integer, then at least two people should come. There is only one wizard living in the city and he is going to come. That isn't enough, so he needs to create one clone.\n\nIn the second sample 10 people should come to the demonstration. The city has 10 wizards. They will all come to the demonstration, so nobody has to create any clones.",
    "translation": "有个国家有n个人，其中x个是巫师。现在只有巫师和巫师制造的木偶会进行游行，问想要达到y%的游行率至少需要制造多少个木偶。"
}