{
    "description": "You are given an array of $ n $ integers $ a_1, a_2, \\ldots, a_n $ . After you watched the amazing film \"Everything Everywhere All At Once\", you came up with the following operation.\n\nIn one operation, you choose $ n-1 $ elements of the array and replace each of them with their arithmetic mean (which doesn't have to be an integer). For example, from the array $ [1, 2, 3, 1] $ we can get the array $ [2, 2, 2, 1] $ , if we choose the first three elements, or we can get the array $ [\\frac{4}{3}, \\frac{4}{3}, 3, \\frac{4}{3}] $ , if we choose all elements except the third.\n\nIs it possible to make all elements of the array equal by performing a finite number of such operations?",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\le t \\le 200 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 3 \\le n \\le 50 $ ) — the number of integers.\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le 100 $ ).",
    "outputFormat": "For each test case, if it is possible to make all elements equal after some number of operations, output $ \\texttt{YES} $ . Otherwise, output $ \\texttt{NO} $ .\n\nYou can output $ \\texttt{YES} $ and $ \\texttt{NO} $ in any case (for example, strings $ \\texttt{yEs} $ , $ \\texttt{yes} $ , $ \\texttt{Yes} $ will be recognized as a positive response).",
    "samples": [
        [
            "4\n3\n42 42 42\n5\n1 2 3 4 5\n4\n4 3 2 1\n3\n24 2 22",
            "YES\nYES\nNO\nNO"
        ]
    ],
    "hint": "In the first test case, all elements are already equal.\n\nIn the second test case, you can choose all elements except the third, their average is $ \\frac{1 + 2 + 4 + 5}{4} = 3 $ , so the array will become $ [3, 3, 3, 3, 3] $ .\n\nIt's possible to show that it's impossible to make all elements equal in the third and fourth test cases.",
    "translation": "你有 $n$ 个数 $a_1,a_2,\\cdots,a_n$，若每次操作是将其中的 $n-1$ 个数以这 $n-1$ 个数的平均数替换（不一定是整数），那么请你判断这 $n$ 个数能否在有限次操作内全部相等？"
}