{
    "description": "Not so long ago, Vlad had a birthday, for which he was presented with a package of candies. There were $ n $ types of candies, there are $ a_i $ candies of the type $ i $ ( $ 1 \\le i \\le n $ ).\n\nVlad decided to eat exactly one candy every time, choosing any of the candies of a type that is currently the most frequent (if there are several such types, he can choose any of them). To get the maximum pleasure from eating, Vlad does not want to eat two candies of the same type in a row.\n\nHelp him figure out if he can eat all the candies without eating two identical candies in a row.",
    "inputFormat": "The first line of input data contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of input test cases.\n\nThe following is a description of $ t $ test cases of input, two lines for each.\n\nThe first line of the case contains the single number $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of types of candies in the package.\n\nThe second line of the case contains $ n $ integers $ a_i $ ( $ 1 \\le a_i \\le 10^9 $ ) — the number of candies of the type $ i $ .\n\nIt is guaranteed that the sum of $ n $ for all cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "Output $ t $ lines, each of which contains the answer to the corresponding test case of input. As an answer, output \"YES\" if Vlad can eat candy as planned, and \"NO\" otherwise.\n\nYou can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).",
    "samples": [
        [
            "6\n2\n2 3\n1\n2\n5\n1 6 2 4 3\n4\n2 2 2 1\n3\n1 1000000000 999999999\n1\n1",
            "YES\nNO\nNO\nYES\nYES\nYES"
        ]
    ],
    "hint": "In the first example, it is necessary to eat sweets in this order:\n\n- a candy of the type $ 2 $ , it is the most frequent, now $ a = [2, 2] $ ;\n- a candy of the type $ 1 $ , there are the same number of candies of the type $ 2 $ , but we just ate one, now $ a = [1, 2] $ ;\n- a candy of the type $ 2 $ , it is the most frequent, now $ a = [1, 1] $ ;\n- a candy of the type $ 1 $ , now $ a = [0, 1] $ ;\n- a candy of the type $ 2 $ , now $ a = [0, 0] $ and the candy has run out.\n\nIn the second example, all the candies are of the same type and it is impossible to eat them without eating two identical ones in a row.\n\nIn the third example, first of all, a candy of the type $ 2 $ will be eaten, after which this kind will remain the only kind that is the most frequent, and you will have to eat a candy of the type $ 2 $ again.",
    "translation": "共有 $t$ 组数据，对于每一组数据，给定一个 $n$ 和一个元素个数为 $n$ 的数列 $A$。其中 $n$ 为糖的种类数，$A_i$ 为第 $i$ 个种类糖的个数。有一个人一次只吃一颗糖，这颗糖是当前最多的那个种类里的一颗，他不希望有连续两次同时吃同一种类里的糖，请问他能否做到，能就输出 $YES$，否则输出 $NO$。"
}