{
    "description": "Gianni, SWERC's chief judge, received a huge amount of high quality problems from the judges and now he has to choose a problem set for SWERC.\n\nHe received $ n $ problems and he assigned a beauty score and a difficulty to each of them. The $ i $ -th problem has beauty score equal to $ b_i $ and difficulty equal to $ d_i $ . The beauty and the difficulty are integers between $ 1 $ and $ 10 $ .\n\nIf there are no problems with a certain difficulty (the possible difficulties are $ 1,2,\\dots,10 $ ) then Gianni will ask for more problems to the judges.\n\nOtherwise, for each difficulty between $ 1 $ and $ 10 $ , he will put in the problem set one of the most beautiful problems with such difficulty (so the problem set will contain exactly $ 10 $ problems with distinct difficulties). You shall compute the total beauty of the problem set, that is the sum of the beauty scores of the problems chosen by Gianni.",
    "inputFormat": "Each test contains multiple test cases. The first line contains an integer $ t $ ( $ 1\\le t\\le 100 $ ) — the number of test cases. The descriptions of the $ t $ test cases follow.\n\nThe first line of each test case contains the integer $ n $ ( $ 1\\le n\\le 100 $ ) — how many problems Gianni received from the judges.\n\nThe next $ n $ lines contain two integers each. The $ i $ -th of such lines contains $ b_i $ and $ d_i $ ( $ 1\\le b_i, d_i\\le 10 $ ) — the beauty score and the difficulty of the $ i $ -th problem.",
    "outputFormat": "For each test case, print the total beauty of the problem set chosen by Gianni. If Gianni cannot create a problem set (because there are no problems with a certain difficulty) print the string MOREPROBLEMS (all letters are uppercase, there are no spaces).",
    "samples": [
        [
            "2\n3\n8 4\n9 3\n6 7\n12\n3 10\n10 1\n10 2\n10 3\n10 4\n3 10\n10 5\n10 6\n10 7\n10 8\n10 9\n1 10",
            "MOREPROBLEMS\n93"
        ]
    ],
    "hint": "In the first test case, Gianni has received only $ 3 $ problems, with difficulties $ 3, 4, 7 $ which are not sufficient to create a problem set (for example because there is not a problem with difficulty $ 1 $ ).\n\nIn the second test case, Gianni will create a problem set by taking the problems $ 2 $ , $ 3 $ , $ 4 $ , $ 5 $ , $ 7 $ , $ 8 $ , $ 9 $ , $ 10 $ , $ 11 $ (which have beauty equal to $ 10 $ and all difficulties from $ 1 $ to $ 9 $ ) and one of the problems $ 1 $ and $ 6 $ (which have both beauty $ 3 $ and difficulty $ 10 $ ). The total beauty of the resulting problem set is $ 10\\cdot 9 + 3 = 93 $ .",
    "translation": "$T,(1\\le T\\le 100)$ 组数据，每组数据有 $n,(1\\le n\\le 100)$ 个题目，每个题目有一个美丽值和一个难度值 $a_i, b_i,(1\\le a_i, b_i \\le 10)$，现在问你每种难度的题中挑选一道题出来组成一张卷子后最高的美丽值和是多少（如果某个难度的题有缺失，请输出 `MOREPROBLEMS`）。"
}