{
    "description": "Monocarp is playing a computer game. In this game, his character fights different monsters.\n\nA fight between a character and a monster goes as follows. Suppose the character initially has health $ h_C $ and attack $ d_C $ ; the monster initially has health $ h_M $ and attack $ d_M $ . The fight consists of several steps:\n\n1. the character attacks the monster, decreasing the monster's health by $ d_C $ ;\n2. the monster attacks the character, decreasing the character's health by $ d_M $ ;\n3. the character attacks the monster, decreasing the monster's health by $ d_C $ ;\n4. the monster attacks the character, decreasing the character's health by $ d_M $ ;\n5. and so on, until the end of the fight.\n\nThe fight ends when someone's health becomes non-positive (i. e. $ 0 $ or less). If the monster's health becomes non-positive, the character wins, otherwise the monster wins.\n\nMonocarp's character currently has health equal to $ h_C $ and attack equal to $ d_C $ . He wants to slay a monster with health equal to $ h_M $ and attack equal to $ d_M $ . Before the fight, Monocarp can spend up to $ k $ coins to upgrade his character's weapon and/or armor; each upgrade costs exactly one coin, each weapon upgrade increases the character's attack by $ w $ , and each armor upgrade increases the character's health by $ a $ .\n\nCan Monocarp's character slay the monster if Monocarp spends coins on upgrades optimally?",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 5 \\cdot 10^4 $ ) — the number of test cases. Each test case consists of three lines:\n\nThe first line contains two integers $ h_C $ and $ d_C $ ( $ 1 \\le h_C \\le 10^{15} $ ; $ 1 \\le d_C \\le 10^9 $ ) — the character's health and attack;\n\nThe second line contains two integers $ h_M $ and $ d_M $ ( $ 1 \\le h_M \\le 10^{15} $ ; $ 1 \\le d_M \\le 10^9 $ ) — the monster's health and attack;\n\nThe third line contains three integers $ k $ , $ w $ and $ a $ ( $ 0 \\le k \\le 2 \\cdot 10^5 $ ; $ 0 \\le w \\le 10^4 $ ; $ 0 \\le a \\le 10^{10} $ ) — the maximum number of coins that Monocarp can spend, the amount added to the character's attack with each weapon upgrade, and the amount added to the character's health with each armor upgrade, respectively.\n\nThe sum of $ k $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print YES if it is possible to slay the monster by optimally choosing the upgrades. Otherwise, print NO.",
    "samples": [
        [
            "4\n25 4\n9 20\n1 1 10\n25 4\n12 20\n1 1 10\n100 1\n45 2\n0 4 10\n9 2\n69 2\n4 2 7",
            "YES\nNO\nYES\nYES"
        ]
    ],
    "hint": "In the first example, Monocarp can spend one coin to upgrade weapon (damage will be equal to $ 5 $ ), then health during battle will change as follows: $ (h_C, h_M) = (25, 9) \\rightarrow (25, 4) \\rightarrow (5, 4) \\rightarrow (5, -1) $ . The battle ended with Monocarp's victory.\n\nIn the second example, Monocarp has no way to defeat the monster.\n\nIn the third example, Monocarp has no coins, so he can't buy upgrades. However, the initial characteristics are enough for Monocarp to win.\n\nIn the fourth example, Monocarp has $ 4 $ coins. To defeat the monster, he has to spend $ 2 $ coins to upgrade weapon and $ 2 $ coins to upgrade armor.",
    "translation": "在某款电脑游戏里，角色初始生命 $hc$，初始攻击 $dc$。怪物初始生命 $hm$，初始攻击 $dm$。\n\n而你有 $k$ 次机会，将攻击力**永久**提升 $w$ 或者将生命**永久**提升 $a$ 。\n\n每一轮，角色攻击怪物，怪物掉 $dc$ 生命。怪物攻击角色，角色掉 $dm$ 生命。\n\n问若干轮以后，角色能否击杀怪物并且角色存活。\n\n击杀怪物定义为：怪物生命 $\\ngtr 0$。\n\n角色存活定义为：角色生命 $>0$。"
}