{
    "description": "You are given a bracket sequence consisting of $ n $ characters '(' and/or )'. You perform several operations with it.\n\nDuring one operation, you choose the shortest prefix of this string (some amount of first characters of the string) that is good and remove it from the string.\n\nThe prefix is considered good if one of the following two conditions is satisfied:\n\n- this prefix is a regular bracket sequence;\n- this prefix is a palindrome of length at least two.\n\nA bracket sequence is called regular if it is possible to obtain a correct arithmetic expression by inserting characters '+' and '1' into this sequence. For example, sequences (())(), () and (()(())) are regular, while )(, (() and (()))( are not.\n\nThe bracket sequence is called palindrome if it reads the same back and forth. For example, the bracket sequences )), (( and )(() are palindromes, while bracket sequences (), )( and ))( are not palindromes.\n\nYou stop performing the operations when it's not possible to find a good prefix. Your task is to find the number of operations you will perform on the given string and the number of remaining characters in the string.\n\nYou have to answer $ t $ independent test cases.",
    "inputFormat": "The first line of the input contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. The next $ 2t $ lines describe test cases.\n\nThe first line of the test case contains one integer $ n $ ( $ 1 \\le n \\le 5 \\cdot 10^5 $ ) — the length of the bracket sequence.\n\nThe second line of the test case contains $ n $ characters '(' and/or ')' — the bracket sequence itself.\n\nIt is guaranteed that the sum of $ n $ over all test cases do not exceed $ 5 \\cdot 10^5 $ ( $ \\sum n \\le 5 \\cdot 10^5 $ ).",
    "outputFormat": "For each test case, print two integers $ c $ and $ r $ — the number of operations you will perform on the given bracket sequence and the number of characters that remain in the string after performing all operations.",
    "samples": [
        [
            "5\n2\n()\n3\n())\n4\n((((\n5\n)((()\n6\n)((()(",
            "1 0\n1 1\n2 0\n1 0\n1 1"
        ]
    ],
    "hint": "",
    "translation": "### 题目翻译\n\nLBW 有一个长度为 $n$ 的由括号组成的字符串，他每次要选择一个前缀并将其从字符串中删除。\n\n这个前缀至少要满足以下两点要求：\n\n+ 这个前缀是一个合法括号序列。\n+ 此前缀是长度大于等于 $2$ 的回文串。\n\n一直这样做，直到无法执行。\n\nLBW 想知道最多能执行的次数与此时剩下的字符数。\n\n### 输入格式\n\n**本题有多组数据。**\n\n第一行，一个整数 $T$，表示有 $T$ 组测试数据。\n\n对于每组测试数据：\n\n第一行，一个整数 $n$，表示括号序列的长度。\n\n第二行，一个字符串，表示括号序列。\n\n### 输出格式\n\n对于每个测试数据，输出最多能执行的次数与此时剩下的字符数。\n\n### 数据范围\n\n$1 \\le T \\le 10^4$\n\n$1 \\le n \\le 5 \\times 10^5$"
}