{
    "description": "There are $ n $ nodes arranged in a circle numbered from $ 1 $ to $ n $ in the clockwise order. You are also given a binary string $ s $ of length $ n $ .\n\nYour task is to construct a tree on the given $ n $ nodes satisfying the two conditions below or report that there such tree does not exist:\n\n- For each node $ i $ $ (1 \\le i \\le n) $ , the degree of node is even if $ s_i = 0 $ and odd if $ s_i = 1 $ .\n- No two edges of the tree intersect internally in the circle. The edges are allowed to intersect on the circumference.\n\nNote that all edges are drawn as straight line segments. For example, edge $ (u, v) $ in the tree is drawn as a line segment connecting $ u $ and $ v $ on the circle.\n\nA tree on $ n $ nodes is a connected graph with $ n - 1 $ edges.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ $ (1 \\leq t \\leq 2\\cdot 10^4) $ — the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ $ (2 \\leq n \\leq 2\\cdot 10^5) $ — the number of nodes.\n\nThe second line of each test case contains a binary string $ s $ of length $ n $ .\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2\\cdot 10^5 $ .",
    "outputFormat": "For each test case, if there does not exist a tree that satisfies the given conditions, then output \"NO\" (without quotes), otherwise output \"YES\" followed by the description of tree.\n\nYou can output each letter in any case (for example, \"YES\", \"Yes\", \"yes\", \"yEs\", \"yEs\" will be recognized as a positive answer).\n\nIf there exists a tree, then output $ n - 1 $ lines, each containing two integers $ u $ and $ v $ $ (1 \\leq u,v \\leq n, u \\neq v) $ denoting an edge between $ u $ and $ v $ in the tree. If there are multiple possible answers, output any.",
    "samples": [
        [
            "3\n4\n0110\n2\n10\n6\n110110",
            "YES\n2 1\n3 4\n1 4\nNO\nYES\n2 3\n1 2\n5 6\n6 2\n3 4"
        ]
    ],
    "hint": "In the first test case, the tree looks as follows:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1682D/a3c1924547a7a2cf2e2e161bdb11c580efe3e855.png)In the second test case, there is only one possible tree with an edge between $ 1 $ and $ 2 $ , and it does not satisfy the degree constraints.\n\nIn the third test case,\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1682D/e5b3e28053fdc3d6ed84005d3e46d8276c4f8576.png) The tree on the left satisfies the degree constraints but the edges intersect internally, therefore it is not a valid tree, while the tree on the right is valid.",
    "translation": "有 $T$ 组数据，每组数据有一个长度为 $n$ 的 $\\tt 01$ 字符串，求构造一个 $n$ 个结点的树满足每个结点的度数的奇偶性符合 $\\tt 01$ 串 $s$，且将这些点依次排列到一个环上，任意两条边不在非端点处相交。"
}