{
    "description": "Monocarp is a tutor of a group of $ n $ students. He communicates with them using a conference in a popular messenger.\n\nToday was a busy day for Monocarp — he was asked to forward a lot of posts and announcements to his group, that's why he had to write a very large number of messages in the conference. Monocarp knows the students in the group he is tutoring quite well, so he understands which message should each student read: Monocarp wants the student $ i $ to read the message $ m_i $ .\n\nOf course, no one's going to read all the messages in the conference. That's why Monocarp decided to pin some of them. Monocarp can pin any number of messages, and if he wants anyone to read some message, he should pin it — otherwise it will definitely be skipped by everyone.\n\nUnfortunately, even if a message is pinned, some students may skip it anyway. For each student $ i $ , Monocarp knows that they will read at most $ k_i $ messages. Suppose Monocarp pins $ t $ messages; if $ t \\le k_i $ , then the $ i $ -th student will read all the pinned messages; but if $ t > k_i $ , the $ i $ -th student will choose exactly $ k_i $ random pinned messages (all possible subsets of pinned messages of size $ k_i $ are equiprobable) and read only the chosen messages.\n\nMonocarp wants to maximize the expected number of students that read their respective messages (i.e. the number of such indices $ i $ that student $ i $ reads the message $ m_i $ ). Help him to choose how many (and which) messages should he pin!",
    "inputFormat": "The first line contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of students in the conference.\n\nThen $ n $ lines follow. The $ i $ -th line contains two integers $ m_i $ and $ k_i $ ( $ 1 \\le m_i \\le 2 \\cdot 10^5 $ ; $ 1 \\le k_i \\le 20 $ ) — the index of the message which Monocarp wants the $ i $ -th student to read and the maximum number of messages the $ i $ -th student will read, respectively.",
    "outputFormat": "In the first line, print one integer $ t $ ( $ 1 \\le t \\le 2 \\cdot 10^5 $ ) — the number of messages Monocarp should pin. In the second line, print $ t $ distinct integers $ c_1 $ , $ c_2 $ , ..., $ c_t $ ( $ 1 \\le c_i \\le 2 \\cdot 10^5 $ ) — the indices of the messages Monocarp should pin. The messages can be listed in any order.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "3\n10 1\n10 2\n5 2",
            "2\n5 10"
        ],
        [
            "3\n10 1\n5 2\n10 1",
            "1\n10"
        ],
        [
            "4\n1 1\n2 2\n3 3\n4 4",
            "3\n2 3 4"
        ],
        [
            "3\n13 2\n42 2\n37 2",
            "3\n42 13 37"
        ]
    ],
    "hint": "Let's consider the examples from the statement.\n\n1. In the first example, Monocarp pins the messages $ 5 $ and $ 10 $ .\n  - if the first student reads the message $ 5 $ , the second student reads the messages $ 5 $ and $ 10 $ , and the third student reads the messages $ 5 $ and $ 10 $ , the number of students which have read their respective messages will be $ 2 $ ;\n  - if the first student reads the message $ 10 $ , the second student reads the messages $ 5 $ and $ 10 $ , and the third student reads the messages $ 5 $ and $ 10 $ , the number of students which have read their respective messages will be $ 3 $ .\n  \n  So, the expected number of students which will read their respective messages is $ \\frac{5}{2} $ .\n2. In the second example, Monocarp pins the message $ 10 $ .\n  - if the first student reads the message $ 10 $ , the second student reads the message $ 10 $ , and the third student reads the message $ 10 $ , the number of students which have read their respective messages will be $ 2 $ .\n  \n  So, the expected number of students which will read their respective messages is $ 2 $ . If Monocarp had pinned both messages $ 5 $ and $ 10 $ , the expected number of students which read their respective messages would have been $ 2 $ as well.\n3. In the third example, the expected number of students which will read their respective messages is $ \\frac{8}{3} $ .\n4. In the fourth example, the expected number of students which will read their respective messages is $ 2 $ .",
    "translation": "Monocarp 是 $n$ 个学生的导师。现在有很多条消息，Monocarp 希望第 $i$ 个学生阅读编号为 $m_i$ 的消息。他需要把一些消息置顶，因为学生只会阅读置顶的消息。\n\n学生 $i$ 有一个属性 $k_i$。如果你置顶了 $t$ 条消息，若 $t\\le k_i$，该学生会阅读所有置顶消息；否则，该学生会从置顶的 $t$ 条消息中随机选 $k_i$ 条阅读。\n\n你需要求出在使得第 $i$ 名学生阅读到第 $m_i$ 条消息的 $i$ 的数量的期望值最大时，你应该置顶哪些消息。如果有多个答案，输出任意一种。\n\n### 输入格式\n\n第一行一个整数 $n\\ (1\\le n\\le 2\\times 10^5)$。\n\n接下来 $n$ 行，第 $i$ 行有两个整数 $m_i,k_i\\ (1\\le m_i\\le 2\\times 10^5,1\\le k_i\\le 20)$。\n\n### 输出格式\n\n第一行一个整数 $t$，表示你置顶的消息条数。\n\n第二行包含 $t$ 个整数 $c_1,c_2,\\dots,c_t$，表示你置顶的消息编号。"
}