{
    "description": "There is a classroom with two rows of computers. There are $ n $ computers in each row and each computer has its own grade. Computers in the first row has grades $ a_1, a_2, \\dots, a_n $ and in the second row — $ b_1, b_2, \\dots, b_n $ .\n\nInitially, all pairs of neighboring computers in each row are connected by wire (pairs $ (i, i + 1) $ for all $ 1 \\le i < n $ ), so two rows form two independent computer networks.\n\nYour task is to combine them in one common network by connecting one or more pairs of computers from different rows. Connecting the $ i $ -th computer from the first row and the $ j $ -th computer from the second row costs $ |a_i - b_j| $ .\n\nYou can connect one computer to several other computers, but you need to provide at least a basic fault tolerance: you need to connect computers in such a way that the network stays connected, despite one of its computer failing. In other words, if one computer is broken (no matter which one), the network won't split in two or more parts.\n\nThat is the minimum total cost to make a fault-tolerant network?",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Next $ t $ cases follow.\n\nThe first line of each test case contains the single integer $ n $ ( $ 3 \\le n \\le 2 \\cdot 10^5 $ ) — the number of computers in each row.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ) — the grades of computers in the first row.\n\nThe third line contains $ n $ integers $ b_1, b_2, \\dots, b_n $ ( $ 1 \\le b_i \\le 10^9 $ ) — the grades of computers in the second row.\n\nIt's guaranteed that the total sum of $ n $ doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a single integer — the minimum total cost to make a fault-tolerant network.",
    "samples": [
        [
            "2\n3\n1 10 1\n20 4 25\n4\n1 1 1 1\n1000000000 1000000000 1000000000 1000000000",
            "31\n1999999998"
        ]
    ],
    "hint": "In the first test case, it's optimal to connect four pairs of computers:\n\n1. computer $ 1 $ from the first row with computer $ 2 $ from the second row: cost $ |1 - 4| = 3 $ ;\n2. computer $ 3 $ from the first row with computer $ 2 $ from the second row: cost $ |1 - 4| = 3 $ ;\n3. computer $ 2 $ from the first row with computer $ 1 $ from the second row: cost $ |10 - 20| = 10 $ ;\n4. computer $ 2 $ from the first row with computer $ 3 $ from the second row: cost $ |10 - 25| = 15 $ ;\n\n In total, $ 3 + 3 + 10 + 15 = 31 $ .In the second test case, it's optimal to connect $ 1 $ from the first row with $ 1 $ from the second row, and $ 4 $ from the first row with $ 4 $ from the second row.",
    "translation": "一间教室里有两排电脑，每排有 $n$ 台，每台电脑有自己的一个等级。第一排的电脑等级依次为 $a_1,a_2,...,a_n$，第二排的电脑等级依次为 $b_1,b_2,...,b_n$。\n\n起初，对于每一排电脑，所有相邻的电脑之间有网线连接。因此两排电脑是相互独立的两套计算机网络。\n\n你的任务是把两排电脑连接到同一个计算机网络中，你可以在两排电脑之间连接一或多对计算机。将第一排的第 $i$ 台电脑和第二排的第 $j$ 台电脑相连需要花费 $|a_i-b_j|$。\n\n你可以把一台电脑与另一排的多台电脑相连，但是你联通的网络需要满足最基本的容错性：不管哪台电脑坏掉，这个网络的剩余部分都不会断开（即其他计算机仍可以两两互通）。\n\n你需要最小化代价。"
}