{
    "description": "For an array $ [b_1, b_2, \\ldots, b_m] $ define its number of inversions as the number of pairs $ (i, j) $ of integers such that $ 1 \\le i < j \\le m $ and $ b_i>b_j $ . Let's call array $ b $ odd if its number of inversions is odd.\n\nFor example, array $ [4, 2, 7] $ is odd, as its number of inversions is $ 1 $ , while array $ [2, 1, 4, 3] $ isn't, as its number of inversions is $ 2 $ .\n\nYou are given a permutation $ [p_1, p_2, \\ldots, p_n] $ of integers from $ 1 $ to $ n $ (each of them appears exactly once in the permutation). You want to split it into several consecutive subarrays (maybe just one), so that the number of the odd subarrays among them is as large as possible.\n\nWhat largest number of these subarrays may be odd?",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\le t \\le 10^5 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the size of the permutation.\n\nThe second line of each test case contains $ n $ integers $ p_1, p_2, \\ldots, p_n $ ( $ 1 \\le p_i \\le n $ , all $ p_i $ are distinct) — the elements of the permutation.\n\nThe sum of $ n $ over all test cases doesn't exceed $ 2\\cdot 10^5 $ .",
    "outputFormat": "For each test case output a single integer — the largest possible number of odd subarrays that you can get after splitting the permutation into several consecutive subarrays.",
    "samples": [
        [
            "5\n3\n1 2 3\n4\n4 3 2 1\n2\n1 2\n2\n2 1\n6\n4 5 6 1 2 3",
            "0\n2\n0\n1\n1"
        ]
    ],
    "hint": "In the first and third test cases, no matter how we split our permutation, there won't be any odd subarrays.\n\nIn the second test case, we can split our permutation into subarrays $ [4, 3], [2, 1] $ , both of which are odd since their numbers of inversions are $ 1 $ .\n\nIn the fourth test case, we can split our permutation into a single subarray $ [2, 1] $ , which is odd.\n\nIn the fifth test case, we can split our permutation into subarrays $ [4, 5], [6, 1, 2, 3] $ . The first subarray has $ 0 $ inversions, and the second has $ 3 $ , so it is odd.",
    "translation": "一个“奇怪”的序列满足此序列中有奇数个逆序对（满足 $a_i>a_j$ 且 $i<j$ 的 $(i,j)$ 称为逆序对）\n\n现在你有一个序列 $p_1,p_2,\\cdots,p_n$，你要把它**连续**地分为若干个子序列（可以只有 $1$ 个），你要使得这些子序列中“奇怪”的序列数最多。"
}