{
    "description": "Victor has a [24-hour clock](https://en.wikipedia.org/wiki/24-hour_clock) that shows the time in the format \"HH:MM\" (00 $ \\le $ HH $ \\le $ 23, 00 $ \\le $ MM $ \\le $ 59). He looks at the clock every $ x $ minutes, and the clock is currently showing time $ s $ .\n\nHow many different palindromes will Victor see in total after looking at the clock every $ x $ minutes, the first time being at time $ s $ ?\n\nFor example, if the clock starts out as 03:12 and Victor looks at the clock every $ 360 $ minutes (i.e. every $ 6 $ hours), then he will see the times 03:12, 09:12, 15:12, 21:12, 03:12, and the times will continue to repeat. Here the time 21:12 is the only palindrome he will ever see, so the answer is $ 1 $ .\n\nA palindrome is a string that reads the same backward as forward. For example, the times 12:21, 05:50, 11:11 are palindromes but 13:13, 22:10, 02:22 are not.",
    "inputFormat": "The first line of the input contains an integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases. The description of each test case follows.\n\nThe only line of each test case contains a string $ s $ of length $ 5 $ with the format \"HH:MM\" where \"HH\" is from \"00\" to \"23\" and \"MM\" is from \"00\" to \"59\" (both \"HH\" and \"MM\" have exactly two digits) and an integer $ x $ ( $ 1 \\leq x \\leq 1440 $ ) — the number of minutes Victor takes to look again at the clock.",
    "outputFormat": "For each test case, output a single integer — the number of different palindromes Victor will see if he looks at the clock every $ x $ minutes starting from time $ s $ .",
    "samples": [
        [
            "6\n03:12 360\n00:00 1\n13:22 2\n15:15 10\n11:11 1440\n22:30 27",
            "1\n16\n10\n0\n1\n1"
        ]
    ],
    "hint": "The first test case is explained in the statement.",
    "translation": "### 题目描述\n从一个`24`小时制的时间点开始，每隔 $x$ 分钟看一次手表，求到重新看到此时间点为止一共看到了多少个回文时间点。\n\n回文时间点：诸如`13:31`,`25:52`等时间点。\n\n### 输入\n第一行一个数 $T$ 表示数据组数，\n\n接下来 $T$ 行每行一个时间点 `xx:xx` 和时间间隔 $x$ ，使用空格分隔。\n\n### 输出\n对于每一组数据，输出一个 $ans$ 表示看到的回文时间点的数量。"
}