{
    "description": "This is the easy version of the problem. The difference is the constraints on $ n $ , $ m $ and $ t $ . You can make hacks only if all versions of the problem are solved.\n\nAlice and Bob are given the numbers $ n $ , $ m $ and $ k $ , and play a game as follows:\n\nThe game has a score that Alice tries to maximize, and Bob tries to minimize. The score is initially $ 0 $ . The game consists of $ n $ turns. Each turn, Alice picks a real number from $ 0 $ to $ k $ (inclusive) which Bob either adds to or subtracts from the score of the game. But throughout the game, Bob has to choose to add at least $ m $ out of the $ n $ turns.\n\nBob gets to know which number Alice picked before deciding whether to add or subtract the number from the score, and Alice gets to know whether Bob added or subtracted the number for the previous turn before picking the number for the current turn (except on the first turn since there was no previous turn).\n\nIf Alice and Bob play optimally, what will the final score of the game be?",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases. The description of test cases follows.\n\nEach test case consists of a single line containing the three integers, $ n $ , $ m $ , and $ k $ ( $ 1 \\le m \\le n \\le 2000, 0 \\le k < 10^9 + 7 $ ) — the number of turns, how many of those turns Bob has to add, and the biggest number Alice can choose, respectively.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2000 $ .",
    "outputFormat": "For each test case output a single integer number — the score of the optimal game modulo $ 10^9 + 7 $ .\n\nFormally, let $ M = 10^9 + 7 $ . It can be shown that the answer can be expressed as an irreducible fraction $ \\frac{p}{q} $ , where $ p $ and $ q $ are integers and $ q \\not \\equiv 0 \\pmod{M} $ . Output the integer equal to $ p \\cdot q^{-1} \\bmod M $ . In other words, output such an integer $ x $ that $ 0 \\le x < M $ and $ x \\cdot q \\equiv p \\pmod{M} $ .",
    "samples": [
        [
            "7\n3 3 2\n2 1 10\n6 3 10\n6 4 10\n100 1 1\n4 4 0\n69 4 20",
            "6\n5\n375000012\n500000026\n958557139\n0\n49735962"
        ]
    ],
    "hint": "In the first test case, the entire game has $ 3 $ turns, and since $ m = 3 $ , Bob has to add in each of them. Therefore Alice should pick the biggest number she can, which is $ k = 2 $ , every turn.\n\nIn the third test case, Alice has a strategy to guarantee a score of $ \\frac{75}{8} \\equiv 375000012 \\pmod{10^9 + 7} $ .\n\nIn the fourth test case, Alice has a strategy to guarantee a score of $ \\frac{45}{2} \\equiv 500000026 \\pmod{10^9 + 7} $ .",
    "translation": "Alice 和 Bob 正在玩一个游戏，游戏分为 $n$ 个回合，Alice 和 Bob 要轮流对一个数 $x$ 进行操作，已知这个数初始值是 $0$。\n\n具体每个回合的行动规则如下：\n\n1. Alice 选择一个在区间 $[0,k]$ 之间的实数 $t$。\n2. Bob 可以选择让 $x$ 变成 $x+t$ 或者 $x-t$，但是 Bob 在 $n$ 个回合之内至少选择 $m$ 次让 $x$ 变成 $x+t$。\n\nAlice想让最终的 $x$ 最大，Bob 想让最终的 $x$ 最小。\n\n已知双方均采用最优策略，求最终的 $x$ 值（对 $10^9+7$ 取模）。\n\n数据范围保证：$1\\le m\\le n\\le 2000,k\\le10^9+7$。"
}