{
    "description": "You are given an array $ a $ of $ n $ integers. Initially there is only one copy of the given array.\n\nYou can do operations of two types:\n\n1. Choose any array and clone it. After that there is one more copy of the chosen array.\n2. Swap two elements from any two copies (maybe in the same copy) on any positions.\n\nYou need to find the minimal number of operations needed to obtain a copy where all elements are equal.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the length of the array $ a $ .\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ -10^9 \\le a_i \\le 10^9 $ ) — the elements of the array $ a $ .\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case output a single integer — the minimal number of operations needed to create at least one copy where all elements are equal.",
    "samples": [
        [
            "6\n1\n1789\n6\n0 1 3 3 7 0\n2\n-1000000000 1000000000\n4\n4 3 2 1\n5\n2 5 7 6 3\n7\n1 1 1 1 1 1 1",
            "0\n6\n2\n5\n7\n0"
        ]
    ],
    "hint": "In the first test case all elements in the array are already equal, that's why the answer is $ 0 $ .\n\nIn the second test case it is possible to create a copy of the given array. After that there will be two identical arrays:\n\n $ [ \\ 0 \\ 1 \\ 3 \\ 3 \\ 7 \\ 0 \\ ] $ and $ [ \\ 0 \\ 1 \\ 3 \\ 3 \\ 7 \\ 0 \\ ] $\n\nAfter that we can swap elements in a way so all zeroes are in one array:\n\n $ [ \\ 0 \\ \\underline{0} \\ \\underline{0} \\ 3 \\ 7 \\ 0 \\ ] $ and $ [ \\ \\underline{1} \\ 1 \\ 3 \\ 3 \\ 7 \\ \\underline{3} \\ ] $\n\nNow let's create a copy of the first array:\n\n $ [ \\ 0 \\ 0 \\ 0 \\ 3 \\ 7 \\ 0 \\ ] $ , $ [ \\ 0 \\ 0 \\ 0 \\ 3 \\ 7 \\ 0 \\ ] $ and $ [ \\ 1 \\ 1 \\ 3 \\ 3 \\ 7 \\ 3 \\ ] $\n\nLet's swap elements in the first two copies:\n\n $ [ \\ 0 \\ 0 \\ 0 \\ \\underline{0} \\ \\underline{0} \\ 0 \\ ] $ , $ [ \\ \\underline{3} \\ \\underline{7} \\ 0 \\ 3 \\ 7 \\ 0 \\ ] $ and $ [ \\ 1 \\ 1 \\ 3 \\ 3 \\ 7 \\ 3 \\ ] $ .\n\nFinally, we made a copy where all elements are equal and made $ 6 $ operations.\n\nIt can be proven that no fewer operations are enough.",
    "translation": "你一开始有一个长度为 $n$ 的数组 $a$。你可以执行若干次操作，每次操作为如下两种中的一种：\n\n- 选择任意一个数组并新建一个和该数组完全相同的新数组。\n- 交换任意两个元素。这两个元素可能是在同一个数组中，也可能是在两个不同的数组中。\n\n你希望最终得到一个所有元素完全相同的数组，求达到这个目标的最小操作次数。\n\n数据范围：\n\n- $t$ 组数据，$1\\leqslant t\\leqslant 10^4$。\n- $1\\leqslant n\\leqslant 10^5$。\n- $-10^9\\leqslant a_i\\leqslant 10^9$。\n\nTranslated by Eason_AC"
}