{
    "description": "There's a chessboard of size $ n \\times n $ . $ m $ rooks are placed on it in such a way that:\n\n- no two rooks occupy the same cell;\n- no two rooks attack each other.\n\nA rook attacks all cells that are in its row or column.\n\nIs it possible to move exactly one rook (you can choose which one to move) into a different cell so that no two rooks still attack each other? A rook can move into any cell in its row or column if no other rook stands on its path.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 2000 $ ) — the number of testcases.\n\nThe first line of each testcase contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 8 $ ) — the size of the chessboard and the number of the rooks.\n\nThe $ i $ -th of the next $ m $ lines contains two integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le n $ ) — the position of the $ i $ -th rook: $ x_i $ is the row and $ y_i $ is the column.\n\nNo two rooks occupy the same cell. No two rooks attack each other.",
    "outputFormat": "For each testcase, print \"YES\" if it's possible to move exactly one rook into a different cell so that no two rooks still attack each other. Otherwise, print \"NO\".",
    "samples": [
        [
            "2\n2 2\n1 2\n2 1\n3 1\n2 2",
            "NO\nYES"
        ]
    ],
    "hint": "In the first testcase, the rooks are in the opposite corners of a $ 2 \\times 2 $ board. Each of them has a move into a neighbouring corner, but moving there means getting attacked by another rook.\n\nIn the second testcase, there's a single rook in a middle of a $ 3 \\times 3 $ board. It has $ 4 $ valid moves, and every move is fine because there's no other rook to attack it.",
    "translation": "在 n*n 的国际象棋棋盘中已放置了 $m$ 个车，满足：\n\n- 没有两个车在同一格里；\n- 没有两个车能攻击对方（即没有两个车在同一列或同一行里）。\n\n判断是否可能恰好对于某一个车（由您来选择）移动一次（前往同一列或同一行内非本格的任意格），使得形成的盘面还满足上面的条件？"
}