{
    "description": "The title is a reference to the very first Educational Round from our writers team, Educational Round 18.\n\nThere is a bag, containing colored balls. There are $ n $ different colors of balls, numbered from $ 1 $ to $ n $ . There are $ \\mathit{cnt}_i $ balls of color $ i $ in the bag. The total amount of balls in the bag is odd (e. g. $ \\mathit{cnt}_1 + \\mathit{cnt}_2 + \\dots + \\mathit{cnt}_n $ is odd).\n\nIn one move, you can choose two balls with different colors and take them out of the bag.\n\nAt some point, all the remaining balls in the bag will have the same color. That's when you can't make moves anymore.\n\nFind any possible color of the remaining balls.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of testcases.\n\nThe first line of each testcase contains a single integer $ n $ ( $ 1 \\le n \\le 20 $ ) — the number of colors.\n\nThe second line contains $ n $ integers $ \\mathit{cnt}_1, \\mathit{cnt}_2, \\dots, \\mathit{cnt}_n $ ( $ 1 \\le \\mathit{cnt}_i \\le 100 $ ) — the amount of balls of each color in the bag.\n\nThe total amount of balls in the bag is odd (e. g. $ \\mathit{cnt}_1 + \\mathit{cnt}_2 + \\dots + \\mathit{cnt}_n $ is odd).",
    "outputFormat": "For each testcase, print a single integer — any possible color of the remaining balls, after you made some moves and can't make moves anymore.",
    "samples": [
        [
            "3\n3\n1 1 1\n1\n9\n2\n4 7",
            "3\n1\n2"
        ]
    ],
    "hint": "In the first testcase, your first and only move can be one of the following:\n\n- take balls with colors $ 1 $ and $ 2 $ ;\n- take balls with colors $ 1 $ and $ 3 $ ;\n- take balls with colors $ 2 $ and $ 3 $ .\n\nAfter the move, exactly one ball will remain. Its color can be $ 3, 2 $ or $ 1 $ depending on the move.\n\nIn the second testcase, you can't make moves at all — there is only color of balls already. This color is $ 1 $ .\n\nIn the third testcase, you can keep removing one ball of color $ 1 $ and one ball of color $ 2 $ until there are no more balls of color $ 1 $ . At the end, three balls of color $ 2 $ remain.",
    "translation": "# 翻译\n你有 $n$ 种颜色的球，第 $i$ 种有 $cnt_i$ 个（保证球总数为奇数），每次你可以拿走两个**颜色不同**的球，可以知道最后一定会剩下一种颜色的球。请输出剩下的颜色可能是什么（任意一种可能即可）。"
}