{
    "description": "Nikephoros and Polycarpus play rock-paper-scissors. The loser gets pinched (not too severely!).\n\nLet us remind you the rules of this game. Rock-paper-scissors is played by two players. In each round the players choose one of three items independently from each other. They show the items with their hands: a rock, scissors or paper. The winner is determined by the following rules: the rock beats the scissors, the scissors beat the paper and the paper beats the rock. If the players choose the same item, the round finishes with a draw.\n\nNikephoros and Polycarpus have played $ n $ rounds. In each round the winner gave the loser a friendly pinch and the loser ended up with a fresh and new red spot on his body. If the round finished in a draw, the players did nothing and just played on.\n\nNikephoros turned out to have worked out the following strategy: before the game began, he chose some sequence of items $ A=(a_{1},a_{2},...,a_{m}) $ , and then he cyclically showed the items from this sequence, starting from the first one. Cyclically means that Nikephoros shows signs in the following order: $ a_{1} $ , $ a_{2} $ , $ ... $ , $ a_{m} $ , $ a_{1} $ , $ a_{2} $ , $ ... $ , $ a_{m} $ , $ a_{1} $ , $ ... $ and so on. Polycarpus had a similar strategy, only he had his own sequence of items $ B=(b_{1},b_{2},...,b_{k}) $ .\n\nDetermine the number of red spots on both players after they've played $ n $ rounds of the game. You can consider that when the game began, the boys had no red spots on them.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=2·10^{9} $ ) — the number of the game's rounds.\n\nThe second line contains sequence $ A $ as a string of $ m $ characters and the third line contains sequence $ B $ as a string of $ k $ characters ( $ 1<=m,k<=1000 $ ). The given lines only contain characters \"R\", \"S\" and \"P\". Character \"R\" stands for the rock, character \"S\" represents the scissors and \"P\" represents the paper.",
    "outputFormat": "Print two space-separated integers: the numbers of red spots Nikephoros and Polycarpus have.",
    "samples": [
        [
            "7\nRPS\nRSPP\n",
            "3 2"
        ],
        [
            "5\nRRRRRRRR\nR\n",
            "0 0"
        ]
    ],
    "hint": "In the first sample the game went like this:\n\n- R - R. Draw.\n- P - S. Nikephoros loses.\n- S - P. Polycarpus loses.\n- R - P. Nikephoros loses.\n- P - R. Polycarpus loses.\n- S - S. Draw.\n- R - P. Nikephoros loses.\n\nThus, in total Nikephoros has $ 3 $ losses (and $ 3 $ red spots), and Polycarpus only has $ 2 $ .",
    "translation": "- 有两个人在玩石头剪刀布游戏：\nR-石头 P-布 S-剪刀\n每个人都会按照一个周期出石头，剪刀或布。\n周期肯定在1000以内（包括1000）问玩n把后，\n双方各**输**了多少次。\n- 输入第一行一个n,（1<=n<=2*10^9）n为玩了几把\n第2行为第一个人的周期规律\n第3行为第二个人的周期规律\n- 输出共2个数：第一个人输的次数和第二个人输的次数"
}