{
    "description": "A club plans to hold a party and will invite some of its $ n $ members. The $ n $ members are identified by the numbers $ 1, 2, \\dots, n $ . If member $ i $ is not invited, the party will gain an unhappiness value of $ a_i $ .\n\nThere are $ m $ pairs of friends among the $ n $ members. As per tradition, if both people from a friend pair are invited, they will share a cake at the party. The total number of cakes eaten will be equal to the number of pairs of friends such that both members have been invited.\n\nHowever, the club's oven can only cook two cakes at a time. So, the club demands that the total number of cakes eaten is an even number.\n\nWhat is the minimum possible total unhappiness value of the party, respecting the constraint that the total number of cakes eaten is even?",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\leq t \\leq 10^4 $ ). The description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ and $ m $ ( $ 1 \\leq n \\leq 10^5 $ , $ 0 \\leq m \\leq \\min(10^5,\\frac{n(n-1)}{2}) $ ) — the number of club members and pairs of friends.\n\nThe second line of each test case contains $ n $ integers $ a_1,a_2, \\dots,a_n $ ( $ 0 \\leq a_i \\leq 10^4 $ ) — the unhappiness value array.\n\nEach of the next $ m $ lines contains two integers $ x $ and $ y $ ( $ 1 \\leq x,y \\leq n $ , $ x \\neq y $ ) indicating that $ x $ and $ y $ are friends. Each unordered pair $ (x,y) $ appears at most once in each test case.\n\nIt is guaranteed that both the sum of $ n $ and the sum of $ m $ over all test cases do not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, print a line containing a single integer – the minimum possible unhappiness value of a valid party.",
    "samples": [
        [
            "4\n1 0\n1\n3 1\n2 1 3\n1 3\n5 5\n1 2 3 4 5\n1 2\n1 3\n1 4\n1 5\n2 3\n5 5\n1 1 1 1 1\n1 2\n2 3\n3 4\n4 5\n5 1",
            "0\n2\n3\n2"
        ]
    ],
    "hint": "In the first test case, all members can be invited. So the unhappiness value is $ 0 $ .\n\nIn the second test case, the following options are possible:\n\n- invite $ 1 $ and $ 2 $ ( $ 0 $ cakes eaten, unhappiness value equal to $ 3 $ );\n- invite $ 2 $ and $ 3 $ ( $ 0 $ cakes eaten, unhappiness value equal to $ 2 $ );\n- invite only $ 1 $ ( $ 0 $ cakes eaten, unhappiness value equal to $ 4 $ );\n- invite only $ 2 $ ( $ 0 $ cakes eaten, unhappiness value equal to $ 5 $ );\n- invite only $ 3 $ ( $ 0 $ cakes eaten, unhappiness value equal to $ 3 $ );\n- invite nobody ( $ 0 $ cakes eaten, unhappiness value equal to $ 6 $ ).\n\n The minimum unhappiness value is achieved by inviting $ 2 $ and $ 3 $ .In the third test case, inviting members $ 3,4,5 $ generates a valid party with the minimum possible unhappiness value.",
    "translation": "一个俱乐部计划举办一次聚会，并邀请 $n$ 名会员中的一些人。$n$ 名成员分别由数字 $1,2,...,n$ 表示。如果成员 $i$ 没有被邀请，团队将获得 $a_i$ 的不快乐值。\n\n$n$ 名成员中有 $m$ 对好友。按照惯例，如果邀请了一对好友，他们会在聚会上分享蛋糕。被吃掉蛋糕的总数将等于两名成员都被邀请的好友的对数。\n\n然而，俱乐部的烤箱一次只能烤两个蛋糕。因此，俱乐部要求吃掉的蛋糕总数是偶数。\n\n聚会的最低的总不快乐值是多少，考虑到被吃掉的蛋糕总数为偶数的约束条件？"
}