{
    "description": "Vika's house has a room in a shape of a rectangular parallelepiped (also known as a rectangular cuboid). Its floor is a rectangle of size $ w \\times d $ , and the ceiling is right above at the constant height of $ h $ . Let's introduce a coordinate system on the floor so that its corners are at points $ (0, 0) $ , $ (w, 0) $ , $ (w, d) $ , and $ (0, d) $ .\n\nA laptop is standing on the floor at point $ (a, b) $ . A projector is hanging on the ceiling right above point $ (f, g) $ . Vika wants to connect the laptop and the projector with a cable in such a way that the cable always goes along the walls, ceiling, or floor (i. e. does not go inside the cuboid). Additionally, the cable should always run parallel to one of the cuboid's edges (i. e. it can not go diagonally).\n\nWhat is the minimum length of a cable that can connect the laptop to the projector?\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1781A/d3b03cec2845dd798f781a8a559bfa32f913d5ba.png) Illustration for the first test case. One of the optimal ways to put the cable is shown in green.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nThe first line of each test case contains three integers $ w $ , $ d $ , and $ h $ ( $ 2 \\le w, d, h \\le 1000 $ ) — the size of the room.\n\nThe second line contains four integers $ a $ , $ b $ , $ f $ , $ g $ ( $ 0 < a, f < w $ ; $ 0 < b, g < d $ ): the laptop is located on the floor at point $ (a, b) $ , while the projector is hanging on the ceiling right above point $ (f, g) $ .",
    "outputFormat": "For each test case, print a single integer — the minimum length of the cable connecting the laptop and the projector that runs only along the walls, floor, and ceiling parallel to cuboid's edges.",
    "samples": [
        [
            "5\n55 20 29\n23 10 18 3\n20 10 5\n1 5 2 5\n15 15 4\n7 13 10 10\n2 1000 2\n1 1 1 999\n10 4 10\n7 1 2 1",
            "47\n8\n14\n1002\n17"
        ]
    ],
    "hint": "The picture in the statement illustrates the first test case.",
    "translation": "- **本题一个测试点内有多组测试数据**。\n- 在一个三维坐标系中有一个左下角坐标为 $(0,0,0)$，右上角坐标为 $(w,d,h)$ 的每条边都平行于坐标轴的长方体。\n- 求从点 $(a,b,0)$ 到点 $(f,g,h)$ 满足以下条件的路线长度最小值：\n    - 行走的每一段路都平行于坐标轴；\n    - 路线应完全在长方体表面，不能离开长方体或进入长方体内部。\n- $w,d,h\\leq1000$，$0<a,f<w$，$0<b,g<d$。"
}