{
    "description": "Polycarpus has $ n $ friends in Tarasov city. Polycarpus knows phone numbers of all his friends: they are strings $ s_{1},s_{2},...,s_{n} $ . All these strings consist only of digits and have the same length.\n\nOnce Polycarpus needed to figure out Tarasov city phone code. He assumed that the phone code of the city is the longest common prefix of all phone numbers of his friends. In other words, it is the longest string $ c $ which is a prefix (the beginning) of each $ s_{i} $ for all $ i $ ( $ 1<=i<=n $ ). Help Polycarpus determine the length of the city phone code.",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 2<=n<=3·10^{4} $ ) — the number of Polycarpus's friends. The following $ n $ lines contain strings $ s_{1},s_{2},...,s_{n} $ — the phone numbers of Polycarpus's friends. It is guaranteed that all strings consist only of digits and have the same length from $ 1 $ to $ 20 $ , inclusive. It is also guaranteed that all strings are different.",
    "outputFormat": "Print the number of digits in the city phone code.",
    "samples": [
        [
            "4\n00209\n00219\n00999\n00909\n",
            "2\n"
        ],
        [
            "2\n1\n2\n",
            "0\n"
        ],
        [
            "3\n77012345678999999999\n77012345678901234567\n77012345678998765432\n",
            "12\n"
        ]
    ],
    "hint": "A prefix of string $ t $ is a string that is obtained by deleting zero or more digits from the end of string $ t $ . For example, string \"00209\" has 6 prefixes: \"\" (an empty prefix), \"0\", \"00\", \"002\", \"0020\", \"00209\".\n\nIn the first sample the city phone code is string \"00\".\n\nIn the second sample the city phone code is an empty string.\n\nIn the third sample the city phone code is string \"770123456789\".",
    "translation": "有 N（1< N < 30001） 个长度在（1——20）个字符的电话号码，求最大的 k ，使得 N 个电话号码的前 k 位完全相同"
}