{
    "description": "A company of $ n $ people is planning a visit to the cinema. Every person can either go to the cinema or not. That depends on how many other people will go. Specifically, every person $ i $ said: \"I want to go to the cinema if and only if at least $ a_i $ other people will go, not counting myself\". That means that person $ i $ will become sad if:\n\n- they go to the cinema, and strictly less than $ a_i $ other people go; or\n- they don't go to the cinema, and at least $ a_i $ other people go.\n\nIn how many ways can a set of people going to the cinema be chosen so that nobody becomes sad?",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nEach test case consists of two lines. The first line contains a single integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — the number of people in the company.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 0 \\le a_i \\le n - 1 $ ) — integers from peoples' claims.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a single integer — the number of different ways to choose a set of people going to the cinema so that nobody becomes sad.",
    "samples": [
        [
            "4\n2\n1 1\n7\n0 1 2 3 4 5 6\n8\n6 0 3 3 6 7 2 7\n5\n3 0 0 3 3",
            "2\n1\n3\n2"
        ]
    ],
    "hint": "In the first test case, both people want to go to the cinema if and only if the other person goes. There are two valid options: either both people go, or neither of them goes. However, if just one of them goes, both will be sad.\n\nIn the second test case, everyone has to go to the cinema. In any other case, someone will be sad.\n\nIn the third test case, there are three valid options: person number $ 2 $ goes to the cinema; or persons with indices $ 2, 3, 4, 7 $ go; or all eight people go.",
    "translation": "- **本题一个测试点内有多组测试数据**。\n- 有 $n$ 个数 $a_1,a_2,\\cdots,a_n$，求有多少 01 数组 $w_1,w_2,\\cdots,w_n$ 使得 $\\nexists i\\in[1,n]$：\n    - 若 $w_i=0$，$\\sum\\limits_{1\\leq j\\leq n,i\\neq j}w_i\\geq a_i$；\n    - 若 $w_i=1$，$\\sum\\limits_{1\\leq j\\leq n,i\\neq j}w_i<a_i$。\n- $2\\leq n,\\sum n\\leq2\\times10^5$，$0\\leq a_i<n$。"
}