{
    "description": "One day, Vogons wanted to build a new hyperspace highway through a distant system with $ n $ planets. The $ i $ -th planet is on the orbit $ a_i $ , there could be multiple planets on the same orbit. It's a pity that all the planets are on the way and need to be destructed.\n\nVogons have two machines to do that.\n\n- The first machine in one operation can destroy any planet at cost of $ 1 $ Triganic Pu.\n- The second machine in one operation can destroy all planets on a single orbit in this system at the cost of $ c $ Triganic Pus.\n\nVogons can use each machine as many times as they want.\n\nVogons are very greedy, so they want to destroy all planets with minimum amount of money spent. Can you help them to know the minimum cost of this project?",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. Then the test cases follow.\n\nEach test case consists of two lines.\n\nThe first line contains two integers $ n $ and $ c $ ( $ 1 \\le n, c \\le 100 $ ) — the number of planets and the cost of the second machine usage.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 100 $ ), where $ a_i $ is the orbit of the $ i $ -th planet.",
    "outputFormat": "For each test case print a single integer — the minimum cost of destroying all planets.",
    "samples": [
        [
            "4\n10 1\n2 1 4 5 2 4 5 5 1 2\n5 2\n3 2 1 2 2\n2 2\n1 1\n2 2\n1 2",
            "4\n4\n2\n2"
        ],
        [
            "1\n1 100\n1",
            "1"
        ]
    ],
    "hint": "In the first test case, the cost of using both machines is the same, so you can always use the second one and destroy all planets in orbit $ 1 $ , all planets in orbit $ 2 $ , all planets in orbit $ 4 $ , all planets in orbit $ 5 $ .\n\nIn the second test case, it is advantageous to use the second machine for $ 2 $ Triganic Pus to destroy all the planets in orbit $ 2 $ , then destroy the remaining two planets using the first machine.\n\nIn the third test case, you can use the first machine twice or the second machine once.\n\nIn the fourth test case, it is advantageous to use the first machine twice.",
    "translation": "给你一个序列 $a$，你可以分别进行如下操作任意次：\n- 花费 $1$ 的代价删除 $a_i$。\n- 花费 $c$ 的代价删除 $\\forall a_i=x$，$x$自定。\n\n求删除整个序列的最小代价。**多测**。"
}