{
    "description": "There are $ n $ bricks numbered from $ 1 $ to $ n $ . Brick $ i $ has a weight of $ a_i $ .\n\nPak Chanek has $ 3 $ bags numbered from $ 1 $ to $ 3 $ that are initially empty. For each brick, Pak Chanek must put it into one of the bags. After this, each bag must contain at least one brick.\n\nAfter Pak Chanek distributes the bricks, Bu Dengklek will take exactly one brick from each bag. Let $ w_j $ be the weight of the brick Bu Dengklek takes from bag $ j $ . The score is calculated as $ |w_1 - w_2| + |w_2 - w_3| $ , where $ |x| $ denotes the absolute value of $ x $ .\n\nIt is known that Bu Dengklek will take the bricks in such a way that minimises the score. What is the maximum possible final score if Pak Chanek distributes the bricks optimally?",
    "inputFormat": "Each test contains multiple test cases. The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 2 \\cdot 10^4 $ ) — the number of test cases. The following lines contain the description of each test case.\n\nThe first line of each test case contains an integer $ n $ ( $ 3 \\leq n \\leq 2 \\cdot 10^5 $ ) — the number of bricks.\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\leq a_i \\leq 10^9 $ ) — the weights of the bricks.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, output a line containing an integer representing the maximum possible final score if Pak Chanek distributes the bricks optimally.",
    "samples": [
        [
            "3\n5\n3 1 5 2 3\n4\n17 8 19 45\n8\n265 265 265 265 265 265 265 265",
            "6\n63\n0"
        ]
    ],
    "hint": "In the first test case, one way of achieving a final score of $ 6 $ is to do the following:\n\n- Put bricks $ 1 $ , $ 4 $ , and $ 5 $ into bag $ 1 $ .\n- Put brick $ 3 $ into bag $ 2 $ .\n- Put brick $ 2 $ into bag $ 3 $ .\n\nIf Pak Chanek distributes the bricks that way, a way Bu Dengklek can take the bricks is:\n\n- Take brick $ 5 $ from bag $ 1 $ .\n- Take brick $ 3 $ from bag $ 2 $ .\n- Take brick $ 2 $ from bag $ 3 $ .\n\nThe score is $ |a_5 - a_3| + |a_3 - a_2| = |3 - 5| + |5 - 1| = 6 $ . It can be shown that Bu Dengklek cannot get a smaller score from this distribution.\n\nIt can be shown that there is no other distribution that results in a final score bigger than $ 6 $ .",
    "translation": "hhoppitree 有 $n$ 根木棍，其中第 $i$ 根木棍的长度为 $a_i$，他想要将它们放置在三个背包中，使得**每个背包中至少有一根木棍**。\n\n他的好朋友会从每个背包中选出一根木棍，假设从三个背包中取出的木棍的长度分别为 $x,y,z$，则他会送给 hhoppitree 一共 $|x-y|+|y-z|$ 瓶可乐，显然，**他的朋友会最小化这个数的值**。\n\nhhoppitree 想通过适当的分配，使得这个数的最小可能值最大，他想知道这个最大值是多少。"
}