{
    "description": "$ 2^n $ people, numbered with distinct integers from $ 1 $ to $ 2^n $ , are playing in a single elimination tournament. The bracket of the tournament is a full binary tree of height $ n $ with $ 2^n $ leaves.\n\nWhen two players meet each other in a match, a player with the smaller number always wins. The winner of the tournament is the player who wins all $ n $ their matches.\n\nA virtual consolation prize \"Wooden Spoon\" is awarded to a player who satisfies the following $ n $ conditions:\n\n- they lost their first match;\n- the player who beat them lost their second match;\n- the player who beat that player lost their third match;\n- $ \\ldots $ ;\n- the player who beat the player from the previous condition lost the final match of the tournament.\n\nIt can be shown that there is always exactly one player who satisfies these conditions.\n\nConsider all possible $ (2^n)! $ arrangements of players into the tournament bracket. For each player, find the number of these arrangements in which they will be awarded the \"Wooden Spoon\", and print these numbers modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "The only line contains a single integer $ n $ ( $ 1 \\le n \\le 20 $ ) — the size of the tournament.\n\nThere are $ 20 $ tests in the problem: in the first test, $ n = 1 $ ; in the second test, $ n = 2 $ ; $ \\ldots $ ; in the $ 20 $ -th test, $ n = 20 $ .",
    "outputFormat": "Print $ 2^n $ integers — the number of arrangements in which the \"Wooden Spoon\" is awarded to players $ 1, 2, \\ldots, 2^n $ , modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "1",
            "0\n2"
        ],
        [
            "2",
            "0\n0\n8\n16"
        ],
        [
            "3",
            "0\n0\n0\n1536\n4224\n7680\n11520\n15360"
        ]
    ],
    "hint": "In the first example, the \"Wooden Spoon\" is always awarded to player $ 2 $ .\n\nIn the second example, there are $ 8 $ arrangements where players $ 1 $ and $ 4 $ meet each other in the first match, and in these cases, the \"Wooden Spoon\" is awarded to player $ 3 $ . In the remaining $ 16 $ arrangements, the \"Wooden Spoon\" is awarded to player $ 4 $ .",
    "translation": "有 $2^n$ 个人，进行 $n$ 轮比赛，比赛图是一棵完全二叉树。现在编号小的人一定会赢编号大的人，如果一个人满足：\n\n这个人第一次被另一个人打败。\n\n打败这个人的人又被第三个人打败。\n\n第三个人又被第四个人打败\n\n……\n\n也就是从这个叶子一直往上一直输，那么这个人就会获得安慰奖“木质勺子”。\n\n求对于每个人，有多少种编号的排列来比赛（叶子的排列），使得他能获得“木质勺子”。"
}