{
    "description": "Madoka decided to entrust the organization of a major computer game tournament \"OSU\"!\n\nIn this tournament, matches are held according to the \"Olympic system\". In other words, there are $ 2^n $ participants in the tournament, numbered with integers from $ 1 $ to $ 2^n $ . There are $ n $ rounds in total in the tournament. In the $ i $ -th round there are $ 2^{n - i} $ matches between two players (one of whom is right, the other is left), after which the winners go further along the tournament grid, and the losing participants are eliminated from the tournament. Herewith, the relative order in the next round does not change. And the winner of the tournament — is the last remaining participant.\n\nBut the smaller the participant's number, the more he will pay Madoka if he wins, so Madoka wants the participant with the lowest number to win. To do this, she can arrange the participants in the first round as she likes, and also determine for each match who will win — the participant on the left or right.\n\nBut Madoka knows that tournament sponsors can change the winner in matches no more than $ k $ times. (That is, if the participant on the left won before the change, then the participant on the right will win after the change, and if the participant on the right won, then the participant on the left will win after the change).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1717D/f3b4c42531ac8b0aab0fa40e7e46069a137caf77.png)So, the first image shows the tournament grid that Madoka made, where the red lines denote who should win the match. And the second one shows the tournament grid, after one change in the outcome of the match by sponsors (a match between $ 1 $ and $ 3 $ players).Print the minimum possible number of the winner in the tournament, which Madoka can get regardless of changes in sponsors. But since the answer can be very large, output it modulo $ 10^9 + 7 $ . Note that we need to minimize the answer, and only then take it modulo.",
    "inputFormat": "The first and the only line contains two integers $ n $ and $ k $ ( $ 1 \\le n \\le 10^5, 1 \\le k \\le \\min(2^n - 1, 10^9) $ ) — the number of rounds in the tournament and the number of outcomes that sponsors can change.",
    "outputFormat": "Print exactly one integer — the minimum number of the winner modulo $ 10^9 + 7 $",
    "samples": [
        [
            "1 1",
            "2"
        ],
        [
            "2 1",
            "3"
        ],
        [
            "3 2",
            "7"
        ]
    ],
    "hint": "In the first example, there is only one match between players $ 1 $ and $ 2 $ , so the sponsors can always make player $ 2 $ wins.\n\nThe tournament grid from the second example is shown in the picture in the statement.",
    "translation": "有$2^n$名参赛者，参赛者编号为$1$至$2^n$。\n\n一共有$n$轮比赛，每一轮，参赛者两两比赛，胜者进入下一轮。因此如图所示，赛程图是一个满二叉树。\n\n现在你可以决定每一个参赛者第一轮的初始排列顺序（对应二叉树叶子节点的顺序），并且你可以决定每一场比赛是左边的人胜出或是右边的人胜出（如图红线为胜出者）。你希望第一名的人编号最小。\n\n但是，有另一个人也能操纵比赛。他可以更改任意$k$场比赛的结果。\n\n输出你能确保得第一名的人的编号的最小值，对$10^9+7$取模。"
}