{
    "description": "Vlad came home and found out that someone had reconfigured the old thermostat to the temperature of $ a $ .\n\nThe thermostat can only be set to a temperature from $ l $ to $ r $ inclusive, the temperature cannot change by less than $ x $ . Formally, in one operation you can reconfigure the thermostat from temperature $ a $ to temperature $ b $ if $ |a - b| \\ge x $ and $ l \\le b \\le r $ .\n\nYou are given $ l $ , $ r $ , $ x $ , $ a $ and $ b $ . Find the minimum number of operations required to get temperature $ b $ from temperature $ a $ , or say that it is impossible.",
    "inputFormat": "The first line of input data contains the single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the test.\n\nThe descriptions of the test cases follow.\n\nThe first line of each case contains three integers $ l $ , $ r $ and $ x $ ( $ -10^9 \\le l \\le r \\le 10^9 $ , $ 1 \\le x \\le 10^9 $ ) — range of temperature and minimum temperature change.\n\nThe second line of each case contains two integers $ a $ and $ b $ ( $ l \\le a, b \\le r $ ) — the initial and final temperatures.",
    "outputFormat": "Output $ t $ numbers, each of which is the answer to the corresponding test case. If it is impossible to achieve the temperature $ b $ , output -1, otherwise output the minimum number of operations.",
    "samples": [
        [
            "10\n3 5 6\n3 3\n0 15 5\n4 5\n0 10 5\n3 7\n3 5 6\n3 4\n-10 10 11\n-5 6\n-3 3 4\n1 0\n-5 10 8\n9 2\n1 5 1\n2 5\n-1 4 3\n0 2\n-6 3 6\n-1 -4",
            "0\n2\n3\n-1\n1\n-1\n3\n1\n3\n-1"
        ]
    ],
    "hint": "In the first example, the thermostat is already set up correctly.\n\nIn the second example, you can achieve the desired temperature as follows: $ 4 \\rightarrow 10 \\rightarrow 5 $ .\n\nIn the third example, you can achieve the desired temperature as follows: $ 3 \\rightarrow 8 \\rightarrow 2 \\rightarrow 7 $ .\n\nIn the fourth test, it is impossible to make any operation.",
    "translation": "共 $t$ 组输入。\n\n对于每组输入，有五个整数 $l,r,x,a,b$。\n\n对于一个 $p$ 的操作，可以从 $p$ 变成 $q$，但是要保证 $|p-q|\\ge x$ 且 $l\\le q\\le r$。\n\n问从 $a$ 到 $b$ 需要的最少操作数，若不能到 $b$ 输出 `-1`（题目保证 $l\\le a,b \\le r$）。\n\nTranslated by @_JYqwq_"
}