{
    "description": "You have an image file of size $ 2 \\times 2 $ , consisting of $ 4 $ pixels. Each pixel can have one of $ 26 $ different colors, denoted by lowercase Latin letters.\n\nYou want to recolor some of the pixels of the image so that all $ 4 $ pixels have the same color. In one move, you can choose no more than two pixels of the same color and paint them into some other color (if you choose two pixels, both should be painted into the same color).\n\nWhat is the minimum number of moves you have to make in order to fulfill your goal?",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nEach test case consists of two lines. Each of these lines contains two lowercase letters of Latin alphabet without any separators, denoting a row of pixels in the image.",
    "outputFormat": "For each test case, print one integer — the minimum number of moves you have to make so that all $ 4 $ pixels of the image have the same color.",
    "samples": [
        [
            "5\nrb\nbr\ncc\nwb\naa\naa\nab\ncd\nyy\nxx",
            "1\n2\n0\n3\n1"
        ]
    ],
    "hint": "Let's analyze the test cases of the example.\n\nIn the first test case, you can paint the bottom left pixel and the top right pixel (which share the same color) into the color r, so all pixels have this color.\n\nIn the second test case, two moves are enough:\n\n- paint both top pixels, which have the same color c, into the color b;\n- paint the bottom left pixel into the color b.\n\nIn the third test case, all pixels already have the same color.\n\nIn the fourth test case, you may leave any of the pixels unchanged, and paint all three other pixels into the color of that pixel in three moves.\n\nIn the fifth test case, you can paint both top pixels into the color x.",
    "translation": "### 题目描述\n\n你有一个大小为 $2×2$ 的图像文件，由 $4$ 个像素组成。每个像素可以具有 $26$ 种不同颜色中的一种，由小写拉丁字母表示。\n\n\n你希望对图像的某些像素重新着色，以便所有 $4$ 个像素具有相同的颜色。在一次操作中，你可以选择至多两个相同颜色的像素并将它们绘制成其他颜色（如果选择两个像素，则应将它们绘制为相同颜色）。\n\n\n为了实现你的目标，你必须采取的最少行动数是多少？\n\n### 输入格式\n第一行包含一个整数 $t$$(1\\leq t \\leq 1000)$ ——表示测试样例的数量\n\n每个测试样例由两行组成。每一行包含两个小写拉丁字母，没有任何分隔符，表示图像中的一行像素。\n\n### 输出格式\n对于每个测试样例，输出一个整数——你最小操作次数，以使图像的4个像素具有相同的颜色。"
}