{
    "description": "As you know, Martian scientists are actively engaged in space research. One of the highest priorities is Pluto. In order to study this planet in more detail, it was decided to build a laboratory on Pluto.\n\nIt is known that the lab will be built of $ n $ square blocks of equal size. For convenience, we will assume that Pluto's surface is a plane divided by vertical and horizontal lines into unit squares. Each square is either occupied by a lab block or not, and only $ n $ squares are occupied.\n\nSince each block is square, it has four walls. If a wall is adjacent to another block, it is considered inside, otherwise — outside.\n\nPluto is famous for its extremely cold temperatures, so the outside walls of the lab must be insulated. One unit of insulation per exterior wall would be required. Thus, the greater the total length of the outside walls of the lab (i. e., its perimeter), the more insulation will be needed.\n\nConsider the lab layout in the figure below. It shows that the lab consists of $ n = 33 $ blocks, and all the blocks have a total of $ 24 $ outside walls, i. e. $ 24 $ units of insulation will be needed.\n\nYou should build the lab optimally, i. e., minimize the amount of insulation. On the other hand, there may be many optimal options, so scientists may be interested in the number of ways to build the lab using the minimum amount of insulation, modulo a prime number $ m $ .\n\nTwo ways are considered the same if they are the same when overlapping without turning. Thus, if a lab plan is rotated by $ 90^{\\circ} $ , such a new plan can be considered a separate way.\n\nTo help scientists explore Pluto, you need to write a program that solves these difficult problems.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1775F/19a2731aaaa55a0f9a8048f01dd79ff768ce23d2.png)",
    "inputFormat": "The first line contains two integers $ t $ and $ u $ ( $ 1 \\le t \\le 2\\cdot 10^5 $ , $ 1 \\le u \\le 2 $ ) — the number of test cases and the test type. If $ u=1 $ , you need to find any way to build the lab in an optimal way, and if $ u=2 $ , you need to calculate the number of ways to do it.\n\nIf $ u=2 $ , then in the following line of input there is a prime integer $ m $ ( $ 10^8 \\le m \\le 10^9 + 9 $ ), modulo which you need to calculate the number of ways.\n\nEach of the following $ t $ lines of input contains a description of a test case consisting of one integer $ n $ ( $ 1 \\le n \\le 4\\cdot 10^5 $ ) — the number of blocks the lab should consist of.\n\nIt is guaranteed that if $ u=1 $ , then the sum of $ n $ on all test cases does not exceed $ 8\\cdot10^5 $ .",
    "outputFormat": "For each test case, output the answers in the format below, separating them with a newline. The output format depends on $ u $ in the input data.\n\nIf $ u=1 $ , in the first line you need to print two integers $ h $ and $ w $ —the height and width of the area in which the lab should be built. Then, in each of the following $ h $ lines, you must output a line $ s_i $ consisting of $ w $ characters \"\\#\" and \".\". If the $ j $ -th character of the row $ s_i $ is \"\\#\", then the corresponding square must contain a block of laboratory, otherwise, it is considered empty. Thus, we get a matrix of symbols. The condition must also be met that the first and last rows of the matrix, as well as the first and last columns, must have at least one character \"\\#\", otherwise we could output the same lab layout, but with smaller $ h $ and $ w $ . If there are many options to build an optimal lab, you can print any of them.\n\nIf $ u=2 $ , you need to print two integers $ p $ and $ c $ — the number of outside walls in an optimal lab, and the remainder of the number of ways by prime modulo $ m $ .",
    "samples": [
        [
            "3 1\n1\n2\n7",
            "1 1\n#\n1 2\n##\n2 4\n.###\n####"
        ],
        [
            "3 2\n1000000007\n1\n2\n7",
            "4 1\n6 2\n12 22"
        ]
    ],
    "hint": "Consider the second example.\n\nIf $ n=1 $ , the only way to build a lab is to place a single block. In this case, the perimeter will be equal to four.\n\nWhen $ n=2 $ , you must place two blocks side by side. This can be done either vertically or horizontally, so there are two ways. It is easy to see that the lab has six outside walls in this case.\n\nFor $ n=7 $ , all the $ 22 $ optimal plans are shown in the picture below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1775F/2d61b154960a5ef9890728641d5e6f811e5f6274.png)"
}