{
    "description": "Oh no, this wicked jury hides something from you again, and you need to guess it interactively.\n\nThis time, you need to find an integer $ n $ . To do that, you can make at most 10 queries of the form \"What is the $ k $ -th decimal digit of the product of all integers from 1 to $ n $ (also known as factorial and denoted as $ n! $ )?\".",
    "inputFormat": "",
    "outputFormat": "In the first line, there is an integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of tests you shall process.\n\nFor each test, the integer $ n $ is chosen in advance. The length of $ n! $ is at most $ 20\\,000 $ , so $ 1 \\le n \\le 5982 $ .\n\nYou can make at most 10 queries of the form \"?  $ k $ \" ( $ 0 \\le k < 20\\,000 $ ). In response to the query, you will get a single digit — the $ k $ -th decimal digit of $ n! $ (the response is between 0 and 9 inclusive). Digits are numbered from 0, starting with the least significant digit. If $ n! $ is too short, and there is no $ k $ -th digit, then 0 is returned.\n\nAfter your program finds the value of $ n $ it shall answer with \"!  $ n $ \". If the answer is correct, then you will receive \"YES\" and should proceed to the next test or terminate if it was the last one. If the answer is not correct, or you are trying to guess, and there are several possible answers consistent with the information you have received, you will get \"NO\". In that case, your submission will receive \"Wrong answer\" verdict and your code shall terminate immediately.",
    "samples": [
        [
            "2\n\n1\n\nYES\n\n0\n\n2\n\nYES",
            "? 0\n\n! 1\n\n? 0\n\n? 19997\n\n! 5982"
        ]
    ],
    "hint": "",
    "translation": "- **这是一道交互题。**\n- 交互库有一个整数 $n\\in[1,5982]$，你可以询问 $n!$ 的第 $x$ 位不超过 $10$ 次，猜出这个 $n$。\n- 注：你必须唯一确定 $n$。"
}