{
    "description": "Luke likes to eat. There are $ n $ piles of food aligned in a straight line in front of him. The $ i $ -th pile contains $ a_i $ units of food.\n\nLuke will walk from the $ 1 $ -st pile towards the $ n $ -th pile, and he wants to eat every pile of food without walking back. When Luke reaches the $ i $ -th pile, he can eat that pile if and only if $ |v - a_i| \\leq x $ , where $ x $ is a fixed integer, and $ v $ is Luke's food affinity.\n\nBefore Luke starts to walk, he can set $ v $ to any integer. Also, for each $ i $ ( $ 1 \\leq i \\leq n $ ), Luke can change his food affinity to any integer before he eats the $ i $ -th pile.\n\nFind the minimum number of changes needed to eat every pile of food.\n\nNote that the initial choice for $ v $ is not considered as a change.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. The description of test cases follows.\n\nFor each test case, the first line contains two integers, $ n, x $ ( $ 1 \\leq n \\leq 2 \\cdot 10^5 $ , $ 1 \\leq x \\leq 10^9 $ ) — the number of piles, and the maximum difference between the size of a pile and Luke's food affinity, such that Luke can eat the pile.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots , a_n $ ( $ 1 \\leq a_i \\leq 10^9 $ ).\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, output an integer on a separate line, which is the minimum number of changes needed.",
    "samples": [
        [
            "7\n5 3\n3 8 5 6 7\n5 3\n3 10 9 8 7\n12 8\n25 3 3 17 8 6 1 16 15 25 17 23\n10 2\n1 2 3 4 5 6 7 8 9 10\n8 2\n2 4 6 8 6 4 12 14\n8 2\n2 7 8 9 6 13 21 28\n15 5\n11 4 13 23 7 10 5 21 20 11 17 5 29 16 11",
            "0\n1\n2\n1\n2\n4\n6"
        ]
    ],
    "hint": "In the first test case, Luke can set $ v $ to $ 5 $ before he starts to walk. And he can walk straight to eat every piles of food without changing $ v $ .\n\nIn the second test case, Luke can set $ v $ to $ 3 $ before he starts to walk. And he could change $ v $ to $ 10 $ before he eats the second pile. After that, he can walk straight to eat remaining food without changing $ v $ .\n\nIn the fourth test case, Luke can set $ v $ to $ 3 $ before he starts to walk. And he could change $ v $ to $ 8 $ before he eats the sixth pile. After that, he can walk straight to eat remaining food without changing $ v $ .\n\nIn the fifth test case, Luke can set $ v $ to $ 4 $ before he starts to walk. And he could change $ v $ to $ 6 $ before he eats the fourth pile. Then he could change $ v $ to $ 12 $ before he eats the seventh pile. After that, he can walk straight to eat remaining food without changing $ v $ .",
    "translation": "有 $n$ 个数、一个常数 $x$ 和一个值 $v$，一开始你可以设 $v$ 为任何非负整数。从头到尾遍历这 $n$ 个数（不能回头），如果 $|v-a_i|>x$，那么你需要修改 $v$ 使得上式不成立。最后，你需要输出修改 $v$ 的最少次数（一开始设置 $v$ 时，我们不认为这是修改）。\n\n多测，$1\\le n\\le2\\cdot10^5$，$1\\le t\\le 10^4$，$1\\le x \\le 10^9$。\n\ntranslated by @xzy090626"
}