{
    "description": "This is an interactive problem.\n\nFarmer Stanley grows corn on a rectangular field of size $  n \\times m  $ meters with corners in points $ (0, 0) $ , $ (0, m) $ , $ (n, 0) $ , $ (n, m) $ . This year the harvest was plentiful and corn covered the whole field.\n\nThe night before harvest aliens arrived and poisoned the corn in a single $ 1 \\times 1 $ square with sides parallel to field borders. The corn inside the square must not be eaten, but you cannot distinguish it from ordinary corn by sight. Stanley can only collect a sample of corn from an arbitrary polygon and bring it to the laboratory, where it will be analyzed and Stanley will be told the amount of corn in the sample that was poisoned. Since the harvest will soon deteriorate, such a study can be carried out no more than $ 5 $ times.\n\nMore formally, it is allowed to make no more than $ 5 $ queries, each of them calculates the area of intersection of a chosen polygon with a square of poisoned corn. It is necessary to find out the coordinates of the lower-left corner of the drawn square (the vertex of the square with the smallest $ x $ and $ y $ coordinates).",
    "inputFormat": "First line contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 100 $ ) — field sizes.",
    "outputFormat": "In order to query the area of intersection of a polygon with $ k $ ( $ 3 \\le k \\le 1000 $ ) vertices at points with coordinates $ (x_1, y_1),\\; \\dots ,\\;(x_k, y_k) $ with a square of poisoned corn print $ k+1 $ lines. In the first of these lines print \"? k\". In the $ i $ -th of the next $ k $ lines print two real numbers $ x_i $ and $ y_i $ ( $ |x_i|, |y_i| \\le 10^4 $ ) with at most $ 15 $ digits after decimal place.\n\nThe polygon must have strictly positive area and contain no self-intersections.\n\nIn response to this query you will receive a real number $ s $ ( $ 0 \\le s \\le 1 $ ) with $ 15 $ digits after decimal place — the area of intersection of the square with the given polygon. If the polygon is invalid, there is no guarantee on the valid response.\n\nWhen you have identified the drawn square, print on a separate line \"! x y\", where $ x $ and $ y $ are real numbers with at most $ 15 $ digits after decimal place representing the coordinates of its lower-left corner ( $ 0 \\le x \\le n - 1 $ , $ 0 \\le y \\le m - 1 $ ), and then you have to terminate your program.\n\nYour answer will be considered correct if its absolute or relative error on both coordinates does not exceed $ 10^{-6} $ . Formally let your answer be $ a $ , jury answer be $ b $ . Your answer will be considered correct if $ \\frac{|a-b|}{max(1,|b|)} \\le 10^{-6} $ .\n\nAfter printing a query do not forget to output end of line and flush the output. Otherwise, you will get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see documentation for other languages.\n\nHacks\n\nTo make a hack, use the following test format.\n\nThe first line of the input should contain two integers $ n $ and $ m $ ( $ 1 \\le n,m \\le 100 $ ) — field sizes.\n\nThe second line should contain two real numbers $ x $ ( $ 0 \\le x \\le n - 1 $ ) and $ y $ ( $ 0 \\le y \\le m - 1 $ ) — coordinates of the lower-left corner of the square of poisoned corn.",
    "samples": [
        [
            "3 3\n\n\n\n\n\n0.5\n\n\n\n\n\n0.5",
            "? 4\n0 0\n2 0\n2 3\n0 3\n\n? 4\n0 0\n0 1\n3 1\n3 0\n\n! 1.5 0.5"
        ]
    ],
    "hint": "In the first test from the statement, the aliens poisoned a square of corn with vertices at points with coordinates $ (1.5, 0.5) $ , $ (1.5, 1.5) $ , $ (2.5, 1.5) $ , $ (2.5, 0.5) $ . In the picture, it is red, the polygon selected in the query is blue, and their intersection is green.\n\nPicture for the first query:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1715F/5905e23dc243a04aad10e5bcbe0e2cd6bb70131e.png)Picture for the second query:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1715F/55886132a04f6c81b89194c1c281874f100d6c79.png)",
    "translation": "**这是一道交互题**\n\n有一个 $n \\times m$ 的长方形，四个角的坐标分别为 $ (0, 0) $ , $ (0, m) $ , $ (n, 0) $ , $ (n, m) $。在长方形里面有一个 $1 \\times 1$ 的正方形，边平行于长方形边界。你需要询问出这个正方形的位置。每次询问，每次你可以询问正方形与你提问的多边形的相交面积。你最多可以进行 $5$ 次询问。"
}