{
    "description": "You are given $ n $ sticks with positive integral length $ a_1, a_2, \\ldots, a_n $ .\n\nYou can perform the following operation any number of times (possibly zero):\n\n- choose one stick, then either increase or decrease its length by $ 1 $ . After each operation, all sticks should have positive lengths.\n\nWhat is the minimum number of operations that you have to perform such that it is possible to select three of the $ n $ sticks and use them without breaking to form an equilateral triangle?\n\nAn equilateral triangle is a triangle where all of its three sides have the same length.",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 3 \\le n \\le 300 $ ) — the number of sticks.\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ) — the lengths of the sticks.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 300 $ .",
    "outputFormat": "For each test case, print one integer on a single line — the minimum number of operations to be made.",
    "samples": [
        [
            "4\n3\n1 2 3\n4\n7 3 7 3\n5\n3 4 2 1 1\n8\n3 1 4 1 5 9 2 6",
            "2\n4\n1\n1"
        ]
    ],
    "hint": "In the first test case, you can increase the length of the first stick by $ 1 $ , then decrease the length of the third stick by $ 1 $ . In total, you perform $ 2 $ operations, such that the three sticks form an equilateral triangle of side length $ 2 $ .\n\nIn the fourth test case, you can decrease the length of the seventh stick by $ 1 $ . An equilateral triangle of side length $ 1 $ can be selected and formed by the second, fourth, and seventh sticks.",
    "translation": "## 题目描述\n给定 $n$ 根木棍，每次可以选择一根木棍进行长度 $+1$ 或 $-1$ 的操作（每次操作后，所有木棍的长度都应为整数）。\n\n求从 $n$ 根木棒中选出 $3$ 根并在**不折断**的情况下使用它们来形成一个**等边三角形**的最小操作数。\n\n## 输入格式\n第一行一个正整数 $t$ $(1\\leq t\\leq 100)$，表示数据组数。\n\n每组数据的第一行包含一个整数 $n$ $(3\\leq n\\leq 300)$，表示木棍的数量。\n\n接下来 $n+1$ 行包含 $n$ 个整数 $a_i$ $(1\\leq a_i\\leq 10^9)$\n\n数据保证，所有数据的 $n$ 之和不超过 $300$。\n\n## 输出格式\n对于每组数据，输出一行一个整数，为要进行的最小操作数。"
}