{
    "description": "Polycarp has a poor memory. Each day he can remember no more than $ 3 $ of different letters.\n\nPolycarp wants to write a non-empty string of $ s $ consisting of lowercase Latin letters, taking minimum number of days. In how many days will he be able to do it?\n\nPolycarp initially has an empty string and can only add characters to the end of that string.\n\nFor example, if Polycarp wants to write the string lollipops, he will do it in $ 2 $ days:\n\n- on the first day Polycarp will memorize the letters l, o, i and write lolli;\n- On the second day Polycarp will remember the letters p, o, s, add pops to the resulting line and get the line lollipops.\n\nIf Polycarp wants to write the string stringology, he will do it in $ 4 $ days:\n\n- in the first day will be written part str;\n- on day two will be written part ing;\n- on the third day, part of olog will be written;\n- on the fourth day, part of y will be written.\n\nFor a given string $ s $ , print the minimum number of days it will take Polycarp to write it.",
    "inputFormat": "The first line of input data contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of a non-empty string $ s $ consisting of lowercase Latin letters (the length of the string $ s $ does not exceed $ 2 \\cdot 10^5 $ ) — the string Polycarp wants to construct.\n\nIt is guaranteed that the sum of string lengths $ s $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a single number — minimum number of days it will take Polycarp to write the string $ s $ from memory.",
    "samples": [
        [
            "6\nlollipops\nstringology\nabracadabra\ncodeforces\ntest\nf",
            "2\n4\n3\n4\n1\n1"
        ]
    ],
    "hint": "",
    "translation": "可怜的 `Polycarp` 一天仅能记住三个不同的字母。过了这天这三个字母将被他忘记（这样才能为明天新记的三个字母腾出空间），因此他可能需要多天才能写完一个单词。\n\n以单词 `stringology` 为例：\n```\n第一天记住字母 s t r ，完成str；\n第二天记住字母 i n g ，完成string；\n第三天记住字母 o l g ，完成stringolog；\n第四天记住字母 y ，完成整个单词stringology。\n```\n由于单词任务太多了， `Polycarp` 找到了聪明的你，你能告诉他每个单词他要花费多久才能写完吗？\n\n**本题有多组数据**\n\n第一行键入一个整数 $t$ （ $t$ 不超过 $10^4$ ），表示 `Polycarp` 要写完的单词总数。\n\n以下每行一个字符串（保证字符串的长度不超过 $10^5$ ），表示他要完成的单词。\n\n对于每个输入的字符串，输出一个整数 $ans$ ，表示他完成该单词需要花费的天数。"
}