{
    "description": "Burenka came to kindergarden. This kindergarten is quite strange, so each kid there receives two fractions ( $ \\frac{a}{b} $ and $ \\frac{c}{d} $ ) with integer numerators and denominators. Then children are commanded to play with their fractions.\n\nBurenka is a clever kid, so she noticed that when she claps once, she can multiply numerator or denominator of one of her two fractions by any integer of her choice (but she can't multiply denominators by $ 0 $ ). Now she wants know the minimal number of claps to make her fractions equal (by value). Please help her and find the required number of claps!",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. Then follow the descriptions of each test case.\n\nThe only line of each test case contains four integers $ a $ , $ b $ , $ c $ and $ d $ ( $ 0 \\leq a, c \\leq 10^9 $ , $ 1 \\leq b, d \\leq 10^9 $ ) — numerators and denominators of the fractions given to Burenka initially.",
    "outputFormat": "For each test case print a single integer — the minimal number of claps Burenka needs to make her fractions equal.",
    "samples": [
        [
            "8\n2 1 1 1\n6 3 2 1\n1 2 2 3\n0 1 0 100\n0 1 228 179\n100 3 25 6\n999999999 300000000 666666666 100000000\n33 15 0 84",
            "1\n0\n2\n0\n1\n1\n1\n1"
        ]
    ],
    "hint": "In the first case, Burenka can multiply $ c $ by $ 2 $ , then the fractions will be equal.\n\nIn the second case, fractions are already equal.\n\nIn the third case, Burenka can multiply $ a $ by $ 4 $ , then $ b $ by $ 3 $ . Then the fractions will be equal ( $ \\frac{1 \\cdot 4}{2 \\cdot 3} = \\frac{2}{3} $ ).",
    "translation": "### 题目描述\n给出两个分数 $ \\dfrac{a}{b}$ 和 $\\dfrac{c}{d}$ ，你每次操作能够选择其中一个分数的分子或分母，将其乘上任意一个整数（当然不能对分母乘 $0$）。要求求出能够使两个分数相等的最小操作次数。\n### 输入格式\n第一行一个整数 $t(1\\leq t\\leq 10^4)$，代表有 $t$ 组数据。\n\n以后 $t$ 行，每行四个整数 $a,b,c,d(0\\leq a,c\\leq 10^9,1\\leq b,d\\leq 10^9$)，分别代表两个分数的分子和分母。\n\n### 输出格式\n对于每组数据输出一行一个整数，即最小操作数。\n### 样例解释\n对于第 $1$ 组数据，将 $c$ 乘上 $2$ 即可。\n\n对于第 $2$ 组数据，两个分数已经相等，无需操作。\n\n对于第 $3$ 组数据，可以将 $a$ 乘上 $4$，将 $b$ 乘上 $3$。两个分数就能够相等($\\dfrac{1\\cdot 4}{2 \\cdot 3}=\\dfrac{2}{3}$)。"
}