{
    "description": "This is an hard version of the problem. The difference between the versions is that the string can be longer than in the easy version. You can only do hacks if both versions of the problem are passed.\n\nKazimir Kazimirovich is a Martian gardener. He has a huge orchard of binary balanced apple trees.\n\nRecently Casimir decided to get himself three capybaras. The gardener even came up with their names and wrote them down on a piece of paper. The name of each capybara is a non-empty line consisting of letters \"a\" and \"b\".\n\nDenote the names of the capybaras by the lines $ a $ , $ b $ , and $ c $ . Then Casimir wrote the nonempty lines $ a $ , $ b $ , and $ c $ in a row without spaces. For example, if the capybara's name was \"aba\", \"ab\", and \"bb\", then the string the gardener wrote down would look like \"abaabbb\".\n\nThe gardener remembered an interesting property: either the string $ b $ is lexicographically not smaller than the strings $ a $ and $ c $ at the same time, or the string $ b $ is lexicographically not greater than the strings $ a $ and $ c $ at the same time. In other words, either $ a \\le b $ and $ c \\le b $ are satisfied, or $ b \\le a $ and $ b \\le c $ are satisfied (or possibly both conditions simultaneously). Here $ \\le $ denotes the lexicographic \"less than or equal to\" for strings. Thus, $ a \\le b $ means that the strings must either be equal, or the string $ a $ must stand earlier in the dictionary than the string $ b $ . For a more detailed explanation of this operation, see \"Notes\" section.\n\nToday the gardener looked at his notes and realized that he cannot recover the names because they are written without spaces. He is no longer sure if he can recover the original strings $ a $ , $ b $ , and $ c $ , so he wants to find any triplet of names that satisfy the above property.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1775A2/30cfa18220110323978b8133a80acdeb63f8ace5.png)",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nThe only line of a test case contains the string $ s $ ( $ 3 \\le |s| \\le 2 \\cdot 10^5 $ ) — the names of the capybaras, written together. The string consists of English letters 'a' and 'b' only.\n\nIt is guaranteed that the sum of string lengths over all test cases does not exceed $ 4 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print three strings $ a $ , $ b $ and $ c $ on a single line, separated by spaces — names of capybaras, such that writing them without spaces results in a line $ s $ . Either $ a \\le b $ and $ c \\le b $ , or $ b \\le a $ and $ b \\le c $ must be satisfied.\n\nIf there are several ways to restore the names, print any of them. If the names cannot be recovered, print \":(\" (without quotes).",
    "samples": [
        [
            "5\nbbba\naba\naaa\nabba\nabbb",
            "b bb a\na b a\na a a\nab b a\na bb b"
        ]
    ],
    "hint": "A string $ x $ is lexicographically smaller than a string $ y $ if and only if one of the following holds:\n\n- $ x $ is a prefix of $ y $ , but $ x \\ne y $ ;\n- in the first position where $ x $ and $ y $ differ, the string $ x $ has the letter 'a', and the string $ y $ has the letter 'b'.\n\nNow let's move on to the examples.\n\nIn the first test case, one of the possible ways to split the line $ s $ into three lines —is \"b\", \"bb\", \"a\".\n\nIn the third test case, we can see that the split satisfies two conditions at once (i.e., $ a \\le b $ , $ c \\le b $ , $ b \\le a $ and $ b \\le c $ are true simultaneously).",
    "translation": "有三个只由字符 `a,b` 构成的字符串 $a,b,c$ ，且 $a\\le b,c\\le b$ 或 $a\\ge b,c\\ge b$。 将它们拼在一起构成了一个新字符串 $s$。\n\n\n现在给你 $s$，($3\\le |s|\\le 2\\cdot 10^5$)，你要复原这三个字符串。\n\n一共有 $T(T\\le 10^4)$ 组测试数据，所有数据中字符串的总长不会超过 $4\\cdot 10^5$。\n\n### 输入格式\n\n第一行，一个数 $T$。  \n接下来的 $T$ 行，每行一个字符串，表示字符串 $s$。\n\n### 输出格式\n\n对于每组测试数据，输出一行三个字符串，用空格隔开，表示拆出的三个字符串。\n\n如果有多种拆分方式，输出任意一种。\n\n如果无法拆分，则输出 `:(`。\n\n### 说明/提示\n\n定义字符串 $x$ 小于 $y$ ，当且仅当：\n\n$x$ 是 $y$ 的前缀，且 $x \\not =y$ 。\n\n或\n\n在 $x$ 与 $y$ 的第一个不同的位置，$x$ 的这一位字符是 `a`，$y$ 的这一位字符是 `b`。"
}