{
    "description": "The famous store \"Second Food\" sells groceries only two days a month. And the prices in each of days differ. You wanted to buy $ n $ kilos of potatoes for a month. You know that on the first day of the month $ 1 $ kilo of potatoes costs $ a $ coins, and on the second day $ b $ coins. In \"Second Food\" you can buy any integer kilograms of potatoes.\n\nFortunately, \"Second Food\" has announced a promotion for potatoes, which is valid only on the first day of the month — for each $ m $ kilos of potatoes you buy, you get $ 1 $ kilo as a gift! In other words, you can get $ m + 1 $ kilograms by paying for $ m $ kilograms.\n\nFind the minimum number of coins that you have to spend to buy at least $ n $ kilos of potatoes.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10\\,000 $ ). Description of the test cases follows.\n\nThe first line of each test case contains two integers $ a $ and $ b $ $ (1 \\leq a, b \\leq 10^9) $ — the prices of $ 1 $ kilo of potatoes on the first and second days, respectively.\n\nThe second line contains two integers $ n $ and $ m $ $ (1 \\leq n, m \\leq 10^9) $ — the required amount of potatoes to buy and the amount of potatoes to use the promotion.",
    "outputFormat": "For each test case print one integer — the minimum number of coins that you have to pay to buy at least $ n $ kilos of potatoes.",
    "samples": [
        [
            "5\n5 4\n3 1\n5 4\n3 2\n3 4\n3 5\n20 15\n10 2\n1000000000 900000000\n1000000000 8",
            "9\n10\n9\n135\n888888888900000000"
        ]
    ],
    "hint": "In the first test case, on the first day you buy $ 1 $ kilo and get $ 1 $ more for a promotion. On the second day, you can buy $ 1 $ kilo of potatoes. Thus, you will spend $ 5+4=9 $ coins in total.\n\nIn the second test case, on the first day you buy $ 2 $ kilo and get another $ 1 $ more for a promotion. This way you will spend $ 2 \\cdot 5 = 10 $ coins.",
    "translation": "### 题目描述\n共 $t$ 组数据，每组数据中，你需要买 $n$ 公斤苹果，第一天单价为 $a$ ，但每买 $m$ 公斤赠送一公斤；第二天单价为 $b$ 。求最小花费。\n### 输入输出格式\n第一行一个正整数 $t$ ，对于每组数据输入包含两行，第一行两个正整数 $a,b$ ，第二行两个正整数 $n,m$ 。\\\n对于每组数据，输出一行一个正整数，表示最少花费。\n### 数据范围\n$1 \\leqslant t \\leqslant 10^4 \\ , \\ 1 \\leqslant a,b,n,m \\leqslant 10^9$ 。"
}