{
    "description": "Three guys play a game: first, each person writes down $ n $ distinct words of length $ 3 $ . Then, they total up the number of points as follows:\n\n- if a word was written by one person — that person gets 3 points,\n- if a word was written by two people — each of the two gets 1 point,\n- if a word was written by all — nobody gets any points.\n\n In the end, how many points does each player have?",
    "inputFormat": "The input consists of multiple test cases. The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\leq n \\leq 1000 $ ) — the number of words written by each person.\n\nThe following three lines each contain $ n $ distinct strings — the words written by each person. Each string consists of $ 3 $ lowercase English characters.",
    "outputFormat": "For each test case, output three space-separated integers — the number of points each of the three guys earned. You should output the answers in the same order as the input; the $ i $ -th integer should be the number of points earned by the $ i $ -th guy.",
    "samples": [
        [
            "3\n1\nabc\ndef\nabc\n3\norz for qaq\nqaq orz for\ncod for ces\n5\niat roc hem ica lly\nbac ter iol ogi sts\nbac roc lly iol iat",
            "1 3 1 \n2 2 6 \n9 11 5"
        ]
    ],
    "hint": "In the first test case:\n\n- The word $ \\texttt{abc} $ was written by the first and third guys — they each get $ 1 $ point.\n- The word $ \\texttt{def} $ was written by the second guy only — he gets $ 3 $ points.",
    "translation": "$t$ 组数据，每组一个 $n$ 表示字符串数量，之后三行每行 $n$ 个长度为 $3$ 的字符串，表示三个小朋友各自的字符串。\n\n如果一个字符串只有一个小朋友有，那他得三分。如果有两个小朋友有，两人各得一分。若三人都有，不得分。\n\n求出三个小朋友最终得分。\n\nBy Binary_1110011_"
}