{
    "description": "This is a hard version of the problem. In this version, there are two colors of the cards.\n\nAlice has $ n $ cards, each card is either black or white. The cards are stacked in a deck in such a way that the card colors alternate, starting from a white card. Alice deals the cards to herself and to Bob, dealing at once several cards from the top of the deck in the following order: one card to herself, two cards to Bob, three cards to Bob, four cards to herself, five cards to herself, six cards to Bob, seven cards to Bob, eight cards to herself, and so on. In other words, on the $ i $ -th step, Alice deals $ i $ top cards from the deck to one of the players; on the first step, she deals the cards to herself and then alternates the players every two steps. When there aren't enough cards at some step, Alice deals all the remaining cards to the current player, and the process stops.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1786A2/0207dd60d582562fa5c47d04eb7edab3058bc16d.png) First Alice's steps in a deck of many cards.How many cards of each color will Alice and Bob have at the end?",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 200 $ ). The description of the test cases follows\n\nThe only line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 10^6 $ ) — the number of cards.",
    "outputFormat": "For each test case print four integers — the number of cards in the end for each player — in this order: white cards Alice has, black cards Alice has, white cards Bob has, black cards Bob has.",
    "samples": [
        [
            "5\n10\n6\n17\n8\n1000000",
            "3 2 2 3\n1 0 2 3\n6 4 3 4\n2 1 2 3\n250278 249924 249722 250076"
        ]
    ],
    "hint": "",
    "translation": "Alice 有 $n$ 张牌，其中奇数牌为白色，偶数牌为黑色。\n\nAlice 准备把牌分给 Bob 和她自己。Alice 以这样的方式发牌：一张牌给 Alice，两张牌给 Bob，三张牌给 Bob，四张牌给 Alice，五张牌给 Alice，六张牌给 Bob，以此类推。当某一步没有足够的牌时，Alice 会将所有剩余的牌发给当前玩家，且停止发牌。\n\n给出牌的张数 $n$，求每个玩家每种牌各有多少张。\n\n有多组数据。"
}