{
    "description": "There are two towers consisting of blocks of two colors: red and blue. Both towers are represented by strings of characters B and/or R denoting the order of blocks in them from the bottom to the top, where B corresponds to a blue block, and R corresponds to a red block.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1795A/69c3335e48895bcb4c761995acd0b1c64b9e8d07.png) These two towers are represented by strings BRBB and RBR.You can perform the following operation any number of times: choose a tower with at least two blocks, and move its top block to the top of the other tower.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1795A/1c4aa5e98141199029dbc159f3efac85b139c1b9.png) ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1795A/e96b9925d26bf52f3d8e10b859d46a71421db524.png)The pair of towers is beautiful if no pair of touching blocks has the same color; i. e. no red block stands on top of another red block, and no blue block stands on top of another blue block.\n\nYou have to check if it is possible to perform any number of operations (possibly zero) to make the pair of towers beautiful.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nEach test case consists of three lines:\n\n- the first line contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 20 $ ) — the number of blocks in the first tower and the number of blocks in the second tower, respectively;\n- the second line contains $ s $ — a string of exactly $ n $ characters B and/or R, denoting the first tower;\n- the third line contains $ t $ — a string of exactly $ m $ characters B and/or R, denoting the second tower.",
    "outputFormat": "For each test case, print YES if it is possible to perform several (possibly zero) operations in such a way that the pair of towers becomes beautiful; otherwise print NO.\n\nYou may print each letter in any case (YES, yes, Yes will all be recognized as positive answer, NO, no and nO will all be recognized as negative answer).",
    "samples": [
        [
            "4\n4 3\nBRBB\nRBR\n4 7\nBRBR\nRRBRBRB\n3 4\nRBR\nBRBR\n5 4\nBRBRR\nBRBR",
            "YES\nYES\nYES\nNO"
        ]
    ],
    "hint": "In the first test case, you can move the top block from the first tower to the second tower (see the third picture).\n\nIn the second test case, you can move the top block from the second tower to the first tower $ 6 $ times.\n\nIn the third test case, the pair of towers is already beautiful.",
    "translation": "### 简述题意\n有 $a,b$ 两座由红蓝色方块垒成的塔,其中 $a$ 的高度为 $n$ ； $b$ 的高度为 $m$ ，用 `R` 代表红色；用`B`代表蓝色。\n\n你可以多次把其中一座顶端的方块移到另一座的顶端（可以不移动）。问有没有一种方法可以使两座塔中均没有连续的同颜色方块。\n### 输入输出\n多组测试数据，对于每一组数据：\n\n输入三行：\n\n第一行有两个整数，分别为 $n$ 和 $m$ 。\n\n第二行和第三行为两个字符串，分别为塔 $a$ 和塔 $b$ 。\n\n输出一行：\n\n若答案为正确，可以输出`YES`、`yes`或`Yes`，若答案为错误，可以输出`NO`、`no`或`nO`。"
}