{
    "description": "You find yourself on an unusual crossroad with a weird traffic light. That traffic light has three possible colors: red (r), yellow (y), green (g). It is known that the traffic light repeats its colors every $ n $ seconds and at the $ i $ -th second the color $ s_i $ is on.\n\nThat way, the order of the colors is described by a string. For example, if $ s= $ \"rggry\", then the traffic light works as the following: red-green-green-red-yellow-red-green-green-red-yellow- ... and so on.\n\nMore formally, you are given a string $ s_1, s_2, \\ldots, s_n $ of length $ n $ . At the first second the color $ s_1 $ is on, at the second — $ s_2 $ , ..., at the $ n $ -th second the color $ s_n $ is on, at the $ n + 1 $ -st second the color $ s_1 $ is on and so on.\n\nYou need to cross the road and that can only be done when the green color is on.\n\nYou know which color is on the traffic light at the moment, but you don't know the current moment of time. You need to find the minimum amount of time in which you are guaranteed to cross the road.\n\nYou can assume that you cross the road immediately.\n\nFor example, with $ s= $ \"rggry\" and the current color r there are two options: either the green color will be on after $ 1 $ second, or after $ 3 $ . That way, the answer is equal to $ 3 $ — that is the number of seconds that we are guaranteed to cross the road, if the current color is r.",
    "inputFormat": "The first line contains a single integer $ t $ $ (1 \\leq t \\leq 10^4 $ ) — the number of test cases.\n\nThen the description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ and a symbol $ c $ ( $ 1 \\leq n \\leq 2 \\cdot 10^5 $ , $ c $ is one of allowed traffic light colors r, y or g)— the length of the string $ s $ and the current color of the traffic light.\n\nThe second line of each test case contains a string $ s $ of the length $ n $ , consisting of the letters r, y and g.\n\nIt is guaranteed that the symbol g is in the string $ s $ and the symbol $ c $ is in the string $ s $ .\n\nIt is guaranteed, that the sum of $ n $ over all test cases does not exceed $ 2\\cdot10^5 $ .",
    "outputFormat": "For each test case output the minimal number of second in which you are guaranteed to cross the road.",
    "samples": [
        [
            "6\n5 r\nrggry\n1 g\ng\n3 r\nrrg\n5 y\nyrrgy\n7 r\nrgrgyrg\n9 y\nrrrgyyygy",
            "3\n0\n2\n4\n1\n4"
        ]
    ],
    "hint": "The first test case is explained in the statement.\n\nIn the second test case the green color is on so you can cross the road immediately.\n\nIn the third test case, if the red color was on at the second second, then we would wait for the green color for one second, and if the red light was on at the first second, then we would wait for the green light for two seconds.\n\nIn the fourth test case the longest we would wait for the green color is if we wait for it starting from the fifth second.",
    "translation": "给定一个循环字符串的一个最小循环节。\n\n求循环字符串中一种字母的右边的第一个 $\\texttt{g}$ 字符的距离最大值，这个字母可以为循环节中任意一个位置，只要符合字母种类要求即可。\n\n如字母种类为 $\\texttt{r}$ ，循环节为 $\\texttt{rggry}$ ，则我们可以选择位于第 $4$ 个位置的 $\\texttt{r}$ ,即可达到最大距离的要求: $3$ 。\n\n$\\texttt{translated by }$[acwing_gza](/user/301255)"
}