{
    "description": "Stanley and Megan decided to shop in the \"Crossmarket\" grocery store, which can be represented as a matrix with $ n $ rows and $ m $ columns.\n\nStanley and Megan can move to an adjacent cell using $ 1 $ unit of power. Two cells are considered adjacent if they share an edge. To speed up the shopping process, Megan brought her portals with her, and she leaves one in each cell she visits (if there is no portal yet). If a person (Stanley or Megan) is in a cell with a portal, that person can use $ 1 $ unit of power to teleport to any other cell with a portal, including Megan's starting cell.\n\nThey decided to split up: Stanley will go from the upper-left cell (cell with coordinates $ (1, 1) $ ) to the lower-right cell (cell with coordinates $ (n, m) $ ), whilst Megan needs to get from the lower-left cell (cell with coordinates $ (n, 1) $ ) to the upper-right cell (cell with coordinates $ (1, m) $ ).\n\nWhat is the minimum total energy needed for them both to do that?\n\nNote that they can choose the time they move. Time does not affect energy.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ). Description of the test cases follows.\n\nThe only line in the test case contains two integers $ n $ and $ m $ ( $ 1 \\le n, m \\le 10^5 $ ).",
    "outputFormat": "For each test case print a single integer on a new line – the answer.",
    "samples": [
        [
            "7\n7 5\n5 7\n1 1\n100000 100000\n57 228\n1 5\n5 1",
            "15\n15\n0\n299998\n340\n5\n5"
        ]
    ],
    "hint": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1715A/13e3a3ce7d991b7ad6fbb4c6b920e4c6d5759dea.png)In the first test case they can stick to the following plan:\n\n1. Megan (red circle) moves to the cell $ (7, 3) $ . Then she goes to the cell $ (1, 3) $ , and Stanley (blue circle) does the same.\n2. Stanley uses the portal in that cell (cells with portals are grey) to get to the cell $ (7, 3) $ . Then he moves to his destination — cell $ (7, 5) $ .\n3. Megan also finishes her route and goes to the cell $ (1, 5) $ .\n\nThe total energy spent is $ (2 + 6) + (2 + 1 + 2) + (2)= 15 $ , which is our final answer.",
    "translation": "### 题意翻译\n有一个 $n \\times m$ 的空间，\n\nStanley 需要从左上角到右下角；\n\nMegan 则需要从左下角到右上角。\n\n两人可以耗费 $1$ 能量到达相邻的格子。\n\n同时为了加快到达的速度， Megan 会在经过的所有格子留下传送门，两人可以耗费 $1$ 能量通过任意传送门通往任意有传送门的位置。\n\n求两人均到达目的地耗费的最小总能量。\n\nby SenGYi"
}