{
    "description": "You have a string $ s $ consisting of digits from $ 0 $ to $ 9 $ inclusive. You can perform the following operation any (possibly zero) number of times:\n\n- You can choose a position $ i $ and delete a digit $ d $ on the $ i $ -th position. Then insert the digit $ \\min{(d + 1, 9)} $ on any position (at the beginning, at the end or in between any two adjacent digits).\n\nWhat is the lexicographically smallest string you can get by performing these operations?\n\nA string $ a $ is lexicographically smaller than a string $ b $ of the same length if and only if the following holds:\n\n- in the first position where $ a $ and $ b $ differ, the string $ a $ has a smaller digit than the corresponding digit in $ b $ .",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases. Then the test cases follow.\n\nEach test case consists of a single line that contains one string $ s $ ( $ 1 \\le |s| \\le 2 \\cdot 10^5 $ ) — the string consisting of digits. Please note that $ s $ is just a string consisting of digits, so leading zeros are allowed.\n\nIt is guaranteed that the sum of lengths of $ s $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "Print a single string — the minimum string that is possible to obtain.",
    "samples": [
        [
            "4\n04829\n9\n01\n314752277691991",
            "02599\n9\n01\n111334567888999"
        ]
    ],
    "hint": "In the first test case:\n\n- Delete $ 8 $ and insert $ 9 $ at the end of the notation. The resulting notation is $ 04299 $ .\n- Delete $ 4 $ and insert $ 5 $ in the $ 3 $ -rd position of the notation. The resulting notation is $ 02599 $ .\n\nNothing needs to be done in the second and third test cases.",
    "translation": "给定一个仅包含 $0$ 到 $9$ 这几个数字的字符串，你可以执行以下操作任意次：\n\n选择字符串中的一个数字 $d$，将 $d$ 删除后，向字符串任意位置插入一个数字 $\\min(d+1,9)$.\n\n求能够得到的字典序最小的字符串。"
}