{
    "description": "Let's call a string balanced if all characters that are present in it appear the same number of times. For example, \"coder\", \"appall\", and \"ttttttt\" are balanced, while \"wowwow\" and \"codeforces\" are not.\n\nYou are given a string $ s $ of length $ n $ consisting of lowercase English letters. Find a balanced string $ t $ of the same length $ n $ consisting of lowercase English letters that is different from the string $ s $ in as few positions as possible. In other words, the number of indices $ i $ such that $ s_i \\ne t_i $ should be as small as possible.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nEach test case consists of two lines. The first line contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the length of the string $ s $ .\n\nThe second line contains the string $ s $ of length $ n $ consisting of lowercase English letters.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, print the smallest number of positions where string $ s $ and a balanced string $ t $ can differ, followed by such a string $ t $ .\n\nIf there are multiple solutions, print any. It can be shown that at least one balanced string always exists.",
    "samples": [
        [
            "4\n5\nhello\n10\ncodeforces\n5\neevee\n6\nappall",
            "1\nhelno\n2\ncodefofced\n1\neeeee\n0\nappall"
        ]
    ],
    "hint": "In the first test case, the given string \"hello\" is not balanced: letters 'h', 'e', and 'o' appear in it once, while letter 'l' appears twice. On the other hand, string \"helno\" is balanced: five distinct letters are present in it, and each of them appears exactly once. Strings \"hello\" and \"helno\" differ in just one position: the fourth character. Other solutions are possible too.\n\nIn the second test case, string \"codefofced\" is balanced since only letters 'c', 'o', 'd', 'e', and 'f' are present in it, and each of them appears exactly twice.\n\nIn the third test case, string \"eeeee\" is balanced since only letter 'e' is present in it.\n\nIn the fourth test case, the given string \"appall\" is already balanced.",
    "translation": "给出长度为 $n$ 的只包含小写字母的字符串 $s$，请修改尽量少的字符，使得每种出现过的字符出现次数相同。给出最优的修改次数和一种方案。**（一定有解，多组数据）**"
}