{
    "description": "In an ICPC contest, balloons are distributed as follows:\n\n- Whenever a team solves a problem, that team gets a balloon.\n- The first team to solve a problem gets an additional balloon.\n\n A contest has 26 problems, labelled $ \\textsf{A} $ , $ \\textsf{B} $ , $ \\textsf{C} $ , ..., $ \\textsf{Z} $ . You are given the order of solved problems in the contest, denoted as a string $ s $ , where the $ i $ -th character indicates that the problem $ s_i $ has been solved by some team. No team will solve the same problem twice.Determine the total number of balloons that the teams received. Note that some problems may be solved by none of the teams.",
    "inputFormat": "The first line of the input contains an integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of testcases.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\leq n \\leq 50 $ ) — the length of the string.\n\nThe second line of each test case contains a string $ s $ of length $ n $ consisting of uppercase English letters, denoting the order of solved problems.",
    "outputFormat": "For each test case, output a single integer — the total number of balloons that the teams received.",
    "samples": [
        [
            "6\n3\nABA\n1\nA\n3\nORZ\n5\nBAAAA\n4\nBKPT\n10\nCODEFORCES",
            "5\n2\n6\n7\n8\n17"
        ]
    ],
    "hint": "In the first test case, $ 5 $ balloons are given out:\n\n- Problem $ \\textsf{A} $ is solved. That team receives $ 2 $ balloons: one because they solved the problem, an an additional one because they are the first team to solve problem $ \\textsf{A} $ .\n- Problem $ \\textsf{B} $ is solved. That team receives $ 2 $ balloons: one because they solved the problem, an an additional one because they are the first team to solve problem $ \\textsf{B} $ .\n- Problem $ \\textsf{A} $ is solved. That team receives only $ 1 $ balloon, because they solved the problem. Note that they don't get an additional balloon because they are not the first team to solve problem $ \\textsf{A} $ .\n\n The total number of balloons given out is $ 2+2+1=5 $ .In the second test case, there is only one problem solved. The team who solved it receives $ 2 $ balloons: one because they solved the problem, an an additional one because they are the first team to solve problem $ \\textsf{A} $ .",
    "translation": "在一场比赛中，有 $26$ 道题目和很多个团队，题目标号分别为 `A` 到 `Z`。每当一道题目被第一次解决，该团队获得 $2$ 个气球，否则获得 $1$ 个气球。\n\n现在给出一个字符串，代表题目被解决的顺序，字符串第 $i$ 个字符 $S_i$ 代表题目 $S_i$ 被解决。求所有团队获得的气球总数。"
}