{
    "description": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/f0f8b416d84260abf4a5738763b563a4a29739c9.png)Ela likes Chess a lot. During breaks, she usually challenges her co-worker in DTL to some chess games. She's not an expert at classic chess, but she's very interested in Chess variants, where she has to adapt to new rules and test her tactical mindset to win the game.The problem, which involves a non-standard chess pieces type that is described below, reads: given $ 3 $ white crickets on a $ n \\cdot n $ board, arranged in an \"L\" shape next to each other, there are no other pieces on the board. Ela wants to know with a finite number of moves, can she put any white cricket on the square on row $ x $ , column $ y $ ?\n\nAn \"L\"-shape piece arrangement can only be one of the below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/514135a9cb3021fdd11c6f5877903e61238e21da.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/e135bddf869fc3c4e5900f14eaae8062e1263b64.png) ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/b79b64cfe0ed70ae5dd5a6ed54ba57554fdeec32.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/07b44b1ac7a379c6fed131cb7e0805a4ed084742.png)For simplicity, we describe the rules for crickets on the board where only three white crickets are. It can move horizontally, vertically, or diagonally, but only to a square in some direction that is immediately after another cricket piece (so that it must jump over it). If the square immediately behind the piece is unoccupied, the cricket will occupy the square. Otherwise (when the square is occupied by another cricket, or does not exist), the cricket isn't allowed to make such a move.\n\nSee an example of valid crickets' moves on the pictures in the Note section.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nThe first line of each test case contains $ n $ ( $ 4 \\le n \\le 10^5 $ ) — denotes the size of the chessboard.\n\nThe second line of each test case contains 6 numbers: $ r_1 $ , $ c_1 $ , $ r_2 $ , $ c_2 $ , $ r_3 $ , $ c_3 $ ( $ 1 \\le r_1, c_1, r_2, c_2, r_3, c_3 \\le n $ ) — coordinates of the crickets. The input ensures that the three crickets are arranged in an \"L\" shape that the legend stated.\n\nThe third line of each test case contains 2 numbers: $ x $ , $ y $ ( $ 1 \\le x, y \\le n $ ) — coordinates of the target square.",
    "outputFormat": "For each test case, print \"YES\" or \"NO\" to denotes whether Ela can put a cricket on the target square.",
    "samples": [
        [
            "6\n8\n7 2 8 2 7 1\n5 1\n8\n2 2 1 2 2 1\n5 5\n8\n2 2 1 2 2 1\n6 6\n8\n1 1 1 2 2 1\n5 5\n8\n2 2 1 2 2 1\n8 8\n8\n8 8 8 7 7 8\n4 8",
            "YES\nNO\nYES\nNO\nYES\nYES"
        ]
    ],
    "hint": "Here's the solution for the first test case. The red square denotes where the crickets need to reach. Note that in chess horizontals are counted from bottom to top, as well as on this picture.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/5d188af801d8843cba510dd4aca2e2621bb3a163.png)",
    "translation": "给定一个 $n\\times n$ 的棋盘，棋盘上有且仅有三颗排成 $\\text{L}$ 形的棋子。\n\n对于 $\\text{L}$ 形的定义，有且仅有以下四种情况：\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/514135a9cb3021fdd11c6f5877903e61238e21da.png)，\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/e135bddf869fc3c4e5900f14eaae8062e1263b64.png)，\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/b79b64cfe0ed70ae5dd5a6ed54ba57554fdeec32.png)，\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737C/07b44b1ac7a379c6fed131cb7e0805a4ed084742.png)\n\n棋子的移动规则和跳棋相同。它可以水平、垂直或斜向移动。当且仅当一个棋子的某个方向紧随另一个棋子时，它能跳到另一个棋子之后的一个方格上。棋子不能跳出棋盘。详见样例解释。\n\n现在有 $T$ 组询问，每组给出棋盘大小 $n(n\\le 10^5)$，三颗棋子各自的位置 $r_1,c_1,r_2,c_2,r_3,c_3(1\\le r_1,c_1,r_2,c_2,r_3,c_3 \\le n)$，以及目标点 $x,y(1 \\le x,y \\le n)$，询问是否能使其中的一颗棋子跳到目标点。输出 `YES` 或 `NO`。"
}