{
    "description": "One of the SWERC judges has a dog named Boy. Besides being a good competitive programmer, Boy loves fresh air, so she wants to be walked at least twice a day. Walking Boy requires $ 120 $ consecutive minutes. Two walks cannot overlap, but one can start as soon as the previous one has finished.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1776A/78c7ec3373fdb4aaf6097566a036cee5a4aad5b2.png)Boy before and after getting ACCEPTED on this problem.\n\nToday, the judge sent $ n $ messages to the SWERC Discord server. The $ i $ -th message was sent $ a_i $ minutes after midnight. You know that, when walking Boy, the judge does not send any messages, but he can send a message right before or right after a walk. Is it possible that the judge walked Boy at least twice today?\n\nNote that a day has $ 1440 $ minutes, and a walk is considered to happen today if it starts at a minute $ s \\ge 0 $ and ends right before a minute $ e \\le 1440 $ . In that case, it must hold that $ e - s = 120 $ and, for every $ i = 1, \\, 2 \\, \\dots, \\, n $ , either $ a_i \\le s $ or $ a_i \\ge e $ .",
    "inputFormat": "Each test contains multiple test cases. The first line contains an integer $ t $ ( $ 1 \\le t \\le 100 $ ) — the number of test cases. The descriptions of the $ t $ test cases follow.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the number of messages sent by the judge.\n\nThe second line of each test case contains $ n $ integers $ a_1, \\, a_2, \\, \\dots, \\, a_n $ ( $ 0 \\le a_1 < a_2 < \\cdots < a_n < 1440 $ ) — the times at which the messages have been sent (in minutes elapsed from midnight).",
    "outputFormat": "For each test case, output one line containing $ \\texttt{YES} $ if it is possible that Boy has been walked at least twice, and $ \\texttt{NO} $ otherwise.",
    "samples": [
        [
            "6\n14\n100 200 300 400 500 600 700 800 900 1000 1100 1200 1300 1400\n12\n100 200 300 400 600 700 800 900 1100 1200 1300 1400\n13\n100 200 300 400 500 600 700 800 900 1100 1200 1300 1400\n13\n101 189 272 356 463 563 659 739 979 1071 1170 1274 1358\n1\n42\n5\n0 1 2 3 4",
            "NO\nYES\nNO\nYES\nYES\nYES"
        ]
    ],
    "hint": "In the first test case, the judge has sent a message at each time multiple of $ 100 $ (excluding $ 0 $ ). It is impossible that he has walked Boy even once.\n\nIn the second test case, the times are the same as above, but $ 500 $ and $ 1000 $ are missing. The judge could have walked Boy, for instance, during the time intervals $ [440, 560] $ and $ [980, 1100] $ . The situation is illustrated in the picture below, where the walks are represented by green intervals.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1776A/fe2f3fd6c35a05df59258e52bbda27c42f836bb8.png) $ $ $ $ $$</p><p>In the <span class=\"tex-font-style-bf\">third test case</span>, the times are the same as in the first test case, but  $ 1000 $  is missing. The judge could have walked Boy at most once.</p><p>In the <span class=\"tex-font-style-bf\">fourth test case</span>, Boy could have been walked during the time intervals  $ \\[739, 859\\] $  and  $ \\[859, 979\\]$$$.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1776A/03c7e851753f1f737cff96bb4fef8c48a9443b97.png)"
}