{
    "description": "Matryoshka is a wooden toy in the form of a painted doll, inside which you can put a similar doll of a smaller size.\n\nA set of nesting dolls contains one or more nesting dolls, their sizes are consecutive positive integers. Thus, a set of nesting dolls is described by two numbers: $ s $ — the size of a smallest nesting doll in a set and $ m $ — the number of dolls in a set. In other words, the set contains sizes of $ s, s + 1, \\dots, s + m - 1 $ for some integer $ s $ and $ m $ ( $ s,m > 0 $ ).\n\nYou had one or more sets of nesting dolls. Recently, you found that someone mixed all your sets in one and recorded a sequence of doll sizes — integers $ a_1, a_2, \\dots, a_n $ .\n\nYou do not remember how many sets you had, so you want to find the minimum number of sets that you could initially have.\n\nFor example, if a given sequence is $ a=[2, 2, 3, 4, 3, 1] $ . Initially, there could be $ 2 $ sets:\n\n- the first set consisting of $ 4 $ nesting dolls with sizes $ [1, 2, 3, 4] $ ;\n- a second set consisting of $ 2 $ nesting dolls with sizes $ [2, 3] $ .\n\nAccording to a given sequence of sizes of nesting dolls $ a_1, a_2, \\dots, a_n $ , determine the minimum number of nesting dolls that can make this sequence.\n\nEach set is completely used, so all its nesting dolls are used. Each element of a given sequence must correspond to exactly one doll from some set.",
    "inputFormat": "The first line of input data contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nThe description of the test cases follows.\n\nThe first line of each test case contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the total number of matryoshkas that were in all sets.\n\nThe second line of each test case contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ) — the sizes of the matryoshkas.\n\nIt is guaranteed that the sum of values of $ n $ over all test cases does not exceed $ 2\\cdot10^5 $ .",
    "outputFormat": "For each test case, print one integer $ k $ — the minimum possible number of matryoshkas sets.",
    "samples": [
        [
            "10\n6\n2 2 3 4 3 1\n5\n11 8 7 10 9\n6\n1000000000 1000000000 1000000000 1000000000 1000000000 1000000000\n8\n1 1 4 4 2 3 2 3\n6\n1 2 3 2 3 4\n7\n10 11 11 12 12 13 13\n7\n8 8 9 9 10 10 11\n8\n4 14 5 15 6 16 7 17\n8\n5 15 6 14 8 12 9 11\n5\n4 2 2 3 4",
            "2\n1\n6\n2\n2\n2\n2\n2\n4\n3"
        ]
    ],
    "hint": "The first test case is described in the problem statement.\n\nIn the second test case, all matryoshkas could be part of the same set with minimum size $ s=7 $ .\n\nIn the third test case, each matryoshka represents a separate set.",
    "translation": "有一种玩具，每个玩具由一个序列组成。一个玩具可以表示为一个二元组 $(s,m)$，其中 $s,m>0$。其含义是这个玩具的序列长度为 $m$，元素为 $s,s+1,s+2,\\cdots,s+m-1$。\n\nZYH 有很多个玩具，但是他不慎把所有玩具的元素乱序混合到了一起。例如玩具 $[1,2,3,4]$ 和玩具 $[2,3]$ 混合到一起后可能是 $[2,2,3,4,3,1]$。\n\n给定混合后的序列 $a$，SA 想知道 ZYH 最初最少有多少个玩具。\n\n多组数据，$1\\leq T\\leq 10^4,1\\leq n \\leq 2\\times 10^5,1\\leq a_i \\leq 10^9,\\sum n \\leq 2\\times 10^5$。\n\ntranslated by @[StayAlone](https://www.luogu.com.cn/user/409236)"
}