{
    "description": "Petya and his friend, the robot Petya++, went to BFDMONCON, where the costume contest is taking place today.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1775E/8672900337cd1aed871edb11b60553e5c1da4d39.png)While walking through the festival, they came across a scientific stand named after Professor Oak and Golfball, where they were asked to solve an interesting problem.\n\nGiven a sequence of numbers $ a_1, a_2, \\dots, a_n $ you can perform several operations on this sequence.\n\nEach operation should look as follows. You choose some subsequence $ ^\\dagger $ . Then you call all the numbers at odd positions in this subsequence northern, and all the numbers at even positions in this subsequence southern. In this case, only the position of the number in the subsequence is taken into account, not in the original sequence.\n\nFor example, consider the sequence $ 1, 4, 2, 8, 5, 7, 3, 6, 9 $ and its subsequence (shown in bold) $ 1, \\mathbf{4}, \\mathbf{2}, 8, \\mathbf{5}, 7, 3, \\mathbf{6}, 9 $ . Then the numbers $ 4 $ and $ 5 $ are northern, and the numbers $ 2 $ and $ 6 $ are southern.\n\nAfter that, you can do one of the following:\n\n- add $ 1 $ to all northern numbers and subtract $ 1 $ from all south numbers; or\n- add $ 1 $ to all southern numbers and subtract $ 1 $ from all northern numbers.\n\nThus, from the sequence $ 1, \\mathbf{4}, \\mathbf{2}, 8, \\mathbf{5}, 7, 3, \\mathbf{6}, 9 $ , if you choose the subsequence shown in bold, you can get either $ 1, \\mathbf{5}, \\mathbf{1}, 8, \\mathbf{6}, 7, 3, \\mathbf{5}, 9 $ or $ 1, \\mathbf{3}, \\mathbf{3}, 8, \\mathbf{4}, 7, 3, \\mathbf{7}, 9 $ .\n\nThen the operation ends. Note also that all operations are independent, i. e. the numbers are no longer called northern or southern when one operation ends.\n\nIt is necessary to turn all the numbers of the sequence into zeros using the operations described above. Since there is very little time left before the costume contest, the friends want to know, what is the minimum number of operations required for this.\n\nThe friends were unable to solve this problem, so can you help them?\n\n $ ^\\dagger $ A sequence $ c $ is a subsequence of a sequence $ d $ if $ c $ can be obtained from $ d $ by the deletion of several (possibly, zero or all) elements.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 10^4 $ ). The description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\le n \\le 2\\cdot 10^5 $ ) — the length of the sequence.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\ldots, a_n $ ( $ -10^9 \\le a_i \\le 10^9 $ ) — the description of the sequence itself.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2\\cdot 10^5 $ .",
    "outputFormat": "For each test case, print one integer in a single line — the minimum number of operations it takes to turn all the numbers into zeros.",
    "samples": [
        [
            "5\n3\n1 2 -3\n5\n1 0 0 -1 -1\n6\n2 -4 3 -5 4 1\n5\n1 -1 1 -1 1\n7\n0 0 0 0 0 0 0",
            "3\n2\n6\n1\n0"
        ]
    ],
    "hint": "In the first test case, the sequence of operations is as follows: $ \\mathbf{1}, 2, \\mathbf{-3} \\longrightarrow 0, \\mathbf{2}, \\mathbf{-2} \\longrightarrow 0, \\mathbf{1}, \\mathbf{-1} \\longrightarrow 0, 0, 0 $ .\n\nIn the second test case, the sequence looks like this: $ \\mathbf{1}, 0, 0, \\mathbf{-1}, -1 \\longrightarrow 0, 0, 0, 0, \\mathbf{-1} \\longrightarrow 0, 0, 0, 0, 0 $ .\n\nIn the fourth test case, simply select the entire sequence as a subsequence, then subtract one from the northern numbers and add one to the southern numbers. Thus, the sequence will be nulled in one operation.\n\nIn the fifth test case, you don't need to do any operations, since the sequence already consists of zeros.",
    "translation": "给定 $n$ 个数 $a_1...a_n$，随后你可以进行若干次操作，每次操作步骤如下：\n\n* 选出 $a$ 中一个子序列（可以不连续）。 \n\n* 把子序列中的奇数项减一，偶数项加一；或者奇数项加一，偶数项减一。\n\n求把 $n$ 个数全部变成 $0$ 的最少操作次数。\n\n$1\\le n\\le2\\times10^5,-10^9\\le a_i\\le10^9$，多组数据。"
}