{
    "description": "You have a matrix $ 2 \\times 2 $ filled with distinct integers. You want your matrix to become beautiful. The matrix is beautiful if the following two conditions are satisfied:\n\n- in each row, the first element is smaller than the second element;\n- in each column, the first element is smaller than the second element.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1772B/3883cb5d5c3c3237649026ca712db7066e7d51ae.png)You can perform the following operation on the matrix any number of times: rotate it clockwise by $ 90 $ degrees, so the top left element shifts to the top right cell, the top right element shifts to the bottom right cell, and so on:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1772B/a844c7395726cf76b3147efc79ccce4d8f167fbf.png)Determine if it is possible to make the matrix beautiful by applying zero or more operations.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 1000 $ ) — the number of test cases.\n\nEach test case consists of two lines. Each of those lines contains two integers — the elements of the corresponding row of the matrix. In each matrix, all four elements are distinct integers from $ 1 $ to $ 100 $ .",
    "outputFormat": "For each test case, print YES if the matrix can become beautiful, or NO otherwise. You may print each letter in any case (YES, yes, Yes will all be recognized as positive answer, NO, no and nO will all be recognized as negative answer).",
    "samples": [
        [
            "6\n1 3\n5 7\n8 10\n3 4\n8 10\n4 3\n6 1\n9 2\n7 5\n4 2\n1 2\n4 3",
            "YES\nYES\nNO\nYES\nYES\nNO"
        ]
    ],
    "hint": "",
    "translation": "给定 $t$ 个 $2\\times2$ 的矩阵，定义每列中左侧数字小于右侧数字、上面数字小于下面数组为一个优秀的矩阵。每一次操作是指顺时针调整矩阵一次，问能否经过若干次操作（或者不操作）使其变为优秀的矩阵。\n\n数据范围：$1\\le t \\le 1000$。"
}