{
    "description": "Let $ s $ be a string of lowercase Latin letters. Its price is the sum of the indices of letters (an integer between 1 and 26) that are included in it. For example, the price of the string abca is $ 1+2+3+1=7 $ .\n\nThe string $ w $ and the integer $ p $ are given. Remove the minimal number of letters from $ w $ so that its price becomes less than or equal to $ p $ and print the resulting string. Note that the resulting string may be empty. You can delete arbitrary letters, they do not have to go in a row. If the price of a given string $ w $ is less than or equal to $ p $ , then nothing needs to be deleted and $ w $ must be output.\n\nNote that when you delete a letter from $ w $ , the order of the remaining letters is preserved. For example, if you delete the letter e from the string test, you get tst.",
    "inputFormat": "The first line of input contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the test. The following are descriptions of $ t $ test cases.\n\nEach case consists of two lines.\n\nThe first of them is the string $ w $ , it is non-empty and consists of lowercase Latin letters. Its length does not exceed $ 2\\cdot10^5 $ .\n\nThe second line contains an integer $ p $ ( $ 1 \\le p \\le 5\\,200\\,000 $ ).\n\nIt is guaranteed that the sum of string lengths $ w $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "Output exactly $ t $ rows, the $ i $ -th of them should contain the answer to the $ i $ -th set of input data. Print the longest string that is obtained from $ w $ by deleting letters such that its price is less or equal to $ p $ . If there are several answers, then output any of them.\n\nNote that the empty string — is one of the possible answers. In this case, just output an empty string.",
    "samples": [
        [
            "5\nabca\n2\nabca\n6\ncodeforces\n1\ncodeforces\n10\ncodeforces\n100",
            "aa\nabc\n\ncdc\ncodeforces"
        ]
    ],
    "hint": "",
    "translation": "设 $s$ 为一个由小写拉丁字母组成的字符串。它的价格被定义为，字符串中每个字母在字母表中的位置的和。\n\n比如，字符串 $\\texttt{abca}$ 的价格是 $1 + 2 + 3 + 1 = 7$。\n\n现在给你一个字符串 $w (|w| \\le 2\\cdot 10^5)$，和一个整数 $p$，请你从字符串中**尽量少**的移除字母，使得 $w$ 的价格小于或等于 $p (1 \\le p \\le 5\\ 200\\ 000)$。注意移除的字母数量可以是 $0$ 个，也可以是字符串中全部的字母。\n\n答案不唯一，输出任意一种即可。\n\n注意：一个测试点包含多组测试数据，第一行输入一个整数 $t\\ (1\\le t\\le 10^4)$ 表示数据组数。保证 $\\sum |w|\\le 2\\times 10^5$。\n\n由 [tzyt](https://www.luogu.com.cn/user/394488) 翻译"
}