{
    "description": "Vasya has a grid with $ 2 $ rows and $ n $ columns. He colours each cell red, green, or blue.\n\nVasya is colourblind and can't distinguish green from blue. Determine if Vasya will consider the two rows of the grid to be coloured the same.",
    "inputFormat": "The input consists of multiple test cases. The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases. The description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\leq n \\leq 100 $ ) — the number of columns of the grid.\n\nThe following two lines each contain a string consisting of $ n $ characters, each of which is either R, G, or B, representing a red, green, or blue cell, respectively — the description of the grid.",
    "outputFormat": "For each test case, output \"YES\" if Vasya considers the grid's two rows to be identical, and \"NO\" otherwise.\n\nYou can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).",
    "samples": [
        [
            "6\n2\nRG\nRB\n4\nGRBG\nGBGB\n5\nGGGGG\nBBBBB\n7\nBBBBBBB\nRRRRRRR\n8\nRGBRRGBR\nRGGRRBGR\n1\nG\nG",
            "YES\nNO\nYES\nNO\nYES\nYES"
        ]
    ],
    "hint": "In the first test case, Vasya sees the second cell of each row as the same because the second cell of the first row is green and the second cell of the second row is blue, so he can't distinguish these two cells. The rest of the rows are equal in colour. Therefore, Vasya will say that the two rows are coloured the same, even though they aren't.\n\nIn the second test case, Vasya can see that the two rows are different.\n\nIn the third test case, every cell is green or blue, so Vasya will think they are the same.",
    "translation": "给定两个由 `RGB` 组成的字符串，`R`代表红色，`G` 代表绿色，`B` 代表蓝色。`Vasya` 有色盲症因此他无法分辨蓝色和绿色。问这两个字符串在 `Vasya` 眼里是否相同。\n\n每个测试点包含多组询问。"
}