{
    "description": "Polycarp has a string $ s $ consisting of lowercase Latin letters.\n\nHe encodes it using the following algorithm.\n\nHe goes through the letters of the string $ s $ from left to right and for each letter Polycarp considers its number in the alphabet:\n\n- if the letter number is single-digit number (less than $ 10 $ ), then just writes it out;\n- if the letter number is a two-digit number (greater than or equal to $ 10 $ ), then it writes it out and adds the number 0 after.\n\nFor example, if the string $ s $ is code, then Polycarp will encode this string as follows:\n\n- 'c' — is the $ 3 $ -rd letter of the alphabet. Consequently, Polycarp adds 3 to the code (the code becomes equal to 3);\n- 'o' — is the $ 15 $ -th letter of the alphabet. Consequently, Polycarp adds 15 to the code and also 0 (the code becomes 3150);\n- 'd' — is the $ 4 $ -th letter of the alphabet. Consequently, Polycarp adds 4 to the code (the code becomes 31504);\n- 'e' — is the $ 5 $ -th letter of the alphabet. Therefore, Polycarp adds 5 to the code (the code becomes 315045).\n\nThus, code of string code is 315045.\n\nYou are given a string $ t $ resulting from encoding the string $ s $ . Your task is to decode it (get the original string $ s $ by $ t $ ).",
    "inputFormat": "The first line of the input contains an integer $ q $ ( $ 1 \\le q \\le 10^4 $ ) — the number of test cases in the input.\n\nThe descriptions of the test cases follow.\n\nThe first line of description of each test case contains one integer $ n $ ( $ 1 \\le n \\le 50 $ ) — the length of the given code.\n\nThe second line of the description of each test case contains a string $ t $ of length $ n $ — the given code. It is guaranteed that there exists such a string of lowercase Latin letters, as a result of encoding which the string $ t $ is obtained.",
    "outputFormat": "For each test case output the required string $ s $ — the string that gives string $ t $ as the result of encoding. It is guaranteed that such a string always exists. It can be shown that such a string is always unique.",
    "samples": [
        [
            "9\n6\n315045\n4\n1100\n7\n1213121\n6\n120120\n18\n315045615018035190\n7\n1111110\n7\n1111100\n5\n11111\n4\n2606",
            "code\naj\nabacaba\nll\ncodeforces\naaaak\naaaaj\naaaaa\nzf"
        ]
    ],
    "hint": "The first test case is explained above.\n\nIn the second test case, the answer is aj. Indeed, the number of the letter a is equal to $ 1 $ , so 1 will be appended to the code. The number of the letter j is $ 10 $ , so 100 will be appended to the code. The resulting code is 1100.\n\nThere are no zeros in the third test case, which means that the numbers of all letters are less than $ 10 $ and are encoded as one digit. The original string is abacaba.\n\nIn the fourth test case, the string $ s $ is equal to ll. The letter l has the number $ 12 $ and is encoded as 120. So ll is indeed 120120.",
    "translation": "### 题目大意\n\nPolycarp将一个**全小写**字母的字符串 s 做了以下编码：\n\n1. 如果这个字符在字母表中的编号 ( 如 字符 $'a'$ 的编号为 $1$，字符 $'z'$ 为 $26$ ) 为**个位**数 $(< 10)$，则直接输出其编号；\n2. 如果这个字符在字母表中的编号为**两位**数 $(\\geqslant 10)$，则在输出他的编号的基础上在其**之后**再输出一个 $0$。\n\n现给出编码后的字符串 $t$ ，请求出他对应的原串。\n\n### 输入格式\n\n第一行一个整数 $q \\; (1 \\leqslant q \\leqslant 10^4)$ 表示测试样例组数。\n\n对于每组测试样例，第一行一个整数 $n \\; (1 \\leqslant n \\leqslant 50)$ 表示编码后的字符串长度。\n\n第二行包含一个字符串 $t$ 表示编码后的字符串。\n\n### 输出格式\n\n对于每组测试样例，输出一行一个字符串 $s$ 表示原串\n\n$Translated \\; by \\; Zigh$"
}