{
    "description": "There are $ n $ participants in a competition, participant $ i $ having a strength of $ s_i $ .\n\nEvery participant wonders how much of an advantage they have over the other best participant. In other words, each participant $ i $ wants to know the difference between $ s_i $ and $ s_j $ , where $ j $ is the strongest participant in the competition, not counting $ i $ (a difference can be negative).\n\nSo, they ask you for your help! For each $ i $ ( $ 1 \\leq i \\leq n $ ) output the difference between $ s_i $ and the maximum strength of any participant other than participant $ i $ .",
    "inputFormat": "The input consists of multiple test cases. The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases. The descriptions of the test cases follow.\n\nThe first line of each test case contains an integer $ n $ ( $ 2 \\leq n \\leq 2\\cdot10^5 $ ) — the length of the array.\n\nThe following line contains $ n $ space-separated positive integers $ s_1 $ , $ s_2 $ , ..., $ s_n $ ( $ 1 \\leq s_i \\leq 10^9 $ ) — the strengths of the participants.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2\\cdot10^5 $ .",
    "outputFormat": "For each test case, output $ n $ space-separated integers. For each $ i $ ( $ 1 \\leq i \\leq n $ ) output the difference between $ s_i $ and the maximum strength of any other participant.",
    "samples": [
        [
            "5\n4\n4 7 3 5\n2\n1 2\n5\n1 2 3 4 5\n3\n4 9 4\n4\n4 4 4 4",
            "-3 2 -4 -2 \n-1 1 \n-4 -3 -2 -1 1 \n-5 5 -5 \n0 0 0 0"
        ]
    ],
    "hint": "For the first test case:\n\n- The first participant has a strength of $ 4 $ and the largest strength of a participant different from the first one is $ 7 $ , so the answer for the first participant is $ 4 - 7 = -3 $ .\n- The second participant has a strength of $ 7 $ and the largest strength of a participant different from the second one is $ 5 $ , so the answer for the second participant is $ 7 - 5 = 2 $ .\n- The third participant has a strength of $ 3 $ and the largest strength of a participant different from the third one is $ 7 $ , so the answer for the third participant is $ 3 - 7 = -4 $ .\n- The fourth participant has a strength of $ 5 $ and the largest strength of a participant different from the fourth one is $ 7 $ , so the answer for the fourth participant is $ 5 - 7 = -2 $ .",
    "translation": "若干个参赛者正在比拼。\n\n每个人想要知道除自己以外的最厉害的人力量比自己**弱多少**，现在他们依次在向你询问。\n\nTranslated by @[CLCK](https://www.luogu.com.cn/user/323183)"
}