{
    "description": "This is an interactive problem.\n\nAnya has gathered $ n $ chess experts numbered from $ 1 $ to $ n $ for which the following properties hold:\n\n- For any pair of players one of the players wins every game against the other (and no draws ever occur);\n- Transitivity does not necessarily hold — it might happen that $ A $ always beats $ B $ , $ B $ always beats $ C $ and $ C $ always beats $ A $ .\n\n Anya does not know, for each pair, who is the player who beats the other.To organize a tournament, Anya hosts $ n-1 $ games. In each game, she chooses two players. One of them wins and stays, while the other one is disqualified. After all the games are hosted only one player will remain. A player is said to be a candidate master if they can win a tournament (notice that the winner of a tournament may depend on the players selected by Anya in the $ n-1 $ games).\n\nSince Anya is a curious girl, she is interested in finding the candidate masters. Unfortunately, she does not have much time. To speed up the process, she will organize up to $ 2n $ simuls (short for \"simultaneous exhibition\", in which one player plays against many).\n\nIn one simul, Anya chooses exactly one player who will play against some (at least one) of the other players. The chosen player wins all games they would win in a regular game, and the same holds for losses. After the simul finishes, Anya is only told the total number of games won by the chosen player (but not which ones). Nobody is disqualified during a simul.\n\nCan you help Anya host simuls and determine the candidate masters?\n\nThe winning players in each pair could be changed between the simuls, but only in a way that preserves the results of all previous simuls. These changes may depend on your queries.",
    "inputFormat": "",
    "outputFormat": "Firstly, the jury sends one integer $ n $ ( $ 3 \\leq n \\leq 250 $ ) which should be read — the number of players. After that, your program may ask queries or report an answer.\n\nTo ask a query, print \"? $ i \\; s_1 s_2 \\ldots s_n $ \" (without quotes), where $ i $ is the index of the player who will play against some of the other players in the simul. $ s $ is a binary string that denotes the players they play against. $ i $ plays against every player $ j $ for which $ s_j = 1 $ holds (and $ s_j = 1 $ should hold for at least one $ 1 \\leq j \\leq n $ ). Please note that $ s_i = 0 $ must hold since a player cannot play against themselves, otherwise, the query is considered to be incorrect.\n\nAfter this, you should read an integer — the number of games player $ i $ has won.\n\nWhen you have identified the answer, you must print \"! $ c_1 c_2 \\ldots c_n $ \" (without quotes) and terminate your program. $ c $ is a binary string which represents the candidate masters. Player $ i $ is a candidate master if $ c_i=1 $ holds, otherwise, they are not.\n\nIf you ask more than $ 2n $ queries or if one of the queries is malformed, the interaction terminates immediately and your program receives verdict Wrong Answer.\n\nAfter printing a query do not forget to output the end of line and flush the output. Otherwise, you will get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see the documentation for other languages.\n\nHacks are disabled in this problem.",
    "samples": [
        [
            "3\n\n1\n\n1\n\n1",
            "? 1 010\n\n? 2 001\n\n? 3 100\n\n! 111"
        ],
        [
            "5\n\n0\n\n3\n\n4",
            "? 5 10110\n\n? 2 10111\n\n? 1 01111\n\n! 10000"
        ]
    ],
    "hint": "In the first example, the first query describes a simul in which player $ 1 $ plays against player $ 2 $ (and no one else). The answer to the query is $ 1 $ , meaning that player $ 1 $ won the only game they played. We can conclude that $ 1 $ beats $ 2 $ . Similarly, the second query tells us that $ 2 $ beats $ 3 $ and the third query tells us that $ 3 $ beats $ 1 $ . All players are candidate masters in this case as\n\n- Player $ 1 $ can win the tournament if $ 2 $ and $ 3 $ play first. $ 3 $ loses and leaves, while $ 2 $ stays. $ 1 $ then plays against $ 2 $ and wins;\n- Other players can win in the same fashion.\n\nIn the second example, the third query describes a simul in which player $ 1 $ plays against every other player. The answer to the query is $ 4 $ , meaning that they won every game they played. It can be concluded that player $ 1 $ also beats every other player. They can never lose, hence they are the only player who can remain at the end of every possible tournament, and the only possible candidate master.",
    "translation": "IO 交互题。\n\n有 $n$ 个人下棋，他们两两之间对战的胜负是确定的，但你不知道。注意，胜负不具有传递性。\n\n你可以进行至多 $2n$ 次询问，询问形式为 `? i s`，其中 $1\\le i\\le n$，$s$ 是一个长度为 $n$ 的 01 串，$s_j=1$ 表示选择第 $j$ 个人。系统会返回一个值 $x$，表示若 $i$ 与所有被选择的人对战胜利场数。\n\n现在要进行 $n-1$ 场淘汰赛，若你能安排每场比赛的对决双方，问哪些人最终可能留下。"
}