{
    "description": "Monocarp is going to host a party for his friends. He prepared $ n $ dishes and is about to serve them. First, he has to add some powdered pepper to each of them — otherwise, the dishes will be pretty tasteless.\n\nThe $ i $ -th dish has two values $ a_i $ and $ b_i $ — its tastiness with red pepper added or black pepper added, respectively. Monocarp won't add both peppers to any dish, won't add any pepper multiple times, and won't leave any dish without the pepper added.\n\nBefore adding the pepper, Monocarp should first purchase the said pepper in some shop. There are $ m $ shops in his local area. The $ j $ -th of them has packages of red pepper sufficient for $ x_j $ servings and packages of black pepper sufficient for $ y_j $ servings.\n\nMonocarp goes to exactly one shop, purchases multiple (possibly, zero) packages of each pepper in such a way that each dish will get the pepper added once, and no pepper is left. More formally, if he purchases $ x $ red pepper packages and $ y $ black pepper packages, then $ x $ and $ y $ should be non-negative and $ x \\cdot x_j + y \\cdot y_j $ should be equal to $ n $ .\n\nFor each shop, determine the maximum total tastiness of the dishes after Monocarp buys pepper packages only in this shop and adds the pepper to the dishes. If it's impossible to purchase the packages in the said way, print -1.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\le n \\le 3 \\cdot 10^5 $ ) — the number of dishes.\n\nThe $ i $ -th of the next $ n $ lines contains two integers $ a_i $ and $ b_i $ ( $ 1 \\le a_i, b_i \\le 10^9 $ ) — the tastiness of the $ i $ -th dish with red pepper added or black pepper added, respectively.\n\nThe next line contains a single integer $ m $ ( $ 1 \\le m \\le 3 \\cdot 10^5 $ ) — the number of shops.\n\nThe $ j $ -th of the next $ m $ lines contains two integers $ x_j $ and $ y_j $ ( $ 1 \\le x_j, y_j \\le n $ ) — the number of servings the red and the black pepper packages are sufficient for in the $ j $ -th shop, respectively.",
    "outputFormat": "Print $ m $ integers. For each shop, print the maximum total tastiness of the dishes after Monocarp buys pepper packages only in this shop and adds the pepper to the dishes. If it's impossible to purchase the packages so that each dish will get the pepper added once and no pepper is left, print -1.",
    "samples": [
        [
            "3\n5 10\n100 50\n2 2\n4\n2 3\n1 1\n3 2\n2 2",
            "62\n112\n107\n-1"
        ],
        [
            "10\n3 1\n2 3\n1 1\n2 1\n6 3\n1 4\n4 3\n1 3\n5 3\n5 4\n10\n8 10\n9 3\n1 4\n2 5\n8 3\n3 5\n1 6\n7 2\n6 7\n3 1",
            "26\n-1\n36\n30\n-1\n26\n34\n26\n-1\n36"
        ]
    ],
    "hint": "Consider the first example.\n\nIn the first shop, Monocarp can only buy $ 0 $ red pepper packages and $ 1 $ black pepper package. Black pepper added to all dishes will sum up to $ 10 + 50 + 2 = 62 $ .\n\nIn the second shop, Monocarp can buy any number of red and black pepper packages: $ 0 $ and $ 3 $ , $ 1 $ and $ 2 $ , $ 2 $ and $ 1 $ or $ 3 $ and $ 0 $ . The optimal choice turns out to be either $ 1 $ and $ 2 $ or $ 2 $ and $ 1 $ . Monocarp can add black pepper to the first dish, red pepper to the second dish and any pepper to the third dish, the total is $ 10 + 100 + 2 = 112 $ .\n\nIn the third shop, Monocarp can only buy $ 1 $ red pepper package and $ 0 $ black pepper packages. Red pepper added to all dishes will sum up to $ 5 + 100 + 2 = 107 $ .\n\nIn the fourth shop, Monocarp can only buy an even total number of packages. Since $ n $ is odd, it's impossible to get exactly $ n $ packages. Thus, the answer is $ -1 $ .",
    "translation": "有 $n$ 盘菜，每盘菜要加入红辣椒或黑辣椒，其中第 $i$ 盘菜加入红辣椒会增加 $a_i$ 点美味值，黑辣椒增加 $b_i$ 点。（每盘菜都会且只会加入一份红辣椒或一份黑辣椒，且不能两种都加）\n\n现在有 $m$ 个商店，每个商店 $j$ 有无数包两种辣椒，一包红辣椒有 $x_j$ 份红辣椒，一包黑辣椒有 $y_j$ 份黑辣椒（每份辣椒只可以加入一盘菜），求对于每个商店，若**只从这个商店买辣椒**得到的最大美味值是多少（买到的辣椒**份数**必须正好等于 $n$，不能多也不能少，若无法实现则输出 $-1$）。"
}