{
    "description": "There are $ n $ houses numbered from $ 1 $ to $ n $ on a circle. For each $ 1 \\leq i \\leq n - 1 $ , house $ i $ and house $ i + 1 $ are neighbours; additionally, house $ n $ and house $ 1 $ are also neighbours.\n\nInitially, $ m $ of these $ n $ houses are infected by a deadly virus. Each morning, Cirno can choose a house which is uninfected and protect the house from being infected permanently.\n\nEvery day, the following things happen in order:\n\n- Cirno chooses an uninfected house, and protect it permanently.\n- All uninfected, unprotected houses which have at least one infected neighbor become infected.\n\nCirno wants to stop the virus from spreading. Find the minimum number of houses that will be infected in the end, if she optimally choose the houses to protect.\n\nNote that every day Cirno always chooses a house to protect before the virus spreads. Also, a protected house will not be infected forever.",
    "inputFormat": "The input consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. Description of test cases follows.\n\nThe first line of each test case consists of two positive integers $ n, m $ ( $ 5 \\leq n \\leq 10^9 $ , $ 1 \\leq m \\leq \\min(n, 10^5) $ ) — the number of houses on the circle, and the number of houses that are initially infected.\n\nThe second line of each test case consists of $ m $ distinct positive integers $ a_1, a_2, \\cdots , a_m $ ( $ 1 \\leq a_i \\leq n $ ) — the indices of the houses infected initially.\n\nIt is guaranteed that the sum of $ m $ over all test cases does not exceed $ 10^5 $ .",
    "outputFormat": "For each test case, output an integer on a separate line, which is the minimum number of infected houses in the end.",
    "samples": [
        [
            "8\n10 3\n3 6 8\n6 2\n2 5\n20 3\n3 7 12\n41 5\n1 11 21 31 41\n10 5\n2 4 6 8 10\n5 5\n3 2 5 4 1\n1000000000 1\n1\n1000000000 4\n1 1000000000 10 16",
            "7\n5\n11\n28\n9\n5\n2\n15"
        ]
    ],
    "hint": "In the first test case:\n\nAt the start of the first day, house $ 3 $ , $ 6 $ , $ 8 $ are infected. Choose house $ 2 $ to protect.\n\nAt the start of the second day, house $ 3 $ , $ 4 $ , $ 5 $ , $ 6 $ , $ 7 $ , $ 8 $ , $ 9 $ are infected. Choose house $ 10 $ to protect.\n\nAt the start of the third day, no more houses are infected.\n\nIn the second test case:\n\nAt the start of the first day, house $ 2 $ , $ 5 $ are infected. Choose house $ 1 $ to protect.\n\nAt the start of the second day, house $ 2 $ , $ 3 $ , $ 4 $ , $ 5 $ , $ 6 $ are infected. No more available houses can be protected.",
    "translation": "有 $n$ 个房子在环上排列。对所有 $1\\le i\\le n-1$，第 $i$ 个房子与第 $i+1$ 个房子相邻；特别地，第 $n$ 个房子与第 $1$ 个房子也相邻。\n\n一开始，这 $n$ 个房子中有 $m$ 个房子被病毒感染了。在之后的每天早上，Cirno 可以选择一个未被感染的房子并对其进行保护，被保护过的房子不会被病毒感染。\n\n在每一天，事件发生的顺序如下：\n\n- Cirno 选择一个未被感染的房子并对其进行保护，阻止病毒的传播。\n- 对所有未被感染病毒的房子，若其与至少一个被感染的房子相邻，则该房子会被染上病毒。\n\nCirno 想要阻止病毒的传播，若他采用最优策略去保护房子，请求出最终被感染房子数的最小值。\n\n注意：在每一天，Cirno 总是在病毒开始传播前进行保护操作。一个被保护过的房子不会被再次感染。"
}