{
    "description": "On an $ 8 \\times 8 $ grid, some horizontal rows have been painted red, and some vertical columns have been painted blue, in some order. The stripes are drawn sequentially, one after the other. When the stripe is drawn, it repaints all the cells through which it passes.\n\nDetermine which color was used last.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1742C/6f423ce4b1dd07561098c185bf230d882c12b3e9.png)The red stripe was painted after the blue one, so the answer is R.",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\leq t \\leq 4000 $ ) — the number of test cases. The description of test cases follows. There is an empty line before each test case.\n\nEach test case consists of $ 8 $ lines, each containing $ 8 $ characters. Each of these characters is either 'R', 'B', or '.', denoting a red square, a blue square, and an unpainted square, respectively.\n\nIt is guaranteed that the given field is obtained from a colorless one by drawing horizontal red rows and vertical blue columns.\n\nAt least one stripe is painted.",
    "outputFormat": "For each test case, output 'R' if a red stripe was painted last, and 'B' if a blue stripe was painted last (without quotes).",
    "samples": [
        [
            "4\n\n\n....B...\n....B...\n....B...\nRRRRRRRR\n....B...\n....B...\n....B...\n....B...\n\n\nRRRRRRRB\nB......B\nB......B\nB......B\nB......B\nB......B\nB......B\nRRRRRRRB\n\n\nRRRRRRBB\n.B.B..BB\nRRRRRRBB\n.B.B..BB\n.B.B..BB\nRRRRRRBB\n.B.B..BB\n.B.B..BB\n\n\n........\n........\n........\nRRRRRRRR\n........\n........\n........\n........",
            "R\nB\nB\nR"
        ]
    ],
    "hint": "The first test case is pictured in the statement.\n\nIn the second test case, the first blue column is painted first, then the first and last red rows, and finally the last blue column. Since a blue stripe is painted last, the answer is B.",
    "translation": "$8\\times8$ 的染色地图，初始是白色，给你染完色的地图，`.` 代表白色，`R` 代表红色，`B` 代表蓝色。\n\n其中染红色的策略必定是涂一行，染蓝色的策略必定是涂一列。颜色会覆盖。\n\n求最后涂的颜色是什么，`R`代表红，`B` 代表蓝。"
}