{
    "description": "You are given two strings $ a $ and $ b $ , consisting of lowercase Latin letters.\n\nA template $ t $ is string, consisting of lowercase Latin letters and asterisks (character '\\*'). A template is called asterisk-minor if the number of asterisks in it is less than or equal to the number of letters in it.\n\nA string $ s $ is said to be matching a template $ t $ if you can replace each asterisk in $ t $ with a string of lowercase Latin letters (possibly, an empty string) so that it becomes equal to $ s $ .\n\nFind an asterisk-minor template such that both $ a $ and $ b $ match it, or report that such a template doesn't exist. If there are multiple answers, print any of them.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of testcases.\n\nThe first line of each testcase contains a string $ a $ ( $ 1 \\le |a| \\le 50 $ , where $ |a| $ is the length of $ a $ ), consisting of lowercase Latin letters.\n\nThe second line contains a string $ b $ ( $ 1 \\le |b| \\le 50 $ ), consisting of lowercase Latin letters.",
    "outputFormat": "For each testcase, output \"NO\", if there doesn't exist an asterisk-minor template that both $ a $ and $ b $ match. Otherwise, print \"YES\" in the first line and the template in the second line. If there are multiple answers, print any of them.\n\nA template should consist only of lowercase Latin letters and asterisks (character '\\*'). The number of asterisks should be less than or equal to the number of letters.",
    "samples": [
        [
            "6\naaab\nzzzb\ncodeforces\natcoder\ncodeforces\ntokitlx\naaaa\naaaaaa\nabcd\nabcd\nc\nf",
            "YES\n*b\nYES\n*co*\nNO\nYES\na*a*a*a\nYES\nabcd\nNO"
        ]
    ],
    "hint": "In the first testcase, for a template \"\\*b\", you can replace the only asterisk with \"aaa\" to get \"aaab\" (which is equal to $ a $ ) or with \"zzz\" to get \"zzzb\" (which is equal to $ b $ ).\n\nIn the third testcase, a template \"\\*o\\*\" is not asterisk-minor, as it contains more asterisks than letters. There are no asterisk-minor templates that both $ a $ and $ b $ match.\n\nIn the fourth testcase, for a template \"a\\*a\\*a\\*a\", you can replace all asterisks with empty strings to get \"aaaa\" (which is equal to $ a $ ) or two of them with \"a\" and two of them with an empty string to get \"aaaaaa\" (which is equal to $ b $ ).\n\nIn the fifth testcase, there are no asterisks in a template \"abcd\", so only \"abcd\" can match it (which is coincidentally both $ a $ and $ b $ ).",
    "translation": "定义一个字符串的模板 $T$，其中仅包含小写字母和可以代替任意字符串（包括空字符串）的通配符 '\\*'。一个合法的模板需要满足 '\\*' 的数量小于等于小写字母的数量。\n\n有一个仅包含小写字母的字符串 $s$，如果我们可以选择出一个合法的模板 $T$，可以通过替换所有的 '\\*' 使其等于 $s$，则称字符串 $s$ 与模板 $T$ 匹配。\n\n现在有 $t$ $(1 \\le t \\le 10^4) $ 组询问，每次给出两个仅包含小写字母的字符串 $a,b$ $(1\\le|a|,|b|\\le 50)$，请给出一个合法的模板 $T$ 使其能同时匹配两个字符串，或输出无解 \"NO\"。"
}