{
    "description": "Vasya plays the Geometry Horse.\n\nThe game goal is to destroy geometric figures of the game world. A certain number of points is given for destroying each figure depending on the figure type and the current factor value.\n\nThere are $ n $ types of geometric figures. The number of figures of type $ k_{i} $ and figure cost $ c_{i} $ is known for each figure type. A player gets $ c_{i}·f $ points for destroying one figure of type $ i $ , where $ f $ is the current factor. The factor value can be an integer number from $ 1 $ to $ t+1 $ , inclusive. At the beginning of the game the factor value is equal to 1. The factor is set to $ i+1 $ after destruction of $ p_{i} $ $ (1<=i<=t) $ figures, so the $ (p_{i}+1) $ -th figure to be destroyed is considered with factor equal to $ i+1 $ .\n\nYour task is to determine the maximum number of points Vasya can get after he destroys all figures. Take into account that Vasya is so tough that he can destroy figures in any order chosen by him.",
    "inputFormat": "The first line contains the only integer number $ n $ $ (1<=n<=100) $ — the number of figure types.\n\nEach of the following $ n $ lines contains two integer numbers $ k_{i} $ and $ c_{i} $ $ (1<=k_{i}<=10^{9},0<=c_{i}<=1000) $ , separated with space — the number of figures of the $ i $ -th type and the cost of one $ i $ -type figure, correspondingly.\n\nThe next line contains the only integer number $ t $ $ (1<=t<=100) $ — the number that describe the factor's changes.\n\nThe next line contains $ t $ integer numbers $ p_{i} $ $ (1<=p_{1}&lt;p_{2}&lt;...&lt;p_{t}<=10^{12}) $ , separated with spaces.\n\nPlease, do not use the %lld specificator to read or write 64-bit integers in С++. It is preferred to use cin, cout streams or the %I64d specificator.",
    "outputFormat": "Print the only number — the maximum number of points Vasya can get.",
    "samples": [
        [
            "1\n5 10\n2\n3 6\n",
            "70"
        ],
        [
            "2\n3 8\n5 10\n1\n20\n",
            "74"
        ]
    ],
    "hint": "In the first example Vasya destroys three figures first and gets $ 3·1·10=30 $ points. Then the factor will become equal to $ 2 $ and after destroying the last two figures Vasya will get $ 2·2·10=40 $ points. As a result Vasya will get $ 70 $ points.\n\nIn the second example all $ 8 $ figures will be destroyed with factor $ 1 $ , so Vasya will get $ (3·8+5·10)·1=74 $ points.",
    "translation": "给定n种物品，每种物品有Ki个，价值为Ci，摧毁一个物品的贡献为Ci×f\n\nf为贡献因子，有一个长度为t的单调递增序列p，当前摧毁的物品若超过p[i]，则贡献因子f=i+1\n\n求最大贡献"
}