{
    "description": "The Smart Beaver from ABBYY has a lot of hobbies. One of them is constructing efficient hash tables. One of the most serious problems in hash tables is resolving collisions. The Beaver is interested in this problem very much and he decided to explore it in detail.\n\nWe assume that the hash table consists of $ h $ cells numbered from $ 0 $ to $ h-1 $ . Objects are added to and removed from it. Every object has its own unique identifier. In addition, every object has a corresponding hash value — an integer between $ 0 $ and $ h-1 $ , inclusive. When an object is added to the table, if the cell corresponding to the hash value of the object is free, then this object goes there. If the cell is already occupied by another object, there is a collision. When an object is deleted from the table, the cell which it occupied becomes empty.\n\nThe Smart Beaver has recently learned about the method of linear probing to resolve collisions. It is as follows. Let's say that the hash value for the added object equals $ t $ and cell $ t $ of the table is already occupied. Then we try to add this object to cell $ (t+m) mod h $ . If it is also occupied, then we try cell $ (t+2·m) mod h $ , then cell $ (t+3·m) mod h $ , and so on. Note that in some cases it's possible that the new object can not be added to the table. It is guaranteed that the input for this problem doesn't contain such situations.\n\nThe operation $ a mod b $ means that we take the remainder of the division of number $ a $ by number $ b $ .\n\nThis technique immediately seemed very inoptimal to the Beaver, and he decided to assess its inefficiency. So, you are given a sequence of operations, each of which is either an addition of an object to the table or a deletion of an object from the table. When adding a new object, a sequence of calls to the table is performed. Calls to occupied cells are called dummy. In other words, if the result of the algorithm described above is the object being added to cell $ (t+i·m) mod h $ $ (i>=0) $ , then exactly $ i $ dummy calls have been performed.\n\nYour task is to calculate the total number of dummy calls to the table for the given sequence of additions and deletions. When an object is deleted from the table, assume that no dummy calls are performed. The table is empty before performing the operations, that is, initially it doesn't contain any objects.",
    "inputFormat": "The first line of input contains three integers $ h $ , $ m $ and $ n $ ( $ 1<=m<h $ ), separated by spaces, where $ h $ is the size of the hash table, $ m $ is the number that is used to resolve collisions, $ n $ is the number of operations.\n\nThe following $ n $ lines contains the descriptions of the operations. Their execution order corresponds to the order in which they appear in the input file. Each operation is described by a single line. The operations are described as follows:\n\n- \"+ id hash\"This is the format of the operation that adds an object to the table. The first character is \"+\" (ASCII 43), followed by a single space, then the object identifier $ id $ $ (0<=id<=10^{9}) $ , then another space, and the hash value of the given object $ hash $ $ (0<=hash<h) $ . The object identifier and the hash value of this object are integers.\n- \"- id\"This is the format of the operation that deletes an object from the table. The first character is \"-\" (ASCII 45), followed by a single space, then the object identifier $ id $ $ (0<=id<=10^{9}) $ . The object identifier is an integer.\n\nIt is guaranteed that for all addition operations the value of $ id $ is unique. It is also guaranteed that the initial data is correct, that is, it's always possible to add an object to the hash table and there won't be any deletions of nonexisting objects.\n\nThe input limitations for getting 20 points are:\n\n- $ 1<=h<=5000 $\n- $ 1<=n<=5000 $\n\nThe input limitations for getting 50 points are:\n\n- $ 1<=h<=5·10^{4} $\n- $ 1<=n<=5·10^{4} $\n\nThe input limitations for getting 100 points are:\n\n- $ 1<=h<=2·10^{5} $\n- $ 1<=n<=2·10^{5} $",
    "outputFormat": "Print a single number — the total number of dummy calls to the hash table.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use cin, cout streams and the %I64d specifier.",
    "samples": [
        [
            "10 2 7\n+ 11 0\n+ 22 2\n+ 33 6\n+ 44 0\n+ 55 0\n- 22\n+ 66 0\n",
            "7\n"
        ],
        [
            "5 1 6\n+ 123 0\n+ 234 1\n+ 345 2\n- 234\n+ 456 0\n+ 567 0\n",
            "4\n"
        ]
    ],
    "hint": "",
    "translation": "长度为 $h$ 的哈希表，采用以下方式解决哈希冲突：将对象添加表中，依次尝试下标 $(t+m) \\bmod h$，$(t+2\\times m) \\bmod h$，$(t+3\\times m) \\bmod h$，……，$(t+i\\times m) \\bmod h\\space (i\\ge 0)$，直到将对象成功添加到表中。\n\n有 $n$ 次操作：\n\n- \"+ id hash\"，将对象标识符为 id 的对象添加到表中，对象的哈希值为 hash (0 <= hash < h)\n- \"- id\"，将编号为 id 的对象从哈希表中移除。\n\n对于所有的 + 操作，id 都是唯一的。保证所有数据是正确的，即始终可以将对象添加到哈希表中，并且不会删除任何不存在的对象。哈希表最初不包含任何对象。\n\n假定删除对象不会产生冲突，输出 n 次操作产生哈希冲突的总次数。"
}