{
    "description": "This is the easy version of this problem. The difference between easy and hard versions is the constraint on $ k $ and the time limit. Also, in this version of the problem, you only need to calculate the answer when $ n=k $ . You can make hacks only if both versions of the problem are solved.\n\nCirno is playing a war simulator game with $ n $ towers (numbered from $ 1 $ to $ n $ ) and $ n $ bots (numbered from $ 1 $ to $ n $ ). The $ i $ -th tower is initially occupied by the $ i $ -th bot for $ 1 \\le i \\le n $ .\n\nBefore the game, Cirno first chooses a permutation $ p = [p_1, p_2, \\ldots, p_n] $ of length $ n $ (A permutation of length $ n $ is an array of length $ n $ where each integer between $ 1 $ and $ n $ appears exactly once). After that, she can choose a sequence $ a = [a_1, a_2, \\ldots, a_n] $ ( $ 1 \\le a_i \\le n $ and $ a_i \\ne i $ for all $ 1 \\le i \\le n $ ).\n\nThe game has $ n $ rounds of attacks. In the $ i $ -th round, if the $ p_i $ -th bot is still in the game, it will begin its attack, and as the result the $ a_{p_i} $ -th tower becomes occupied by the $ p_i $ -th bot; the bot that previously occupied the $ a_{p_i} $ -th tower will no longer occupy it. If the $ p_i $ -th bot is not in the game, nothing will happen in this round.\n\nAfter each round, if a bot doesn't occupy any towers, it will be eliminated and leave the game. Please note that no tower can be occupied by more than one bot, but one bot can occupy more than one tower during the game.\n\nAt the end of the game, Cirno will record the result as a sequence $ b = [b_1, b_2, \\ldots, b_n] $ , where $ b_i $ is the number of the bot that occupies the $ i $ -th tower at the end of the game.\n\nHowever, as a mathematics master, she wants you to solve the following counting problem instead of playing games:\n\nCount the number of different pairs of sequences $ a $ and $ b $ that we can get from all possible choices of sequence $ a $ and permutation $ p $ .\n\nSince this number may be large, output it modulo $ M $ .",
    "inputFormat": "The only line contains two positive integers $ k $ and $ M $ ( $ 1\\le k\\le 5000 $ , $ 2\\le M\\le 10^9 $ ). It is guaranteed that $ 2^{18} $ is a divisor of $ M-1 $ and $ M $ is a prime number.\n\nYou need to calculate the answer for $ n=k $ .",
    "outputFormat": "Output a single integer — the number of different pairs of sequences for $ n=k $ modulo $ M $ .",
    "samples": [
        [
            "1 998244353",
            "0"
        ],
        [
            "2 998244353",
            "2"
        ],
        [
            "3 998244353",
            "24"
        ],
        [
            "8 998244353",
            "123391016"
        ]
    ],
    "hint": "For $ n=1 $ , no valid sequence $ a $ exists. We regard the answer as $ 0 $ .\n\nFor $ n=2 $ , there is only one possible array $ a $ : $ [2, 1] $ .\n\n- For array $ a $ is $ [2, 1] $ and permutation $ p $ is $ [1, 2] $ , the sequence $ b $ will be $ [1, 1] $ after all rounds have finished. The details for each rounds: \n  - In the first round, the first bot will begin its attack and successfully capture the tower $ 2 $ . After this round, the second bot will be eliminated and leave the game as all of its towers are occupied by other bots.\n  - In the second round, the second bot is not in the game.\n- For array $ a $ is $ [2, 1] $ and permutation $ p $ is $ [2, 1] $ , the sequence $ b $ will be $ [2, 2] $ after all rounds have finished. The details for each rounds: \n  - In the first round, the second bot will begin its attack and successfully capture the tower $ 1 $ . After this round, the first bot will be eliminated and leave the game as all of its towers are occupied by other bots.\n  - In the second round, the first bot is not in the game.\n\nSo the number of different pairs of sequences $ (a,b) $ is $ 2 $ ( $ [2, 1] $ , $ [1, 1] $ and $ [2, 1] $ , $ [2, 2] $ ) for $ n=2 $ .",
    "translation": "**本题是 H2 的简单版本，在该题当中你只需要回答 $\\bm{n=k}$ 时的答案，而另一版本问题你需要回答 $\\bm{n=1,2,\\dots,k}$ 时的答案。**\n\nCirno 在玩一款有 $n$ 个塔和 $n$ 个机器人的战争模拟游戏。一开始第 $i$ 个机器人占领了第 $i$ 个塔。\n\n在游戏开始之前，Cirno 可以选择一个长度为 $n$ 的**排列** $p_n$ 和长度为 $n$ 的正整数序列 $a_1,a_2,\\dots,a_n$。其中 $1\\leq a_i\\leq n$ 且 $a_i\\not =i$。\n\n游戏中有 $n$ 次攻击：第 $i$ 轮当中：\n- 如果机器人 $p_i$ 还在赛场，那么它会占领 $a_{p_i}$，这时原来占领 $a_{p_i}$ 的机器人不再占领 $a_{p_i}$。\n- 否则，不会发生任何事情。\n\n每轮游戏结束后，没有占领任何塔的机器人会退出游戏。\n\n游戏结束后 Cirno 会统计占领每一个塔 $i$ 的机器人编号 $b_i$。\n\n作为数学大师，你需要求所有数列对 $(a,b)$ 使得存在可能的 $p_i$ 使得经过上面游戏后统计到的结果为 $b$。\n\n答案对 $M$ 取模。$k\\leq 5000,2\\leq M\\leq 10^9$。保证 $M-1$ 是 $2^{18}$ 的倍数。"
}