{
    "description": "During a daily walk Alina noticed a long number written on the ground. Now Alina wants to find some positive number of same length without leading zeroes, such that the sum of these two numbers is a palindrome.\n\nRecall that a number is called a palindrome, if it reads the same right to left and left to right. For example, numbers $ 121, 66, 98989 $ are palindromes, and $ 103, 239, 1241 $ are not palindromes.\n\nAlina understands that a valid number always exist. Help her find one!",
    "inputFormat": "The first line of input data contains an integer $ t $ ( $ 1 \\leq t \\leq 100 $ ) — the number of test cases. Next, descriptions of $ t $ test cases follow.\n\nThe first line of each test case contains a single integer $ n $ ( $ 2 \\leq n \\leq 100\\,000 $ ) — the length of the number that is written on the ground.\n\nThe second line of contains the positive $ n $ -digit integer without leading zeroes — the number itself.\n\nIt is guaranteed that the sum of the values $ n $ over all test cases does not exceed $ 100\\,000 $ .",
    "outputFormat": "For each of $ t $ test cases print an answer — a positive $ n $ -digit integer without leading zeros, such that the sum of the input integer and this number is a palindrome.\n\nWe can show that at least one number satisfying the constraints exists. If there are multiple solutions, you can output any of them.",
    "samples": [
        [
            "3\n2\n99\n4\n1023\n3\n385",
            "32\n8646\n604"
        ]
    ],
    "hint": "In the first test case $ 99 + 32 = 131 $ is a palindrome. Note that another answer is $ 12 $ , because $ 99 + 12 = 111 $ is also a palindrome.\n\nIn the second test case $ 1023 + 8646 = 9669 $ .\n\nIn the third test case $ 385 + 604 = 989 $ .",
    "translation": "#### 题目大意\n\n每天散步时，艾琳娜都会注意到地上有一个很长的数字（一个 $n$ 位数）。现在艾琳娜想找一个不含前导 $0$ 的 $n$ 位数，使得这两个 $n$ 位数的和是一个回文数。\n\n数据保证一定有一个 $n$ 位数符合要求。如果有多个 $n$ 位数符合要求，任意输出其中的一个即可。\n\n（回文数：如果一个数字从右往左读和从左往右读得到的数相同，那么它就被称为回文数。例如，数字121、66、98989是回文数，103、239、1241不是回文数。）\n\n#### 输入格式\n\n第一行包含一个整数 $t$（$1 \\leq t \\leq 100$），表示数据组数。\n\n每组数据的第一行包含一个整数 $n$（$1 \\leq n \\leq 10^5$，且保证 $\\sum \\limits{n} \\leq 10^5$）,表示地上这个数字的长度为 $n$ 位。第二行包含一个 $n$ 位数，表示地上这个数字本身。\n\n#### 输出格式\n\n对于每组数据，输出一个 $n$ 位数，表示一个符合要求的 $n$ 位数。"
}