{
    "description": "Burenka and Tonya are playing an old Buryat game with a chip on a board of $ n \\times m $ cells.\n\nAt the beginning of the game, the chip is located in the lower left corner of the board. In one move, the player can move the chip to the right or up by any odd number of cells (but you cannot move the chip both to the right and up in one move). The one who cannot make a move loses.\n\nBurenka makes the first move, the players take turns. Burenka really wants to win the game, but she is too lazy to come up with a strategy, so you are invited to solve the difficult task of finding it. Name the winner of the game (it is believed that Burenka and Tonya are masters of playing with chips, so they always move in the optimal way).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1719A/a6c823a6eb354fdb9ffdf07a308c103419371a6a.png)Chip's starting cell is green, the only cell from which chip can't move is red. if the chip is in the yellow cell, then blue cells are all options to move the chip in one move.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. The following is a description of the input data sets.\n\nThe only line of each test case contains two integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 10^9 $ ) — the dimensions of the game board.",
    "outputFormat": "For each test case print a single line — the name of the winner of the game (\"Burenka\" or \"Tonya\").",
    "samples": [
        [
            "6\n1 1\n1 4\n5 6\n2 2\n6 3\n999999999 1000000000",
            "Tonya\nBurenka\nBurenka\nTonya\nBurenka\nBurenka"
        ]
    ],
    "hint": "In the first case, Burenka has no move, so Tonya wins.\n\nIn the second case, Burenka can move $ 3 $ cells to the right, after which Tony will not be able to make a move, which means that Burenka wins.\n\nIn the third case, Burenka can move $ 5 $ squares to the right. Then we can say that we have a game on a board of $ 1 \\times 5 $ cells, and Tonya is the first player. In such game the second player wins, so in the original one Burenka will win.",
    "translation": "有一个 $n$ 行 $m$ 列的方格矩阵，左下角的方格有一个棋子，这个棋子每次移动只能**向上或向右**移动**奇数**格。Burenka 和 Tonya 用这个棋子玩一个游戏：两人依次移动一次棋子，最后没法移动棋子的人就输了。Burenka 先手，给你 $n$ 和 $m$，问你谁最后会赢。我们假定他们都精通这个游戏，因此每一步走棋方式都是最优的。\n\n输入第一行一个整数 $t(1\\le t\\le10^4)$，表示 $t$ 组数据。接下来 $t$ 行每行两个整数 $n,m(1\\le n,m\\le10^9)$，含义如题面所述。\n\n对于每一组数据，输出一行一个字符串，表示游戏最后的赢家，即“Burenka”或“Tonya”。"
}