{
    "description": "A bracket sequence is a string containing only characters \"(\" and \")\". A regular bracket sequence (or, shortly, an RBS) is a bracket sequence that can be transformed into a correct arithmetic expression by inserting characters \"1\" and \"+\" between the original characters of the sequence. For example:\n\n- bracket sequences \"()()\" and \"(())\" are regular (the resulting expressions are: \"(1)+(1)\" and \"((1+1)+1)\");\n- bracket sequences \")(\", \"(\" and \")\" are not.\n\nThere was an RBS. Some brackets have been replaced with question marks. Is it true that there is a unique way to replace question marks with brackets, so that the resulting sequence is an RBS?",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 5 \\cdot 10^4 $ ) — the number of testcases.\n\nThe only line of each testcase contains an RBS with some brackets replaced with question marks. Each character is either '(', ')' or '?'. At least one RBS can be recovered from the given sequence.\n\nThe total length of the sequences over all testcases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each testcase, print \"YES\" if the way to replace question marks with brackets, so that the resulting sequence is an RBS, is unique. If there is more than one way, then print \"NO\".",
    "samples": [
        [
            "5\n(?))\n??????\n()\n??\n?(?)()?)",
            "YES\nNO\nYES\nYES\nNO"
        ]
    ],
    "hint": "In the first testcase, the only possible original RBS is \"(())\".\n\nIn the second testcase, there are multiple ways to recover an RBS.\n\nIn the third and the fourth testcases, the only possible original RBS is \"()\".\n\nIn the fifth testcase, the original RBS can be either \"((()()))\" or \"(())()()\".",
    "translation": "有个**合法括号序列**，部分字符被 `?` 替换了，问是否存在**唯一的一种**填 `?` 的方案，使得括号序列合法，即判断填 `?` 使得括号序列合法的方案数**是否等于1**。存在唯一方案输出 `YES`，方案不唯一输出 `NO`\n\n序列长度 $\\sum n\\le 2\\times 10^5$，测试点数 $T\\leq 5\\times 10^4$\n\n第一行输出测试点总数 $T$。\n\n之后每一行一个字符串 $s$ 表示替换掉部分字符后的**合法括号序列**。"
}