{
    "description": "This is the hard version of the problem. In this version, the constraints on $ h $ and $ w $ are higher.\n\nA house at the sea has $ h $ floors, all of the same height. The side of the house facing the sea has $ w $ windows at equal distances from each other on every floor. Thus, the windows are positioned in cells of a rectangular grid of size $ h \\times w $ .\n\nIn every window, the light can be turned either on or off, except for the given $ k $ (at most $ 2 $ ) windows. In these $ k $ windows the light can not be turned on, because it is broken.\n\nIn the dark, we can send a signal to a ship at sea using a configuration of lights turned on and off. However, the ship can not see the position of the lights with respect to the house. Thus, if one configuration can be turned into another using parallel transfer, these configurations are considered equal. Note that only parallel transfer is allowed, but neither rotations nor flips are. Moreover, a configuration without any light at all is not considered valid.\n\nFind how many different signals the ship can receive and print this number modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 100 $ ). The description of the test cases follows.\n\nThe first line of each test case contains three integers $ h $ , $ w $ , and $ k $ ( $ 1 \\le h, w \\le 200 $ ; $ 0 \\le k \\le \\min(h \\cdot w, 2) $ ) — the height of the house, the number of windows on each floor, and the number of windows with broken lights.\n\nIf $ k > 0 $ , each of the next $ k $ lines contains two integers $ r_i $ and $ c_i $ ( $ 1 \\le r_i \\le h $ ; $ 1 \\le c_i \\le w $ ) — the floor number and the window number with the broken light. The floors are numbered $ 1 $ to $ h $ from bottom to top, and the windows are numbered $ 1 $ to $ w $ from left to right. If $ k = 2 $ , then either $ r_1 \\ne r_2 $ or $ c_1 \\ne c_2 $ .\n\nIt is guaranteed that the sum of $ h \\cdot w $ over all test cases does not exceed $ 40\\,000 $ .",
    "outputFormat": "For each test case, print a single integer — the number of signals the ship can receive, modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "10\n1 3 0\n2 2 0\n3 2 0\n4 5 0\n12 7 0\n1 1 1\n1 1\n1 3 1\n1 2\n3 4 1\n3 4\n2 3 2\n1 1\n2 1\n4 5 2\n2 3\n4 2",
            "4\n10\n44\n954368\n34903934\n0\n2\n1696\n10\n253144"
        ]
    ],
    "hint": "In the first test case, the ship can receive four different signals: all lights on; lights on in two neighboring windows; lights on in the leftmost and the rightmost windows; or light on in any single window."
}