{
    "description": "Tannhaus, the clockmaker in the town of Winden, makes mysterious clocks that measure time in $ h $ hours numbered from $ 0 $ to $ h-1 $ . One day, he decided to make a puzzle with these clocks.\n\nThe puzzle consists of an $ n \\times m $ grid of clocks, and each clock always displays some hour exactly (that is, it doesn't lie between two hours). In one move, he can choose any row or column and shift all clocks in that row or column one hour forward $ ^\\dagger $ .\n\nThe grid of clocks is called solvable if it is possible to make all the clocks display the same time.\n\nWhile building his puzzle, Tannhaus suddenly got worried that it might not be possible to make the grid solvable. Some cells of the grid have clocks already displaying a certain initial time, while the rest of the cells are empty.\n\nGiven the partially completed grid of clocks, find the number of ways $ ^\\ddagger $ to assign clocks in the empty cells so that the grid is solvable. The answer can be enormous, so compute it modulo $ 10^9 + 7 $ .\n\n $ ^\\dagger $ If a clock currently displays hour $ t $ and is shifted one hour forward, then the clock will instead display hour $ (t+1) \\bmod h $ .\n\n $ ^\\ddagger $ Two assignments are different if there exists some cell with a clock that displays a different time in both arrangements.",
    "inputFormat": "The first line of input contains $ t $ ( $ 1 \\leq t \\leq 5 \\cdot 10^4 $ ) — the number of test cases.\n\nThe first line of each test case consists of 3 integers $ n $ , $ m $ , and $ h $ ( $ 1 \\leq n, m \\leq 2 \\cdot 10^5 $ ; $ 1 \\leq h \\leq 10^9 $ ) — the number of rows in the grid, the number of columns in the grid, and the number of the hours in the day respectively.\n\nThe next $ n $ lines each contain $ m $ integers, describing the clock grid. The integer $ x $ ( $ -1 \\leq x < h $ ) in the $ i $ -th row and the $ j $ -th column represents the initial hour of the corresponding clock, or if $ x = -1 $ , an empty cell.\n\nIt is guaranteed that the sum of $ n \\cdot m $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, output the number of ways to assign clocks in the empty cells so that the grid is solvable. The answer can be huge, so output it modulo $ 10^9 + 7 $ .",
    "samples": [
        [
            "5\n2 3 4\n1 0 -1\n-1 -1 2\n2 2 10\n1 2\n3 5\n4 5 1024\n1 -1 -1 -1 -1\n-1 -1 -1 1000 -1\n-1 -1 -1 -1 69\n420 -1 -1 999 -1\n3 3 3\n-1 -1 1\n2 -1 1\n2 -1 2\n3 3 3\n1 -1 2\n-1 0 -1\n-1 1 0",
            "4\n0\n73741817\n0\n1"
        ]
    ],
    "hint": "For the first sample, this is a possible configuration for the clocks:\n\n| 1 | 0 | 3 |\n| :-----------: | :-----------: | :-----------: |\n| 0 | 3 | 2 |\n\nThis is solvable since we can:\n\n1. Move the middle column forward one hour.\n2. Move the third column forward one hour.\n3. Move the third column forward one hour.\n4. Move the second row forward one hour.\n\n After that all the clocks show one hour.For the second test case, it can be shown that there are no possible solvable clock configurations.",
    "translation": "Feyn 是一个钟表匠，他出了一个谜题：\n\n谜题包含一个放了 $n\\times m$ 个钟的矩阵，矩阵里的每个钟都恰好指向某一时刻。注意在 Feyn 的世界里钟是以 $h$ 个小时为进制的。Feyn 每次可以给矩阵的某一行或某一列中的钟拨向下一时刻。这个矩阵有些位置放好了钟，有些还没放好钟，请你计算有多少种不同的方案数使得填满矩阵后 Feyn 能按规则把所有钟拨向相同时刻。答案对 $10^9+7$ 取模。多组数据。\n\n如果两个矩阵中某个钟初始指向的时刻不同，则认为他们是不同的方案。\n\n(translated by 342873)"
}