{
    "description": "Monocarp is playing a video game. In the game, he controls a spaceship and has to destroy an enemy spaceship.\n\nMonocarp has two lasers installed on his spaceship. Both lasers $ 1 $ and $ 2 $ have two values:\n\n- $ p_i $ — the power of the laser;\n- $ t_i $ — the reload time of the laser.\n\nWhen a laser is fully charged, Monocarp can either shoot it or wait for the other laser to charge and shoot both of them at the same time.\n\nAn enemy spaceship has $ h $ durability and $ s $ shield capacity. When Monocarp shoots an enemy spaceship, it receives $ (P - s) $ damage (i. e. $ (P - s) $ gets subtracted from its durability), where $ P $ is the total power of the lasers that Monocarp shoots (i. e. $ p_i $ if he only shoots laser $ i $ and $ p_1 + p_2 $ if he shoots both lasers at the same time). An enemy spaceship is considered destroyed when its durability becomes $ 0 $ or lower.\n\nInitially, both lasers are zero charged.\n\nWhat's the lowest amount of time it can take Monocarp to destroy an enemy spaceship?",
    "inputFormat": "The first line contains two integers $ p_1 $ and $ t_1 $ ( $ 2 \\le p_1 \\le 5000 $ ; $ 1 \\le t_1 \\le 10^{12} $ ) — the power and the reload time of the first laser.\n\nThe second line contains two integers $ p_2 $ and $ t_2 $ ( $ 2 \\le p_2 \\le 5000 $ ; $ 1 \\le t_2 \\le 10^{12} $ ) — the power and the reload time of the second laser.\n\nThe third line contains two integers $ h $ and $ s $ ( $ 1 \\le h \\le 5000 $ ; $ 1 \\le s < \\min(p_1, p_2) $ ) — the durability and the shield capacity of an enemy spaceship. Note that the last constraint implies that Monocarp will always be able to destroy an enemy spaceship.",
    "outputFormat": "Print a single integer — the lowest amount of time it can take Monocarp to destroy an enemy spaceship.",
    "samples": [
        [
            "5 10\n4 9\n16 1",
            "20"
        ],
        [
            "10 1\n5000 100000\n25 9",
            "25"
        ]
    ],
    "hint": "In the first example, Monocarp waits for both lasers to charge, then shoots both lasers at $ 10 $ , they deal $ (5 + 4 - 1) = 8 $ damage. Then he waits again and shoots lasers at $ 20 $ , dealing $ 8 $ more damage.\n\nIn the second example, Monocarp doesn't wait for the second laser to charge. He just shoots the first laser $ 25 $ times, dealing $ (10 - 9) = 1 $ damage each time.",
    "translation": "有两艘飞船，第 $i$ 艘飞船（$i∈[1,2]$）的攻击力为 $p_i$，每一次攻击的充能时间为 $t_i$，一开始两艘飞船没有充能。\n\n现在要打败敌方飞船，敌方飞船的血量为 $h$，防御力为 $s$。对于一次攻击力为 $P$ 的攻击，敌方飞船的血量会减少 $(P-s)$。每一次攻击可以是一艘飞船单独攻击，也可以是两艘飞船同时攻击（当一艘飞船完成充能后，可以等待另一艘飞船充能，然后再一起攻击）。两艘飞船一起攻击的攻击力为 $p_1+p_2$。\n\n打败敌方飞船的条件是使得敌方飞船的血量小于等于 $0$。现在依次给出 $p_1,t_1,p_2,t_2,h,s$，求出最少需要多少时间能够打败敌方飞船。"
}