{
    "description": "Vasya plays the Plane of Tanks.\n\nTanks are described with the following attributes:\n\n- the number of hit points;\n- the interval between two gun shots (the time required to recharge the gun);\n- the probability that the gun shot will not pierce armor of the enemy tank;\n- the damage to the enemy's tank.\n\nThe gun damage is described with a segment $ [l,r] $ , where $ l $ and $ r $ are integer numbers. The potential gun damage $ x $ is chosen with equal probability among all integer numbers of the segment $ [l,r] $ . If the shot pierces the armor of an enemy's tank then the enemy loses $ x $ hit points. If the number of hit points becomes non-positive then the enemy tank is considered destroyed.\n\nIt is possible that the shot does not pierce the armor of a tank. In this case the number of hit points doesn't change. The probability that the armor will not be pierced is considered as the shooting tank attribute and does not depend on players' behavior.\n\nThe victory is near and there is only one enemy tank left. Vasya is ready for the battle — one more battle between the Good and the Evil is inevitable! Two enemies saw each other and each of them fired a shot at the same moment... The last battle has begun! Help Vasya to determine what is the probability that he will win the battle by destroying the enemy tank?\n\nIf both tanks are destroyed (after simultaneous shots), then Vasya is considered a winner. You can assume that each player fires a shot just after the gun recharge and each tank has infinite number of ammo.",
    "inputFormat": "The first line contains five integer numbers separated with spaces describing Vasya's tank: the number of hit points $ hp $ $ (10<=hp<=200) $ , the interval between two shots $ dt $ $ (1<=dt<=30) $ , gun damage segment $ l $ and $ r $ $ (10<=l<=r<=100) $ , the probability that the enemy's tank armor will not be pierced $ p $ $ (0<=p<=100) $ (percents).\n\nThe second line describes the tank of Vasya's enemy in the same format.",
    "outputFormat": "Print the only number with absolute or relative error no more than $ 10^{-4} $ — probability of Vasya's victory.",
    "samples": [
        [
            "100 3 50 50 0\n100 3 50 50 0\n",
            "1.000000\n"
        ],
        [
            "100 3 50 50 0\n100 2 48 50 0\n",
            "0.888889\n"
        ],
        [
            "100 3 50 50 0\n100 1 50 50 50\n",
            "0.500000\n"
        ]
    ],
    "hint": "In the first example both tanks are destroyed at once after the second shot. The probability of destroying the enemy tank is $ 1 $ .\n\nIn the second example Vasya's enemy tank fires the second shot before Vasya's tank, but has no time for the third shot. In order to destroy Vasya's tank it is necessary to fire two shots with damage 50. The probability of that event is ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF175D/f8855c9ef0f76eb617fd9868f6262da6f8abf0c3.png) = ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF175D/49e48ec82407863835e2852427cadd0be624ece6.png). Otherwise, Vasya wins.\n\nIn the third example Vasya's enemy tank fires three shots with probability of armor piercing $ 0.5 $ . In order to destroy Vasya's tank it is necessary that at least 2 of 3 shots pierce the armor of Vasya's tank. The probability of this event is $ 0.5 $ .",
    "translation": "坦克的属性：血量，攻击间隔，攻击下限与上限，攻击不命中的概率\n\n现有2个坦克，求第一个坦克获胜的概率（当2个坦克同时死亡时，算第一个坦克获胜）"
}