{
    "description": "You have been invited as a production process optimization specialist to some very large company. The company has $ n $ machines at its factory, standing one behind another in the production chain. Each machine can be described in one of the following two ways: $ (+,~a_i) $ or $ (*,~a_i) $ .\n\nIf a workpiece with the value $ x $ is supplied to the machine of kind $ (+,~a_i) $ , then the output workpiece has value $ x + a_i $ .\n\nIf a workpiece with the value $ x $ is supplied to the machine of kind $ (*,~a_i) $ , then the output workpiece has value $ x \\cdot a_i $ .\n\nThe whole production process is as follows. The workpiece with the value $ 1 $ is supplied to the first machine, then the workpiece obtained after the operation of the first machine is supplied to the second machine, then the workpiece obtained after the operation of the second machine is supplied to the third machine, and so on. The company is not doing very well, so now the value of the resulting product does not exceed $ 2 \\cdot 10^9 $ .\n\nThe directors of the company are not satisfied with the efficiency of the production process and have given you a budget of $ b $ coins to optimize it.\n\nTo optimize production you can change the order of machines in the chain. Namely, by spending $ p $ coins, you can take any machine of kind $ (+,~a_i) $ and move it to any place in the chain without changing the order of other machines. Also, by spending $ m $ coins, you can take any machine of kind $ (*,~a_i) $ and move it to any place in the chain.\n\nWhat is the maximum value of the resulting product that can be achieved if the total cost of movements that are made should not exceed $ b $ coins?",
    "inputFormat": "The first line contains four integers $ n $ , $ b $ , $ p $ and $ m $ ( $ 1 \\le n \\le 10^6 $ , $ 1 \\le b, p, m \\le 10^9 $ ) — the number of machine at the factory, your budget and costs of movements of both kinds of machines.\n\nEach of the following $ n $ lines contains description of a machine. The description begins with one of the following characters: \"+\" or \"\\*\", that denotes the kind of the machine. Then an integer $ a_i $ follows ( $ 1 \\le a_i \\le 2 \\cdot 10^9 $ ).\n\nIt's guaranteed that the current value of the resulting product does not exceed $ 2 \\cdot 10^9 $ .",
    "outputFormat": "Print one integer — the maximum value of the resulting product that can be achieved if the total cost of movements that are made does not exceed $ b $ coins.",
    "samples": [
        [
            "3 2 1 3\n* 2\n+ 1\n+ 1",
            "6"
        ],
        [
            "4 2 2 2\n* 2\n+ 1\n* 3\n+ 2",
            "21"
        ],
        [
            "8 2 1 1\n* 2\n+ 1\n* 4\n+ 1\n+ 1\n+ 1\n* 5\n+ 3",
            "240"
        ]
    ],
    "hint": "In the first example our budget is too low to move machine $ (*,~2) $ , but we can move both machines $ (+,~1) $ to the beginning of the chain. So the final chain will be $ (+,~1) $ $ (+,~1) $ $ (*,~2) $ . If the workpiece with the value $ 1 $ is supplied to the first machine, its value will be changed in the following way: $ 1, 2, 3, 6 $ .\n\nIn the second example we can move only one machine. Let's move machine $ (+,~2) $ to the beginning of the chain. The final chain will be $ (+,~2) $ $ (*,~2) $ $ (+,~1) $ $ (*,~3) $ . The value of the workpiece will be changed in the following way: $ 1, 3, 6, 7, 21 $ .\n\nIn the third example we can place machine $ (*,~4) $ before the machine $ (*,~5) $ , and move machine $ (+,~3) $ to the beginning of the chain. The final chain will be $ (+,~3) $ $ (*,~2) $ $ (+,~1) $ $ (+,~1) $ $ (+,~1) $ $ (+,~1) $ $ (*,~4) $ $ (*,~5) $ . The value of the workpiece will be changed in the following way: $ 1, 4, 8, 9, 10, 11, 12, 48, 240 $ .",
    "translation": "给定一个操作序列，每一个操作形如 $(+,a_i)$ 或 $(*,a_i)$ 。当前有一个变量 $x$，起始时 $x=1$，然后按操作序列的顺序进行操作。  \n当进行一次 $(+,a_i)$ 操作以后 $x$ 变为 $x+a_i$。  \n当进行一次 $(*,a_i)$ 操作以后 $x$ 变为 $x \\cdot a_i$。\n\n现在你手中有 $b$ 块钱，你可以花费 $p$ 块钱将一个加法操作移动到操作序列的任意位置，也可以花费 $m$ 块钱将一个乘法操作移到操作序列任意位置。\n\n请问经过操作以后所能得到的 $x$ 的最大值。\n\n保证初始操作序列所得结果不会超过 $2\\times 10^9$。"
}