{
    "description": "Pak Chanek is visiting a kingdom that earned a nickname \"Kingdom of Criticism\" because of how often its residents criticise each aspect of the kingdom. One aspect that is often criticised is the heights of the buildings. The kingdom has $ N $ buildings. Initially, building $ i $ has a height of $ A_i $ units.\n\nAt any point in time, the residents can give a new criticism, namely they currently do not like buildings with heights between $ l $ and $ r $ units inclusive for some two integers $ l $ and $ r $ . It is known that $ r-l $ is always odd.\n\nIn $ 1 $ minute, the kingdom's construction team can increase or decrease the height of any building by $ 1 $ unit as long as the height still becomes a positive number. Each time they receive the current criticism from the residents, the kingdom's construction team makes it so that there are no buildings with heights between $ l $ and $ r $ units inclusive in the minimum time possible. It can be obtained that there is only one way to do this.\n\nNote that the construction team only cares about the current criticism from the residents. All previous criticisms are forgotten.\n\nThere will be $ Q $ queries that you must solve. Each query is one of the three following possibilities:\n\n- 1 k w: The kingdom's construction team changes the height of building $ k $ to be $ w $ units ( $ 1 \\leq k \\leq N $ , $ 1 \\leq w \\leq 10^9 $ ).\n- 2 k: The kingdom's construction team wants you to find the height of building $ k $ ( $ 1 \\leq k \\leq N $ ).\n- 3 l r: The residents currently do not like buildings with heights between $ l $ and $ r $ units inclusive ( $ 2 \\leq l \\leq r \\leq 10^9-1 $ , $ r-l $ is odd).\n\nNote that each change in height still persists to the next queries.",
    "inputFormat": "The first line contains a single integer $ N $ ( $ 1 \\leq N \\leq 4 \\cdot 10^5 $ ) — the number buildings in the kingdom.\n\nThe second line contains $ N $ integers $ A_1, A_2, \\ldots, A_N $ ( $ 1 \\leq A_i \\leq 10^9 $ ) — the initial heights of the buildings.\n\nThe next line contains a single integer $ Q $ ( $ 1 \\leq Q \\leq 4 \\cdot 10^5 $ ) — the number of queries.\n\nThe $ j $ -th of the next $ Q $ lines contains the $ j $ -th query as described. There is at least one query of type $ 2 $ .",
    "outputFormat": "For each query of type $ 2 $ , output a line containing an integer representing the height of the building asked.",
    "samples": [
        [
            "5\n2 6 5 6 2\n9\n1 5 10\n2 5\n1 1 3\n3 3 6\n3 8 9\n1 2 9\n2 3\n2 2\n2 4",
            "10\n7\n9\n7"
        ]
    ],
    "hint": "After the $ 1 $ -st query, the height of each building is $ 2, 6, 5, 6, 10 $ .\n\nAfter the $ 3 $ -rd query, the height of each building is $ 3, 6, 5, 6, 10 $ .\n\nAfter the $ 4 $ -th query, the height of each building is $ 2, 7, 7, 7, 10 $ .\n\nAfter the $ 5 $ -th query, the height of each building is $ 2, 7, 7, 7, 10 $ .\n\nAfter the $ 6 $ -th query, the height of each building is $ 2, 9, 7, 7, 10 $ .",
    "translation": "你正在写一道小清新数据结构题，突然 |x| 进来了，于是你假装在打 galgame:\n\n你需要维护一个长度为 $n$ 的序列，支持以下三个操作：\n\n1. `1 k w`：单点修改。\n2. `2 k`：单点查询。\n1. `3 l r`：对整个区间中值 $\\in[l,r]$ 的，将其修改为 $l-1$ 与 $r+1$ 中离他更近的那一个。保证 $r-l$ 为奇数。\n\n注：如果后面的操作与前面的矛盾，不管前面的。\n\n数据范围：$1\\leq n,q\\leq 4\\times 10^5$。\n\ntranslated by |x|"
}