{
    "description": "You are given a square grid with $ n $ rows and $ n $ columns, where each cell has a non-negative integer written in it. There is a chip initially placed at the top left cell (the cell with coordinates $ (1, 1) $ ). You need to move the chip to the bottom right cell (the cell with coordinates $ (n, n) $ ).\n\nIn one step, you can move the chip to the neighboring cell, but:\n\n1. you can move only right or down. In other words, if the current cell is $ (x, y) $ , you can move either to $ (x, y + 1) $ or to $ (x + 1, y) $ . There are two special cases: \n  - if the chip is in the last column (cell $ (x, n) $ ) and you're moving right, you'll teleport to the first column (to the cell $ (x, 1) $ );\n  - if the chip is in the last row (cell $ (n, y) $ ) and you're moving down, you'll teleport to the first row (to the cell $ (1, y) $ ).\n2. you cannot visit the same cell twice. The starting cell is counted visited from the beginning (so you cannot enter it again), and you can't leave the finishing cell once you visit it.\n\nYour total score is counted as the sum of numbers in all cells you have visited. What is the maximum possible score you can achieve?",
    "inputFormat": "The first line contains the single integer $ n $ ( $ 2 \\le n \\le 200 $ ) — the number of rows and columns in the grid.\n\nNext $ n $ lines contains the description of each row of the grid. The $ i $ -th line contains $ n $ integers $ a_{i, 1}, a_{i, 2}, \\dots, a_{i, n} $ ( $ 0 \\le a_{i, j} \\le 10^9 $ ) where $ a_{i, j} $ is the number written in the cell $ (i, j) $ .",
    "outputFormat": "Print one integer — the maximum possible score you can achieve.",
    "samples": [
        [
            "2\n1 2\n3 4",
            "8"
        ],
        [
            "3\n10 10 10\n10 0 10\n10 10 10",
            "80"
        ]
    ],
    "hint": "",
    "translation": "给定一个 $n$ 行 $n$ 列的网格，每一格内都有一个非负整数。你的分数等于你走过格子的分数之和。你需要从 $(1,1)$ 移动到 $(n,n)$，并获取尽可能多的分数。你可以执行以下操作：\n\n+ 向下或向右走一格，前提是你走到的格子未被访问过；\n\n+ 当你走到终点后，你无法再次移动；\n\n+ 如果你在 $(x,n)$，当你执行向右的操作时，你会出现在 $(x,1)$；\n\n+ 如果你在 $(n,y)$，当你执行向下的操作时，你会出现在 $(1,y)$。\n\n输出你能获取到的最大分数。\n\n$2\\le n \\le 100$，每个方格内的分数 $a_{i,j}\\le 10^9$。"
}