{
    "description": "Vasya has been playing Plane of Tanks with his friends the whole year. Now it is time to divide the participants into several categories depending on their results.\n\nA player is given a non-negative integer number of points in each round of the Plane of Tanks. Vasya wrote results for each round of the last year. He has $ n $ records in total.\n\nIn order to determine a player's category consider the best result obtained by the player and the best results of other players. The player belongs to category:\n\n- \"noob\" — if more than $ 50% $ of players have better results;\n- \"random\" — if his result is not worse than the result that $ 50% $ of players have, but more than $ 20% $ of players have better results;\n- \"average\" — if his result is not worse than the result that $ 80% $ of players have, but more than $ 10% $ of players have better results;\n- \"hardcore\" — if his result is not worse than the result that $ 90% $ of players have, but more than $ 1% $ of players have better results;\n- \"pro\" — if his result is not worse than the result that $ 99% $ of players have.\n\nWhen the percentage is calculated the player himself is taken into account. That means that if two players played the game and the first one gained 100 points and the second one 1000 points, then the first player's result is not worse than the result that $ 50% $ of players have, and the second one is not worse than the result that $ 100% $ of players have.\n\nVasya gave you the last year Plane of Tanks results. Help Vasya determine each player's category.",
    "inputFormat": "The first line contains the only integer number $ n $ ( $ 1<=n<=1000 $ ) — a number of records with the players' results.\n\nEach of the next $ n $ lines contains a player's name and the amount of points, obtained by the player for the round, separated with a space. The name contains not less than 1 and no more than 10 characters. The name consists of lowercase Latin letters only. It is guaranteed that any two different players have different names. The amount of points, obtained by the player for the round, is a non-negative integer number and does not exceed 1000.",
    "outputFormat": "Print on the first line the number $ m $ — the number of players, who participated in one round at least.\n\nEach one of the next $ m $ lines should contain a player name and a category he belongs to, separated with space. Category can be one of the following: \"noob\", \"random\", \"average\", \"hardcore\" or \"pro\" (without quotes). The name of each player should be printed only once. Player names with respective categories can be printed in an arbitrary order.",
    "samples": [
        [
            "5\nvasya 100\nvasya 200\nartem 100\nkolya 200\nigor 250\n",
            "4\nartem noob\nigor pro\nkolya random\nvasya random\n"
        ],
        [
            "3\nvasya 200\nkolya 1000\nvasya 1000\n",
            "2\nkolya pro\nvasya pro\n"
        ]
    ],
    "hint": "In the first example the best result, obtained by artem is not worse than the result that $ 25% $ of players have (his own result), so he belongs to category \"noob\". vasya and kolya have best results not worse than the results that $ 75% $ players have (both of them and artem), so they belong to category \"random\". igor has best result not worse than the result that $ 100% $ of players have (all other players and himself), so he belongs to category \"pro\".\n\nIn the second example both players have the same amount of points, so they have results not worse than $ 100% $ players have, so they belong to category \"pro\".",
    "translation": "输入 $n$ 个人以及他们去年比赛的分数，然后要求编写程序，对其进行分类。其中，分类的规则如下：\n\n* 如果有多于 50% 的人比自己优秀自己就是 ```noob```；\n\n* 如果只有多于 20% 的人比自己优秀自己就是 ```random```；\n\n* 如果只有多于 10% 的人比自己优秀自己就是 ```average```；\n\n* 如果只有多于 1% 的人比自己优秀自己就是 ```hardcore```；\n\n* 如果没人比自己优秀自己就是 ```pro```。\n\n请输出每个玩家的类别。\n如果有一个人有多次成绩，取最高的一次的分数。"
}