{
    "description": "Monocarp is playing a MMORPG. There are two commonly used types of currency in this MMORPG — gold coins and silver coins. Monocarp wants to buy a new weapon for his character, and that weapon costs $ n $ silver coins. Unfortunately, right now, Monocarp has no coins at all.\n\nMonocarp can earn gold coins by completing quests in the game. Each quest yields exactly one gold coin. Monocarp can also exchange coins via the in-game trading system. Monocarp has spent days analyzing the in-game economy; he came to the following conclusion: it is possible to sell one gold coin for $ a $ silver coins (i. e. Monocarp can lose one gold coin to gain $ a $ silver coins), or buy one gold coin for $ b $ silver coins (i. e. Monocarp can lose $ b $ silver coins to gain one gold coin).\n\nNow Monocarp wants to calculate the minimum number of quests that he has to complete in order to have at least $ n $ silver coins after some abuse of the in-game economy. Note that Monocarp can perform exchanges of both types (selling and buying gold coins for silver coins) any number of times.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of one line containing three integers $ n $ , $ a $ and $ b $ ( $ 1 \\le n \\le 10^7 $ ; $ 1 \\le a, b \\le 50 $ ).",
    "outputFormat": "For each test case, print one integer — the minimum possible number of quests Monocarp has to complete.",
    "samples": [
        [
            "4\n100 25 30\n9999997 25 50\n52 50 48\n49 50 1",
            "4\n400000\n1\n1"
        ]
    ],
    "hint": "In the first test case of the example, Monocarp should complete $ 4 $ quests, and then sell $ 4 $ gold coins for $ 100 $ silver coins.\n\nIn the second test case, Monocarp should complete $ 400000 $ quests, and then sell $ 400000 $ gold coins for $ 10 $ million silver coins.\n\nIn the third test case, Monocarp should complete $ 1 $ quest, sell the gold coin for $ 50 $ silver coins, buy a gold coin for $ 48 $ silver coins, and then sell it again for $ 50 $ coins. So, he will have $ 52 $ silver coins.\n\nIn the fourth test case, Monocarp should complete $ 1 $ quest and then sell the gold coin he has obtained for $ 50 $ silver coins.",
    "translation": "你需要通过完成探险来争取至少 $n$ 个银币，遗憾的是，你手头上现在一个币也没有。\n\n完成一次探险后，你可以挣取 1 个金币。你可以随时且不限次数地进行以下交易：\n\n+ 使用 1 个金币，买入 $a$ 个银币；\n\n+ 使用 $b$ 个银币，买入 1 个金币。\n\n一共 $ t $ ( $ 1 \\le t \\le 10^4 $ ) 组数据。每组数据给出 $n,a,b$ ( $ 1 \\le n \\le 10^7 $ ; $ 1 \\le a, b \\le 50 $ )。输出你需要完成的最少探险次数。\n\n**有多测。**"
}