{
    "description": "You work in the quality control department of technical support for a large company. Your job is to make sure all client issues have been resolved.\n\nToday you need to check a copy of a dialog between a client and a technical support manager. According to the rules of work, each message of the client must be followed by one or several messages, which are the answer of a support manager. However, sometimes clients ask questions so quickly that some of the manager's answers to old questions appear after the client has asked some new questions.\n\nDue to the privacy policy, the full text of messages is not available to you, only the order of messages is visible, as well as the type of each message: a customer question or a response from the technical support manager. It is guaranteed that the dialog begins with the question of the client.\n\nYou have to determine, if this dialog may correspond to the rules of work described above, or the rules are certainly breached.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 500 $ ). Description of the test cases follows.\n\nThe first line of each test case contains one integer $ n $ ( $ 1 \\le n \\le 100 $ ) — the total number of messages in the dialog.\n\nThe second line of each test case consists of $ n $ characters \"Q\" and \"A\", describing types of messages in the dialog in chronological order. Character \"Q\" denotes the message with client question, and character \"A\" — the message with technical support manager answer. It is guaranteed that the first character in the line equals to \"Q\".",
    "outputFormat": "For each test case print \"Yes\" (without quotes) if dialog may correspond to the rules of work, or \"No\" (without quotes) otherwise.",
    "samples": [
        [
            "5\n4\nQQAA\n4\nQQAQ\n3\nQAA\n1\nQ\n14\nQAQQAQAAQQQAAA",
            "Yes\nNo\nYes\nNo\nYes"
        ]
    ],
    "hint": "In the first test case the two questions from the client are followed with two specialist's answers. So this dialog may correspond to the rules of work.\n\nIn the second test case one of the first two questions was not answered.\n\nIn the third test case the technical support manager sent two messaged as the answer to the only message of the client.",
    "translation": "### 题面翻译\n\n给定一个只包含大写字母 $\\texttt{Q}$ 和 $\\texttt{A}$ 的字符串，如果字符串里的每一个 $\\texttt{Q}$ 都能与**在其之后**的 $\\texttt{A}$ 一一对应地匹配，则输出字符串 $\\texttt{Yes}$，否则输出字符串 $\\texttt{No}$。注意，可以有 $\\texttt{A}$ 没有被匹配，但每个 $\\texttt{Q}$ 必须成功地匹配。\n\n### 输入格式\n\n输入一个只包含大写字母 $\\texttt{Q}$ 和 $\\texttt{A}$ 的字符串。\n\n### 输出格式\n\n输出字符串 $\\texttt{Yes}$ 或 $\\texttt{No}$。"
}