{
    "description": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737A/56ed0d2349bc5e2f6cd6bfba1e2e6140ddd296a6.png)Ela loves reading a lot, just like her new co-workers in DTL! On her first day after becoming an engineer in DTL, she is challenged by a co-worker to sort a heap of books into different compartments on the shelf. $ n $ books must be split into $ k $ compartments on the bookshelf ( $ n $ is divisible by $ k $ ). Each book is represented by a lowercase Latin letter from 'a' to 'y' inclusively, which is the beginning letter in the title of the book.\n\nEla must stack exactly $ \\frac{n}{k} $ books in each compartment. After the books are stacked, for each compartment indexed from $ 1 $ to $ k $ , she takes the minimum excluded (MEX) letter of the multiset of letters formed by letters representing all books in that compartment, then combines the resulting letters into a string. The first letter of the resulting string is the MEX letter of the multiset of letters formed by the first compartment, the second letter of the resulting string is the MEX letter of the multiset of letters formed by the second compartment, ... and so on. Please note, under the constraint of this problem, MEX letter can always be determined for any multiset found in this problem because 'z' is not used.\n\nWhat is the lexicographically greatest resulting string possible that Ela can create?\n\nA string $ a $ is lexicographically greater than a string $ b $ if and only if one of the following holds:\n\n- $ b $ is a prefix of $ a $ , but $ b \\ne a $ ;\n- in the first position where $ a $ and $ b $ differ, the string $ a $ has a letter that appears later in the alphabet than the corresponding letter in $ b $ .\n\nThe minimum excluded (MEX) letter of a multiset of letters is the letter that appears earliest in the alphabet and is not contained in the multiset. For example, if a multiset of letters contains $ 7 $ letters 'b', 'a', 'b', 'c', 'e', 'c', 'f' respectively, then the MEX letter of this compartment is 'd', because 'd' is not included in the multiset, and all letters comes before 'd' in the alphabet, namely 'a', 'b' and 'c', are included in the multiset.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 100 $ ). Description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ and $ k $ ( $ 1 \\le n \\le 200 $ ; $ 1 \\le k \\le n $ ). It is guaranteed that $ n $ is divisible by $ k $ .\n\nThe second line of each test case contains a string of $ n $ lowercase Latin letters from 'a' to 'y' inclusively. Each letter represents the starting letter of the title of a book in the initial heap.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 1000 $ .",
    "outputFormat": "For each test case, output a string of $ k $ letters which is the most optimal string that Ela can find.",
    "samples": [
        [
            "5\n12 3\ncabccadabaac\n12 6\ncabccadabaac\n12 12\ncabccadabaac\n25 1\nabcdefghijklmnopqrstuvwxy\n10 5\nbcdxedbcfg",
            "edb\nccbbba\nbbbbbaaaaaaa\nz\naaaaa"
        ]
    ],
    "hint": "In the first test case, the books can be divided into $ 3 $ compartments as below:\n\n- the first compartment contains the books with indices $ 1, 2, 3, 7 $ : $ multiset_1 = \\{ $ 'c', 'a', 'b', 'd' $ \\} $ $ \\rightarrow $ $ MEX(multiset_1) = $ 'e'\n- the second compartment contains the books with indices $ 4, 5, 6, 9 $ : $ multiset_2 = \\{ $ 'c', 'c', 'a', 'b' $ \\} $ $ \\rightarrow $ $ MEX(multiset_2) = $ 'd'\n- the third compartment contains the remaining books $ 8, 10, 11, 12 $ : $ multiset_3 = \\{ $ 'a', 'a', 'a', 'c' $ \\} $ $ \\rightarrow $ $ MEX(multiset_3) = $ 'b'\n\nTherefore, the answer is 'edb'. It can be proven that there is no way that Ela can arrange the books so that it results in a lexicographically greater string.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1737A/407eef03cdf4780f728db3b04f21cd023d792a00.png)",
    "translation": "将 $n$ 个字母（在 `a` 到 `y` 中）任意分为大小相等的 $k$ 份，将每一份的 MEX 字母组合成一个字符串，求能得到的字典序最大的字符串。\n\n一组字母的 MEX 字母是在字母表中出现最早的一个不存在于这组字母中的字母。\n\nby Wu_while"
}