{
    "description": "Hossam bought a new piece of ground with length $ n $ and width $ m $ , he divided it into an $ n \\cdot m $ grid, each cell being of size $ 1\\times1 $ .\n\nSince Hossam's name starts with the letter 'H', he decided to draw the capital letter 'H' by building walls of size $ 1\\times1 $ on some squares of the ground. Each square $ 1\\times1 $ on the ground is assigned a quality degree: perfect, medium, or bad.\n\nThe process of building walls to form up letter 'H' has the following constraints:\n\n- The letter must consist of one horizontal and two vertical lines.\n- The vertical lines must not be in the same or neighboring columns.\n- The vertical lines must start in the same row and end in the same row (and thus have the same length).\n- The horizontal line should connect the vertical lines, but must not cross them.\n- The horizontal line can be in any row between the vertical lines (not only in the middle), except the top and the bottom one. (With the horizontal line in the top row the letter looks like 'n', and in the bottom row like 'U'.)\n- It is forbidden to build walls in cells of bad quality.\n- You can use at most one square of medium quality.\n- You can use any number of squares of perfect quality.\n\nFind the maximum number of walls that can be used to draw the letter 'H'.\n\nCheck the note for more clarification.",
    "inputFormat": "The first line of the input contains two integer numbers $ n $ , $ m $ ( $ 1 \\le n, m \\le 400 $ ).\n\nThe next $ n $ lines of the input contain $ m $ characters each, describing the grid. The character '.' stands for a perfect square, the character 'm' stands for a medium square, and the character '\\#' stands for a bad square.",
    "outputFormat": "Print a single integer — the maximum number of walls that form a capital letter 'H'.\n\nIf it is not possible to draw any letter 'H', print $ 0 $ .",
    "samples": [
        [
            "2 3\n#m.\n.#.",
            "0"
        ],
        [
            "7 8\n...#.m..\n..m...m.\n.#..#.m#\n...m..m.\nm.......\n..#.m.mm\n......m.",
            "16"
        ]
    ],
    "hint": "In the first test case, we can't build the letter 'H'.\n\nFor the second test case, the figure below represents the grid and some of the valid letters 'H'. Perfect, medium, and bad squares are represented with white, yellow, and black colors respectively.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1771E/7ab52d112de710667f4c7cf4e814613751fe43eb.png)",
    "translation": "给定一个仅包含 `#`、`.`、`m` 的 $n$ 行 $m$ 列的矩阵，你需要找到一些能组成 `H` 的格子。这个 `H` 需满足以下要求：\n\n- 由两条竖直的线段和一条水平的线段组成。\n\n- 两条竖直的线段由同一行开始，在同一行结束，且不能在同一列或相邻列。\n\n- 水平的线段将两条竖直线段相连，但不在竖直线段的最后一行或第一行。注意水平的线段不能跨越竖直的线段。\n\n- 不得包含 `#`，最多包含一个 `m`。\n\n在满足条件的 `H` 中，找到所占格子数量最多的那个。输出其所占格子的数量。不存在输出 $0$。\n\n$1\\leq n,m \\leq 400$。\n\nTranslated by @[StayAlone](https://www.luogu.com.cn/user/409236)"
}