{
    "description": "You are given a non-degenerate triangle (a non-degenerate triangle is a triangle with positive area). The vertices of the triangle have coordinates $ (x_1, y_1) $ , $ (x_2, y_2) $ and $ (x_3, y_3) $ .\n\nYou want to draw a straight line to cut the triangle into two non-degenerate triangles. Furthermore, the line you draw should be either horizontal or vertical.\n\nCan you draw the line to meet all the constraints?\n\nHere are some suitable ways to draw the line:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1767A/eae3d7282c3158bdbed223cdc7230dcfb540b234.png)However, these ways to draw the line are not suitable (the first line cuts the triangle into a triangle and a quadrangle; the second line doesn't cut the triangle at all; the third line is neither horizontal nor vertical):\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1767A/bffea37399e8b2b37904bb00d4f9d390b630614c.png)",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of four lines. The first of them is empty. The $ i $ -th of the next three lines contains two integers $ x_i $ and $ y_i $ ( $ 1 \\le x_i, y_i \\le 10^8 $ ) — the coordinates of the $ i $ -th vertex of the triangle.\n\nAdditional constraint on the input: in each test case, the triangle formed by three vertices has positive area (i. e. it is non-degenerate).",
    "outputFormat": "For each test case, print YES if it is possible to cut the triangle according to the statement, or NO otherwise. You may print each letter in any case (YES, yes, Yes will all be recognized as positive answer, NO, no and nO will all be recognized as negative answer).",
    "samples": [
        [
            "4\n\n\n4 7\n6 8\n3 5\n\n\n4 5\n4 7\n6 8\n\n\n5 8\n1 8\n2 5\n\n\n3 6\n6 6\n6 3",
            "YES\nYES\nYES\nNO"
        ]
    ],
    "hint": "",
    "translation": "给定二维平面内一个面积不为零的三角形的三个顶点坐标 $(x_1,y_1),(x_2,y_2),(x_3,y_3)$。\n\n你要判断是否能画一条水平或竖直的线，把这个三角形划分为两个面积不为零的三角形。"
}