{
    "description": "Last year Bob earned by selling memory sticks. During each of $ n $ days of his work one of the two following events took place:\n\n- A customer came to Bob and asked to sell him a $ 2^{x} $ MB memory stick. If Bob had such a stick, he sold it and got $ 2^{x} $ berllars.\n- Bob won some programming competition and got a $ 2^{x} $ MB memory stick as a prize. Bob could choose whether to present this memory stick to one of his friends, or keep it.\n\nBob never kept more than one memory stick, as he feared to mix up their capacities, and deceive a customer unintentionally. It is also known that for each memory stick capacity there was at most one customer, who wanted to buy that memory stick. Now, knowing all the customers' demands and all the prizes won at programming competitions during the last $ n $ days, Bob wants to know, how much money he could have earned, if he had acted optimally.",
    "inputFormat": "The first input line contains number $ n $ ( $ 1<=n<=5000 $ ) — amount of Bob's working days. The following $ n $ lines contain the description of the days. Line sell x stands for a day when a customer came to Bob to buy a $ 2^{x} $ MB memory stick ( $ 0<=x<=2000 $ ). It's guaranteed that for each $ x $ there is not more than one line sell x. Line win x stands for a day when Bob won a $ 2^{x} $ MB memory stick ( $ 0<=x<=2000 $ ).",
    "outputFormat": "Output the maximum possible earnings for Bob in berllars, that he would have had if he had known all the events beforehand. Don't forget, please, that Bob can't keep more than one memory stick at a time.",
    "samples": [
        [
            "7\nwin 10\nwin 5\nwin 3\nsell 5\nsell 3\nwin 10\nsell 10\n",
            "1056\n"
        ],
        [
            "3\nwin 5\nsell 6\nsell 4\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "题目描述:你能够按顺序获得一些容量为 2^x MB的硬盘，你可以保留它，但是你在卖掉当前这个之前是不能保留其他的硬盘的（卖掉这个硬盘的收益为2^x）。在已经知道什么时候会有人买什么类型的硬盘的前提下，问你能获得的最大收益是多少。\n输入:第一行一个数n，表示总共有n天,\n之后n行,每行一个字符串和一个整数x,\n若开头为\"win\"，则表示该天获得了一个容量为2^xMB的硬盘；\n若开头为\"sell\"，则表示该天有顾客来买容量为2^xMB的硬盘\n\n输出:一个数w，表示最大收益\n\n1<=n<=5000\n0<=x<=2000\n\ntranslated by 稀神探女"
}