{
    "description": "You are given a binary string $ s $ consisting of only characters 0 and/or 1.\n\nYou can perform several operations on this string (possibly zero). There are two types of operations:\n\n- choose two consecutive elements and swap them. In order to perform this operation, you pay $ 10^{12} $ coins;\n- choose any element from the string and remove it. In order to perform this operation, you pay $ 10^{12}+1 $ coins.\n\nYour task is to calculate the minimum number of coins required to sort the string $ s $ in non-decreasing order (i. e. transform $ s $ so that $ s_1 \\le s_2 \\le \\dots \\le s_m $ , where $ m $ is the length of the string after applying all operations). An empty string is also considered sorted in non-decreasing order.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nThe only line of each test case contains the string $ s $ ( $ 1 \\le |s| \\le 3 \\cdot 10^5 $ ), consisting of only characters 0 and/or 1.\n\nThe sum of lengths of all given strings doesn't exceed $ 3 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a single integer — the minimum number of coins required to sort the string $ s $ in non-decreasing order.",
    "samples": [
        [
            "6\n100\n0\n0101\n00101101\n1001101\n11111",
            "1000000000001\n0\n1000000000000\n2000000000001\n2000000000002\n0"
        ]
    ],
    "hint": "In the first example, you have to remove the $ 1 $ -st element, so the string becomes equal to 00.\n\nIn the second example, the string is already sorted.\n\nIn the third example, you have to swap the $ 2 $ -nd and the $ 3 $ -rd elements, so the string becomes equal to 0011.\n\nIn the fourth example, you have to swap the $ 3 $ -rd and the $ 4 $ -th elements, so the string becomes equal to 00011101, and then remove the $ 7 $ -th element, so the string becomes equal to 0001111.\n\nIn the fifth example, you have to remove the $ 1 $ -st element, so the string becomes equal to 001101, and then remove the $ 5 $ -th element, so the string becomes equal to 00111.\n\nIn the sixth example, the string is already sorted.",
    "translation": "给定一个 $01$ 字符串，你可以进行以下两种操作：\n\n1. 交换相邻的两个元素，此操作需要花费 $10^{12}$ 个金币。\n\n2. 删除某个元素，此操作需要花费 $10^{12}+1$ 个金币。\n\n你要通过以上两种操作使这个字符串单调不降，求最小金币花费。"
}