{
    "description": "Consider a tournament with $ n $ participants. The rating of the $ i $ -th participant is $ a_i $ .\n\nThe tournament will be organized as follows. First of all, organizers will assign each participant an index from $ 1 $ to $ n $ . All indices will be unique. Let $ p_i $ be the participant who gets the index $ i $ .\n\nThen, $ n-1 $ games will be held. In the first game, participants $ p_1 $ and $ p_2 $ will play. In the second game, the winner of the first game will play against $ p_3 $ . In the third game, the winner of the second game will play against $ p_4 $ , and so on — in the last game, the winner of the $ (n-2) $ -th game will play against $ p_n $ .\n\nMonocarp wants to predict the results of all $ n-1 $ games (of course, he will do the prediction only after the indices of the participants are assigned). He knows for sure that, when two participants with ratings $ x $ and $ y $ play, and $ |x - y| > k $ , the participant with the higher rating wins. But if $ |x - y| \\le k $ , any of the two participants may win.\n\nAmong all $ n! $ ways to assign the indices to participants, calculate the number of ways to do this so that Monocarp can predict the results of all $ n-1 $ games. Since the answer can be large, print it modulo $ 998244353 $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 2 \\le n \\le 10^6 $ ; $ 0 \\le k \\le 10^9 $ ).\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 0 \\le a_1 \\le a_2 \\le \\dots \\le a_n \\le 10^9 $ ).",
    "outputFormat": "Print one integer — the number of ways to assign the indices to the participants so that Monocarp can predict the results of all $ n-1 $ games.",
    "samples": [
        [
            "4 3\n7 12 17 21",
            "24"
        ],
        [
            "3 7\n4 9 28",
            "4"
        ],
        [
            "4 1\n1 2 3 4",
            "0"
        ],
        [
            "4 1\n1 2 2 4",
            "12"
        ],
        [
            "16 30\n8 12 15 27 39 44 49 50 51 53 58 58 59 67 68 100",
            "527461297"
        ]
    ],
    "hint": "In the first example, a match with any pair of players can be predicted by Monocarp, so all $ 24 $ ways to assign indices should be counted.\n\nIn the second example, suitable ways are $ [1, 3, 2] $ , $ [2, 3, 1] $ , $ [3, 1, 2 $ \\] and $ [3, 2, 1] $ .",
    "translation": "有 $n$ 个人，每个人有能力值 $a_i$。规定一个比赛顺序 $p_1,p_2,\\dots,p_n$，第一场 $p_1,p_2$ 比，胜者与 $p_3$ 比，胜者与 $p_4$ 比……，共进行 $n-1$ 轮比赛决出最终胜者。若能力值为 $x,y$ 的两个人比赛，若 $|x-y|>k$ 则能力值高者胜；否则两人都有可能胜出。请计数比赛顺序的方案数，使得任意一次比赛都有唯一胜者。\n\ntranslated by cszyf"
}