{
    "description": "This is an interactive problem.\n\nThere are $ n $ distinct hidden points with real coordinates on a two-dimensional Euclidean plane. In one query, you can ask some line $ ax + by + c = 0 $ and get the projections of all $ n $ points to this line in some order. The given projections are not exact, please read the interaction section for more clarity.\n\nUsing the minimum number of queries, guess all $ n $ points and output them in some order. Here minimality means the minimum number of queries required to solve any possible test case with $ n $ points.\n\nThe hidden points are fixed in advance and do not change throughout the interaction. In other words, the interactor is not adaptive.\n\nA projection of point $ A $ to line $ ax + by + c = 0 $ is the point on the line closest to $ A $ .",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 50 $ ) — the number of test cases.\n\nThe description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 2 \\leq n \\leq 25 $ ) — the number of hidden points.\n\nFor each test case, it is guaranteed that for any pair of hidden points, their $ x $ coordinates differ by at least $ 1 $ . Analogously, $ y $ coordinates of any pair also differ by at least $ 1 $ .\n\nCoordinates $ x $ and $ y $ of all hidden points do not exceed $ 100 $ by absolute value.",
    "outputFormat": "To query a line $ ax + by + c = 0 $ you should print \"? a b c\" where all a, b and c are real numbers up to $ 100 $ by absolute value. For less precision issues numbers $ a $ and $ b $ must satisfy the condition $ |a| + |b| \\geq 0.1 $ , where $ |a| $ is the absolute value of $ a $ .\n\nAs an answer to the query you will get $ n $ points in the form \"x\\_1 y\\_1 ... x\\_n y\\_n\", where points $ (x_i, y_i) $ are projections to the line $ ax + by + c = 0 $ . It is guaranteed that each printed point is no more than $ 10^{-4} $ away from the real projection point. Every coordinate is printed with at most 9 decimal places.\n\nSee the interaction example for more clarity.\n\nIf you ask too many queries, you will get Wrong answer.\n\nTo output an answer you should print \"! x\\_1 y\\_1 ... x\\_n y\\_n\", where $ (x_i, y_i) $ are coordinates of the hidden points. You could output the hidden points in any order. The answer would be considered correct if each of the printed points is no more than $ 10^{-3} $ away from the corresponding hidden point. Printing the answer doesn't count as a query.\n\nAfter printing a query or the answer, do not forget to output end of line and flush the output. Otherwise, you will get Idleness limit exceeded. To do this, use:\n\n- fflush(stdout) or cout.flush() in C++;\n- System.out.flush() in Java;\n- flush(output) in Pascal;\n- stdout.flush() in Python;\n- see the documentation for other languages\n\nHacks\n\nTo make a hack, use the following test format.\n\nIn the first line output a single integer $ t $ ( $ 1 \\leq t \\leq 50 $ ) — the number of test cases.\n\nThe description of the test cases follows.\n\nIn the first line of each test case output a single integer $ n $ ( $ 2 \\leq n \\leq 25 $ ). In the next $ n $ lines output two rational numbers each. The numbers in line $ i $ should correspond to $ x_i $ and $ y_i $ respectively. Printed points must comply with all constraints from the input section.",
    "samples": [
        [
            "1\n2\n\n1 1 2.5 1\n\n1.500000001 1.500000000 2 2",
            "? 0 1 -1\n\n? 0.2 -0.2 0\n\n! 1 3 2.5 0.500000001"
        ]
    ],
    "hint": "In the sample the hidden points are $ (1, 3) $ and $ (2.5, 0.5) $\n\nA picture, which describes the first query:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1826F/4744008dabc55375d10584d55a7e6bc54d18767a.png)\n\nA picture, which describes the second query:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1826F/3b1f3044b777eff15fd4aeeb3484196dbbaecf67.png)",
    "translation": "这是一道交互题。\n\n在平面直角坐标系中有 $n(1 \\leq n \\leq 25)$ 个隐藏的不同的点，你可以进行若干次询问，每次询问一条直线 $ax+by+c=0$，交互库会返回这 $n$ 个点在这条直线上的投影（以任意顺序），你需要用不超过 $M$ 次询问，求出这 $n$ 个点的坐标，其中 $M$ 表示能解决所有可能的有 $n$ 个隐藏点的问题所需要的最少询问次数。\n\n保证这 $n$ 个点两两之间横坐标之差与纵坐标之差均不小于 $1$，而且坐标绝对值不超过 $100$。交互库给出的投影坐标与实际坐标误差不超过 $10^{-4}$，并且小数点后最多有 $9$ 位。\n\n你需要保证询问时给出的 $a, b, c$ 满足 $|a| + |b| \\geq 0.1$ 且 $|a|, |b|, |c| \\leq 100$，最后给出的答案与实际答案误差不超过 $10^{-3}$。\n\n有 $t(1 \\leq t \\leq 50)$ 组测试数据。"
}