{
    "description": "In a debate club with $ n $ members, including yourself (member $ 1 $ ), there are $ k $ opinions to be discussed in sequence. During each discussion, members express their agreement or disagreement with the opinion. Let's define $ Y $ as the number of members who agree and $ N $ as the number of members who disagree. After each discussion, members leave the club based on the following criteria:\n\n- If more members agree than disagree ( $ Y > N $ ), all members who disagreed leave the club.\n- If more members disagree than agree ( $ Y < N $ ), all members who agreed leave the club.\n- If there is a tie ( $ Y = N $ ), all members leave the club.\n\nAs the club president, your goal is to stay in the club and maximize the number of members remaining after the meeting. You have access to each member's stance on all $ k $ opinions before the meeting starts, and you can expel any number of members (excluding yourself) before the meeting begins.\n\nDetermine the maximum number of members, including yourself, who can remain in the club after the meeting. You don't need to provide the specific expulsion strategy but only the maximum number of members that can stay. Ensure that you remain in the club after the meeting as well.",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1000 $ ). Description of the test cases follows.\n\nThe first line of each test case contains two positive integers $ n $ and $ k $ ( $ 1 \\le n, k \\le 100 $ ) — the number of members and the number of discussions.\n\nThe $ i $ -th of the following $ n $ lines contains a string $ t_i $ of length $ k $ . The $ j $ -th character in the string $ t_i $ indicates whether the $ i $ -th member agrees or disagrees with the $ j $ -th opinion if they are present during that discussion. A \"+\" symbol means the member agrees, while a \"-\" symbol means the member disagrees.\n\nIt is guaranteed that the sum of $ n \\cdot k $ over all test cases does not exceed $ 5 \\cdot 10^4 $ .",
    "outputFormat": "For each test case, output the maximum number of members, including yourself, who can remain in the club after the meeting.",
    "samples": [
        [
            "5\n2 2\n++\n+-\n1 3\n+-+\n4 1\n+\n-\n-\n+\n5 4\n++++\n+--+\n++-+\n+-++\n++++\n4 2\n++\n--\n--\n-+",
            "1\n1\n2\n2\n1"
        ]
    ],
    "hint": "For convenience, we will analyze the examples based on who actually attended the meeting (i. e. was not expelled) rather than who was expelled.\n\nExample 1:\n\nOnly the first member could have attended the meeting, otherwise both members would have left after the second opinion is discussed.\n\nExample 2:\n\nThere is only a single member that attends the meeting and stays till the end.\n\nExample 3:\n\nThe club has $ 4 $ members and only one opinion will be discussed during the meeting. Let's analyze the possible outcomes based on the participants in the meeting:\n\n- If only the first member attends, they'll be the only one left after the meeting.\n- If the first member attends with the second or third member, they will be a tie in the discussion, making them both leave.\n- If the first member attends with the second and third members, the first member will be in the minority and will leave after the discussion, which contradicts the statement.\n- If the first and fourth members attend, they will agree during the discussion and both remain till the end.\n- If the first, second, and fourth members attend, the second member will be in the minority during the discussion, and only the first and fourth members will remain at the end. The same happens if the second member is replaced by the third member.\n- If all four members attend, there will be a tie during the discussion, making everyone leave.\n\nThe maximum number of members remaining after the meeting is $ 2 $ .\n\nExample 4:\n\nThe club has $ 5 $ members and $ 4 $ opinions will be discussed during the meeting.\n\nOne way to achieve the maximum number of members is if only the first, third, and fifth members attend the meeting. In this case, they all agree during the first two discussions, after which the third member is in the minority during the third discussion. Then, the first and fifth members agree in the last discussion, and those two members stay till the end of the meeting.\n\nExample 5:\n\nThe club has $ 4 $ members and $ 2 $ opinions will be discussed.\n\nIf the first three members attend the meeting, the first member will be in the minority during the first discussion and will leave the club. After that, the second and third members will both disagree with the second opinion, and they both will stay till the end of the meeting. In this way, there will be 2 members left after the meeting, but it is an invalid outcome, as it forces the first member to leave. Therefore, the maximum number of 1 member is achieved if only the first member attends the meeting.",
    "translation": "## 题目描述\n\n在一个有着 $n$ 个成员的辩论俱乐部中（你是其中的第 $1$ 个成员），有 $k$ 个辩题即将被按顺序辩论。在每次辩论中，俱乐部的成员们会表达他们同意或者不同意这个辩题。我们假设有 $Y$ 个成员同意， $N$ 个成员不同意。在每次辩论之后，成员们会按照以下的规则退出俱乐部：\n\n+ 如果同意的成员多于不同意的成员（ $Y > N$ ），那么所有不同意的成员会退出俱乐部；\n+ 如果不同意的成员多于同意的成员（ $Y < N$ ），那么所有同意的成员会退出俱乐部；\n+ 如果平局（ $Y = N$ ），那么所有成员都会退出俱乐部。\n\n作为俱乐部的部长，你的目标是让自己待在俱乐部里，并且使辩论之后俱乐部里剩余的成员的数量最大化。在辩论开始之前，你已经得知了每一位成员对于各个辩题的意见，并且你可以在辩论开始之前开除任意数量的成员（不包括你自己）。\n\n你需要求出辩论之后俱乐部里最多能剩下多少人（包括你自己）。你不需要输出开除的方案。请确保最后你自己还在俱乐部里。\n\n## 输入格式\n每个测试点包含多组数据。输入数据的第一行包含数据组数 $t$ ( $1 \\le t \\le 100$ )。第二行及以下是测试数据。\n\n每组测试数据的第一行包含两个正整数 $n$ 和 $k$ ( $1 \\le n,k \\le 100$ )，分别表示俱乐部内成员的个数和辩题的个数。\n\n接下来的 $n$ 行中，第 $i$ 行包含一个长度为 $k$ 的字符串 $t_i$ 。字符串 $t_i$ 中的第 $j$ 个字符（ $+$  或 $-$ ）描述了第 $i$ 位成员对第 $j$ 个辩题的意见（如果这时候他/她还在俱乐部中）。“ $+$ ”代表同意，而“ $-$ ”代表不同意。\n\n输入保证各组数据的 $n \\sdot k$ 之和不超过 $5 \\sdot 10^4$ 。\n\n## 输出格式\n对于每组数据，输出辩论之后俱乐部里最多能剩下的人数。"
}