{
    "description": "There is a beautiful alley with trees in front of a shopping mall. Unfortunately, it has to go to make space for the parking lot.\n\nThe trees on the alley all grow in a single line. There are $ n $ spots for trees, index $ 0 $ is the shopping mall, index $ n+1 $ is the road and indices from $ 1 $ to $ n $ are the spots for trees. Some of them are taken — there grow trees of the same height $ k $ . No more than one tree grows in each spot.\n\nWhen you chop down a tree in the spot $ x $ , you can make it fall either left or right. If it falls to the left, it takes up spots from $ x-k $ to $ x $ , inclusive. If it falls to the right, it takes up spots from $ x $ to $ x+k $ , inclusive.\n\nLet $ m $ trees on the alley grow in some spots $ x_1, x_2, \\dots, x_m $ . Let an alley be called unfortunate if all $ m $ trees can be chopped down in such a way that:\n\n- no tree falls on the shopping mall or the road;\n- each spot is taken up by no more than one fallen tree.\n\nCalculate the number of different unfortunate alleys with $ m $ trees of height $ k $ . Two alleys are considered different if there is a spot $ y $ such that a tree grows in $ y $ on the first alley and doesn't grow in $ y $ on the second alley.\n\nOutput the number modulo $ 998\\,244\\,353 $ .",
    "inputFormat": "The only line contains three integers $ n, m $ and $ k $ ( $ 1 \\le m, k \\le n \\le 3 \\cdot 10^5 $ ) — the number of spots for the trees, the number of trees and the height of each tree.",
    "outputFormat": "Print a single integer — the number of different unfortunate alleys with $ m $ trees of height $ k $ , modulo $ 998\\,244\\,353 $ .",
    "samples": [
        [
            "6 1 4",
            "4"
        ],
        [
            "5 2 2",
            "0"
        ],
        [
            "6 2 2",
            "4"
        ],
        [
            "15 3 2",
            "311"
        ]
    ],
    "hint": "",
    "translation": "在 $[1, n]$ 的区间里放 $m$ 棵树，每棵树的高度为 $k$。求有多少种放置树的方法，满足：\n\n1. 每个树都在整点上，且每个点最多只能放一棵树。\n2. 存在一种砍倒树的方案，使得树倒了之后不会越界，也不会有某个点被超过一棵树占据。你可以自由选择树向左倒（也就是占据区间 $[x - k, x]$）或者向右倒（也就是占据区间 $[x, x + k]$）。\n\n$1\\leq n, m, k\\leq 3\\times 10 ^ 5$。"
}