{
    "description": "You are given a string $ s $ consisting of the characters 0, 1 and/or ?. Let's call it a pattern.\n\nLet's say that the binary string (a string where each character is either 0 or 1) matches the pattern if you can replace each character ? with 0 or 1 (for each character, the choice is independent) so that the strings become equal. For example, 0010 matches ?01?, but 010 doesn't match 1??, ??, or ????.\n\nLet's define the cost of the binary string as the minimum number of operations of the form \"reverse an arbitrary contiguous substring of the string\" required to sort the string in non-descending order.\n\nYou have to find a binary string with the minimum possible cost among those that match the given pattern. If there are multiple answers, print any of them.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 3 \\cdot 10^4 $ ) — the number of test cases.\n\nThe first and only line of each test case contains the string $ s $ ( $ 1 \\le |s| \\le 3 \\cdot 10^5 $ ) consisting of characters 0, 1, and/or ?.\n\nThe sum of the string lengths over all test cases does not exceed $ 3 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print a binary string with the minimum possible cost among those that match the given pattern. If there are multiple answers, print any of them.",
    "samples": [
        [
            "4\n??01?\n10100\n1??10?\n0?1?10?10",
            "00011\n10100\n111101\n011110010"
        ]
    ],
    "hint": "In the first test case of the example, the cost of the resulting string is $ 0 $ .\n\nIn the second test case, the cost of the resulting string is $ 2 $ : we can reverse the substring from the $ 1 $ -st character to the $ 5 $ -th character, and we obtain the string 00101. Then we reverse the substring from the $ 3 $ -rd to the $ 4 $ -th character, and we obtain the string 00011, which is sorted in non-descending order.",
    "translation": "给定由 `1` `0` `?` 所组成的字符串，你需要用 `0` 或 `1` 替换 `?`。\n\n我们将 $s_{l},s_{l+1},\\dots,s_r$ 反转成为一次操作。\n\n你要使通过“反转”操作使原字符串成为升序的操作次数尽可能的小。\n\n问最终构造出的字符串，有多解输出其一。"
}