{
    "description": "Initially you have a single pile with $ n $ gold nuggets. In an operation you can do the following:\n\n- Take any pile and split it into two piles, so that one of the resulting piles has exactly twice as many gold nuggets as the other. (All piles should have an integer number of nuggets.)\n\n  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1829D/7d414b1e40fe9f84ac7152f64f7f831c73043b5b.png)One possible move is to take a pile of size $ 6 $ and split it into piles of sizes $ 2 $ and $ 4 $ , which is valid since $ 4 $ is twice as large as $ 2 $ .\n\n Can you make a pile with exactly $ m $ gold nuggets using zero or more operations?",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases.\n\nThe only line of each test case contains two integers $ n $ and $ m $ ( $ 1 \\leq n, m \\leq 10^7 $ ) — the starting and target pile sizes, respectively.",
    "outputFormat": "For each test case, output \"YES\" if you can make a pile of size exactly $ m $ , and \"NO\" otherwise.\n\nYou can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).",
    "samples": [
        [
            "11\n6 4\n9 4\n4 2\n18 27\n27 4\n27 2\n27 10\n1 1\n3 1\n5 1\n746001 2984004",
            "YES\nYES\nNO\nNO\nYES\nYES\nNO\nYES\nYES\nNO\nNO"
        ]
    ],
    "hint": "The first test case is pictured in the statement. We can make a pile of size $ 4 $ .\n\nIn the second test case, we can perform the following operations: $ \\{\\color{red}{9}\\} \\to \\{\\color{red}{6},3\\} \\to \\{4,2,3\\} $ . The pile that is split apart is colored red before each operation.\n\nIn the third test case, we can't perform a single operation.\n\nIn the fourth test case, we can't end up with a larger pile than we started with.",
    "translation": "# 题意简述\n本题有 $t$ 组数据。对于每组数据，你都会得到 $n$ 个金币。\n\n现在，你可以对这 $n$ 个金币进行分堆。每次分堆只能分成两堆，并且需要使分堆后的一堆恰好是另一堆的**两倍**。同时，分成的两堆都必须有**整数**个金币。\n\n请你判断：在经过多次或不经过分堆后能否有任意一堆的金币数为 $m$。如果可以，请输出 `YES` 或其它任意的大小写形式；否则，请输出 `NO` 或其它任意的大小写形式。\n\n## 样例解释\n对于样例一中的第一组数据，我们可以采用如图的形式分堆：\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1829D/7d414b1e40fe9f84ac7152f64f7f831c73043b5b.png)\n\n对于第二组数据，它可以采用如下的分堆方式：\n\n$$\n\\{\\color{red}9\\color{black}\\}\\to\\{\\color{red}6\\color{black},3\\}\\to\\{4,2,3\\}\n$$\n\n在每次分堆前，被分开的堆被标为红色。\n\n对于第三组数据，我们无法进行分堆操作。\n\n对于第四组数据，我们不能把少的金币变成更多的一堆。\n\nTranslate by @[tianbiandeshenghuo11](/user/752485)"
}