{
    "description": "The Great Mushroom King descended to the dwarves, but not everyone managed to see him. Only the few chosen ones could see the King.\n\nWe know that only $ LCM(k^{2^l}+1,k^{2^{l+1}}+1,...,k^{2^r}+1) $ dwarves can see the Great Mushroom King. Numbers $ k $ , $ l $ , $ r $ are chosen by the Great Mushroom King himself in some complicated manner which is unclear to common dwarves.\n\nThe dwarven historians decided to document all visits of the Great Mushroom King. For each visit the dwarven historians know three integers $ k_{i} $ , $ l_{i} $ , $ r_{i} $ , chosen by the Great Mushroom King for this visit. They also know a prime number $ p_{i} $ . Help them to count the remainder of dividing the number of dwarves who can see the King, by number $ p_{i} $ , for each visit.",
    "inputFormat": "The first line contains the single integer $ t $ $ (1<=t<=10^{5}) $ — the number of the King's visits.\n\nEach of the following $ t $ input lines contains four space-separated integers $ k_{i} $ , $ l_{i} $ , $ r_{i} $ and $ p_{i} $ $ (1<=k_{i}<=10^{6} $ ; $ 0<=l_{i}<=r_{i}<=10^{18}; 2<=p_{i}<=10^{9}) $ — the numbers, chosen by the Great Mushroom King and the prime module, correspondingly.\n\nIt is guaranteed that for all visits number $ p_{i} $ is prime.\n\nPlease do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "outputFormat": "For each visit print the answer on a single line — the remainder of dividing the number of the dwarves who can see the King this time, by number $ p_{i} $ . Print the answers for the visits in the order, in which the visits are described in the input.",
    "samples": [
        [
            "2\n3 1 10 2\n5 0 4 3\n",
            "0\n0\n"
        ]
    ],
    "hint": "We consider that $ LCM(a_{1},a_{2},...,a_{n}) $ represents the least common multiple of numbers $ a_{1} $ , $ a_{2} $ , $ ... $ , $ a_{n} $ .\n\nWe consider that $ x^{0}=1 $ , for any $ x $ .",
    "translation": "- $T(T\\leq 10^5)$ 组询问，每组询问给出四个数 $k,l,r,p$，其中 $p$ 为质数。\n- 求 $\\operatorname{lcm}(k^{2^{l}}+1,k^{2^{l+1}}+1,k^{2^{l+2}}+1,\\dots,k^{2^{r}}+1)\\bmod p$ 的值。\n- $k\\leq 10^6,l,r\\leq 10^{18},p\\leq 10^9$。\n\n感谢 @tzc_wk 提供的翻译。"
}