{
    "description": "Vlad decided to compose a melody on his guitar. Let's represent the melody as a sequence of notes corresponding to the characters 'a', 'b', 'c', 'd', 'e', 'f', and 'g'.\n\nHowever, Vlad is not very experienced in playing the guitar and can only record exactly two notes at a time. Vlad wants to obtain the melody $ s $ , and to do this, he can merge the recorded melodies together. In this case, the last sound of the first melody must match the first sound of the second melody.\n\nFor example, if Vlad recorded the melodies \"ab\" and \"ba\", he can merge them together and obtain the melody \"aba\", and then merge the result with \"ab\" to get \"abab\".\n\nHelp Vlad determine the minimum number of melodies consisting of two notes that he needs to record in order to obtain the melody $ s $ .",
    "inputFormat": "The first line of input contains an integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nFollowing that are the descriptions of the test cases.\n\nThe first line of each test case contains an integer $ n $ ( $ 2 \\le n \\le 50 $ ) — the length of the melody $ s $ .\n\nThe second line of each test case contains a string $ s $ of length $ n $ , consisting of characters 'a', 'b', 'c', 'd', 'e', 'f', 'g'.",
    "outputFormat": "Output $ t $ integers, each representing the answer for the corresponding test case. As the answer output minimum number of melodies consisting of two notes that Vlad needs to record.",
    "samples": [
        [
            "5\n4\nabab\n7\nabacaba\n6\naaaaaa\n7\nabcdefg\n5\nbabdd",
            "2\n4\n1\n6\n4"
        ]
    ],
    "hint": "In the first sample, you need to record the melodies \"ab\" and \"ba\", as described in the problem statement.\n\nIn the second sample, you need to record the melodies \"ab\", \"ba\", \"ac\", and \"ca\".\n\nIn the third sample, the only necessary melody is \"aa\".",
    "translation": "Vlad 想要背会一段仅由 `abcdefg` 中音符构成的旋律 $s$。\n\n但是 Vlad 只能一次性记住两个音符，如果想要记住一段旋律，就需要把记住的音符或旋律拼起来。拼起来要求前一段旋律的最后一个音符和后一段的第一个音符相同。\n\n比如，假如 Vlad 已经记住了 `ab` 和 `ba`，那么他可以把这两段旋律拼起来，变成 `aba`（注意拼的过程中会删去那个相同的字符），然后再和 `ab` 拼成 `abab`。\n\nVlad 想问你，至少需要多少个这样的两个音符的旋律，才能使他记住旋律 $s$？\n\n- 多测，数据组数不超过 $10^4$。\n- $2\\le|S|\\le50$。"
}