{
    "description": "The boy Vitya loves to listen to music very much. He knows that $ n $ albums are due to be released this Friday, $ i $ -th of which contains $ k_i $ tracks. Of course, Vitya has already listened to all the tracks, and knows that in the $ i $ -th album, the coolness of the $ j $ -th track is equal to $ a_{i,j} $ .Vitya has a friend Masha, whom he really wants to invite to the festival, where his favorite bands perform. However, in order for a friend to agree, she must first evaluate the released novelties. Vitya knows that if Masha listens to a track that was cooler than all the previous ones, she will get 1 unit of impression. Unfortunately, albums can only be listened to in their entirety, without changing the songs in them in places.\n\nHelp Vitya find such an order of albums so that Masha's impression turns out to be as much as possible, and she definitely went to the festival with him.",
    "inputFormat": "Each test consists of multiple test cases. The first line contains a single integer t ( $ 1 \\le t \\le 200\\,000 $ ) — the number of test cases. The description of test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\le n \\le 200\\,000 $ ) — number of albums.\n\nThe album descriptions follow. Each album description consists of two lines:\n\nThe first line contains a single integer $ k_i $ ( $ 1 \\le k_i \\le 200\\,000 $ ) — the number of tracks in the $ i $ th album.\n\nThe following line contains $ k_i $ integers $ a_{i, 1},\\ a_{i, 2},\\ a_{i, 3},\\ \\ldots,\\ a_{i, k_i} $ ( $ 1 \\le a_{i,j} \\le 200\\,000 $ ) — the coolness of the tracks in the $ i $ album.\n\nDenote for $ \\sum k_i $ the sum of all $ k_i $ . It is guaranteed that $ \\sum k_i \\le 200\\,000 $ .",
    "outputFormat": "For each test case print the singular number — the maximum impression that Masha can get.",
    "samples": [
        [
            "2\n4\n5\n4 9 4 6 8\n1\n7\n2\n8 6\n1\n1\n4\n2\n3 4\n2\n1 8\n2\n2 8\n2\n7 9",
            "4\n4"
        ]
    ],
    "hint": "In the first test example, the optimal order is listening to the 4th, 2nd, 3rd and 1st albums.\n\nIn this case, Masha will listen to the tracks in the following order: 1; 7; 8, 6; 4, 9, 4, 6, 8 and will receive 4 units of impression.\n\nIn the second test example, you must first listen to the 1st, then the 4th, and in any order the 2nd and 3rd. In this case, Masha will get the maximum impression, and for every song in the 1st and 4th albums and nothing for the 2nd and 3rd.",
    "translation": "- 给你 $n$ 个数列，你要把它们按任意顺序首尾连接起来。\n- 最大化连接后能成为严格前缀最大值的数的数量。\n- 多组测试数据，$1 \\leq n \\leq 2 \\times 10^5$。"
}