{
    "description": "You are given a checkerboard of size $ 201 \\times 201 $ , i. e. it has $ 201 $ rows and $ 201 $ columns. The rows of this checkerboard are numbered from $ -100 $ to $ 100 $ from bottom to top. The columns of this checkerboard are numbered from $ -100 $ to $ 100 $ from left to right. The notation $ (r, c) $ denotes the cell located in the $ r $ -th row and the $ c $ -th column.\n\nThere is a king piece at position $ (0, 0) $ and it wants to get to position $ (a, b) $ as soon as possible. In this problem our king is lame. Each second, the king makes exactly one of the following five moves.\n\n- Skip move. King's position remains unchanged.\n- Go up. If the current position of the king is $ (r, c) $ he goes to position $ (r + 1, c) $ .\n- Go down. Position changes from $ (r, c) $ to $ (r - 1, c) $ .\n- Go right. Position changes from $ (r, c) $ to $ (r, c + 1) $ .\n- Go left. Position changes from $ (r, c) $ to $ (r, c - 1) $ .\n\n King is not allowed to make moves that put him outside of the board. The important consequence of the king being lame is that he is not allowed to make the same move during two consecutive seconds. For example, if the king goes right, the next second he can only skip, go up, down, or left.What is the minimum number of seconds the lame king needs to reach position $ (a, b) $ ?",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. Then follow $ t $ lines containing one test case description each.\n\nEach test case consists of two integers $ a $ and $ b $ ( $ -100 \\leq a, b \\leq 100 $ ) — the position of the cell that the king wants to reach. It is guaranteed that either $ a \\ne 0 $ or $ b \\ne 0 $ .",
    "outputFormat": "Print $ t $ integers. The $ i $ -th of these integers should be equal to the minimum number of seconds the lame king needs to get to the position he wants to reach in the $ i $ -th test case. The king always starts at position $ (0, 0) $ .",
    "samples": [
        [
            "5\n-4 1\n4 4\n0 -6\n-5 -4\n7 -8",
            "7\n8\n11\n9\n15"
        ]
    ],
    "hint": "One of the possible solutions for the first example is: go down, go right, go down, go right, go down, go left, go down.\n\nOne of the possible solutions for the second example is to alternate \"go right\" and \"go up\" moves $ 4 $ times each.\n\nOne of the possible solutions for the third example is to alternate \"go left\" and \"skip\" moves starting with \"go left\". Thus, \"go left\" will be used $ 6 $ times, and \"skip\" will be used $ 5 $ times.",
    "translation": "有一个 $201 \\times 201$ 的格子，下标 $-100 \\leq x,y \\leq 100$。$t(t \\leq 10^4)$ 组数据，每组数据给你 $x$ 和 $y$，问从 $(0,0)$ 走到 $(x,y)$ 至少需要几步（每次能向上，下，左，右是个方向走，但不能超过格子边界，并且连续两步的操作不能相同）。"
}