{
    "description": "At a geometry lesson Bob learnt that a triangle is called right-angled if it is nondegenerate and one of its angles is right. Bob decided to draw such a triangle immediately: on a sheet of paper he drew three points with integer coordinates, and joined them with segments of straight lines, then he showed the triangle to Peter. Peter said that Bob's triangle is not right-angled, but is almost right-angled: the triangle itself is not right-angled, but it is possible to move one of the points exactly by distance 1 so, that all the coordinates remain integer, and the triangle become right-angled. Bob asks you to help him and find out if Peter tricks him. By the given coordinates of the triangle you should find out if it is right-angled, almost right-angled, or neither of these.",
    "inputFormat": "The first input line contains 6 space-separated integers $ x_{1},y_{1},x_{2},y_{2},x_{3},y_{3} $ — coordinates of the triangle's vertices. All the coordinates are integer and don't exceed 100 in absolute value. It's guaranteed that the triangle is nondegenerate, i.e. its total area is not zero.",
    "outputFormat": "If the given triangle is right-angled, output RIGHT, if it is almost right-angled, output ALMOST, and if it is neither of these, output NEITHER.",
    "samples": [
        [
            "0 0 2 0 0 1\n",
            "RIGHT\n"
        ],
        [
            "2 3 4 5 6 6\n",
            "NEITHER\n"
        ],
        [
            "-1 0 2 0 0 1\n",
            "ALMOST\n"
        ]
    ],
    "hint": "",
    "translation": "定义一个三角形是直角三角形，当且仅当它的一个角是直角且没有退化为线段。\n\n定义一个三角形「几乎」是一个直角三角形，当且仅当将它的一个顶点移动恰好 $1$ 个单位长度后它是一个直角三角形。你需要保证移动后所有顶点都是整点。\n\n给出平面直角坐标系中中 $3$ 个整点的坐标。如果以这三个点为顶点的三角形是直角三角形，输出 `RIGHT`；否则，如果以这三个点为顶点的三角形「几乎」是一个直角三角形，输出 `ALMOST`；否则输出 `NEITHER`。\n\n输入中横纵坐标的绝对值均不超过 $100$。\n\nTranslated by @Ja50nY0un9 "
}