{
    "description": "You have a garland consisting of $ 4 $ colored light bulbs, the color of the $ i $ -th light bulb is $ s_i $ .\n\nInitially, all the light bulbs are turned off. Your task is to turn all the light bulbs on. You can perform the following operation any number of times: select a light bulb and switch its state (turn it on if it was off, and turn it off if it was on). The only restriction on the above operation is that you can apply the operation to a light bulb only if the previous operation was applied to a light bulb of a different color (the first operation can be applied to any light bulb).\n\nCalculate the minimum number of operations to turn all the light bulbs on, or report that this is impossible.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nThe single line of each test case contains $ s $ — a sequence of $ 4 $ characters, where each character is a decimal digit. The $ i $ -th character denotes the color of the $ i $ -th light bulb.",
    "outputFormat": "For each test case, print one integer — the minimum number of operations to turn all the light bulbs on. If it is impossible to turn all the bulbs on, print -1.",
    "samples": [
        [
            "3\n9546\n0000\n3313",
            "4\n-1\n6"
        ]
    ],
    "hint": "In the first example, all the colors are different, so you can just turn all the bulbs on in $ 4 $ operations.\n\nIn the second example, it is impossible to turn all the bulbs on, because after you switch one light bulb, it is impossible to turn the others on.\n\nIn the third example, you can proceed as follows: turn the first light bulb on, turn the third light bulb on, turn the fourth light bulb on, turn the third light bulb off, turn the second light bulb on, turn the third light bulb on.",
    "translation": "#### 题意\n\n有 $4$ 只灯泡，第 $i$ 只灯泡的颜色为 $s_i$ 。\n\n一开始，所有灯泡都是关着的，你需要把它们都打开。你可以进行数次操作，每次操作改变一个灯泡的状态，即打开原本关着的灯泡或关上原本亮着的灯泡。第一次操作可选择任何灯泡，此后每一次被操作的灯泡的颜色都不得与上次操作的灯泡颜色相同。现求最少需要的操作数，如果无法打开所有灯泡输出 $-1$ 。\n\n#### 输入\n\n输入有多组测试数据，第一行是数据组数 $T$ $(1\\le T \\le 10^4)$ ，此后每行每组数据都有 $4$ 个**不用空格隔开**的整数 $s_i$ $(0\\le s_i \\le 9)$ ，表示灯泡的颜色。\n\n#### 输出\n\n对于每组数据，如果不可能打开所有灯泡，输出 $-1$ ，否则输出打开所有灯泡最少需要的操作数目。"
}