{
    "description": "Little Sasha has two friends, whom he wants to please with gifts on the Eighth of March. To do this, he went to the largest shopping center in the city.There are $ n $ departments in the mall, each of which has exactly two stores. For convenience, we number the departments with integers from $ 1 $ to $ n $ . It is known that gifts in the first store of the $ i $ department cost $ a_i $ rubles, and in the second store of the $ i $ department — $ b_i $ rubles.\n\nEntering the mall, Sasha will visit each of the $ n $ departments of the mall, and in each department, he will enter exactly one store. When Sasha gets into the $ i $ -th department, he will perform exactly one of two actions:\n\n1. Buy a gift for the first friend, spending $ a_i $ rubles on it.\n2. Buy a gift for the second friend, spending $ b_i $ rubles on it.\n\nSasha is going to buy at least one gift for each friend. Moreover, he wants to pick up gifts in such a way that the price difference of the most expensive gifts bought for friends is as small as possible so that no one is offended.\n\nMore formally: let $ m_1 $ be the maximum price of a gift bought to the first friend, and $ m_2 $ be the maximum price of a gift bought to the second friend. Sasha wants to choose gifts in such a way as to minimize the value of $ \\lvert m_1 - m_2 \\rvert $ .",
    "inputFormat": "Each test contains multiple test cases. The first line contains the number of test cases $ t $ ( $ 1 \\le t \\le 1\\,000 $ ). The description of the test cases follows.\n\nThe first line of each test case contains a single integer $ n $ ( $ 2 \\le n \\le 500\\,000 $ ) — the number of departments in the mall.\n\nEach of the following $ n $ lines of each test case contains two integers $ a_i $ and $ b_i $ ( $ 0 \\le a_i, b_i \\le 10^9 $ ) — the prices of gifts in the first and second store of the $ i $ department, respectively.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 500\\,000 $ .",
    "outputFormat": "Print one integer — the minimum price difference of the most expensive gifts bought to friends.",
    "samples": [
        [
            "2\n2\n1 2\n2 1\n5\n1 5\n2 7\n3 3\n4 10\n2 5",
            "0\n1"
        ]
    ],
    "hint": "In the first test case, Sasha has two possible options: buy a gift for the first friend in the first department, and the second friend — in the second department, or vice versa. In the first case, $ m_1 = m_2 = 1 $ , and in the second case — $ m_1 = m_2 = 2 $ . In both cases, the answer is $ 0 $ . In the second test case, you can buy gifts for the first friend in the $ 2 $ , $ 4 $ and $ 5 $ departments, and for the second friend — in the $ 1 $ and $ 3 $ departments.So $ m_1 = \\max(2, 4, 2) = 4 $ , $ m_2 = \\max(5, 3) = 5 $ . The answer is $ \\lvert 4 - 5 \\rvert = 1 $ .",
    "translation": "有 $n$ 个商店，在第 $i$ 个商店会进行下面两个操作之一：\n\n- 为朋友 A 买礼物，花费 $a_i$ 元。\n- 为朋友 B 买礼物，花费 $b_i$ 元。\n\n求在每个商店进行过以上操作后，朋友 A 和 B 获得的礼物中的最大价值之差的最小值。\n\n有 $t$ 组测试数据。\n\n数据范围：$1\\le t\\le1000$，$2\\le n\\le5\\times 10^5$，$0\\le a_i, b_i\\le 10^9$。"
}