{
    "description": "Berland Intercollegiate Contest has just finished. Monocarp and Polycarp, as the jury, are going to conduct an editorial. Unfortunately, the time is limited, since they have to finish before the closing ceremony.\n\nThere were $ n $ problems in the contest. The problems are numbered from $ 1 $ to $ n $ . The editorial for the $ i $ -th problem takes $ a_i $ minutes. Monocarp and Polycarp are going to conduct an editorial for exactly $ k $ of the problems.\n\nThe editorial goes as follows. They have a full problemset of $ n $ problems before them, in order. They remove $ n - k $ problems without changing the order of the remaining $ k $ problems. Then, Monocarp takes some prefix of these $ k $ problems (possibly, an empty one or all problems). Polycarp takes the remaining suffix of them. After that, they go to different rooms and conduct editorials for their problems in parallel. So, the editorial takes as much time as the longer of these two does.\n\nPlease, help Monocarp and Polycarp to choose the problems and the split in such a way that the editorial finishes as early as possible. Print the duration of the editorial.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of testcases.\n\nThe first line of each testcase contains two integers $ n $ and $ k $ ( $ 1 \\le k \\le n \\le 3 \\cdot 10^5 $ ) — the number of problems in the full problemset and the number of problems Monocarp and Polycarp are going to conduct an editorial for.\n\nThe second line contains $ n $ integers $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10^9 $ ) — the time each editorial takes.\n\nThe sum of $ n $ over all testcases doesn't exceed $ 3 \\cdot 10^5 $ .",
    "outputFormat": "For each testcase, print a single integer — the smallest amount of time the editorial takes, if Monocarp and Polycarp can choose which $ k $ of $ n $ problems to conduct an editorial for and how to split them among themselves.",
    "samples": [
        [
            "6\n5 4\n1 10 1 1 1\n5 3\n1 20 5 15 3\n5 3\n1 20 3 15 5\n10 6\n10 8 20 14 3 8 6 4 16 11\n10 5\n9 9 2 13 15 19 4 9 13 12\n1 1\n1",
            "2\n6\n5\n21\n18\n1"
        ]
    ],
    "hint": "",
    "translation": "给定一个长度为 $ n $ 的序列，从中找出一个长度为 $ k $ 的子序列（可以不连续），然后将这个子序列划分为前后两部分，使得前半部分元素和与后半部分元素和的 $ \\max $ 最小。输出这个最小值。"
}