{
    "description": "The story was not finished as PMP thought. God offered him one more chance to reincarnate and come back to life. But before he can come back, God told him that PMP should ask $ n $ great men including prominent programmers about their life experiences.\n\nThe men are standing on a straight line. They are numbered $ 1 $ through $ n $ from left to right. The coordinate of the $ i $ -th man is $ x_{i} $ $ (x_{i}&lt;x_{i+1},i&lt;n) $ . PMP should visit all these people one by one in arbitrary order. Each men should be visited exactly once. At the beginning of his tour, he starts at location of $ s $ -th man and asks him about his experiences.\n\nEach time PMP wants to change his location, he should give a ticket to an angel and the angel carries him to his destination. Angels take PMP from one location, fly to his destination and put him down there. Nobody else is visited in this movement. Moving from $ i $ -th man to $ j $ -th man, takes $ |x_{i}-x_{j}| $ time. PMP can get back to life as soon as he visits all men.\n\nThere are two types of angels: Some angels are going to the right and they only accept right tickets. Others are going the left and they only accept left tickets. There are an unlimited number of angels of each type. PMP has $ l $ left tickets and $ n-1-l $ right tickets.\n\nPMP wants to get back to life as soon as possible to be able to compete in this year's final instead of the final he missed last year. He wants to know the quickest way to visit all the men exactly once. He also needs to know the exact sequence moves he should make.",
    "inputFormat": "The first line of input contains three space-separated integers $ n,l,s $ ( $ 2<=n<=10^{5},0<=l&lt;n,1<=s<=n $ ) — the number of people to visit, the number left tickets PMP got, and initial location of PMP. Next line contains $ n $ space-separated integers. The $ i $ -th integer in this line is $ x_{i} $ ( $ 0=x_{1}&lt;x_{2}&lt;...&lt;x_{n}<=10^{9} $ ) — the location of $ i $ -th man.",
    "outputFormat": "If PMP cannot visit all men with the tickets he got print -1 in the only line of output. Otherwise, in the first line you should print the minimum time PMP can visit all men. In the second line you should print $ n-1 $ integers that are the numbers of the men that PMP should visit in order in one optimal solution. If there are multiple answers, output any of them.\n\nPlease do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "5 2 2\n0 10 11 21 22\n",
            "33\n1 3 5 4\n"
        ],
        [
            "4 3 1\n0 1 2 3\n",
            "-1\n"
        ],
        [
            "7 3 2\n0 100 200 201 301 303 305\n",
            "409\n1 3 4 7 6 5\n"
        ]
    ],
    "hint": "Let us remind here, a great contestant of all times, who left us about a year ago. May Renat Mullakhanov rest in peace."
}