{
    "description": "This is a hard version of the problem. It differs from the easy one only by constraints on $ n $ and $ t $ .\n\nThere is a deck of $ n $ cards, each of which is characterized by its power. There are two types of cards:\n\n- a hero card, the power of such a card is always equal to $ 0 $ ;\n- a bonus card, the power of such a card is always positive.\n\nYou can do the following with the deck:\n\n- take a card from the top of the deck;\n- if this card is a bonus card, you can put it on top of your bonus deck or discard;\n- if this card is a hero card, then the power of the top card from your bonus deck is added to his power (if it is not empty), after that the hero is added to your army, and the used bonus discards.\n\nYour task is to use such actions to gather an army with the maximum possible total power.",
    "inputFormat": "The first line of input data contains single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases in the test.\n\nThe first line of each test case contains one integer $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) — the number of cards in the deck.\n\nThe second line of each test case contains $ n $ integers $ s_1, s_2, \\dots, s_n $ ( $ 0 \\le s_i \\le 10^9 $ ) — card powers in top-down order.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "Output $ t $ numbers, each of which is the answer to the corresponding test case — the maximum possible total power of the army that can be achieved.",
    "samples": [
        [
            "5\n5\n3 3 3 0 0\n6\n0 3 3 0 0 3\n7\n1 2 3 0 4 5 0\n7\n1 2 5 0 4 3 0\n5\n3 1 0 0 4",
            "6\n6\n8\n9\n4"
        ]
    ],
    "hint": "In the first sample, you can take bonuses $ 1 $ and $ 2 $ . Both hero cards will receive $ 3 $ power. If you take all the bonuses, one of them will remain unused.\n\nIn the second sample, the hero's card on top of the deck cannot be powered up, and the rest can be powered up with $ 2 $ and $ 3 $ bonuses and get $ 6 $ total power.\n\nIn the fourth sample, you can take bonuses $ 1 $ , $ 2 $ , $ 3 $ , $ 5 $ and skip the bonus $ 6 $ , then the hero $ 4 $ will be enhanced with a bonus $ 3 $ by $ 5 $ , and the hero $ 7 $ with a bonus $ 5 $ by $ 4 $ . $ 4+5=9 $ .",
    "translation": "有一副由 $n$ 张卡组成的牌，每一张牌有一个力量值，卡牌分为两种类型：\n+ 对于一张英雄卡，它的力量值总是 $0$。\n+ 对于一张附加卡，其力量值总为 **正数**。\n\n你可以对这副牌做以下操作：\n+ 从牌堆顶端取走一张牌；\n+ 如果这张牌是附加牌，你可以把它放到你的附加牌堆的 **堆顶**，或者直接丢弃；\n+ 如果这张牌是英雄牌，那么附加牌堆顶的牌的力量值会赋给当前英雄卡（如果附加牌堆非空），之后其会加入你的军队，并且消耗所用附加牌。\n\n你的任务是用这些操作集结一支 **最大总力量值的** 军队。"
}