{
    "description": "Did you think there was going to be a JoJo legend here? But no, that was me, Dio!\n\nGiven a binary string $ s $ of length $ n $ , consisting of characters 0 and 1. Let's build a square table of size $ n \\times n $ , consisting of 0 and 1 characters as follows.\n\nIn the first row of the table write the original string $ s $ . In the second row of the table write cyclic shift of the string $ s $ by one to the right. In the third row of the table, write the cyclic shift of line $ s $ by two to the right. And so on. Thus, the row with number $ k $ will contain a cyclic shift of string $ s $ by $ k $ to the right. The rows are numbered from $ 0 $ to $ n - 1 $ top-to-bottom.\n\nIn the resulting table we need to find the rectangle consisting only of ones that has the largest area.\n\nWe call a rectangle the set of all cells $ (i, j) $ in the table, such that $ x_1 \\le i \\le x_2 $ and $ y_1 \\le j \\le y_2 $ for some integers $ 0 \\le x_1 \\le x_2 < n $ and $ 0 \\le y_1 \\le y_2 < n $ .\n\nRecall that the cyclic shift of string $ s $ by $ k $ to the right is the string $ s_{n-k+1} \\ldots s_n s_1 s_2 \\ldots s_{n-k} $ . For example, the cyclic shift of the string \"01011\" by $ 0 $ to the right is the string itself \"01011\", its cyclic shift by $ 3 $ to the right is the string \"01101\".",
    "inputFormat": "Each test consists of multiple test cases. The first line contains a single integer $ t $ ( $ 1 \\le t \\le 2 \\cdot 10^4 $ ) — the number of test cases. The description of test cases follows.\n\nThe first and the only line of each test case contains a single binary string $ s $ ( $ 1 \\le \\lvert s \\rvert \\le 2 \\cdot 10^5 $ ), consisting of characters 0 and 1.\n\nIt is guaranteed that the sum of string lengths $ |s| $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, output a single integer — the maximum area of a rectangle consisting only of ones. If there is no such rectangle, output $ 0 $ .",
    "samples": [
        [
            "5\n0\n1\n101\n011110\n101010",
            "0\n1\n2\n6\n1"
        ]
    ],
    "hint": "In the first test case, there is a table $ 1 \\times 1 $ consisting of a single character 0, so there are no rectangles consisting of ones, and the answer is $ 0 $ .\n\nIn the second test case, there is a table $ 1 \\times 1 $ , consisting of a single character 1, so the answer is $ 1 $ .\n\nIn the third test case, there is a table:\n\n 101110011In the fourth test case, there is a table:\n\n 011110001111100111110011111001111100In the fifth test case, there is a table:\n\n 101010010101101010010101101010010101Rectangles with maximum area are shown in bold.",
    "translation": "#### 题目描述\n\n给定一个长度为 $n$ 的二进制字符串 $s$，构建一个 $n \\times n$ 的方格表。首行写下原始字符串 $s$，次行右移一个字符的循环移位字符串 $s$，第三行右移两个字符的循环移位字符串 $s$，以此类推。因此，第 $k$ 行包含一个从 $s$ 右移 $k$ 个字符的循环移位字符串。行从上到下编号 $0$ 至 $n-1$。\n\n在生成的表中，需要找到只由数字 $1$ 构成的矩形并计算其面积，返回最大的面积。\n\n注意：字符串 $s$ 向右循环移动 $k$ 位是指将其最后 $k$ 个字符移动到前面，即字符串 $s_{n-k+1} \\cdots s_n \\; s_1 \\cdots s_{n-k}$。\n\n#### 输入格式\n\n第一行的正整数 $t$ ($1\\leq t\\leq 2\\times10^4$) 是测试用例的数量。 对于每个测试用例，只有一行，是一个只由零和一组成的二进制字符串。\n\n保证所有测试用例中字符总数之和不超过 $2\\times 10^5$。\n\n#### 输出格式\n\n对于每个测试用例，输出一个整数：只由数字 $1$ 构成的矩形的最大面积。如果不存在这样的矩形，则输出 $0$。"
}