{
    "description": "A regular bracket sequence is a bracket sequence that can be transformed into a correct arithmetic expression by inserting characters \"1\" and \"+\" between the original characters of the sequence. For example:\n\n- the bracket sequences \"()()\" and \"(())\" are regular (the resulting expressions are: \"(1)+(1)\" and \"((1+1)+1)\");\n- the bracket sequences \")(\", \"(\" and \")\" are not.\n\nA bracket sequence is called beautiful if one of the following conditions is satisfied:\n\n- it is a regular bracket sequence;\n- if the order of the characters in this sequence is reversed, it becomes a regular bracket sequence.\n\nFor example, the bracket sequences \"()()\", \"(())\", \")))(((\", \"))()((\" are beautiful.\n\nYou are given a bracket sequence $ s $ . You have to color it in such a way that:\n\n- every bracket is colored into one color;\n- for every color, there is at least one bracket colored into that color;\n- for every color, if you write down the sequence of brackets having that color in the order they appear, you will get a beautiful bracket sequence.\n\nColor the given bracket sequence $ s $ into the minimum number of colors according to these constraints, or report that it is impossible.",
    "inputFormat": "The first line contains one integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nEach test case consists of two lines. The first line contains one integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^5 $ ) — the number of characters in $ s $ . The second line contains $ s $ — a string of $ n $ characters, where each character is either \"(\" or \")\".\n\nAdditional constraint on the input: the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print the answer as follows:\n\n- if it is impossible to color the brackets according to the problem statement, print $ -1 $ ;\n- otherwise, print two lines. In the first line, print one integer $ k $ ( $ 1 \\le k \\le n $ ) — the minimum number of colors. In the second line, print $ n $ integers $ c_1, c_2, \\dots, c_n $ ( $ 1 \\le c_i \\le k $ ), where $ c_i $ is the color of the $ i $ -th bracket. If there are multiple answers, print any of them.",
    "samples": [
        [
            "4\n8\n((())))(\n4\n(())\n4\n))((\n3\n(()",
            "2\n2 2 2 1 2 2 2 1\n1\n1 1 1 1\n1\n1 1 1 1\n-1"
        ]
    ],
    "hint": "",
    "translation": "如果一个括号序列符合以下两个条件中的一个，那么它是优美的：\n\n1、序列的任意一个前缀中，左括号的个数不少于右括号的个数，且整个序列中，左括号的个数等于右括号的个数。\n\n2、序列的任意一个前缀中，右括号的个数不少于左括号的个数，且整个序列中，左括号的个数等于右括号的个数。\n\n给定一个括号序列，你需要把它分成若干组，使得每一组的括号构成的序列都是优美的。求最少需要分成多少组，并输出分组方案。如果无解，输出 $ -1 $。"
}