{
    "description": "Kristina has a string $ s $ of length $ n $ , consisting only of lowercase and uppercase Latin letters. For each pair of lowercase letter and its matching uppercase letter, Kristina can get $ 1 $ burl. However, pairs of characters cannot overlap, so each character can only be in one pair.\n\nFor example, if she has the string $ s $ = \"aAaaBACacbE\", she can get a burl for the following character pairs:\n\n- $ s_1 $ = \"a\" and $ s_2 $ = \"A\"\n- $ s_4 $ = \"a\" and $ s_6 $ = \"A\"\n- $ s_5 $ = \"B\" and $ s_{10} $ = \"b\"\n- $ s_7 $ = \"C\" and $ s_9 $ = \"c\"\n\nKristina wants to get more burles for her string, so she is going to perform no more than $ k $ operations on it. In one operation, she can:\n\n- either select the lowercase character $ s_i $ ( $ 1 \\le i \\le n $ ) and make it uppercase.\n- or select uppercase character $ s_i $ ( $ 1 \\le i \\le n $ ) and make it lowercase.\n\nFor example, when $ k $ = 2 and $ s $ = \"aAaaBACacbE\" it can perform one operation: choose $ s_3 $ = \"a\" and make it uppercase. Then she will get another pair of $ s_3 $ = \"A\" and $ s_8 $ = \"a\"\n\nFind maximum number of burles Kristina can get for her string.",
    "inputFormat": "The first line of input data contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nThe description of the test cases follows.\n\nThe first line of each test case contains two integers $ n $ ( $ 1 \\le n \\le 2 \\cdot 10^5 $ ) and $ k $ ( $ 0 \\le k \\le n $ ) — the number of characters in the string and the maximum number of operations that can be performed on it.\n\nThe second line of each test case contains a string $ s $ of length $ n $ , consisting only of lowercase and uppercase Latin letters.\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each test case, print exactly one integer on a separate line: the maximum number of burles that Kristina can get for her string $ s $ .",
    "samples": [
        [
            "5\n11 2\naAaaBACacbE\n2 2\nab\n4 1\naaBB\n6 0\nabBAcC\n5 3\ncbccb",
            "5\n0\n1\n3\n2"
        ]
    ],
    "hint": "The first test case is explained in the problem statement.\n\nIn the second test case, it is not possible to get any pair by performing any number of operations.",
    "translation": "给定 $n$，$k$，长度为 $n$ 的字符串 $s$。\n\n一个大写的字母和一个小写格式的该字母可以合并，合并后消失，且分值加一。\n\n一次操作定义为将一个字母改变其大小写格式（大写转小写，小写转大写）。\n\n求在不超过 $k$ 次操作后，该字符串的分值的最大值。\n\n共 $t$ 组数据。\n\nby @Larryyu"
}