{
    "description": "You are given a string $ s $ , consisting of lowercase Latin letters.\n\nIn one operation, you can select several (one or more) positions in it such that no two selected positions are adjacent to each other. Then you remove the letters on the selected positions from the string. The resulting parts are concatenated without changing their order.\n\nWhat is the smallest number of operations required to make all the letters in $ s $ the same?",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of testcases.\n\nThe only line of each testcase contains a string $ s $ , consisting of lowercase Latin letters. Its length is from $ 1 $ to $ 2 \\cdot 10^5 $ .\n\nThe total length of the strings over all testcases doesn't exceed $ 2 \\cdot 10^5 $ .",
    "outputFormat": "For each testcase, print a single integer — the smallest number of operations required to make all the letters in the given string $ s $ the same.",
    "samples": [
        [
            "5\nabacaba\ncodeforces\noooooooo\nabcdef\nmewheniseearulhiiarul",
            "1\n3\n0\n2\n4"
        ]
    ],
    "hint": "In the first testcase, you can select positions $ 2, 4 $ and $ 6 $ and remove the corresponding letters 'b', 'c' and 'b'.\n\nIn the third testcase, the letters in the string are already the same, so you don't have to make any operations.\n\nIn the fourth testcase, one of the possible solutions in $ 2 $ operations is the following. You can select positions $ 1, 4, 6 $ first. The string becomes \"bce\". Then select positions $ 1 $ and $ 3 $ . The string becomes \"c\". All letters in it are the same, since it's just one letter.",
    "translation": "现有一个由小写字母组成的字符串，你将对这个字符串进行操作。每次操作你可以选择任意多个（可以只选一个）两两在字符串中不相邻的字母，把它们从字符串中删除。求至少进行多少次操作，字符串里的所有字母相同。"
}