{
    "description": "You were walking down the street and heard a sound. The sound was described by the string $ s $ consisting of lowercase and uppercase Latin characters. Now you want to find out if the sound was a cat meowing.\n\nFor the sound to be a meowing, the string can only contain the letters 'm', 'e', 'o' and 'w', in either uppercase or lowercase. Also:\n\n- string must start with non-empty sequence consisting only of characters 'm' or 'M'\n- it must be immediately followed by non-empty sequence consisting only of characters 'e' or 'E'\n- it must be immediately followed by non-empty sequence consisting only of characters 'o' or 'O'\n- it must be immediately followed by non-empty sequence consisting only of characters 'w' or 'W', this sequence ends the string, after it immediately comes the string end\n\nFor example, strings \"meow\", \"mmmEeOWww\", \"MeOooOw\" describe a meowing, but strings \"Mweo\", \"MeO\", \"moew\", \"MmEW\", \"meowmeow\" do not.\n\nDetermine whether the sound you heard was a cat meowing or something else.",
    "inputFormat": "The first line of input data contains a single integer $ t $ ( $ 1 \\le t \\le 10^4 $ ) — the number of test cases.\n\nThe description of the test cases follows.\n\nThe first line of each test case contains an integer $ n $ ( $ 1 \\le n \\le 50 $ ) — the length of the string describing the sound.\n\nThe second line of each test case contains a string $ s $ of $ n $ characters. The string describes the sound you heard and consists only of lowercase and uppercase Latin letters.",
    "outputFormat": "For each test case, output on a separate line:\n\n- YES if the sound was a cat meowing;\n- NO otherwise.\n\nYou can output YES and NO in any case (for example, strings yEs, yes, Yes and YES will be recognized as positive response).",
    "samples": [
        [
            "7\n4\nmeOw\n14\nmMmeoOoWWWwwwW\n3\nmew\n7\nMmeEeUw\n4\nMEOW\n6\nMmyaVW\n5\nmeowA",
            "YES\nYES\nNO\nNO\nYES\nNO\nNO"
        ]
    ],
    "hint": "In the first test case, the string consists of a sequence of characters 'm', 'e', 'O', 'w', which satisfies the definition of meowing.\n\nIn the second test case, the string consists of a sequence of $ 3 $ characters 'm' and 'M', one 'e', a sequence of $ 3 $ characters 'o' and 'O' and a sequence of $ 7 $ characters 'w' and 'W', which satisfies the definition of meowing.\n\nIn the third test case, the string does not describe a meowing because it lacks a sequence of 'o' or 'O' characters between 'e' and 'w'.\n\nIn the fourth test case, the string contains the character 'U', so it does not describe a meowing.",
    "translation": "给定一个字符串及其长度，如果满足下列条件输出 ```YES``` 否则输出 ```NO```。\n- 该字符串由四部分组成\n- 每部分有且仅有一种字母（不分大小写），依次为 ```m```,```e```,```o```,```w```。\n\n共 $t$ 组数据。\n\nby @Larryyu"
}