{
    "description": "Mihai and Bianca are playing with bags of candies. They have a row $ a $ of $ n $ bags of candies. The $ i $ -th bag has $ a_i $ candies. The bags are given to the players in the order from the first bag to the $ n $ -th bag.\n\nIf a bag has an even number of candies, Mihai grabs the bag. Otherwise, Bianca grabs the bag. Once a bag is grabbed, the number of candies in it gets added to the total number of candies of the player that took it.\n\nMihai wants to show off, so he wants to reorder the array so that at any moment (except at the start when they both have no candies), Mihai will have strictly more candies than Bianca. Help Mihai find out if such a reordering exists.",
    "inputFormat": "The first line of the input contains an integer $ t $ ( $ 1 \\leq t \\leq 1000 $ ) — the number of test cases.\n\nThe first line of each test case contains a single integer $ n $ ( $ 1 \\leq n \\leq 100 $ ) — the number of bags in the array.\n\nThe second line of each test case contains $ n $ space-separated integers $ a_i $ ( $ 1 \\leq a_i \\leq 100 $ ) — the number of candies in each bag.",
    "outputFormat": "For each test case, output \"YES\" (without quotes) if such a reordering exists, and \"NO\" (without quotes) otherwise.\n\nYou can output the answer in any case (for example, the strings \"yEs\", \"yes\", \"Yes\" and \"YES\" will be recognized as a positive answer).",
    "samples": [
        [
            "3\n4\n1 2 3 4\n4\n1 1 1 2\n3\n1 4 3",
            "YES\nNO\nNO"
        ]
    ],
    "hint": "In the first test case, Mihai can reorder the array as follows: $ [4, 1, 2, 3] $ . Then the process proceeds as follows:\n\n- the first bag has $ 4 $ candies, which is even, so Mihai takes it — Mihai has $ 4 $ candies, and Bianca has $ 0 $ .\n- the second bag has $ 1 $ candies, which is odd, so Bianca takes it — Mihai has $ 4 $ candies, and Bianca has $ 1 $ .\n- the third bag has $ 2 $ candies, which is even, so Mihai takes it — Mihai has $ 6 $ candies, and Bianca has $ 1 $ .\n- the fourth bag has $ 3 $ candies, which is odd, so Bianca takes it — Mihai has $ 6 $ candies, and Bianca has $ 4 $ .\n\n Since Mihai always has more candies than Bianca, this reordering works.",
    "translation": "有 $n$ 包糖果，每包有 $a_i$ 糖果，如果该包糖果数是偶数，```Mihai``` 会拿走，否则 ```Bianca``` 会拿走。\n\n两人会按照顺序依次拿走 $a_1,a_2\\dots a_n$，现在可以对数列重新排序，问是否存在一种情况，使得任意时刻 ```Mihai``` 拿到的糖果数严格大于 ```Binaca``` 拿到的。\n\nby @[Larryyu](https://www.luogu.com.cn/user/475329)"
}