{
    "description": "Dasha loves guinea pigs very much. In this regard, she decided to settle as many guinea pigs at home as possible and developed a plan for the next $ n $ days. Every day, she will either buy a new guinea pig or call a doctor to examine all her pets.\n\nUnfortunately, the store where she was going to buy guinea pigs does not understand them. Therefore, it cannot determine their gender. Dasha can't do it either. The only one who can help is a doctor.\n\nTo keep guinea pigs, aviaries are needed. Dasha plans to buy them in the same store. Unfortunately, only one species is sold there — a double aviary. No more than two guinea pigs can live in it.\n\nSince Dasha does not want to cause moral injury to her pets — she will not settle two guinea pigs of different genders in one aviary.\n\nHelp Dasha calculate how many aviaries in the worst case you need to buy so that you can be sure that at no moment of time do two guinea pigs of different genders live in the same aviary.\n\nAs part of this task, we believe that guinea pigs have only two genders — male and female.",
    "inputFormat": "The first line of input data contains one number $ t $ ( $ 1 \\leqslant t \\leqslant 10^5 $ ) — the number of input data sets.\n\nThe first line of each input data set contains one number $ n $ ( $ 1 \\leqslant n \\leqslant 10^5 $ ) — the number of days Dasha has a plan for.\n\nThe next line contains $ n $ numbers $ b_1, b_2, b_3, \\ldots, b_n $ ( $ 1 \\leqslant b_i \\leqslant 2 $ ) — Dasha's plan. If $ b_i = 1 $ , then on the $ i $ th day, Dasha will buy a new guinea pig. If $ b_i = 2 $ , then on the $ i $ th day, a doctor will come to Dasha and help determine the sex of all guinea pigs that Dasha already has.\n\nIt is guaranteed that the sum of $ n $ for all input data sets does not exceed $ 10^5 $ .",
    "outputFormat": "For each set of input data, output one number — the minimum number of aviaries Dasha needs to buy so that no matter what the genders of the pigs turn out to be, we can settle them so that at no point in time do two guinea pigs of different genders live together.",
    "samples": [
        [
            "6\n3\n1 1 1\n3\n2 2 2\n5\n1 1 1 2 1\n10\n1 2 1 2 1 2 1 2 1 2\n20\n1 2 1 1 1 1 1 2 1 2 1 2 2 1 1 1 1 1 1 1\n20\n2 1 1 2 1 1 2 1 2 2 1 1 1 2 2 1 1 1 1 2",
            "3\n0\n3\n4\n12\n9"
        ]
    ],
    "hint": "In the first set of input data, Dasha needs to put each guinea pig in a separate enclosure, since she does not know their gender.\n\nIn the second set of input data, Dasha will buy $ 0 $ guinea pigs, which means she will need $ 0 $ aviaries.\n\nIn the third set of input data, you even need $ 3 $ aviaries to put each guinea pig in a separate aviary before the doctor arrives at the $ 4 $ th day. When she finds out their gender, at least two guinea pigs will be of the same gender and they can be placed in one aviary, and the third in another aviary. Thus, she will have one free aviary in which she can settle a new guinea pig. So answer is $ 3 $ .\n\nIn the fourth set of input data, we show that $ 4 $ is the optimal answer.\n\nTo begin with, we note that the first four guinea pigs can be placed one at a time in an aviary. Then a doctor will come and determine their gender. Among these four guinea pigs there will be at least one pair of the same gender, because: either male guinea pigs are at least $ 2 $ , or they are not more than $ 1 $ , which means that the female is at least $ 3 $ . Now we can put this couple in one aviary, and the other two in separate ones. We will have one more empty aviary where we can put a new pig.\n\nNow let's show that the answer is at least $ 4 $ . Let's say that among the first $ 4 $ guinea pigs, $ 3 $ are female and $ 1 $ is male. We need at least $ 3 $ aviaries to settle them. Then, when we buy a new guinea pig, we will need another aviary in which we will put it, since we do not know its gender.",
    "translation": "Dasha 很喜欢豚鼠，她在 $n$ 天内要不是买豚鼠，要不是请医生来看豚鼠。\n\nDasha 和宠物店都无法分辨豚鼠的性别（思考人生），只能在医生来查看豚鼠的时候为这些豚鼠做性别鉴定。\n\n为了豚鼠，Dasha 打算给它们买一些笼子，但宠物店里卖的笼子只能放最多 $2$ 只豚鼠。由于她不想让她的豚鼠遭受道德伤害，一个笼子里只能放同一种性别的豚鼠。\n\n求 Dasha 最少需要买多少个笼子。\n\n这个翻译由 @ztrztr 提供"
}