{
    "description": "Lara has a safe that is locked with a circle-shaped code lock that consists of a rotating arrow, a static circumference around the arrow, an input screen, and an input button.\n\nThe circumference of the lock is split into $ k $ equal sections numbered from $ 1 $ to $ k $ in clockwise order. Arrow always points to one of the sections. Each section is marked with one of the first $ k $ letters of the English alphabet. No two sections are marked with the same letter.\n\nDue to the lock limitations, the safe's password is a string of length $ n $ that consists of first $ k $ letters of the English alphabet only. Lara enters the password by rotating the lock's arrow and pressing the input button. Initially, the lock's arrow points to section $ 1 $ and the input screen is empty. In one second she can do one of the following actions.\n\n- Rotate the arrow one section clockwise. If the arrow was pointing at section $ x < k $ it will now point at section $ x + 1 $ . If the arrow was pointing at section $ k $ it will now point at section $ 1 $ .\n- Rotate the arrow one section counter-clockwise. If the arrow was pointing at section $ x > 1 $ it will now point at section $ x - 1 $ . If the arrow was pointing at section $ 1 $ it will now point at section $ k $ .\n- Press the input button. The letter marked on the section that the arrow points to will be added to the content of the input screen.\n\n As soon as the content of the input screen matches the password, the safe will open. Lara always enters her password in the minimum possible time.Lara has recently found out that the safe can be re-programmed. She can take the first $ k $ letters of the English alphabet and assign them to the sectors in any order she likes. Now she wants to re-arrange the letters in a way that will minimize the number of seconds it takes her to input the password. Compute this minimum number of seconds and the number of ways to assign letters, for which this minimum number of seconds is achieved.\n\nTwo ways to assign letters to sectors are considered to be distinct if there exists at least one sector $ i $ that is assigned different letters.",
    "inputFormat": "The first line of the input contains two integers $ k $ and $ n $ ( $ 2 \\leq k \\leq 16 $ , $ 2 \\leq n \\leq 100\\,000 $ ) — the number of sectors on the lock's circumference and the length of Lara's password, respectively.\n\nThe second line of the input contains a string of length $ n $ that consists of the first $ k $ lowercase letters of the English alphabet only. This string is the password.",
    "outputFormat": "On the first line print minimum possible number of seconds it can take Lara to enter the password and open the safe if she assigns letters to sectors optimally.\n\nOn the second line print the number of ways to assign letters optimally.",
    "samples": [
        [
            "3 10\nabcabcabca",
            "19\n2"
        ],
        [
            "4 20\nbcbcbcbcadadadadcbda",
            "40\n2"
        ],
        [
            "4 6\nadcbda",
            "12\n4"
        ]
    ],
    "hint": "The initial states of optimal arrangements for the first example are shown in the figure below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1804H/e45e1b4f3b79b2d902d1c00b376c53b95aba0db4.png)The initial states of optimal arrangements for the second example are shown in the figure below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1804H/389620732c47a1486b9197d87744ef5c54805e3b.png)The initial states of optimal arrangements for the third example are shown in the figure below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1804H/938898f262739c0b43e88285dd85cd7f571846a9.png)"
}