{
    "description": "Vasya has recently bought some land and decided to surround it with a wooden fence.\n\nHe went to a company called \"Wooden board\" that produces wooden boards for fences. Vasya read in the catalog of products that the company has at its disposal $ n $ different types of wood. The company uses the $ i $ -th type of wood to produce a board of this type that is a rectangular $ a_{i} $ by $ b_{i} $ block.\n\nVasya decided to order boards in this company and build a fence from them. It turned out that the storehouse of the company is so large that Vasya can order arbitrary number of boards of every type. Note that Vasya is allowed to turn the boards as he builds the fence. However, Vasya cannot turn square boards.\n\nVasya is required to construct a fence of length $ l $ , however, an arbitrary fence won't do. Vasya wants his fence to look beautiful. We'll say that a fence is beautiful if and only if the following two conditions are fulfilled:\n\n- there are no two successive boards of the same type\n- the first board of the fence has an arbitrary length, and the length of each subsequent board equals the width of the previous one\n\nIn other words, the fence is considered beautiful, if the type of the $ i $ -th board in the fence is different from the $ i-1 $ -th board's type; besides, the $ i $ -th board's length is equal to the $ i-1 $ -th board's width (for all $ i $ , starting from 2).\n\nNow Vasya wonders, how many variants of arranging a fence for his land exist. Your task is to count the number of different beautiful fences of length $ l $ .\n\nTwo fences will be considered the same if the corresponding sequences of fence boards types and rotations are the same, otherwise the fences are different. Since the sought number can be large enough, you need to calculate the answer modulo $ 1000000007 $ $ (10^{9}+7) $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ l $ ( $ 1<=n<=100,1<=l<=3000 $ ) — the number of different board types and the fence length, correspondingly. Next $ n $ lines contain descriptions of board types: the $ i $ -th line contains two integers $ a_{i} $ and $ b_{i} $ ( $ 1<=a_{i},b_{i}<=100 $ ) — the sizes of the board of the $ i $ -th type. All numbers on the lines are separated by spaces.",
    "outputFormat": "Print a single integer — the sought number of variants modulo $ 1000000007 $ ( $ 10^{9}+7 $ ).",
    "samples": [
        [
            "2 3\n1 2\n2 3\n",
            "2\n"
        ],
        [
            "1 2\n2 2\n",
            "1\n"
        ],
        [
            "6 6\n2 1\n3 2\n2 5\n3 3\n5 1\n2 1\n",
            "20\n"
        ]
    ],
    "hint": "In the first sample there are exactly two variants of arranging a beautiful fence of length 3:\n\n- As the first fence board use the board of the first type of length 1 and width 2. As the second board use board of the second type of length 2 and width 3.\n- Use one board of the second type after you turn it. That makes its length equal 3, and width — 2.",
    "translation": "给定 $n$ 种木板，每种木板有长度和宽度 $a_i,b_i$。\n\n现在需要从中选一些木板，拼成长度总和为 $l$ 的栅栏，每种木板可以使用无限次。注意你可以将一块木板旋转 $90^\\circ$，使其长度和宽度对调，但这不会改变它的种类。\n\n建出的栅栏要求相邻两块木板：\n\n- 种类不能一样\n- 前者的长度需等于后者的宽度\n\n请你求出有多少种建栅栏的方案数。答案对 $10^9+7$ 取模。"
}