{
    "description": "In this problem, unlike problem A, you need to look for unluckiest number, not the luckiest one.\n\nNote that the constraints of this problem differ from such in problem A.\n\nOlympus City recently launched the production of personal starships. Now everyone on Mars can buy one and fly to other planets inexpensively.\n\nEach starship has a number —some positive integer $ x $ . Let's define the luckiness of a number $ x $ as the difference between the largest and smallest digits of that number. For example, $ 142857 $ has $ 8 $ as its largest digit and $ 1 $ as its smallest digit, so its luckiness is $ 8-1=7 $ . And the number $ 111 $ has all digits equal to $ 1 $ , so its luckiness is zero.\n\nHateehc is a famous Martian blogger who often flies to different corners of the solar system. To release interesting videos even faster, he decided to buy himself a starship. When he came to the store, he saw starships with numbers from $ l $ to $ r $ inclusively. While in the store, Hateehc wanted to find a starship with the unluckiest number.\n\nSince there are a lot of starships in the store, and Hateehc can't program, you have to help the blogger and write a program that answers his question.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF1808C/20c86d6a3ad44baab97e03914b693fecf3deba6f.png)",
    "inputFormat": "The first line contains an integer $ t $ ( $ 1 \\le t \\le 600 $ ) —the number of test cases.\n\nEach of the following $ t $ lines contains a description of the test case. The description consists of two integers $ l $ , $ r $ ( $ 1 \\le l \\le r \\le 10^{18} $ ) — the largest and smallest numbers of the starships in the store.",
    "outputFormat": "Print $ t $ lines, one line for each test case, containing the unluckiest starship number in the store.\n\nIf there are several ways to choose the unluckiest number, output any of them.",
    "samples": [
        [
            "5\n59 63\n42 49\n48 53\n90 90\n1 100",
            "63\n44\n53\n90\n1"
        ]
    ],
    "hint": "Let's look at two test examples:\n\n- the luckiness of the number $ 59 $ is $ 9 - 5 = 4 $ ;\n- the luckiness of $ 60 $ equals $ 6 - 0 = 6 $ ;\n- the luckiness of $ 61 $ equals $ 6 - 1 = 5 $ ;\n- the luckiness of $ 62 $ equals $ 6 - 2 = 4 $ ;\n- the luckiness of $ 63 $ is $ 6 - 3 = 3 $ .\n\n So the unluckiest number is $ 63 $ .In the fifth test case, the unluckiest numbers are $ 1 $ , $ 2 $ , $ 3 $ , $ 4 $ , $ 5 $ , $ 6 $ , $ 7 $ , $ 8 $ , $ 9 $ , $ 11 $ , $ 22 $ , $ 33 $ , $ 44 $ , $ 55 $ , $ 66 $ , $ 77 $ , $ 88 $ , $ 99 $ , so you are allowed to choose any of them.",
    "translation": "定义一个数的幸运值为这个数中最大数字与最小数字的差。例如数字 $142857$ 的幸运值为 $8-1=7$ 。现给出 $T$ 组区间 $[l,r]$ ，对于每组数据输出区间中幸运值最小的数字，若有多种答案输出一种即可。 $T \\leq 600 , 1 \\leq l \\leq r \\leq 10^{18}$ 。"
}