{
    "description": "To thank Ian, Mary gifted an array $ a $ of length $ n $ to Ian. To make himself look smart, he wants to make the array in non-decreasing order by doing the following finitely many times: he chooses two adjacent elements $ a_i $ and $ a_{i+1} $ ( $ 1\\le i\\le n-1 $ ), and increases both of them by $ 1 $ or decreases both of them by $ 1 $ . Note that, the elements of the array can become negative.\n\nAs a smart person, you notice that, there are some arrays such that Ian cannot make it become non-decreasing order! Therefore, you decide to write a program to determine if it is possible to make the array in non-decreasing order.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1 \\leq t \\leq 10^4 $ ) — the number of test cases. The description of test cases follows.\n\nThe first line of each test case consists of a single integer $ n $ ( $ 2\\le n\\le 3\\cdot10^5 $ ) — the number of elements in the array.\n\nThe second line of each test case contains $ n $ integers $ a_1,a_2,\\ldots,a_n $ ( $ 1\\le a_i\\le 10^9 $ ) — the elements of the array $ a $ .\n\nIt is guaranteed that the sum of $ n $ over all test cases does not exceed $ 3\\cdot10^5 $ .",
    "outputFormat": "For each test case, output \"YES\" if there exists a sequence of operations which make the array non-decreasing, else output \"NO\".\n\nYou may print each letter in any case (for example, \"YES\", \"Yes\", \"yes\", \"yEs\" will all be recognized as positive answer).",
    "samples": [
        [
            "5\n3\n1 3 2\n2\n2 1\n4\n1 3 5 7\n4\n2 1 4 3\n5\n5 4 3 2 1",
            "YES\nNO\nYES\nNO\nYES"
        ]
    ],
    "hint": "For the first test case, we can increase $ a_2 $ and $ a_3 $ both by $ 1 $ . The array is now $ [1, 4, 3] $ .\n\nThen we can decrease $ a_1 $ and $ a_2 $ both by $ 1 $ . The array is now $ [0, 3, 3] $ , which is sorted in non-decreasing order. So the answer is \"YES\".\n\nFor the second test case, no matter how Ian perform the operations, $ a_1 $ will always be larger than $ a_2 $ . So the answer is \"NO\" and Ian cannot pretend to be smart.\n\nFor the third test case, the array is already in non-decreasing order, so Ian does not need to do anything.",
    "translation": "### 题目描述\n\n为了感谢 $\\textrm{lan}$，$\\textrm{Mary}$ 赠送了 $\\textrm{lan}$ 一个长度为 $n$ 的序列。为了让他自己看起来聪明，他想要让序列按非递减排序。他可以执行以下操作若干次：\n\n+ 选择数组中的两个元素 $a_i,a_{i+1}$ ( $1\\le i<n$ )。\n\n+ 同时将它们减去 $1$，或者都加上 $1$。\n\n（注意：操作后 $a_i,a_{i+1}$ 可以是负数或 $0$）\n\n作为一个聪明人，你会注意到，有些序列 $\\textrm{lan}$ 无法让其非递减排序。因此，你决定编写一个程序来确定是否可以使数组按非递减顺序排列。\n\n### 输入格式\n\n第一行是一个正整数 $t$ ( $1\\le t\\le 10^4$ )，表示测试数据的数量。\n\n对于每组数据：\n\n第一行是一个正整数 $n$ ( $1\\le n\\le 3\\cdot 10^5$ )，表示序列中有多少元素。\n\n第二行是 $n$ 个正整数 $a_1,a_2,\\dots,a_n$ ( $1\\le a_i\\le 10^9$ )，表示序列 $a$ 的元素。\n\n保证 $n$ 的总和不超过 $3\\cdot 10^5$。\n\n### 输出格式\n\n对于每个测试数据，如果该序列在操作后能按非递减顺序排序，输出 `YES`，否则输出 `NO`。\n\n你可以打印 `YES`，`yEs`，`yes`，`Yes`，这些都是可以被接受的。"
}