{
    "description": "Vasya lagged behind at the University and got to the battlefield. Just joking! He's simply playing some computer game. The field is a flat platform with $ n $ trenches dug on it. The trenches are segments on a plane parallel to the coordinate axes. No two trenches intersect.\n\nThere is a huge enemy laser far away from Vasya. The laser charges for $ a $ seconds, and then shoots continuously for $ b $ seconds. Then, it charges for $ a $ seconds again. Then it shoots continuously for $ b $ seconds again and so on. Vasya knows numbers $ a $ and $ b $ . He also knows that while the laser is shooting, Vasya must be in the trench, but while the laser is charging, Vasya can safely move around the field. The main thing is to have time to hide in the trench before the shot. If Vasya reaches the trench exactly at the moment when the laser starts shooting, we believe that Vasya managed to hide. Coincidentally, the length of any trench in meters numerically does not exceed $ b $ .\n\nInitially, Vasya is at point $ A $ . He needs to get to point $ B $ . Vasya moves at speed 1 meter per second in either direction. You can get in or out of the trench at any its point. Getting in or out of the trench takes no time. It is also possible to move in the trench, without leaving it.\n\nWhat is the minimum time Vasya needs to get from point $ A $ to point $ B $ , if at the initial time the laser has just started charging? If Vasya cannot get from point $ A $ to point $ B $ , print -1. If Vasya reaches point $ B $ at the moment when the laser begins to shoot, it is believed that Vasya managed to reach point $ B $ .",
    "inputFormat": "The first line contains two space-separated integers: $ a $ and $ b $ $ (1<=a,b<=1000) $ , — the duration of charging and the duration of shooting, in seconds.\n\nThe second line contains four space-separated integers: $ A_{x} $ , $ A_{y} $ , $ B_{x} $ , $ B_{y} $ $ (-10^{4}<=A_{x},A_{y},B_{x},B_{y}<=10^{4}) $ — the coordinates of points $ А $ and $ B $ . It is guaranteed that points $ A $ and $ B $ do not belong to any trench.\n\nThe third line contains a single integer: $ n $ $ (1<=n<=1000) $ , — the number of trenches.\n\nEach of the following $ n $ lines contains four space-separated integers: $ x_{1} $ , $ y_{1} $ , $ x_{2} $ , $ y_{2} $ $ (-10^{4}<=x_{i},y_{i}<=10^{4}) $ — the coordinates of ends of the corresponding trench.\n\nAll coordinates are given in meters. It is guaranteed that for any trench either $ x_{1}=x_{2} $ , or $ y_{1}=y_{2} $ . No two trenches intersect. The length of any trench in meters doesn't exceed $ b $ numerically.",
    "outputFormat": "If Vasya can get from point $ A $ to point $ B $ , print the minimum time he will need for it. Otherwise, print number -1.\n\nThe answer will be considered correct if the absolute or relative error does not exceed $ 10^{-4} $",
    "samples": [
        [
            "2 4\n0 5 6 5\n3\n0 0 0 4\n1 1 4 1\n6 0 6 4\n",
            "19.0000000000\n"
        ],
        [
            "5 10\n0 0 10 10\n1\n5 0 5 9\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "在一个战场上,V要从A点到B点,战场上有很多直线型战壕\r\n在开始的a秒内V可以随意移动,随后的b秒V只能呆在战壕内或在战壕内移动,随后a秒又可以随意移动......以此类推\r\nV可以以每秒1米的速度移动,求V从A到B需要多长时间;若不能达到B则输出-1\r\n输入的第一行为两个正整数a和b(1<a,b<1000)\r\n第二行为四个整数分别为A的坐标Xa,Ya,及B的坐标 Xb,Yb(-10000<Xa,Ya,Xb,Yb<10000)\r\n第三行为一个整数n(1<n<10000)\r\n接下来n行,每行有四个整数x1i,y1i,x2i,x2i表示战壕的一端的坐标及另一端的坐标。战壕的长度不超过b\r\n输出误差不超过 10^−4即可\r\n"
}