{
    "description": "Everyone knows that 2010 FIFA World Cup is being held in South Africa now. By the decision of BFA (Berland's Football Association) next World Cup will be held in Berland. BFA took the decision to change some World Cup regulations:\n\n- the final tournament features $ n $ teams ( $ n $ is always even)\n- the first $ n/2 $ teams (according to the standings) come through to the knockout stage\n- the standings are made on the following principle: for a victory a team gets 3 points, for a draw — 1 point, for a defeat — 0 points. In the first place, teams are ordered in the standings in decreasing order of their points; in the second place — in decreasing order of the difference between scored and missed goals; in the third place — in the decreasing order of scored goals\n- it's written in Berland's Constitution that the previous regulation helps to order the teams without ambiguity.\n\nYou are asked to write a program that, by the given list of the competing teams and the results of all the matches, will find the list of teams that managed to get through to the knockout stage.",
    "inputFormat": "The first input line contains the only integer $ n $ ( $ 1<=n<=50 $ ) — amount of the teams, taking part in the final tournament of World Cup. The following $ n $ lines contain the names of these teams, a name is a string of lower-case and upper-case Latin letters, its length doesn't exceed 30 characters. The following $ n·(n-1)/2 $ lines describe the held matches in the format name1-name2 num1:num2, where $ name1 $ , $ name2 $ — names of the teams; $ num1 $ , $ num2 $ ( $ 0<=num1,num2<=100 $ ) — amount of the goals, scored by the corresponding teams. Accuracy of the descriptions is guaranteed: there are no two team names coinciding accurate to the letters' case; there is no match, where a team plays with itself; each match is met in the descriptions only once.",
    "outputFormat": "Output $ n/2 $ lines — names of the teams, which managed to get through to the knockout stage in lexicographical order. Output each name in a separate line. No odd characters (including spaces) are allowed. It's guaranteed that the described regulations help to order the teams without ambiguity.",
    "samples": [
        [
            "4\nA\nB\nC\nD\nA-B 1:1\nA-C 2:2\nA-D 1:0\nB-C 1:0\nB-D 0:3\nC-D 0:3\n",
            "A\nD\n"
        ],
        [
            "2\na\nA\na-A 2:1\n",
            "a\n"
        ]
    ],
    "hint": "",
    "translation": "## 题意\n众所周知，2010 年 FIFA 世界杯在南非举行。BFA 决定下一届世界杯将在伯兰德举行。BFA 决定改变世界杯的一些规定：  \n\n- 最后的比赛涉及 $n$ 支球队（$n$ 总是偶数）；\n- 前 $\\frac{n}{2}$ 队（根据排名）进入淘汰赛阶段。\n\n积分榜是按照以下原则制作的：胜利一个队得 $3$ 分，平分 $1$ 分，失败 $0$ 分。首先，球队按积分顺序排在积分榜上，分数相等比较净胜球，净胜球相等比较进球数。\n\n你被要求写一个程序，通过给定的比赛名单和所有比赛的结果，找到设法进入淘汰赛阶段的球队名单。\n\n## 输入格式\n第一个输入行包含唯一的整数 $n(1 \\le n \\le 50)$表示参加世界杯决赛的球队数量。 \n\n以下 $n$ 行，包含这些团队的名称，名称是一个包含小写和大写拉丁字母的字符串，其长度不超过 $30$ 个字符。\n\n以下的 $\\frac{n\\times(n-1)}{2}$ 行描述格式为 $\\text{name1-name2  num1:num2}$，其中 $\\text{name1,name2}$ 为团队名称；$\\text{num1,num2} (0 \\le \\text{num1,num2} \\le 100) $ 为相应的队伍得分。 数据保证没有两支球队名字相同，没有比赛一个球队与自己打球，任意两个球队只会比赛一次。\n\n## 输出格式\n按照字典顺序输出 $\\frac{n}{2}$ 行进入淘汰赛阶段的球队的名字，在一个单独的行中输出每支球队名称。数据保证结果唯一。\nTranslated by @Youngsc、@艾因斯坦 "
}