{
    "description": "They say that Berland has exactly two problems, fools and roads. Besides, Berland has $ n $ cities, populated by the fools and connected by the roads. All Berland roads are bidirectional. As there are many fools in Berland, between each pair of cities there is a path (or else the fools would get upset). Also, between each pair of cities there is no more than one simple path (or else the fools would get lost).\n\nBut that is not the end of Berland's special features. In this country fools sometimes visit each other and thus spoil the roads. The fools aren't very smart, so they always use only the simple paths.\n\nA simple path is the path which goes through every Berland city not more than once.\n\nThe Berland government knows the paths which the fools use. Help the government count for each road, how many distinct fools can go on it.\n\nNote how the fools' paths are given in the input.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2<=n<=10^{5} $ ) — the number of cities.\n\nEach of the next $ n-1 $ lines contains two space-separated integers $ u_{i},v_{i} $ ( $ 1<=u_{i},v_{i}<=n $ , $ u_{i}≠v_{i} $ ), that means that there is a road connecting cities $ u_{i} $ and $ v_{i} $ .\n\nThe next line contains integer $ k $ ( $ 0<=k<=10^{5} $ ) — the number of pairs of fools who visit each other.\n\nNext $ k $ lines contain two space-separated numbers. The $ i $ -th line $ (i>0) $ contains numbers $ a_{i},b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ ). That means that the fool number $ 2i-1 $ lives in city $ a_{i} $ and visits the fool number $ 2i $ , who lives in city $ b_{i} $ . The given pairs describe simple paths, because between every pair of cities there is only one simple path.",
    "outputFormat": "Print $ n-1 $ integer. The integers should be separated by spaces. The $ i $ -th number should equal the number of fools who can go on the $ i $ -th road. The roads are numbered starting from one in the order, in which they occur in the input.",
    "samples": [
        [
            "5\n1 2\n1 3\n2 4\n2 5\n2\n1 4\n3 5\n",
            "2 1 1 1 \n"
        ],
        [
            "5\n3 4\n4 5\n1 4\n2 4\n3\n2 3\n1 3\n3 5\n",
            "3 1 1 1 \n"
        ]
    ],
    "hint": "In the first sample the fool number one goes on the first and third road and the fool number 3 goes on the second, first and fourth ones.\n\nIn the second sample, the fools number 1, 3 and 5 go on the first road, the fool number 5 will go on the second road, on the third road goes the fool number 3, and on the fourth one goes fool number 1.",
    "translation": "## 题目描述\n\n有一颗 $n$  个节点的树，$k$  次旅行，问每一条边被走过的次数。\n\n## 输入格式\n\n第一行一个整数 $n$  （$2\\leq n\\leq 10^5$ ）。\n\n接下来 $n-1$  行，每行两个正整数 $x,y$  （$1\\leq x,y\\leq n,x\\neq y$ ），表示 $x$  与 $y$  之间有一条连边。\n\n接下来一个整数 $k$  （$0\\leq k\\leq 10^5$ ）。\n\n接下来 $k$  行，每行两个正整数 $x,y$  （$1\\leq x,y\\leq n$ ），表示有一个从 $x$  到 $y$  的旅行。\n\n## 输出格式\n\n总共 $n-1$  行，按输入顺序输出每一条边被走过的次数。\n\nTranslated by @larryzhong "
}