{
    "description": "You've got a rectangular table with length $ a $ and width $ b $ and the infinite number of plates of radius $ r $ . Two players play the following game: they take turns to put the plates on the table so that the plates don't lie on each other (but they can touch each other), and so that any point on any plate is located within the table's border. During the game one cannot move the plates that already lie on the table. The player who cannot make another move loses. Determine which player wins, the one who moves first or the one who moves second, provided that both players play optimally well.",
    "inputFormat": "A single line contains three space-separated integers $ a $ , $ b $ , $ r $ $ (1<=a,b,r<=100) $ — the table sides and the plates' radius, correspondingly.",
    "outputFormat": "If wins the player who moves first, print \"First\" (without the quotes). Otherwise print \"Second\" (without the quotes).",
    "samples": [
        [
            "5 5 2\n",
            "First\n"
        ],
        [
            "6 7 4\n",
            "Second\n"
        ]
    ],
    "hint": "In the first sample the table has place for only one plate. The first player puts a plate on the table, the second player can't do that and loses.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF197A/616ddb445b80df1d3e6e847cff2f0e32d4fd3dd4.png)In the second sample the table is so small that it doesn't have enough place even for one plate. So the first player loses without making a single move.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF197A/c6393d7d89b7426c75efde7ce23de7dae72901f3.png)",
    "translation": "\n\n你有一个长方形的桌子，长度 a ,宽度 b ,以及无限多的半径 r的圆盘。\n\n两位玩家玩以下游戏：他们轮流把圆盘放在桌子上，使得盘子之间不能互相重叠(但他们的边缘可以互相接触)，任何盘子上的任何点都位于桌子的边界内（也就是盘子的任意一部分不能悬空）。在比赛中，人们不能移动已经摆在桌子上的盘子。不能再往桌子上合法的摆圆盘的玩家输。\n\n你的任务是确定哪个玩家赢了，先放圆盘的玩家称为“First”，后放圆盘的玩家称为“Second”，当然两个球员都发挥得最好。\n"
}