{
    "description": "You've gotten an $ n×m $ sheet of squared paper. Some of its squares are painted. Let's mark the set of all painted squares as $ A $ . Set $ A $ is connected. Your task is to find the minimum number of squares that we can delete from set $ A $ to make it not connected.\n\nA set of painted squares is called connected, if for every two squares $ a $ and $ b $ from this set there is a sequence of squares from the set, beginning in $ a $ and ending in $ b $ , such that in this sequence any square, except for the last one, shares a common side with the square that follows next in the sequence. An empty set and a set consisting of exactly one square are connected by definition.",
    "inputFormat": "The first input line contains two space-separated integers $ n $ and $ m $ ( $ 1<=n,m<=50 $ ) — the sizes of the sheet of paper.\n\nEach of the next $ n $ lines contains $ m $ characters — the description of the sheet of paper: the $ j $ -th character of the $ i $ -th line equals either \"#\", if the corresponding square is painted (belongs to set $ A $ ), or equals \".\" if the corresponding square is not painted (does not belong to set $ A $ ). It is guaranteed that the set of all painted squares $ A $ is connected and isn't empty.",
    "outputFormat": "On the first line print the minimum number of squares that need to be deleted to make set $ A $ not connected. If it is impossible, print -1.",
    "samples": [
        [
            "5 4\n####\n#..#\n#..#\n#..#\n####\n",
            "2\n"
        ],
        [
            "5 5\n#####\n#...#\n#####\n#...#\n#####\n",
            "2\n"
        ]
    ],
    "hint": "In the first sample you can delete any two squares that do not share a side. After that the set of painted squares is not connected anymore.\n\nThe note to the second sample is shown on the figure below. To the left there is a picture of the initial set of squares. To the right there is a set with deleted squares. The deleted squares are marked with crosses.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF193A/cc2de3ad5afd093ec1251f928cbdde2a451e56d2.png)",
    "translation": "### 题目背景\r\n你有一块n×m的方格纸。其中有一些方格已被涂上颜色。\r\n我们把已被涂上颜色的方格全部放入一个集合A内，A中所有的方格都是相互联通的（联通即任意两个方格之间都存在一条路径 路径上的每一个方格都是已涂上颜色的，并且每一个方格都与前一个方格有一条公共边）。\r\n我们想知道 最少删除多少个方格 才能使这张方格纸上有颜色的方格不再联通。\r\n根据定义，只有一个方格的集合或者不包含任何方格的集合也是联通的。\r\n\r\n### 输入\r\n输入第一行包含两个数 n和m 分别代表方格纸的高和宽\r\n接下来的n行 每行有m个字符：\r\n“#”表示已被涂色的方格；\r\n“.”表示未被涂色的方格。\r\n输入的方格纸保证所有有颜色的方格都是相互连通的。\r\n\r\n### 输出\r\n输出最少需要删除几个方格才能使图变得不联通，\r\n假如无法做到 输出-1。\r\n"
}