{
    "description": "One day the Codeforces round author sat exams. He had $ n $ exams and he needed to get an integer from $ 2 $ to $ 5 $ for each exam. He will have to re-sit each failed exam, i.e. the exam that gets mark $ 2 $ .\n\nThe author would need to spend too much time and effort to make the sum of his marks strictly more than $ k $ . That could have spoilt the Codeforces round. On the other hand, if the sum of his marks is strictly less than $ k $ , the author's mum won't be pleased at all.\n\nThe Codeforces authors are very smart and they always get the mark they choose themselves. Also, the Codeforces authors just hate re-sitting exams.\n\nHelp the author and find the minimum number of exams he will have to re-sit if he passes the exams in the way that makes the sum of marks for all $ n $ exams equal exactly $ k $ .",
    "inputFormat": "The single input line contains space-separated integers $ n $ and $ k $ ( $ 1<=n<=50 $ , $ 1<=k<=250 $ ) — the number of exams and the required sum of marks.\n\nIt is guaranteed that there exists a way to pass $ n $ exams in the way that makes the sum of marks equal exactly $ k $ .",
    "outputFormat": "Print the single number — the minimum number of exams that the author will get a $ 2 $ for, considering that the sum of marks for all exams must equal $ k $ .",
    "samples": [
        [
            "4 8\n",
            "4\n"
        ],
        [
            "4 10\n",
            "2\n"
        ],
        [
            "1 3\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample the author has to get a $ 2 $ for all his exams.\n\nIn the second sample he should get a $ 3 $ for two exams and a $ 2 $ for two more.\n\nIn the third sample he should get a $ 3 $ for one exam.",
    "translation": "codefoces的一个作者参加了sat考试，现在给出他考试的科目数与他的总成绩，试问这位作者他最少有几个科目为2分（每科考试的分数为2到5分）"
}