{
    "description": "One day Vasya heard a story: \"In the city of High Bertown a bus number 62 left from the bus station. It had $ n $ grown-ups and $ m $ kids...\"\n\nThe latter events happen to be of no importance to us. Vasya is an accountant and he loves counting money. So he wondered what maximum and minimum sum of money these passengers could have paid for the ride.\n\nThe bus fare equals one berland ruble in High Bertown. However, not everything is that easy — no more than one child can ride for free with each grown-up passenger. That means that a grown-up passenger who rides with his $ k $ $ (k&gt;0) $ children, pays overall $ k $ rubles: a ticket for himself and $ (k-1) $ tickets for his children. Also, a grown-up can ride without children, in this case he only pays one ruble.\n\nWe know that in High Bertown children can't ride in a bus unaccompanied by grown-ups.\n\nHelp Vasya count the minimum and the maximum sum in Berland rubles, that all passengers of this bus could have paid in total.",
    "inputFormat": "The input file consists of a single line containing two space-separated numbers $ n $ and $ m $ $ (0<=n,m<=10^{5}) $ — the number of the grown-ups and the number of the children in the bus, correspondingly.",
    "outputFormat": "If $ n $ grown-ups and $ m $ children could have ridden in the bus, then print on a single line two space-separated integers — the minimum and the maximum possible total bus fare, correspondingly.\n\nOtherwise, print \"Impossible\" (without the quotes).",
    "samples": [
        [
            "1 2\n",
            "2 2"
        ],
        [
            "0 5\n",
            "Impossible"
        ],
        [
            "2 2\n",
            "2 3"
        ]
    ],
    "hint": "In the first sample a grown-up rides with two children and pays two rubles.\n\nIn the second sample there are only children in the bus, so the situation is impossible.\n\n In the third sample there are two cases: - Each of the two grown-ups rides with one children and pays one ruble for the tickets. In this case the passengers pay two rubles in total.\n- One of the grown-ups ride with two children's and pays two rubles, the another one rides alone and pays one ruble for himself. So, they pay three rubles in total.",
    "translation": "**题目描述**\n--\n\n一天，Vasya 听到一个故事，它说：“在 High Bertown 城，一辆 $62$ 路公交车带着 $n$ 位大人和 $m$ 位小孩，从公交车站开了出来……”\n\n至于那些后续，都是无关紧要的。Vasya 是一位会计，而且他很享受数钱数到手抽经的快感。因此，他想知道这趟车上的这些乘客所付车票钱的最小值和最大值是多少\n\n在 High Bertown 城，公交车的车票为 $1$ 卢布 。但是，那么简单的题目想都别想遇到—— $1$ 位大人可以免票带 $1$ 位小孩。这意味着 $1$ 位大人和 $k$ 个小孩共同乘车，总的需要 $k$ 卢布的车票；他自己需要 $1$ 张车票，孩子们需要 $(k-1)$  张。除此之外，大人们可以不带孩子乘车，这样他们就只要支付自己的 $1$ 卢布车票钱。\n\n同时，我们还知道在 High Bertown 城，孩子们不能在没有大人的陪同下单独乘车。\n\n请你帮帮 Vasya 计算一下这辆车上乘客需付金额总和的最小值和最大值。\n\n---\n\n**输入输出格式**\n---\n\n**输入格式：**\n\n输入文件包括一行两个整数 $n$ 和 $m$ $(0\\leq n,m\\leq 10^5)$ 。其相互对应车上大人和小孩的人数。\n\n**输出格式：**\n\n如果 $n$ 位大人和 $m$ 位孩子乘车的情况合法，则在一行内输出以空格分隔的两个整数——最小值和最大值。\n\n否则，输出\"Impossible\"(不含引号)。\n\n---\n\n**说明**\n---\n\n在第一个样例中， $1$ 位大人和 $2$ 位孩子乘车，不管怎么样，都需要支付 $2$ 卢布。\n\n在第二个样例中，只有孩子乘车是不合法的。\n\n在第三个样例中，有两种情况：\n\n1.  $2$ 位大人各带 $1$ 位小孩，各付 $1$ 卢布车票钱。此时，乘客们一共支付了 $2$ 卢布。\n\n2. 另一种情况下，一位大人带 $2$ 位孩子，支付 $2$ 卢布车票钱；另一位独自乘车，花费 $1$ 卢布。因此，他们一共支付了 $3$ 卢布。"
}