{
    "description": "So, the Berland is at war with its eternal enemy Flatland again, and Vasya, an accountant, was assigned to fulfil his duty to the nation.\n\nRight now the situation in Berland is dismal — their both cities are surrounded! The armies of flatlanders stand on the borders of circles, the circles' centers are in the surrounded cities. At any moment all points of the flatland ring can begin to move quickly in the direction of the city — that's the strategy the flatlanders usually follow when they besiege cities.\n\nThe berlanders are sure that they can repel the enemy's attack if they learn the exact time the attack starts. For that they need to construct a radar that would register any movement at the distance of at most $ r $ from it. Thus, we can install a radar at such point, that at least one point of the enemy ring will be in its detecting range (that is, at a distance of at most $ r $ ). Then the radar can immediately inform about the enemy's attack.\n\nDue to the newest technologies, we can place a radar at any point without any problems. But the problem is that the berlanders have the time to make only one radar. Besides, the larger the detection radius $ (r) $ is, the more the radar costs.\n\nThat's why Vasya's task (that is, your task) is to find the minimum possible detection radius for the radar. In other words, your task is to find the minimum radius $ r $ $ (r>=0) $ such, that a radar with radius $ r $ can be installed at some point and it can register the start of the movements of both flatland rings from that point.\n\nIn this problem you can consider the cities as material points, the attacking enemy rings - as circles with centers in the cities, the radar's detection range — as a disk (including the border) with the center at the point where the radar is placed.",
    "inputFormat": "The input files consist of two lines. Each line represents the city and the flatland ring that surrounds it as three space-separated integers $ x_{i} $ , $ y_{i} $ , $ r_{i} $ $ (|x_{i}|,|y_{i}|<=10^{4}; 1<=r_{i}<=10^{4}) $ — the city's coordinates and the distance from the city to the flatlanders, correspondingly.\n\nIt is guaranteed that the cities are located at different points.",
    "outputFormat": "Print a single real number — the minimum detection radius of the described radar. The answer is considered correct if the absolute or relative error does not exceed $ 10^{-6} $ .",
    "samples": [
        [
            "0 0 1\n6 0 3\n",
            "1.000000000000000"
        ],
        [
            "-10 10 3\n10 -10 3\n",
            "11.142135623730951"
        ]
    ],
    "hint": "The figure below shows the answer to the first sample. In this sample the best decision is to put the radar at point with coordinates $ (2,0) $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF190B/d8b028b093bb3a5b506b76e0b869d1e14653f9f5.png)The figure below shows the answer for the second sample. In this sample the best decision is to put the radar at point with coordinates $ (0,0) $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF190B/621697dde00296bbf818d1a40e69e6ac2914a652.png)",
    "translation": "给出两个圆的位置和半径，输出第三个圆连接其他两个圆的最小半径"
}