{
    "description": "You are given a tree with $ n $ vertexes and $ n $ points on a plane, no three points lie on one straight line.\n\nYour task is to paint the given tree on a plane, using the given points as vertexes.\n\nThat is, you should correspond each vertex of the tree to exactly one point and each point should correspond to a vertex. If two vertexes of the tree are connected by an edge, then the corresponding points should have a segment painted between them. The segments that correspond to non-adjacent edges, should not have common points. The segments that correspond to adjacent edges should have exactly one common point.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=1500 $ ) — the number of vertexes on a tree (as well as the number of chosen points on the plane).\n\nEach of the next $ n-1 $ lines contains two space-separated integers $ u_{i} $ and $ v_{i} $ ( $ 1<=u_{i},v_{i}<=n $ , $ u_{i}≠v_{i} $ ) — the numbers of tree vertexes connected by the $ i $ -th edge.\n\nEach of the next $ n $ lines contain two space-separated integers $ x_{i} $ and $ y_{i} $ ( $ -10^{9}<=x_{i},y_{i}<=10^{9} $ ) — the coordinates of the $ i $ -th point on the plane. No three points lie on one straight line.\n\nIt is guaranteed that under given constraints problem has a solution.",
    "outputFormat": "Print $ n $ distinct space-separated integers from $ 1 $ to $ n $ : the $ i $ -th number must equal the number of the vertex to place at the $ i $ -th point (the points are numbered in the order, in which they are listed in the input).\n\nIf there are several solutions, print any of them.",
    "samples": [
        [
            "3\n1 3\n2 3\n0 0\n1 1\n2 0\n",
            "1 3 2\n"
        ],
        [
            "4\n1 2\n2 3\n1 4\n-1 -2\n3 5\n-3 3\n2 0\n",
            "4 2 1 3\n"
        ]
    ],
    "hint": "The possible solutions for the sample are given below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF196C/a95f8b6fcfb254d1f8656b062aef9bc93b0460d0.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF196C/dfe0db226de1aa42fb5962aa07f4d0c31fb72c9c.png)",
    "translation": "给你一棵$n$个点的树和$n$个平面直角坐标系上的点，现在要把树上的$n$个点映射到坐标系中的$n$个点上。要求是除了在顶点处不能有线段相交。\r\n\r\n输入格式：   \r\n第一行$n$。   \r\n后面$n-1$行表示了一棵树，再后面$n$行表示坐标系的$n$个点。   \r\n\r\n输出格式：   \r\n$n$个数，表示每个树节点对应坐标系中点的序号。"
}