{
    "description": "In Berland the opposition is going to arrange mass walking on the boulevard. The boulevard consists of $ n $ tiles that are lain in a row and are numbered from $ 1 $ to $ n $ from right to left. The opposition should start walking on the tile number $ 1 $ and the finish on the tile number $ n $ . During the walk it is allowed to move from right to left between adjacent tiles in a row, and jump over a tile. More formally, if you are standing on the tile number $ i $ $ (i&lt;n-1) $ , you can reach the tiles number $ i+1 $ or the tile number $ i+2 $ from it (if you stand on the tile number $ n-1 $ , you can only reach tile number $ n $ ). We can assume that all the opposition movements occur instantaneously.\n\nIn order to thwart an opposition rally, the Berland bloody regime organized the rain. The tiles on the boulevard are of poor quality and they are rapidly destroyed in the rain. We know that the $ i $ -th tile is destroyed after $ a_{i} $ days of rain (on day $ a_{i} $ tile isn't destroyed yet, and on day $ a_{i}+1 $ it is already destroyed). Of course, no one is allowed to walk on the destroyed tiles! So the walk of the opposition is considered thwarted, if either the tile number $ 1 $ is broken, or the tile number $ n $ is broken, or it is impossible to reach the tile number $ n $ from the tile number $ 1 $ if we can walk on undestroyed tiles.\n\nThe opposition wants to gather more supporters for their walk. Therefore, the more time they have to pack, the better. Help the opposition to calculate how much time they still have and tell us for how many days the walk from the tile number $ 1 $ to the tile number $ n $ will be possible.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=10^{3} $ ) — the boulevard's length in tiles.\n\nThe second line contains $ n $ space-separated integers $ a_{i} $ — the number of days after which the $ i $ -th tile gets destroyed ( $ 1<=a_{i}<=10^{3} $ ).",
    "outputFormat": "Print a single number — the sought number of days.",
    "samples": [
        [
            "4\n10 3 5 10\n",
            "5\n"
        ],
        [
            "5\n10 2 8 3 5\n",
            "5\n"
        ]
    ],
    "hint": "In the first sample the second tile gets destroyed after day three, and the only path left is $ 1→3→4 $ . After day five there is a two-tile gap between the first and the last tile, you can't jump over it.\n\nIn the second sample path $ 1→3→5 $ is available up to day five, inclusive. On day six the last tile is destroyed and the walk is thwarted.",
    "translation": "有一条从 $1$ 到 $n$ 的路，第 $i$ 块瓦片会在第 $a_i$ 天结束时损坏。\n\n你可以跳一格者跳两格，准确地说，如果你在第 $i$ 格瓦片$(i<n − 1)$，你可以到达 $i+1$ 格或 $i+2$ 格。\n\n特别地，如果你在 $n−1$ 格，那么你只可以跳一格。\n\n求最晚的可以从 $1$ 到达 $n$ 的天数。"
}