{
    "description": "Any resemblance to any real championship and sport is accidental.\n\nThe Berland National team takes part in the local Football championship which now has a group stage. Let's describe the formal rules of the local championship:\n\n- the team that kicked most balls in the enemy's goal area wins the game;\n- the victory gives 3 point to the team, the draw gives 1 point and the defeat gives 0 points;\n- a group consists of four teams, the teams are ranked by the results of six games: each team plays exactly once with each other team;\n- the teams that get places 1 and 2 in the group stage results, go to the next stage of the championship.\n\nIn the group stage the team's place is defined by the total number of scored points: the more points, the higher the place is. If two or more teams have the same number of points, then the following criteria are used (the criteria are listed in the order of falling priority, starting from the most important one):\n\n- the difference between the total number of scored goals and the total number of missed goals in the championship: the team with a higher value gets a higher place;\n- the total number of scored goals in the championship: the team with a higher value gets a higher place;\n- the lexicographical order of the name of the teams' countries: the country with the lexicographically smaller name gets a higher place.\n\nThe Berland team plays in the group where the results of 5 out of 6 games are already known. To be exact, there is the last game left. There the Berand national team plays with some other team. The coach asks you to find such score  $ X $ : $ Y $  (where $ X $ is the number of goals Berland scored and $ Y $ is the number of goals the opponent scored in the game), that fulfills the following conditions:\n\n- $ X $ > $ Y $ , that is, Berland is going to win this game;\n- after the game Berland gets the 1st or the 2nd place in the group;\n- if there are multiple variants, you should choose such score  $ X $ : $ Y $ , where value $ X-Y $ is minimum;\n- if it is still impossible to come up with one score, you should choose the score where value $ Y $ (the number of goals Berland misses) is minimum.",
    "inputFormat": "The input has five lines.\n\nEach line describes a game as \" $ team_{1} $ $ team_{2} $ $ goals_{1} $ : $ goals_{2} $ \" (without the quotes), what means that team $ team_{1} $ played a game with team $ team_{2} $ , besides, $ team_{1} $ scored $ goals_{1} $ goals and $ team_{2} $ scored $ goals_{2} $ goals. The names of teams $ team_{1} $ and $ team_{2} $ are non-empty strings, consisting of uppercase English letters, with length of no more than 20 characters; $ goals_{1},goals_{2} $ are integers from 0 to 9.\n\nThe Berland team is called \"BERLAND\". It is guaranteed that the Berland team and one more team played exactly 2 games and the the other teams played exactly 3 games.",
    "outputFormat": "Print the required score in the last game as  $ X $ : $ Y $ , where $ X $ is the number of goals Berland scored and $ Y $ is the number of goals the opponent scored. If the Berland team does not get the first or the second place in the group, whatever this game's score is, then print on a single line \"IMPOSSIBLE\" (without the quotes).\n\nNote, that the result score can be very huge, 10:0 for example.",
    "samples": [
        [
            "AERLAND DERLAND 2:1\nDERLAND CERLAND 0:3\nCERLAND AERLAND 0:1\nAERLAND BERLAND 2:0\nDERLAND BERLAND 4:0\n",
            "6:0\n"
        ],
        [
            "AERLAND DERLAND 2:2\nDERLAND CERLAND 2:3\nCERLAND AERLAND 1:3\nAERLAND BERLAND 2:1\nDERLAND BERLAND 4:1\n",
            "IMPOSSIBLE\n"
        ]
    ],
    "hint": "In the first sample \"BERLAND\" plays the last game with team \"CERLAND\". If Berland wins with score 6:0, the results' table looks like that in the end:\n\n1. AERLAND (points: 9, the difference between scored and missed goals: 4, scored goals: 5)\n2. BERLAND (points: 3, the difference between scored and missed goals: 0, scored goals: 6)\n3. DERLAND (points: 3, the difference between scored and missed goals: 0, scored goals: 5)\n4. CERLAND (points: 3, the difference between scored and missed goals: -4, scored goals: 3)\n\nIn the second sample teams \"AERLAND\" and \"DERLAND\" have already won 7 and 4 points, respectively. The Berland team wins only 3 points, which is not enough to advance to the next championship stage.",
    "translation": "这个题目是说，Berland的国家队成功加入一场足球联赛的半决赛。下面是球赛的规则：\r\n\r\n**·** 两队比赛，比赛结束后哪支队伍进的球比对方队伍多，哪方获胜。\r\n\r\n**·** 胜利得3分，平局两队各得1分，失败不得分（得0分）。\r\n\r\n**·** 这四队中得到第一或第二的队伍进入下一轮。\r\n\r\n每个队伍的名次是由总得分来算的：分越多，名次越高。如果两个队伍有同样的分，以下列方式来决定高低（越靠前的规则越优先考虑，如果还是不能分出高低，再往下判断。下列第一个权重最高）：\r\n\r\n**·** 每个队的进球数减去失球数，得到的结果越高排名就越高。\r\n\r\n**·** 总进球数越高，排名就越高。\r\n\r\n**·** 如果以上都不行的话，则以字典序排列。\r\n\r\n现在还有一场比赛未打。一共6场比赛，已知前五场的队伍与得分。某个队伍和Berland还没交战。教练想让你找到如此X:Y（X是Berland的得分，Y是另一只球队的得分），可以满足下列条件：\r\n\r\n**·** X>Y，Berland得赢；\r\n\r\n**·** Berland赢后，得进前二名；\r\n\r\n**·** 如果不止一种答案，尽可能让X-Y小；\r\n\r\n**·** 如果还是有很多答案（不止一个），你应该让Y尽可能小。\r\n\r\n输入格式：\r\n\r\n一共有五行。\r\n\r\n每一行都是以“team1 team2 goals1:goals2”（没引号）形式出现。表示team1跟team2交战一局。team1进了goal1个球，team2进了goal2个球。team1和team2都是非空字符串，并且都是大写字母，总长度不超过20。goal1和goal2都是0~9的正整数。\r\n\r\nBerland队名字是\"BERLAND\"。保证只有Berland和另一支队伍打了2场比赛，其他队打了3场。\r\n\r\n输出格式：\r\n\r\n输出比分X:Y。X是Berland分数，Y是另一只球队的分数。如果怎么样也无法得到第一或第二，输出一行\"IMPOSSIBLE\"（没引号）。\r\n\r\n提示：最后一场分数也不一定小，比如10:0这种情况。"
}