{
    "description": "Little Vasya loves orange juice very much. That's why any food and drink in his kitchen necessarily contains orange juice. There are $ n $ drinks in his fridge, the volume fraction of orange juice in the $ i $ -th drink equals $ p_{i} $ percent.\n\nOne day Vasya decided to make himself an orange cocktail. He took equal proportions of each of the $ n $ drinks and mixed them. Then he wondered, how much orange juice the cocktail has.\n\nFind the volume fraction of orange juice in the final drink.",
    "inputFormat": "The first input line contains a single integer $ n $ ( $ 1<=n<=100 $ ) — the number of orange-containing drinks in Vasya's fridge. The second line contains $ n $ integers $ p_{i} $ ( $ 0<=p_{i}<=100 $ ) — the volume fraction of orange juice in the $ i $ -th drink, in percent. The numbers are separated by a space.",
    "outputFormat": "Print the volume fraction in percent of orange juice in Vasya's cocktail. The answer will be considered correct if the absolute or relative error does not exceed $ 10^{-4} $ .",
    "samples": [
        [
            "3\n50 50 100\n",
            "66.666666666667\n"
        ],
        [
            "4\n0 25 50 75\n",
            "37.500000000000\n"
        ]
    ],
    "hint": "Note to the first sample: let's assume that Vasya takes $ x $ milliliters of each drink from the fridge. Then the volume of pure juice in the cocktail will equal ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF200B/7c2a6a8bbcdbfef1f9a32c2eb1f7549c3c17c619.png) milliliters. The total cocktail's volume equals $ 3·x $ milliliters, so the volume fraction of the juice in the cocktail equals ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF200B/cc3d21395b67607dff0b7baa3b0b870221e3352d.png), that is, $ 66.(6) $ percent.",
    "translation": "题目描述：\n\n小瓦斯雅有n杯橙汁饮料，第i杯饮料中橙汁所占体积分数为pi%，有一天，他决定做一杯混合饮料。他从每杯饮料中取相同比例的饮料并将它们混合在一起，然后他想知道混合饮料中含有多少橙汁。输出最终橙汁所占的体积分数。\n\n输入描述：\n\n第一行整数n，接下来n个整数pi\n\n输出描述：\n\n橙汁占的体积分数（当你输出的答案与标准答案绝对值相差不超过0.0001时，输出正确）"
}