{
    "description": "The Little Elephant loves Ukraine very much. Most of all he loves town Rozdol (ukr. \"Rozdil\").\n\nHowever, Rozdil is dangerous to settle, so the Little Elephant wants to go to some other town. The Little Elephant doesn't like to spend much time on travelling, so for his journey he will choose a town that needs minimum time to travel to. If there are multiple such cities, then the Little Elephant won't go anywhere.\n\nFor each town except for Rozdil you know the time needed to travel to this town. Find the town the Little Elephant will go to or print \"Still Rozdil\", if he stays in Rozdil.",
    "inputFormat": "The first line contains a single integer $ n $ $ (1<=n<=10^{5}) $ — the number of cities. The next line contains $ n $ integers, separated by single spaces: the $ i $ -th integer represents the time needed to go from town Rozdil to the $ i $ -th town. The time values are positive integers, not exceeding $ 10^{9} $ .\n\nYou can consider the cities numbered from $ 1 $ to $ n $ , inclusive. Rozdil is not among the numbered cities.",
    "outputFormat": "Print the answer on a single line — the number of the town the Little Elephant will go to. If there are multiple cities with minimum travel time, print \"Still Rozdil\" (without the quotes).",
    "samples": [
        [
            "2\n7 4\n",
            "2\n"
        ],
        [
            "7\n7 4 47 100 4 9 12\n",
            "Still Rozdil\n"
        ]
    ],
    "hint": "In the first sample there are only two cities where the Little Elephant can go. The travel time for the first town equals $ 7 $ , to the second one — $ 4 $ . The town which is closest to Rodzil (the only one) is the second one, so the answer is $ 2 $ .\n\nIn the second sample the closest cities are cities two and five, the travelling time to both of them equals $ 4 $ , so the answer is \"Still Rozdil\".",
    "translation": "有一头小象住在 $\\texttt{Rozdil}$ 小镇里，它想去其他的小镇旅行。\n\n这个国家一共有 $n$ 个小镇，第 $i$ 个小镇距离 $\\texttt{Rozdil}$ 小镇的距离为 $a_i$。小象想去往离 $\\texttt{Rozdil}$ 最近的小镇，但是，如果这样的小镇不止一个的话，那么小象就会继续待在 $\\texttt{Rozdil}$。\n\n现在，它想问你这个距离 $\\texttt{Rozdil}$ 最近的小镇的编号，或者，如果这样的小镇不止一个的话，请输出 $\\texttt{Still Rozdil}$。\n\n---\n一句话题意：给出 $n$ 个数 $a_1,a_2,...,a_n$，请找到最小的数的编号，如果最小数有多个，输出 $\\texttt{Still Rozdil}$。\n\n**数据范围：$1\\leqslant n\\leqslant 10^5,1\\leqslant a_i\\leqslant 10^9$。**"
}