{
    "description": "Vasya, like many others, likes to participate in a variety of sweepstakes and lotteries. Now he collects wrappings from a famous chocolate bar \"Jupiter\". According to the sweepstake rules, each wrapping has an integer written on it — the number of points that the participant adds to his score as he buys the bar. After a participant earns a certain number of points, he can come to the prize distribution center and exchange the points for prizes. When somebody takes a prize, the prize's cost is simply subtracted from the number of his points.\n\nVasya didn't only bought the bars, he also kept a record of how many points each wrapping cost. Also, he remembers that he always stucks to the greedy strategy — as soon as he could take at least one prize, he went to the prize distribution centre and exchanged the points for prizes. Moreover, if he could choose between multiple prizes, he chose the most expensive one. If after an exchange Vasya had enough points left to get at least one more prize, then he continued to exchange points.\n\nThe sweepstake has the following prizes (the prizes are sorted by increasing of their cost):\n\n- a mug (costs $ a $ points),\n- a towel (costs $ b $ points),\n- a bag (costs $ c $ points),\n- a bicycle (costs $ d $ points),\n- a car (costs $ e $ points).\n\nNow Vasya wants to recollect what prizes he has received. You know sequence $ p_{1},p_{2},...,p_{n} $ , where $ p_{i} $ is the number of points Vasya got for the $ i $ -th bar. The sequence of points is given in the chronological order. You also know numbers $ a $ , $ b $ , $ c $ , $ d $ , $ e $ . Your task is to find, how many prizes Vasya received, what prizes they are and how many points he's got left after all operations are completed.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=50 $ ) — the number of chocolate bar wrappings that brought points to Vasya. The second line contains space-separated integers $ p_{1},p_{2},...,p_{n} $ ( $ 1<=p_{i}<=10^{9} $ ). The third line contains 5 integers $ a $ , $ b $ , $ c $ , $ d $ , $ e $ ( $ 1<=a&lt;b&lt;c&lt;d&lt;e<=10^{9} $ ) — the prizes' costs.",
    "outputFormat": "Print on the first line 5 integers, separated by a space — the number of mugs, towels, bags, bicycles and cars that Vasya has got, respectively. On the second line print a single integer — the number of points Vasya will have left after all operations of exchange are completed.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "3\n3 10 4\n2 4 10 15 20\n",
            "1 1 1 0 0 \n1\n"
        ],
        [
            "4\n10 4 39 2\n3 5 10 11 12\n",
            "3 0 1 0 3 \n0\n"
        ]
    ],
    "hint": "In the first sample Vasya gets $ 3 $ points after eating the first chocolate bar. Then he exchanges $ 2 $ points and gets a mug. Vasya wins a bag after eating the second chocolate bar. Then he wins a towel after eating the third chocolate bar. After all chocolate bars $ 3-2+10-10+4-4=1 $ points remains.",
    "translation": "## 题意\n你有 n 块巧克力可以吃，每块巧克力包装背后有一个积分，要用这些积分去换 5 种不同价格的礼物。你每次只能吃一块，吃完后去换礼物，要求先换价格尽量高的礼物，然后要把积分尽量用完，用不完的积分可以留在下一次和下一个积分合并再用。请输出能换到每种礼物的数量和剩余的积分。\n## 输入格式\n第一行包含一个整数 n ( 1≤n≤50 ) — 表示巧克力的数量。\n\n第二行包含 n 个空格分隔的整数 $p1$ , $p2$ , ... , $pn$。 ( 1≤ 所有的数 ≤10的9次方 )，分别表示每个巧克力的积分。\n第三行包含 5 个整数 a , b , c , d , e ( 1≤a<b<c<d<e≤10的9次方) ，分别礼物的价格。\n\n## 输出格式\n第一行输出 5 个整数，依次表示能换到每种礼物的数量。\n\n在输出一个整数，表示完成所有兑换操作后 Vasya 剩余的积分。\n\n翻译：Xuorange"
}