{
    "description": "Vasya works as a DJ in the best Berland nightclub, and he often uses dubstep music in his performance. Recently, he has decided to take a couple of old songs and make dubstep remixes from them.\n\nLet's assume that a song consists of some number of words. To make the dubstep remix of this song, Vasya inserts a certain number of words \"WUB\" before the first word of the song (the number may be zero), after the last word (the number may be zero), and between words (at least one between any pair of neighbouring words), and then the boy glues together all the words, including \"WUB\", in one string and plays the song at the club.\n\nFor example, a song with words \"I AM X\" can transform into a dubstep remix as \"WUBWUBIWUBAMWUBWUBX\" and cannot transform into \"WUBWUBIAMWUBX\".\n\nRecently, Petya has heard Vasya's new dubstep track, but since he isn't into modern music, he decided to find out what was the initial song that Vasya remixed. Help Petya restore the original song.",
    "inputFormat": "The input consists of a single non-empty string, consisting only of uppercase English letters, the string's length doesn't exceed $ 200 $ characters. It is guaranteed that before Vasya remixed the song, no word contained substring \"WUB\" in it; Vasya didn't change the word order. It is also guaranteed that initially the song had at least one word.",
    "outputFormat": "Print the words of the initial song that Vasya used to make a dubsteb remix. Separate the words with a space.",
    "samples": [
        [
            "WUBWUBABCWUB\n",
            "ABC "
        ],
        [
            "WUBWEWUBAREWUBWUBTHEWUBCHAMPIONSWUBMYWUBFRIENDWUB\n",
            "WE ARE THE CHAMPIONS MY FRIEND "
        ]
    ],
    "hint": "In the first sample: \"WUBWUBABCWUB\" = \"WUB\" + \"WUB\" + \"ABC\" + \"WUB\". That means that the song originally consisted of a single word \"ABC\", and all words \"WUB\" were added by Vasya.\n\nIn the second sample Vasya added a single word \"WUB\" between all neighbouring words, in the beginning and in the end, except for words \"ARE\" and \"THE\" — between them Vasya added two \"WUB\".",
    "translation": "## 题目翻译\nVasya有一句歌词(可能含有空格)，他在第一个单词之前和最后一个单词之后加上若干(可以为0)个\"WUB\",再每个单词之间加上若干(至少为1)个\"WUB\"，转变成一个新的字符串(无空格)\n如\"I AM X\" 可以变成 \"WUBWUBIWUBAMWUBWUBX\" 而不能变成 \"WUBWUBIAMWUBX\"\n现在给出转变后的字符串，求出原来的字符串\n## 输入格式\n输入包括一个非空字符串SSS，其中SSS仅由大写字母组成并且的长度不超过200\n保证原来的字符串不含有\"WUB\"并且至少有一个单词\n## 输出格式\n输出转变前的字符串，每个单词用空格分隔"
}