{
    "description": "Once $ n $ people simultaneously signed in to the reception at the recently opened, but already thoroughly bureaucratic organization (abbreviated TBO). As the organization is thoroughly bureaucratic, it can accept and cater for exactly one person per day. As a consequence, each of $ n $ people made an appointment on one of the next $ n $ days, and no two persons have an appointment on the same day.\n\nHowever, the organization workers are very irresponsible about their job, so none of the signed in people was told the exact date of the appointment. The only way to know when people should come is to write some requests to TBO.\n\nThe request form consists of $ m $ empty lines. Into each of these lines the name of a signed in person can be written (it can be left blank as well). Writing a person's name in the same form twice is forbidden, such requests are ignored. TBO responds very quickly to written requests, but the reply format is of very poor quality — that is, the response contains the correct appointment dates for all people from the request form, but the dates are in completely random order. Responds to all requests arrive simultaneously at the end of the day (each response specifies the request that it answers).\n\nFortunately, you aren't among these $ n $ lucky guys. As an observer, you have the following task — given $ n $ and $ m $ , determine the minimum number of requests to submit to TBO to clearly determine the appointment date for each person.",
    "inputFormat": "The first line contains a single integer $ t $ ( $ 1<=t<=1000 $ ) — the number of test cases. Each of the following $ t $ lines contains two integers $ n $ and $ m $ ( $ 1<=n,m<=10^{9} $ ) — the number of people who have got an appointment at TBO and the number of empty lines in the request form, correspondingly.",
    "outputFormat": "Print $ t $ lines, each containing an answer for the corresponding test case (in the order they are given in the input) — the minimum number of requests to submit to TBO.",
    "samples": [
        [
            "5\n4 1\n4 2\n7 3\n1 1\n42 7\n",
            "3\n2\n3\n0\n11\n"
        ]
    ],
    "hint": "In the first sample, you need to submit three requests to TBO with three different names. When you learn the appointment dates of three people out of four, you can find out the fourth person's date by elimination, so you do not need a fourth request.\n\nIn the second sample you need only two requests. Let's number the persons from $ 1 $ to $ 4 $ and mention persons $ 1 $ and $ 2 $ in the first request and persons $ 1 $ and $ 3 $ in the second request. It is easy to see that after that we can clearly determine each person's appointment date regardless of the answers obtained from TBO.\n\nIn the fourth sample only one person signed up for an appointment. He doesn't need to submit any requests — his appointment date is tomorrow.",
    "translation": "# 题目描述\n\n有n个人，每个人都有一个编号，编号范围在1-n以内，每个人的编号都不相同\n\n你每次可以去询问最多m个不同的人，他们的编号是哪些，但是你不知道编号与这m个人的对应关系\n\n现在你需要给出最少申请多少次，可以清楚知道这n个人每个人的编号\n\n# 输入格式\n\n第一行有一个整数t( 1<=t<=1000)，表示有几次询问\n\n接下来t行，每行给出对应题目的n和  m(1<=n,m<=10^9)\n\n# 输出格式\n\nt行，每行一个值，对应输入的一次询问，输出最少申请多少次知道n个人的编号"
}