{
    "description": "The capital of Berland has the only movie theater in the country. Besides, it consists of only one room. The room is divided into $ n $ rows, each row consists of $ m $ seats.\n\nThere are $ k $ people lined up to the box office, each person wants to buy exactly one ticket for his own entertainment. Before the box office started selling tickets, each person found the seat that seemed best for him and remembered it as a pair of coordinates $ (x_{i},y_{i}) $ , where $ x_{i} $ is the row number, and $ y_{i} $ is the seat number in this row.\n\nIt is possible that some people have chosen the same place, then when some people see their favorite seat taken in the plan of empty seats in the theater, they choose and buy a ticket to another place. Each of them has the following logic: let's assume that he originally wanted to buy a ticket to seat $ (x_{1},y_{1}) $ , then when he comes to the box office, he chooses such empty seat $ (x_{2},y_{2}) $ , which satisfies the following conditions:\n\n- the value of $ |x_{1}-x_{2}|+|y_{1}-y_{2}| $ is minimum\n- if the choice is not unique, then among the seats that satisfy the first condition, this person selects the one for which the value of $ x_{2} $ is minimum\n- if the choice is still not unique, among the seats that satisfy the first and second conditions, this person selects the one for which the value of $ y_{2} $ is minimum\n\nYour task is to find the coordinates of a seat for each person.",
    "inputFormat": "The first input line contains three integers $ n $ , $ m $ , $ k $ ( $ 1<=n,m<=2000 $ , $ 1<=k<=min(n·m,10^{5} $ ) — the number of rows in the room, the number of seats in each row and the number of people in the line, correspondingly. Each of the next $ k $ lines contains two integers $ x_{i} $ , $ y_{i} $ ( $ 1<=x_{i}<=n $ , $ 1<=y_{i}<=m $ ) — the coordinates of the seat each person has chosen. Numbers on the same line are separated by a space. The pairs of coordinates are located in the order, in which people stand in the line, starting from the head (the first person in the line who stands in front of the box office) to the tail (the last person in the line).",
    "outputFormat": "Print $ k $ lines, each containing a pair of integers. Print on the $ i $ -th line $ x_{i},y_{i} $ — the coordinates of the seat, for which the person who stands $ i $ -th in the line will buy the ticket.",
    "samples": [
        [
            "3 4 6\n1 1\n1 1\n1 1\n1 2\n1 3\n1 3\n",
            "1 1\n1 2\n2 1\n1 3\n1 4\n2 3\n"
        ],
        [
            "4 3 12\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n2 2\n",
            "2 2\n1 2\n2 1\n2 3\n3 2\n1 1\n1 3\n3 1\n3 3\n4 2\n4 1\n4 3\n"
        ]
    ],
    "hint": "",
    "translation": "有一个 $n \\times m$ 的 $01$ 矩阵 $A$，每个元素初始值为 $0$，共 $k$ 个操作：\n\n- 给定 $(x_0, y_0)$，求出满足条件的 $(x, y)$，输出 $(x, y)$ 并将 $A_{x, y}$ 赋值为 $1$。\n\n其中 $(x, y)$ 需满足的条件如下：\n\n- $A_{x, y} = 0$。\n- $(x, y)$ 与 $(x_0, y_0)$ 的曼哈顿距离尽可能小。\n- 满足上述两个条件的同时，优先保证 $x$ 最小，其次保证 $y$ 最小。"
}