{
    "description": "A boy named Vasya wants to play an old Russian solitaire called \"Accordion\". In this solitaire, the player must observe the following rules:\n\n- A deck of $ n $ cards is carefully shuffled, then all $ n $ cards are put on the table in a line from left to right;\n- Before each move the table has several piles of cards lying in a line (initially there are $ n $ piles, each pile has one card). Let's number the piles from left to right, from 1 to $ x $ . During one move, a player can take the whole pile with the maximum number $ x $ (that is the rightmost of remaining) and put it on the top of pile $ x-1 $ (if it exists) or on the top of pile $ x-3 $ (if it exists). The player can put one pile on top of another one only if the piles' top cards have the same suits or values. Please note that if pile $ x $ goes on top of pile $ y $ , then the top card of pile $ x $ becomes the top card of the resulting pile. Also note that each move decreases the total number of piles by 1;\n- The solitaire is considered completed if all cards are in the same pile.\n\nVasya has already shuffled the cards and put them on the table, help him understand whether completing this solitaire is possible or not.",
    "inputFormat": "The first input line contains a single integer $ n $ $ (1<=n<=52) $ — the number of cards in Vasya's deck. The next line contains $ n $ space-separated strings $ c_{1},c_{2},...,c_{n} $ , where string $ c_{i} $ describes the $ i $ -th card on the table. Each string $ c_{i} $ consists of exactly two characters, the first one represents the card's value, the second one represents its suit. Cards on the table are numbered from left to right.\n\nA card's value is specified by one of these characters: \"2\", \"3\", \"4\", \"5\", \"6\", \"7\", \"8\", \"9\", \"T\", \"J\", \"Q\", \"K\", \"A\". A card's suit is specified by one of these characters: \"S\", \"D\", \"H\", \"C\".\n\nIt is not guaranteed that the deck has all possible cards. Also, the cards in Vasya's deck can repeat.",
    "outputFormat": "On a single line print the answer to the problem: string \"YES\" (without the quotes) if completing the solitaire is possible, string \"NO\" (without the quotes) otherwise.",
    "samples": [
        [
            "4\n2S 2S 2C 2C\n",
            "YES\n"
        ],
        [
            "2\n3S 2C\n",
            "NO\n"
        ]
    ],
    "hint": "In the first sample you can act like that:\n\n- put the 4-th pile on the 1-st one;\n- put the 3-rd pile on the 2-nd one;\n- put the 2-nd pile on the 1-st one.\n\nIn the second sample there is no way to complete the solitaire.",
    "translation": "## 题目描述\n\n现在有 $n$ 堆扑克牌摆在桌子上，每堆有一张牌。当且仅当两堆牌最上面的一张牌的花色或大小相同时，两堆牌可以被放到一起。现在每次只能把最后的一堆牌放在倒数第二堆或倒数第四堆（如果有）上，问能否通过一定的操作使得桌面上最后只剩下一堆牌。\n\n## 输入格式\n\n输入的第一行是一个正整数 $n$ ，表示初始一共有 $n$ 堆牌。\n\n第二行有 $n$ 个字符串，每个字符串表示桌子上的一张牌。一张牌被表示为两个字符 $AB$ ，其中 $A$ 为大小，$A \\in \\{ 2, 3, 4, 5, 6, 7, 8, 9, T, J, Q, K, A \\}$，$B$ 为花色，$B \\in \\{ S, D, H, C \\} $。\n\n感谢@星烁晶熠辉 提供的翻译"
}