{
    "description": "One not particularly beautiful evening Valera got very bored. To amuse himself a little bit, he found the following game.\n\nHe took a checkered white square piece of paper, consisting of $ n×n $ cells. After that, he started to paint the white cells black one after the other. In total he painted $ m $ different cells on the piece of paper. Since Valera was keen on everything square, he wondered, how many moves (i.e. times the boy paints a square black) he should make till a black square with side $ 3 $ can be found on the piece of paper. But Valera does not know the answer to this question, so he asks you to help him.\n\nYour task is to find the minimum number of moves, till the checkered piece of paper has at least one black square with side of $ 3 $ . Otherwise determine that such move does not exist.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ $ (1<=n<=1000 $ , $ 1<=m<=min(n·n,10^{5})) $ — the size of the squared piece of paper and the number of moves, correspondingly.\n\nThen, $ m $ lines contain the description of the moves. The $ i $ -th line contains two integers $ x_{i} $ , $ y_{i} $ ( $ 1<=x_{i},y_{i}<=n $ ) — the number of row and column of the square that gets painted on the $ i $ -th move.\n\nAll numbers on the lines are separated by single spaces. It is guaranteed that all moves are different. The moves are numbered starting from $ 1 $ in the order, in which they are given in the input. The columns of the squared piece of paper are numbered starting from $ 1 $ , from the left to the right. The rows of the squared piece of paper are numbered starting from $ 1 $ , from top to bottom.",
    "outputFormat": "On a single line print the answer to the problem — the minimum number of the move after which the piece of paper has a black square with side $ 3 $ . If no such move exists, print -1.",
    "samples": [
        [
            "4 11\n1 1\n1 2\n1 3\n2 2\n2 3\n1 4\n2 4\n3 4\n3 2\n3 3\n4 1\n",
            "10\n"
        ],
        [
            "4 12\n1 1\n1 2\n1 3\n2 2\n2 3\n1 4\n2 4\n3 4\n3 2\n4 2\n4 1\n3 1\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "有一个 $n \\times n$ 的矩阵，初始时矩阵的所有格子都是白色的。\n\n现在你进行了 $m$ 次操作，每次操作会选定一个格子 $(x_i,y_i)$ ，并将这个格子涂成黑色。\n\n请求出你最少需要几次操作才能涂出一个 $3 \\times 3$ 的黑色矩阵，如果无解，输出 $-1$ 。\n\n提供者：@xuorange"
}