{
    "description": "One day $ n $ students come to the stadium. They want to play football, and for that they need to split into teams, the teams must have an equal number of people.\n\nWe know that this group of people has archenemies. Each student has at most two archenemies. Besides, if student $ A $ is an archenemy to student $ B $ , then student $ B $ is an archenemy to student $ A $ .\n\nThe students want to split so as no two archenemies were in one team. If splitting in the required manner is impossible, some students will have to sit on the bench.\n\nDetermine the minimum number of students you will have to send to the bench in order to form the two teams in the described manner and begin the game at last.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 2<=n<=100 $ , $ 1<=m<=100 $ ) — the number of students and the number of pairs of archenemies correspondingly.\n\nNext $ m $ lines describe enmity between students. Each enmity is described as two numbers $ a_{i} $ and $ b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ , $ a_{i}≠b_{i} $ ) — the indexes of the students who are enemies to each other. Each enmity occurs in the list exactly once. It is guaranteed that each student has no more than two archenemies.\n\nYou can consider the students indexed in some manner with distinct integers from 1 to $ n $ .",
    "outputFormat": "Print a single integer — the minimum number of students you will have to send to the bench in order to start the game.",
    "samples": [
        [
            "5 4\n1 2\n2 4\n5 3\n1 4\n",
            "1"
        ],
        [
            "6 2\n1 4\n3 4\n",
            "0"
        ],
        [
            "6 6\n1 2\n2 3\n3 1\n4 5\n5 6\n6 4\n",
            "2"
        ]
    ],
    "hint": "",
    "translation": "有 $n$ 个学生，他们中有 $m$ 对人互相仇视，且每个人至多仇视 $2$ 个人。给出这 $m$ 对互相仇视的人，需要将所有学生分成人数相等的两组（来打球），且互相仇视的人不能在一组。但为了满足要求，有些人可能不得不放弃参加分组（坐板凳）。\n\n输出不能参加分组的最少人数。"
}