{
    "description": "Furik and Rubik take part in a relay race. The race will be set up on a large square with the side of $ n $ meters. The given square is split into $ n×n $ cells (represented as unit squares), each cell has some number.\n\nAt the beginning of the race Furik stands in a cell with coordinates $ (1,1) $ , and Rubik stands in a cell with coordinates $ (n,n) $ . Right after the start Furik runs towards Rubik, besides, if Furik stands at a cell with coordinates $ (i,j) $ , then he can move to cell $ (i+1,j) $ or $ (i,j+1) $ . After Furik reaches Rubik, Rubik starts running from cell with coordinates $ (n,n) $ to cell with coordinates $ (1,1) $ . If Rubik stands in cell $ (i,j) $ , then he can move to cell $ (i-1,j) $ or $ (i,j-1) $ . Neither Furik, nor Rubik are allowed to go beyond the boundaries of the field; if a player goes beyond the boundaries, he will be disqualified.\n\nTo win the race, Furik and Rubik must earn as many points as possible. The number of points is the sum of numbers from the cells Furik and Rubik visited. Each cell counts only once in the sum.\n\nPrint the maximum number of points Furik and Rubik can earn on the relay race.",
    "inputFormat": "The first line contains a single integer $ (1<=n<=300) $ . The next $ n $ lines contain $ n $ integers each: the $ j $ -th number on the $ i $ -th line $ a_{i,j} $ $ (-1000<=a_{i,j}<=1000) $ is the number written in the cell with coordinates $ (i,j) $ .",
    "outputFormat": "On a single line print a single number — the answer to the problem.",
    "samples": [
        [
            "1\n5\n",
            "5\n"
        ],
        [
            "2\n11 14\n16 12\n",
            "53\n"
        ],
        [
            "3\n25 16 25\n12 18 19\n11 13 8\n",
            "136\n"
        ]
    ],
    "hint": "Comments to the second sample: The profitable path for Furik is: $ (1,1) $ , $ (1,2) $ , $ (2,2) $ , and for Rubik: $ (2,2) $ , $ (2,1) $ , $ (1,1) $ .\n\nComments to the third sample: The optimal path for Furik is: $ (1,1) $ , $ (1,2) $ , $ (1,3) $ , $ (2,3) $ , $ (3,3) $ , and for Rubik: $ (3,3) $ , $ (3,2) $ , $ (2,2) $ , $ (2,1) $ , $ (1,1) $ . The figure to the sample:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF213C/a92c8e717fa04d02a17d26f350f073f77ae6ad03.png) Furik's path is marked with yellow, and Rubik's path is marked with pink.",
    "translation": "输入一个$n*n$的矩形，每个$a_{i,j}$是这个位置的价值。现在要从左上角走到右下角再返回，每个价值只被计算一次，求最大价值和"
}