{
    "description": "Bajtek is learning to skate on ice. He's a beginner, so his only mode of transportation is pushing off from a snow drift to the north, east, south or west and sliding until he lands in another snow drift. He has noticed that in this way it's impossible to get from some snow drifts to some other by any sequence of moves. He now wants to heap up some additional snow drifts, so that he can get from any snow drift to any other one. He asked you to find the minimal number of snow drifts that need to be created.\n\nWe assume that Bajtek can only heap up snow drifts at integer coordinates.",
    "inputFormat": "The first line of input contains a single integer $ n $ ( $ 1<=n<=100 $ ) — the number of snow drifts. Each of the following $ n $ lines contains two integers $ x_{i} $ and $ y_{i} $ ( $ 1<=x_{i},y_{i}<=1000 $ ) — the coordinates of the $ i $ -th snow drift.\n\nNote that the north direction coinсides with the direction of $ Oy $ axis, so the east direction coinсides with the direction of the $ Ox $ axis. All snow drift's locations are distinct.",
    "outputFormat": "Output the minimal number of snow drifts that need to be created in order for Bajtek to be able to reach any snow drift from any other one.",
    "samples": [
        [
            "2\n2 1\n1 2\n",
            "1\n"
        ],
        [
            "2\n2 1\n4 1\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": " _** Description**_ \n\n给出n个点的横纵坐标，两个点互通当且仅当两个点有相同的横坐标或纵坐标，问最少需要加几个点才能使得所有点都两两互通\n\n** _Input_ **\n\n第一行一个整数n表示点数，之后n行每行两个整数x[ i ]和y[ i ]表示第i个点的横纵坐标(1<=n<=100,1<=x[ i ],y[ i ]<=1000)\n\n** _Output_ **\n\n输出需要加的最少点数\n"
}