{
    "description": "The country Treeland consists of $ n $ cities, some pairs of them are connected with unidirectional roads. Overall there are $ n-1 $ roads in the country. We know that if we don't take the direction of the roads into consideration, we can get from any city to any other one.\n\nThe council of the elders has recently decided to choose the capital of Treeland. Of course it should be a city of this country. The council is supposed to meet in the capital and regularly move from the capital to other cities (at this stage nobody is thinking about getting back to the capital from these cities). For that reason if city $ a $ is chosen a capital, then all roads must be oriented so that if we move along them, we can get from city $ a $ to any other city. For that some roads may have to be inversed.\n\nHelp the elders to choose the capital so that they have to inverse the minimum number of roads in the country.",
    "inputFormat": "The first input line contains integer $ n $ ( $ 2<=n<=2·10^{5} $ ) — the number of cities in Treeland. Next $ n-1 $ lines contain the descriptions of the roads, one road per line. A road is described by a pair of integers $ s_{i},t_{i} $ ( $ 1<=s_{i},t_{i}<=n; s_{i}≠t_{i} $ ) — the numbers of cities, connected by that road. The $ i $ -th road is oriented from city $ s_{i} $ to city $ t_{i} $ . You can consider cities in Treeland indexed from 1 to $ n $ .",
    "outputFormat": "In the first line print the minimum number of roads to be inversed if the capital is chosen optimally. In the second line print all possible ways to choose the capital — a sequence of indexes of cities in the increasing order.",
    "samples": [
        [
            "3\n2 1\n2 3\n",
            "0\n2 \n"
        ],
        [
            "4\n1 4\n2 4\n3 4\n",
            "2\n1 2 3 \n"
        ]
    ],
    "hint": "",
    "translation": "题目描述\n\nTreeland国有n个城市，这n个城市连成了一颗树，有n-1条道路连接了所有城市。每条道路只能单向通行。现在政府需要决定选择哪个城市为首都。假如城市i成为了首都，那么为了使首都能到达任意一个城市，不得不将一些道路翻转方向，记翻转道路的条数为k。你的任务是找到所有满足k最小的首都。\n\n输入输出格式\n\n输入格式\n\n输入包含多个测试点。对于每个测试点，每个测试点的第一行为一个正整数n（2<=n<=2e5）。接下来n-1行，每行两个正整数ai，bi，表示城市a到城市b有一条单向通行的道路。输入以空格分隔，以EOF结尾。\n\n输出格式\n\n对于每个测试点，第一行输出k，第二行升序输出所有满足条件的首都的编号。"
}