{
    "description": "A parking lot in the City consists of $ n $ parking spaces, standing in a line. The parking spaces are numbered from 1 to $ n $ from left to right.\n\nWhen a car arrives at the lot, the operator determines an empty parking space for it. For the safety's sake the chosen place should be located as far from the already occupied places as possible. That is, the closest occupied parking space must be as far away as possible. If there are several such places, then the operator chooses the place with the minimum index from them. If all parking lot places are empty, then the car gets place number $ 1 $ .\n\nWe consider the distance between the $ i $ -th and the $ j $ -th parking spaces equal to $ 4·|i-j| $ meters.\n\nYou are given the parking lot records of arriving and departing cars in the chronological order. For each record of an arriving car print the number of the parking lot that was given to this car.",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ m $ $ (1<=n,m<=2·10^{5}) $ — the number of parking places and the number of records correspondingly.\n\nNext $ m $ lines contain the descriptions of the records, one per line. The $ i $ -th line contains numbers $ t_{i} $ , $ id_{i} $ $ (1<=t_{i}<=2; 1<=id_{i}<=10^{6}) $ . If $ t_{i} $ equals 1, then the corresponding record says that the car number $ id_{i} $ arrived at the parking lot. If $ t_{i} $ equals 2, then the corresponding record says that the car number $ id_{i} $ departed from the parking lot.\n\nRecords about arriving to the parking lot and departing from the parking lot are given chronologically. All events occurred consecutively, no two events occurred simultaneously.\n\nIt is guaranteed that all entries are correct:\n\n- each car arrived at the parking lot at most once and departed from the parking lot at most once,\n- there is no record of a departing car if it didn't arrive at the parking lot earlier,\n- there are no more than $ n $ cars on the parking lot at any moment.\n\nYou can consider the cars arbitrarily numbered from 1 to $ 10^{6} $ , all numbers are distinct. Initially all places in the parking lot are empty.",
    "outputFormat": "For each entry of an arriving car print the number of its parking space. Print the numbers of the spaces in the order, in which the cars arrive to the parking lot.",
    "samples": [
        [
            "7 11\n1 15\n1 123123\n1 3\n1 5\n2 123123\n2 15\n1 21\n2 3\n1 6\n1 7\n1 8\n",
            "1\n7\n4\n2\n7\n4\n1\n3\n"
        ]
    ],
    "hint": ""
}