{
    "description": "A new Berland businessman Vitaly is going to open a household appliances' store. All he's got to do now is to hire the staff.\n\nThe store will work seven days a week, but not around the clock. Every day at least $ k $ people must work in the store.\n\nBerland has a law that determines the order of working days and non-working days. Namely, each employee must work for exactly $ n $ consecutive days, then rest for exactly $ m $ days, then work for $ n $ more days and rest for $ m $ more, and so on. Vitaly doesn't want to break the law. Fortunately, there is a loophole: the law comes into force on the day when the employee is hired. For example, if an employee is hired on day $ x $ , then he should work on days $ [x,x+1,...,x+n-1] $ , $ [x+m+n,x+m+n+1,...,x+m+2n-1] $ , and so on. Day $ x $ can be chosen arbitrarily by Vitaly.\n\nThere is one more thing: the key to the store. Berland law prohibits making copies of keys, so there is only one key. Vitaly is planning to entrust the key to the store employees. At the same time on each day the key must be with an employee who works that day — otherwise on this day no one can get inside the store. During the day the key holder can give the key to another employee, if he also works that day. The key will handed to the first hired employee at his first working day.\n\nEach employee has to be paid salary. Therefore, Vitaly wants to hire as few employees as possible provided that the store can operate normally on each day from $ 1 $ to infinity. In other words, on each day with index from $ 1 $ to infinity, the store must have at least $ k $ working employees, and one of the working employees should have the key to the store.\n\nHelp Vitaly and determine the minimum required number of employees, as well as days on which they should be hired.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=m<=n<=1000 $ , $ n≠1 $ , $ 1<=k<=1000 $ ).",
    "outputFormat": "In the first line print a single integer $ z $ — the minimum required number of employees.\n\nIn the second line print $ z $ positive integers, separated by spaces: the $ i $ -th integer $ a_{i} $ ( $ 1<=a_{i}<=10^{4} $ ) should represent the number of the day, on which Vitaly should hire the $ i $ -th employee.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "4 3 2\n",
            "4\n1 1 4 5"
        ],
        [
            "3 3 1\n",
            "3\n1 3 5"
        ]
    ],
    "hint": "",
    "translation": "## 描述:\n\n有一个大型超市需要雇佣员工，若在第 x 天雇佣一个员工，则该员工会连续工作 n 天，然后休息 m 天，重复以上规律。要求每天至少要有 k 个员工在超市上班，并且至少有一个员工是来自前一天工作的。输出最少需要雇佣的员工数量和每个员是在第几天开始雇佣的，例如 d[i]=j 表示第 i 个员工是在第 j 天开始雇佣的。\n\n## 输入描述：\n\n输入第一行包含三个整数 n , m 和 k \n( 1≤m≤n≤1000 , n=1 , 1≤k≤1000)。\n\n## 输出描述：\n\n在第一行输出一个整数 z 表示所需的最少员工人数。\n在第二行打印 z 个正整数，用空格分隔： 第 i 个整数 a \ni\n​\n  ( 1≤a \ni\n​\n ≤10 \n4\n  ) 应该表示应聘用第 i 名员工的日期。\n如果有多个答案，请输出其中任何一个。"
}