{
    "description": "The Bytelandian Institute for Biological Research (BIBR) is investigating the properties of two species of bacteria, named simply 0 and 1. Even under a microscope, bacteria of those two species are very difficult to distinguish. In fact, the only thing the scientists possess that is able to differentiate between them is a plant called Formurosa.\n\nIf the scientists place a sample of colonies of bacteria on each on Formurosa's leaves, it will activate a complicated nutrition process. During that process color of Formurosa changes to reflect the result of a — possibly very complicated — logical formula on the species of bacteria, involving constants and the operators $ | $ (OR), $ &amp; $ (AND) and $ ^ $ (XOR). If it is 0, the plant will turn red, otherwise — it will turn blue.\n\nFor example, if the nutrition process of Formurosa is described by the formula: $ (((?^?)|?)&amp;(1^?)) $ ; then Formurosa has four leaves (the \"?\" signs denote the leaves). If we place $ 0,1,0,0 $ on the respective leaves, the result of the nutrition process will be $ (((0^1)|0)&amp;(1^0))=1 $ , therefore the plant will turn blue.\n\nThe scientists have $ n $ colonies of bacteria. They do not know their types; the only thing they know for sure is that not all colonies are of the same type. They want to attempt to determine the bacteria's species by repeated evaluations with Formurosa. During each evaluation they must place exactly one sample on every leaf of the plant. However, they may use multiple samples of one colony during a single evaluation; they can even cover the whole plant with bacteria from one colony!\n\nIs it possible for them to always determine the species of each colony, no matter what they are (assuming they are not all the same)?",
    "inputFormat": "The first line of input contains a single integer $ n $ ( $ 2<=n<=10^{6} $ ) — the number of colonies of bacteria.\n\nThe second line contains the formula describing the nutrition process of Formurosa. This line contains only characters «0», «1», «?», «|», «&», «^», «(», «)» and complies with the following grammar:\n\n $ s→0|1|?|(s|s)|(s&amp;s)|(s^s) $ The formula consists of no more than $ 10^{6} $ characters.",
    "outputFormat": "If it is always possible to determine the species of each colony, output \"YES\" (without quotes). Otherwise, output \"NO\" (without quotes).",
    "samples": [
        [
            "2\n(?^?)\n",
            "NO\n"
        ],
        [
            "10\n?\n",
            "YES\n"
        ],
        [
            "2\n((?^?)&amp;?)\n",
            "YES\n"
        ]
    ],
    "hint": "",
    "translation": "有 $n$ 个`bool`未知量 $x_1,x_2,\\dots,x_n$（取值`false`/`true`）以及一个含若干互不相同的参数的表达式 $F(a_1,a_2,\\dots,a_k)$。\n\n表达式只包含：\n- `?` 表示一个参数，所有参数互不相同；\n- `&`,`|`,`^` 三种运算，即逻辑与、逻辑或和逻辑异或；\n- `(`,`)` 表示运算的优先级，**保证每个运算符外围都有一对括号**（也可以认为是一对括号内只有恰好一个运算符）。\n\n你可以进行的操作是将每个参数 $a_i$ 代换成未知量 $x_j$，同一个未知量可以代入多个不同的参数。然后你可以知道这个表达式的值。\n\n你可以进行无限次操作，求你能否通过这些操作确定每一个未知量的取值。\n\n另外需要注意的是，**未知量的取值一定不全相同**。\n\n$2\\le n\\le10^6$；表达式以字符串形式输入，长度不超过 $10^6$。"
}