{
    "description": "Harry Potter has a difficult homework. Given a rectangular table, consisting of $ n×m $ cells. Each cell of the table contains the integer. Harry knows how to use two spells: the first spell change the sign of the integers in the selected row, the second — in the selected column. Harry's task is to make non-negative the sum of the numbers in each row and each column using these spells.\n\nAlone, the boy can not cope. Help the young magician!",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ $ (1<=n, m<=100) $ — the number of rows and the number of columns.\n\nNext $ n $ lines follow, each contains $ m $ integers: $ j $ -th integer in the $ i $ -th line is $ a_{i,j} $ $ (|a_{i,j}|<=100) $ , the number in the $ i $ -th row and $ j $ -th column of the table.\n\nThe rows of the table numbered from 1 to $ n $ . The columns of the table numbered from 1 to $ m $ .",
    "outputFormat": "In the first line print the number $ a $ — the number of required applications of the first spell. Next print $ a $ space-separated integers — the row numbers, you want to apply a spell. These row numbers must be distinct!\n\nIn the second line print the number $ b $ — the number of required applications of the second spell. Next print $ b $ space-separated integers — the column numbers, you want to apply a spell. These column numbers must be distinct!\n\nIf there are several solutions are allowed to print any of them.",
    "samples": [
        [
            "4 1\n-1\n-1\n-1\n-1\n",
            "4 1 2 3 4 \n0 \n"
        ],
        [
            "2 4\n-1 -1 -1 2\n1 1 1 1\n",
            "1 1 \n1 4 \n"
        ]
    ],
    "hint": "",
    "translation": "$Harry Potter$ 的家庭作业超级难。老师给定了一个矩形表，由 $n×m$ 个单元格组成。表中的每个单元格都包含一个整数。\r\n\r\n$Harry$ 可以使用两个法术：\r\n\r\n第一个法术可以在选定行中改变所有整数的符号\r\n\r\n第二个可以在所选列中做同样的事情。\r\n\r\n$Harry$ 的任务是用这些咒语把每行和每列中的数字的总和变成非负的。帮帮这个年轻的魔术师，否则他就会挂科，失去和马尔福的拌嘴机会！"
}