{
    "description": "A dice is a cube, its faces contain distinct integers from 1 to 6 as black points. The sum of numbers at the opposite dice faces always equals 7. Please note that there are only two dice (these dices are mirror of each other) that satisfy the given constraints (both of them are shown on the picture on the left).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF225A/85f2da947143b29924bb6531722e86105dbf28c1.png)Alice and Bob play dice. Alice has built a tower from $ n $ dice. We know that in this tower the adjacent dice contact with faces with distinct numbers. Bob wants to uniquely identify the numbers written on the faces of all dice, from which the tower is built. Unfortunately, Bob is looking at the tower from the face, and so he does not see all the numbers on the faces. Bob sees the number on the top of the tower and the numbers on the two adjacent sides (on the right side of the picture shown what Bob sees).\n\nHelp Bob, tell whether it is possible to uniquely identify the numbers on the faces of all the dice in the tower, or not.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=100 $ ) — the number of dice in the tower.\n\nThe second line contains an integer $ x $ $ (1<=x<=6) $ — the number Bob sees at the top of the tower. Next $ n $ lines contain two space-separated integers each: the $ i $ -th line contains numbers $ a_{i},b_{i} $ $ (1<=a_{i},b_{i}<=6; a_{i}≠b_{i}) $ — the numbers Bob sees on the two sidelong faces of the $ i $ -th dice in the tower.\n\nConsider the dice in the tower indexed from top to bottom from 1 to $ n $ . That is, the topmost dice has index 1 (the dice whose top face Bob can see). It is guaranteed that it is possible to make a dice tower that will look as described in the input.",
    "outputFormat": "Print \"YES\" (without the quotes), if it is possible to to uniquely identify the numbers on the faces of all the dice in the tower. If it is impossible, print \"NO\" (without the quotes).",
    "samples": [
        [
            "3\n6\n3 2\n5 4\n2 4\n",
            "YES"
        ],
        [
            "3\n3\n2 6\n4 1\n5 3\n",
            "NO"
        ]
    ],
    "hint": "",
    "translation": "## 题意翻译\n\n有 $n$ 个骰子被叠在了一起。对于每个骰子上的一个数，与它对面的数的和始终为 $7$ 。\n\n你是小明，你只能从正面看这个骰子塔，你看到了每一个骰子的两面 $a$ 与 $b$ 。以及最顶上的数。\n\n试问是否有可能用正常的骰子叠出描述中的骰子塔？\n\n如果可以输出 $\\text{YES}$ ，否则输出 $\\text{NO}$  。\n\n翻译来源: @[Pitiless0514](https://www.luogu.com.cn/user/206021)"
}