{
    "description": "A bracket sequence is a string, containing only characters \"(\", \")\", \"\\[\" and \"\\]\".\n\nA correct bracket sequence is a bracket sequence that can be transformed into a correct arithmetic expression by inserting characters \"1\" and \"+\" between the original characters of the sequence. For example, bracket sequences \"()\\[\\]\", \"(\\[\\])\" are correct (the resulting expressions are: \"(1)+\\[1\\]\", \"(\\[1+1\\]+1)\"), and \"\\](\" and \"\\[\" are not. The empty string is a correct bracket sequence by definition.\n\nA substring $ s[l...\\ r] $ $ (1<=l<=r<=|s|) $ of string $ s=s_{1}s_{2}...\\ s_{|s|} $ (where $ |s| $ is the length of string $ s $ ) is the string $ s_{l}s_{l+1}...\\ s_{r} $ . The empty string is a substring of any string by definition.\n\nYou are given a bracket sequence, not necessarily correct. Find its substring which is a correct bracket sequence and contains as many opening square brackets «\\[» as possible.",
    "inputFormat": "The first and the only line contains the bracket sequence as a string, consisting only of characters \"(\", \")\", \"\\[\" and \"\\]\". It is guaranteed that the string is non-empty and its length doesn't exceed $ 10^{5} $ characters.",
    "outputFormat": "In the first line print a single integer — the number of brackets «\\[» in the required bracket sequence. In the second line print the optimal sequence. If there are more than one optimal solutions print any of them.",
    "samples": [
        [
            "([])\n",
            "1\n([])\n"
        ],
        [
            "(((\n",
            "0\n\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述：\n对于一个括号序列，只含有```(```、```)```、```[```、```]```这四种括号。一个括号序列是合法的，当且仅当能在里面加上若干个```1```和```+```，使其成为一个正确的表达式（其中两种括号均可以互相嵌套）。给定一个括号序列，请找到它的一个子串，使得它是合法的，且其中```[```最多。\n## 输出格式：\n第一行一个数，表示```[```最多的次数；\\\n第二行输出此时的子串。"
}