{
    "description": "Trouble came from the overseas lands: a three-headed dragon Gorynych arrived. The dragon settled at point $ C $ and began to terrorize the residents of the surrounding villages.\n\nA brave hero decided to put an end to the dragon. He moved from point $ A $ to fight with Gorynych. The hero rode from point $ A $ along a straight road and met point $ B $ on his way. The hero knows that in this land for every pair of roads it is true that they are either parallel to each other, or lie on a straight line, or are perpendicular to each other. He also knows well that points $ B $ and $ C $ are connected by a road. So the hero must either turn 90 degrees to the left or continue riding straight ahead or turn 90 degrees to the right. But he forgot where the point $ C $ is located.\n\nFortunately, a Brave Falcon flew right by. It can see all three points from the sky. The hero asked him what way to go to get to the dragon's lair.\n\nIf you have not got it, you are the falcon. Help the hero and tell him how to get him to point $ C $ : turn left, go straight or turn right.\n\nAt this moment the hero is believed to stand at point $ B $ , turning his back to point $ A $ .",
    "inputFormat": "The first input line contains two space-separated integers $ x_{a},y_{a} $ $ (|x_{a}|,|y_{a}|<=10^{9}) $ — the coordinates of point $ A $ . The second line contains the coordinates of point $ B $ in the same form, the third line contains the coordinates of point $ C $ .\n\nIt is guaranteed that all points are pairwise different. It is also guaranteed that either point $ B $ lies on segment $ AC $ , or angle $ ABC $ is right.",
    "outputFormat": "Print a single line. If a hero must turn left, print \"LEFT\" (without the quotes); If he must go straight ahead, print \"TOWARDS\" (without the quotes); if he should turn right, print \"RIGHT\" (without the quotes).",
    "samples": [
        [
            "0 0\n0 1\n1 1\n",
            "RIGHT\n"
        ],
        [
            "-1 -1\n-3 -3\n-4 -4\n",
            "TOWARDS\n"
        ],
        [
            "-4 -6\n-3 -7\n-2 -6\n",
            "LEFT\n"
        ]
    ],
    "hint": "The picture to the first sample:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF227A/e61b67213ead6cd60a9de674ba59a16f640ab902.png)The red color shows points A, B and C. The blue arrow shows the hero's direction. The green color shows the hero's trajectory.\n\nThe picture to the second sample:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF227A/009eb3489d47ef4ebc3672ec1f44c9cae16a8306.png)",
    "translation": "在一个遥远的村庄里，有若干条路，两两互相平行否则互相垂直。\n\n现给你三个点 $A,B,C$ 的坐标，已知 $A,B$ 在同一条路上，$B,C$ 也在同一条路上，你从 $A$ 走到了 $B$，要去 $C$，问现在应该是直走，左转，还是右转 。\n\n注意：不保证三点一定不共线，保证  $BC$ 与 $AB$ 相交时一定为垂直（即夹角为 $90^\\circ$）。"
}