{
    "description": "Vasya is going to the Olympics in the city Ntown by train. The boy wants to read the textbook to prepare for the Olympics. He counted that he needed $ k $ hours for this. He also found that the light in the train changes every hour. The light is measured on a scale from 0 to 100, where 0 is very dark, and 100 is very light.\n\nVasya has a train lighting schedule for all $ n $ hours of the trip — $ n $ numbers from 0 to 100 each (the light level in the first hour, the second hour and so on). During each of those hours he will either read the whole time, or not read at all. He wants to choose $ k $ hours to read a book, not necessarily consecutive, so that the minimum level of light among the selected hours were maximum. Vasya is very excited before the upcoming contest, help him choose reading hours.",
    "inputFormat": "The first input line contains two integers $ n $ and $ k $ ( $ 1<=n<=1000,1<=k<=n $ ) — the number of hours on the train and the number of hours to read, correspondingly. The second line contains $ n $ space-separated integers $ a_{i} $ ( $ 0<=a_{i}<=100 $ ), $ a_{i} $ is the light level at the $ i $ -th hour.",
    "outputFormat": "In the first output line print the minimum light level Vasya will read at. In the second line print $ k $ distinct space-separated integers $ b_{1},b_{2},...,b_{k} $ , — the indexes of hours Vasya will read at ( $ 1<=b_{i}<=n $ ). The hours are indexed starting from 1. If there are multiple optimal solutions, print any of them. Print the numbers $ b_{i} $ in an arbitrary order.",
    "samples": [
        [
            "5 3\n20 10 30 40 10\n",
            "20\n1 3 4 \n"
        ],
        [
            "6 5\n90 20 35 40 60 100\n",
            "35\n1 3 4 5 6 \n"
        ]
    ],
    "hint": "In the first sample Vasya should read at the first hour (light $ 20 $ ), third hour (light $ 30 $ ) and at the fourth hour (light $ 40 $ ). The minimum light Vasya will have to read at is $ 20 $ .",
    "translation": "瓦西亚将乘火车去伦敦城参加奥运会。这个男孩想读课本为奥运会做准备。他数了数这件事他需要k个小时。他还发现火车上的灯每小时都在变。光是在$0$到$100$的范围内测量的，$0$表示非常暗，$100$表示非常亮。\n\n\n瓦西亚有一个所有$n$小时行程的列车照明计划表（第一小时、第二小时等等）。在每一个小时里，他要么一直读，要么根本不读。他想选择$k$小时看书，不一定是连续的，这样在选定的时间里，光线的最低水平是最大的。\n\n第一行包含两个整数$n$和$k$（1<=n<=1000，1<=k<=n ）列车上的小时数和读书用的小时数。第二行包含$n$个空格分隔的整数$a_i$（0<=$a_i$<=100），$a_i$是第$i$小时的灯光级别。 \n\n第一行打印你找到的方案中最暗的灯光亮度，之后打印你要选那几个小时，以空格隔开，如果有多个最优解，请随便打印一个。 \n"
}