{
    "description": "One day Vasya was going home when he saw a box lying on the road. The box can be represented as a rectangular parallelepiped. Vasya needed no time to realize that the box is special, as all its edges are parallel to the coordinate axes, one of its vertices is at point $ (0,0,0) $ , and the opposite one is at point $ (x_{1},y_{1},z_{1}) $ . The six faces of the box contain some numbers $ a_{1},a_{2},...,a_{6} $ , exactly one number right in the center of each face.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF231D/891b16d62b99e19e4dbbcc1ffa7c6345c322e404.png)The numbers are located on the box like that:\n\n- number $ a_{1} $ is written on the face that lies on the ZOX plane;\n- $ a_{2} $ is written on the face, parallel to the plane from the previous point;\n- $ a_{3} $ is written on the face that lies on the XOY plane;\n- $ a_{4} $ is written on the face, parallel to the plane from the previous point;\n- $ a_{5} $ is written on the face that lies on the YOZ plane;\n- $ a_{6} $ is written on the face, parallel to the plane from the previous point.\n\nAt the moment Vasya is looking at the box from point $ (x,y,z) $ . Find the sum of numbers that Vasya sees. Note that all faces of the box are not transparent and Vasya can't see the numbers through the box. The picture contains transparent faces just to make it easier to perceive. You can consider that if Vasya is looking from point, lying on the plane of some face, than he can not see the number that is written on this face. It is enough to see the center of a face to see the corresponding number for Vasya. Also note that Vasya always reads correctly the $ a_{i} $ numbers that he sees, independently of their rotation, angle and other factors (that is, for example, if Vasya sees some $ a_{i}=6 $ , then he can't mistake this number for $ 9 $ and so on).",
    "inputFormat": "The fist input line contains three space-separated integers $ x $ , $ y $ and $ z $ ( $ |x|,|y|,|z|<=10^{6} $ ) — the coordinates of Vasya's position in space. The second line contains three space-separated integers $ x_{1} $ , $ y_{1} $ , $ z_{1} $ ( $ 1<=x_{1},y_{1},z_{1}<=10^{6} $ ) — the coordinates of the box's vertex that is opposite to the vertex at point $ (0,0,0) $ . The third line contains six space-separated integers $ a_{1},a_{2},...,a_{6} $ ( $ 1<=a_{i}<=10^{6} $ ) — the numbers that are written on the box faces.\n\nIt is guaranteed that point $ (x,y,z) $ is located strictly outside the box.",
    "outputFormat": "Print a single integer — the sum of all numbers on the box faces that Vasya sees.",
    "samples": [
        [
            "2 2 2\n1 1 1\n1 2 3 4 5 6\n",
            "12\n"
        ],
        [
            "0 0 10\n3 2 3\n1 2 3 4 5 6\n",
            "4\n"
        ]
    ],
    "hint": "The first sample corresponds to perspective, depicted on the picture. Vasya sees numbers $ a_{2} $ (on the top face that is the darkest), $ a_{6} $ (on the right face that is the lightest) and $ a_{4} $ (on the left visible face).\n\nIn the second sample Vasya can only see number $ a_{4} $ .",
    "translation": "一个立方体，它的一个顶点在原点，它的每个面上有一个数字，给出它的边长和你所在的位置的坐标，问你能看到的数字和是多少？"
}