{
    "description": "Overall there are $ m $ actors in Berland. Each actor has a personal identifier — an integer from $ 1 $ to $ m $ (distinct actors have distinct identifiers). Vasya likes to watch Berland movies with Berland actors, and he has $ k $ favorite actors. He watched the movie trailers for the next month and wrote the following information for every movie: the movie title, the number of actors who starred in it, and the identifiers of these actors. Besides, he managed to copy the movie titles and how many actors starred there, but he didn't manage to write down the identifiers of some actors. Vasya looks at his records and wonders which movies may be his favourite, and which ones may not be. Once Vasya learns the exact cast of all movies, his favorite movies will be determined as follows: a movie becomes favorite movie, if no other movie from Vasya's list has more favorite actors.\n\nHelp the boy to determine the following for each movie:\n\n- whether it surely will be his favourite movie;\n- whether it surely won't be his favourite movie;\n- can either be favourite or not.",
    "inputFormat": "The first line of the input contains two integers $ m $ and $ k $ ( $ 1<=m<=100,1<=k<=m $ ) — the number of actors in Berland and the number of Vasya's favourite actors.\n\nThe second line contains $ k $ distinct integers $ a_{i} $ ( $ 1<=a_{i}<=m $ ) — the identifiers of Vasya's favourite actors.\n\nThe third line contains a single integer $ n $ ( $ 1<=n<=100 $ ) — the number of movies in Vasya's list.\n\nThen follow $ n $ blocks of lines, each block contains a movie's description. The $ i $ -th movie's description contains three lines:\n\n- the first line contains string $ s_{i} $ ( $ s_{i} $ consists of lowercase English letters and can have the length of from $ 1 $ to $ 10 $ characters, inclusive) — the movie's title,\n- the second line contains a non-negative integer $ d_{i} $ ( $ 1<=d_{i}<=m $ ) — the number of actors who starred in this movie,\n- the third line has $ d_{i} $ integers $ b_{i,j} $ ( $ 0<=b_{i,j}<=m $ ) — the identifiers of the actors who star in this movie. If $ b_{i,j}=0 $ , than Vasya doesn't remember the identifier of the $ j $ -th actor. It is guaranteed that the list of actors for a movie doesn't contain the same actors.\n\nAll movies have distinct names. The numbers on the lines are separated by single spaces.",
    "outputFormat": "Print $ n $ lines in the output. In the $ i $ -th line print:\n\n- 0, if the $ i $ -th movie will surely be the favourite;\n- 1, if the $ i $ -th movie won't surely be the favourite;\n- 2, if the $ i $ -th movie can either be favourite, or not favourite.",
    "samples": [
        [
            "5 3\n1 2 3\n6\nfirstfilm\n3\n0 0 0\nsecondfilm\n4\n0 0 4 5\nthirdfilm\n1\n2\nfourthfilm\n1\n5\nfifthfilm\n1\n4\nsixthfilm\n2\n1 0\n",
            "2\n2\n1\n1\n1\n2\n"
        ],
        [
            "5 3\n1 3 5\n4\njumanji\n3\n0 0 0\ntheeagle\n5\n1 2 3 4 0\nmatrix\n3\n2 4 0\nsourcecode\n2\n2 4\n",
            "2\n0\n1\n1\n"
        ]
    ],
    "hint": "Note to the second sample:\n\n- Movie jumanji can theoretically have from 1 to 3 Vasya's favourite actors.\n- Movie theeagle has all three favourite actors, as the actor Vasya failed to remember, can only have identifier 5.\n- Movie matrix can have exactly one favourite actor.\n- Movie sourcecode doesn't have any favourite actors.\n\nThus, movie theeagle will surely be favourite, movies matrix and sourcecode won't surely be favourite, and movie jumanji can be either favourite (if it has all three favourite actors), or not favourite.",
    "translation": "有 $m$ 个演员编号分别为 $1$ 至 $m$。其中，编号分别为 $a_1$ 至 $a_k$ 的 $k$ 个演员是小 V 所喜爱的。\n\n当且仅当不存在拥有更多小 V 喜欢的演员的电影时，这个一个电影是小 V 喜爱的的电影。\n\n小 V 记录了下个月 $n$ 个电影的影片名称 $s_i$，演员人数 $d_i$ 和演员编号 $b_{ij}$。特殊地，若给定的演员编号为 $0$ 则代表小 V 忘记了这个演员的编号。\n\n试求出每个电影是否是小 V 喜爱的电影。若肯定是，输出 ``0``；若不可能是，输出``1``，若不确定，输出``2``。\n\n $1\\leq k \\leq m \\leq 100$，$1\\leq d_i\\leq m$，$0\\leq b_{ij}\\leq m$，$1\\leq |s_i|\\leq10$。\n\n电影名称由小写字母组成。同一部电影中不会出现两个相同的演员编号。\n\n文件输入输出。输入输出文件分别是 ``input.txt`` 以及 ``output.txt``。\n\n由于 Codeforces 系统更新后本题数据没有更新，本题用时将会被乘 $2$ 。例如：400 ms 的代码将被视为 800 ms。"
}