{
    "description": "Vasya should paint a fence in front of his own cottage. The fence is a sequence of $ n $ wooden boards arranged in a single row. Each board is a $ 1 $ centimeter wide rectangle. Let's number the board fence using numbers $ 1,2,...,n $ from left to right. The height of the $ i $ -th board is $ h_{i} $ centimeters.\n\nVasya has a $ 1 $ centimeter wide brush and the paint of two colors, red and green. Of course, the amount of the paint is limited. Vasya counted the area he can paint each of the colors. It turned out that he can not paint over $ a $ square centimeters of the fence red, and he can not paint over $ b $ square centimeters green. Each board of the fence should be painted exactly one of the two colors. Perhaps Vasya won't need one of the colors.\n\nIn addition, Vasya wants his fence to look smart. To do this, he should paint the fence so as to minimize the value that Vasya called the fence unattractiveness value. Vasya believes that two consecutive fence boards, painted different colors, look unattractive. The unattractiveness value of a fence is the total length of contact between the neighboring boards of various colors. To make the fence look nice, you need to minimize the value as low as possible. Your task is to find what is the minimum unattractiveness Vasya can get, if he paints his fence completely.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF234F/a14b673dce5ebb55793e288f9c6ca9cf6b548bb3.png)The picture shows the fence, where the heights of boards (from left to right) are 2,3,2,4,3,1. The first and the fifth boards are painted red, the others are painted green. The first and the second boards have contact length 2, the fourth and fifth boards have contact length 3, the fifth and the sixth have contact length 1. Therefore, the unattractiveness of the given painted fence is 2+3+1=6.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=200 $ ) — the number of boards in Vasya's fence.\n\nThe second line contains two integers $ a $ and $ b $ ( $ 0<=a,b<=4·10^{4} $ ) — the area that can be painted red and the area that can be painted green, correspondingly.\n\nThe third line contains a sequence of $ n $ integers $ h_{1},h_{2},...,h_{n} $ $ (1<=h_{i}<=200) $ — the heights of the fence boards.\n\nAll numbers in the lines are separated by single spaces.",
    "outputFormat": "Print a single number — the minimum unattractiveness value Vasya can get if he paints his fence completely. If it is impossible to do, print $ -1 $ .",
    "samples": [
        [
            "4\n5 7\n3 3 4 1\n",
            "3\n"
        ],
        [
            "3\n2 3\n1 3 1\n",
            "2\n"
        ],
        [
            "3\n3 3\n2 2 2\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "长度为$n$的栅栏，第$i$个栅栏高度为$h_i$,宽度均为1。现在你需要将所有栅栏都涂上红色或绿色，规定同一个栅栏必须涂一种颜色，且红色总面积不能超过$a$，绿色总面积不能超过$b$。\n\n涂完色后栅栏的难看程度定义为相邻且颜色不同的栅栏相交部分的线段长度之和，求最小难看程度。\n\n本题需要文件输入输出，示例如下：\n```\n    freopen(\"input.txt\",\"r\",stdin);\n    freopen(\"output.txt\",\"w\",stdout);\n    \n```"
}