{
    "description": "Urpal lives in a big city. He has planned to meet his lover tonight.\n\nThe city has $ n $ junctions numbered from $ 1 $ to $ n $ . The junctions are connected by $ m $ directed streets, all the roads have equal length. Urpal lives in junction $ a $ and the date is planned in a restaurant in junction $ b $ . He wants to use public transportation to get to junction $ b $ . There are $ k $ bus transportation companies. At the beginning of every second, a bus from the $ i $ -th company chooses a random shortest path between junction $ s_{i} $ and junction $ t_{i} $ and passes through it. There might be no path from $ s_{i} $ to $ t_{i} $ . In that case no bus will leave from $ s_{i} $ to $ t_{i} $ . If a bus passes through a junction where Urpal stands, he can get on the bus. He can also get off the bus at any junction along the path.\n\nNow Urpal wants to know if it's possible to go to the date using public transportation in a finite amount of time (the time of travel is the sum of length of the traveled roads) and what is the minimum number of buses he should take in the worst case.\n\nAt any moment Urpal knows only his own position and the place where the date will be. When he gets on the bus he knows only the index of the company of this bus. Of course Urpal knows the city map and the the pairs $ (s_{i},t_{i}) $ for each company.\n\nNote that Urpal doesn't know buses velocity.",
    "inputFormat": "The first line of the input contains four integers $ n $ , $ m $ , $ a $ , $ b $ $ (2<=n<=100; 0<=m<=n·(n-1); 1<=a,b<=n; a≠b) $ .\n\nThe next $ m $ lines contain two integers each $ u_{i} $ and $ v_{i} $ $ (1<=u_{i},v_{i}<=n; u_{i}≠v_{i}) $ describing a directed road from junction $ u_{i} $ to junction $ v_{i} $ . All roads in the input will be distinct.\n\nThe next line contains an integer $ k $ $ (0<=k<=100) $ . There will be $ k $ lines after this, each containing two integers $ s_{i} $ and $ t_{i} $ $ (1<=s_{i},t_{i}<=n; s_{i}≠t_{i}) $ saying there is a bus route starting at $ s_{i} $ and ending at $ t_{i} $ . Please note that there might be no path from $ s_{i} $ to $ t_{i} $ , this case is described in the problem statement.",
    "outputFormat": "In the only line of output print the minimum number of buses Urpal should get on on his way in the worst case. If it's not possible to reach the destination in the worst case print -1.",
    "samples": [
        [
            "7 8 1 7\n1 2\n1 3\n2 4\n3 4\n4 6\n4 5\n6 7\n5 7\n3\n2 7\n1 4\n5 7\n",
            "2\n"
        ],
        [
            "4 4 1 2\n1 2\n1 3\n2 4\n3 4\n1\n1 4\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "n个城市，m条有向边，起点为a,终点为b，有k个公车公司，人从起点要到终点\n\n每秒第i个公司有一辆车随机选一条si到ti的最短路（如果没有si到ti的路，这个公司就不会有车），若车经过人，人可以上车\n\n人想知道最坏要换几次车，若最坏不能到达，输出-1\n\nTranslated by Fheiwn"
}