{
    "description": "John Doe has an $ n×m $ table. John Doe can paint points in some table cells, not more than one point in one table cell. John Doe wants to use such operations to make each square subtable of size $ n×n $ have exactly $ k $ points.\n\nJohn Doe wondered, how many distinct ways to fill the table with points are there, provided that the condition must hold. As this number can be rather large, John Doe asks to find its remainder after dividing by $ 1000000007 $ $ (10^{9}+7) $ .\n\nYou should assume that John always paints a point exactly in the center of some cell. Two ways to fill a table are considered distinct, if there exists a table cell, that has a point in one way and doesn't have it in the other.",
    "inputFormat": "A single line contains space-separated integers $ n $ , $ m $ , $ k $ ( $ 1<=n<=100; n<=m<=10^{18}; 0<=k<=n^{2} $ ) — the number of rows of the table, the number of columns of the table and the number of points each square must contain.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "outputFormat": "In a single line print a single integer — the remainder from dividing the described number of ways by $ 1000000007 $ $ (10^{9}+7) $ .",
    "samples": [
        [
            "5 6 1\n",
            "45"
        ]
    ],
    "hint": "Let's consider the first test case:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF232B/8876a3223960f71627c5d6c6a4c6ddb988dcaef6.png) The gray area belongs to both $ 5×5 $ squares. So, if it has one point, then there shouldn't be points in any other place. If one of the white areas has a point, then the other one also must have a point. Thus, there are about $ 20 $ variants, where the point lies in the gray area and $ 25 $ variants, where each of the white areas contains a point. Overall there are $ 45 $ variants.",
    "translation": "有一个 $n\\times m$的矩阵，求使得每个 $n\\times n$的矩阵中都有正好 $k$个点的方案数，方案数对 $1000000007$（ $1e9+7$）取模。 $1\\le n\\le100,n\\le m\\le10^{18},0\\le k\\le n^2$"
}