{
    "description": "You've got a list of program warning logs. Each record of a log stream is a string in this format:\n\n \"2012-MM-DD HH:MM:SS:MESSAGE\" (without the quotes). String \"MESSAGE\" consists of spaces, uppercase and lowercase English letters and characters \"!\", \".\", \",\", \"?\". String \"2012-MM-DD\" determines a correct date in the year of 2012. String \"HH:MM:SS\" determines a correct time in the 24 hour format.\n\nThe described record of a log stream means that at a certain time the record has got some program warning (string \"MESSAGE\" contains the warning's description).\n\nYour task is to print the first moment of time, when the number of warnings for the last $ n $ seconds was not less than $ m $ .",
    "inputFormat": "The first line of the input contains two space-separated integers $ n $ and $ m $ $ (1<=n,m<=10000) $ .\n\nThe second and the remaining lines of the input represent the log stream. The second line of the input contains the first record of the log stream, the third line contains the second record and so on. Each record of the log stream has the above described format. All records are given in the chronological order, that is, the warning records are given in the order, in which the warnings appeared in the program.\n\nIt is guaranteed that the log has at least one record. It is guaranteed that the total length of all lines of the log stream doesn't exceed $ 5·10^{6} $ (in particular, this means that the length of some line does not exceed $ 5·10^{6} $ characters). It is guaranteed that all given dates and times are correct, and the string 'MESSAGE\" in all records is non-empty.",
    "outputFormat": "If there is no sought moment of time, print -1. Otherwise print a string in the format \"2012-MM-DD HH:MM:SS\" (without the quotes) — the first moment of time when the number of warnings for the last $ n $ seconds got no less than $ m $ .",
    "samples": [
        [
            "60 3\n2012-03-16 16:15:25: Disk size is\n2012-03-16 16:15:25: Network failute\n2012-03-16 16:16:29: Cant write varlog\n2012-03-16 16:16:42: Unable to start process\n2012-03-16 16:16:43: Disk size is too small\n2012-03-16 16:16:53: Timeout detected\n",
            "2012-03-16 16:16:43\n"
        ],
        [
            "1 2\n2012-03-16 23:59:59:Disk size\n2012-03-17 00:00:00: Network\n2012-03-17 00:00:01:Cant write varlog\n",
            "-1\n"
        ],
        [
            "2 2\n2012-03-16 23:59:59:Disk size is too sm\n2012-03-17 00:00:00:Network failute dete\n2012-03-17 00:00:01:Cant write varlogmysq\n",
            "2012-03-17 00:00:00\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\n现在给你一份日志，有若干行，每一行由`2012-月-日 时:分:秒:日志信息`，时间为24小时计时法，日志信息中可能会有空格。你的任务是找出第一个往前n秒中有不少于m条日志的在日志里的时刻。\n## 输入格式\n共有若干行，第一行为n和m（1<=n,m<=10000）。第二行开始是日志内容。\n## 输出格式\n如果有这个时刻就输出这个时刻+这个时刻的日志信息（就是这个时刻的输入），否则输出`-1`。"
}