{
    "description": "Vasya is an active Internet user. One day he came across an Internet resource he liked, so he wrote its address in the notebook. We know that the address of the written resource has format:\n\n <protocol>://<domain>.ru\\[/<context>\\]where:\n\n- <protocol> can equal either \"http\" (without the quotes) or \"ftp\" (without the quotes),\n- <domain> is a non-empty string, consisting of lowercase English letters,\n- the /<context> part may not be present. If it is present, then <context> is a non-empty string, consisting of lowercase English letters.\n\nIf string <context> isn't present in the address, then the additional character \"/\" isn't written. Thus, the address has either two characters \"/\" (the ones that go before the domain), or three (an extra one in front of the context).\n\nWhen the boy came home, he found out that the address he wrote in his notebook had no punctuation marks. Vasya must have been in a lot of hurry and didn't write characters \":\", \"/\", \".\".\n\nHelp Vasya to restore the possible address of the recorded Internet resource.",
    "inputFormat": "The first line contains a non-empty string that Vasya wrote out in his notebook. This line consists of lowercase English letters only.\n\nIt is guaranteed that the given string contains at most 50 letters. It is guaranteed that the given string can be obtained from some correct Internet resource address, described above.",
    "outputFormat": "Print a single line — the address of the Internet resource that Vasya liked. If there are several addresses that meet the problem limitations, you are allowed to print any of them.",
    "samples": [
        [
            "httpsunrux\n",
            "http://sun.ru/x\n"
        ],
        [
            "ftphttprururu\n",
            "ftp://http.ru/ruru\n"
        ]
    ],
    "hint": "In the second sample there are two more possible answers: \"ftp://httpruru.ru\" and \"ftp://httpru.ru/ru\".",
    "translation": "Vasya 在学校上信息课时发现了一个很有意思的网站，并把他记录了下来。然而，他实在是太粗心了，以至于等到他回到家才发现，他写下的网址没有打标点符号，只有由一大堆英文字母组成的字符串！\n\nVasya 只记得，他想要写下的网址的格式是 `<protocol>://<domain>.ru[/<context>]`，其中：\n\n- `<protocol>` 可以是 `http`，也可以是 `ftp`。\n- `<domain>` 是一个由小写字母构成的非空字符串。\n- `/<context>` 可有可无。如果有这一部分的话，那么 `<context>` 是一个由小写字母构成的非空字符串。\n\n现在，Vasya 会告诉你他写下的字符串 $s$，请你帮助 Vasya 还原出这个网址。如果有多个网址符合要求，你只需要告诉 Vasya 任意一个符合要求的网址即可。\n\n数据范围：$|s|\\leqslant 50$。\n\nTranslated by Eason_AC"
}