{
    "description": "Mirror Box is a name of a popular game in the Iranian National Amusement Park (INAP). There is a wooden box, $ 10^{5} $ cm long and $ 100 $ cm high in this game. Some parts of the box's ceiling and floor are covered by mirrors. There are two negligibly small holes in the opposite sides of the box at heights $ h_{l} $ and $ h_{r} $ centimeters above the floor. The picture below shows what the box looks like.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF241C/6424a01d70e5009585312ab434deff869a3c6956.png)In the game, you will be given a laser gun to shoot once. The laser beam must enter from one hole and exit from the other one. Each mirror has a preset number $ v_{i} $ , which shows the number of points players gain if their laser beam hits that mirror. Also — to make things even funnier — the beam must not hit any mirror more than once.\n\nGiven the information about the box, your task is to find the maximum score a player may gain. Please note that the reflection obeys the law \"the angle of incidence equals the angle of reflection\".",
    "inputFormat": "The first line of the input contains three space-separated integers $ h_{l},h_{r},n $ ( $ 0&lt;h_{l},h_{r}&lt;100 $ , $ 0<=n<=100 $ ) — the heights of the holes and the number of the mirrors.\n\nNext $ n $ lines contain the descriptions of the mirrors. The $ i $ -th line contains space-separated $ v_{i},c_{i},a_{i},b_{i} $ ; the integer $ v_{i} $ ( $ 1<=v_{i}<=1000 $ ) is the score for the $ i $ -th mirror; the character $ c_{i} $ denotes $ i $ -th mirror's position — the mirror is on the ceiling if $ c_{i} $ equals \"T\" and on the floor if $ c_{i} $ equals \"F\"; integers $ a_{i} $ and $ b_{i} $ ( $ 0<=a_{i}&lt;b_{i}<=10^{5} $ ) represent the $ x $ -coordinates of the beginning and the end of the mirror.\n\nNo two mirrors will share a common point. Consider that the $ x $ coordinate increases in the direction from left to right, so the border with the hole at height $ h_{l} $ has the $ x $ coordinate equal to 0 and the border with the hole at height $ h_{r} $ has the $ x $ coordinate equal to $ 10^{5} $ .",
    "outputFormat": "The only line of output should contain a single integer — the maximum possible score a player could gain.",
    "samples": [
        [
            "50 50 7\n10 F 1 80000\n20 T 1 80000\n30 T 81000 82000\n40 T 83000 84000\n50 T 85000 86000\n60 T 87000 88000\n70 F 81000 89000\n",
            "100\n"
        ],
        [
            "80 72 9\n15 T 8210 15679\n10 F 11940 22399\n50 T 30600 44789\n50 F 32090 36579\n5 F 45520 48519\n120 F 49250 55229\n8 F 59700 80609\n35 T 61940 64939\n2 T 92540 97769\n",
            "120\n"
        ]
    ],
    "hint": "The second sample is depicted above. The red beam gets $ 10+50+5+35+8+2=110 $ points and the blue one gets $ 120 $ .\n\nThe red beam on the picture given in the statement shows how the laser beam can go approximately, this is just illustration how the laser beam can gain score. So for the second sample there is no such beam that gain score 110.",
    "translation": "### 题目简介\n给出一个矩形，两边有两个洞，上下有一些镜子，从一个洞发射一个球，经过两边的镜子会反射，最后到达另外一个洞。每个镜子最多经过一次，每个镜子有一定的价值。问最大价值"
}