{
    "description": "Vasya is pressing the keys on the keyboard reluctantly, squeezing out his ideas on the classical epos depicted in Homer's Odysseus... How can he explain to his literature teacher that he isn't going to become a writer? In fact, he is going to become a programmer. So, he would take great pleasure in writing a program, but none — in writing a composition.\n\nAs Vasya was fishing for a sentence in the dark pond of his imagination, he suddenly wondered: what is the least number of times he should push a key to shift the cursor from one position to another one?\n\nLet's describe his question more formally: to type a text, Vasya is using the text editor. He has already written $ n $ lines, the $ i $ -th line contains $ a_{i} $ characters (including spaces). If some line contains $ k $ characters, then this line overall contains $ (k+1) $ positions where the cursor can stand: before some character or after all characters (at the end of the line). Thus, the cursor's position is determined by a pair of integers $ (r,c) $ , where $ r $ is the number of the line and $ c $ is the cursor's position in the line (the positions are indexed starting from one from the beginning of the line).\n\nVasya doesn't use the mouse to move the cursor. He uses keys \"Up\", \"Down\", \"Right\" and \"Left\". When he pushes each of these keys, the cursor shifts in the needed direction. Let's assume that before the corresponding key is pressed, the cursor was located in the position $ (r,c) $ , then Vasya pushed key:\n\n- \"Up\": if the cursor was located in the first line ( $ r=1 $ ), then it does not move. Otherwise, it moves to the previous line (with number $ r-1 $ ), to the same position. At that, if the previous line was short, that is, the cursor couldn't occupy position $ c $ there, the cursor moves to the last position of the line with number $ r-1 $ ;\n- \"Down\": if the cursor was located in the last line ( $ r=n $ ), then it does not move. Otherwise, it moves to the next line (with number $ r+1 $ ), to the same position. At that, if the next line was short, that is, the cursor couldn't occupy position $ c $ there, the cursor moves to the last position of the line with number $ r+1 $ ;\n- \"Right\": if the cursor can move to the right in this line ( $ c&lt;a_{r}+1 $ ), then it moves to the right (to position $ c+1 $ ). Otherwise, it is located at the end of the line and doesn't move anywhere when Vasya presses the \"Right\" key;\n- \"Left\": if the cursor can move to the left in this line ( $ c&gt;1 $ ), then it moves to the left (to position $ c-1 $ ). Otherwise, it is located at the beginning of the line and doesn't move anywhere when Vasya presses the \"Left\" key.\n\nYou've got the number of lines in the text file and the number of characters, written in each line of this file. Find the least number of times Vasya should push the keys, described above, to shift the cursor from position $ (r_{1},c_{1}) $ to position $ (r_{2},c_{2}) $ .",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 1<=n<=100 $ ) — the number of lines in the file. The second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 0<=a_{i}<=10^{5} $ ), separated by single spaces. The third line contains four integers $ r_{1},c_{1},r_{2},c_{2} $ ( $ 1<=r_{1},r_{2}<=n,1<=c_{1}<=a_{r1}+1,1<=c_{2}<=a_{r2}+1 $ ).",
    "outputFormat": "Print a single integer — the minimum number of times Vasya should push a key to move the cursor from position $ (r_{1},c_{1}) $ to position $ (r_{2},c_{2}) $ .",
    "samples": [
        [
            "4\n2 1 6 4\n3 4 4 2\n",
            "3\n"
        ],
        [
            "4\n10 5 6 4\n1 11 4 2\n",
            "6\n"
        ],
        [
            "3\n10 1 10\n1 10 1 1\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample the editor contains four lines. Let's represent the cursor's possible positions in the line as numbers. Letter $ s $ represents the cursor's initial position, letter $ t $ represents the last one. Then all possible positions of the cursor in the text editor are described by the following table.\n\n123\n\n12\n\n123s567\n\n1t345\n\nOne of the possible answers in the given sample is: \"Left\", \"Down\", \"Left\".",
    "translation": "小v正在使用文本编辑器。\r\n\r\n他已经写了$n$行，第$i$行包含$a_i$个字符(包括空格).\r\n\r\n如果每行包含$k$个字符，那这一行有$k+1$个光标可以达到的位置：在每个字符之前或者行末。因此，光标的位置有一对整数$(r,c)$确定，代表在第$r$行第$c$个位置。（这些位置从行的开始处开始索引。）\r\n\r\n小v不用鼠标，他按上下左右键来控制光标。\r\n\r\n如果光标在第一行，按上没用。\r\n\r\n如果光标在最后一行，按下没用。\r\n\r\n如果光标在行首，按左没用。\r\n\r\n如果光标在行末，按右没用。\r\n\r\n如果鼠标的位置比上一行的行末位置大，如果按上的话，移到上一行的行末。\r\n\r\n如果鼠标的位置比下一行的行末位置大，如果按下的话，移到下一行的行末。\r\n\r\n现在要求出$(r1,c1)$到$(r2,c2)$光标移动的最少距离。\r\n\r\ntranslated by $\\color{red}\\texttt{2020严誉沣}$"
}