{
    "description": "Little Vitaly loves different algorithms. Today he has invented a new algorithm just for you. Vitaly's algorithm works with string $ s $ , consisting of characters \"x\" and \"y\", and uses two following operations at runtime:\n\n1. Find two consecutive characters in the string, such that the first of them equals \"y\", and the second one equals \"x\" and swap them. If there are several suitable pairs of characters, we choose the pair of characters that is located closer to the beginning of the string.\n2. Find in the string two consecutive characters, such that the first of them equals \"x\" and the second one equals \"y\". Remove these characters from the string. If there are several suitable pairs of characters, we choose the pair of characters that is located closer to the beginning of the string.\n\nThe input for the new algorithm is string $ s $ , and the algorithm works as follows:\n\n1. If you can apply at least one of the described operations to the string, go to step 2 of the algorithm. Otherwise, stop executing the algorithm and print the current string.\n2. If you can apply operation 1, then apply it. Otherwise, apply operation 2. After you apply the operation, go to step 1 of the algorithm.\n\nNow Vitaly wonders, what is going to be printed as the result of the algorithm's work, if the input receives string $ s $ .",
    "inputFormat": "The first line contains a non-empty string $ s $ .\n\nIt is guaranteed that the string only consists of characters \"x\" and \"y\". It is guaranteed that the string consists of at most $ 10^{6} $ characters. It is guaranteed that as the result of the algorithm's execution won't be an empty string.",
    "outputFormat": "In the only line print the string that is printed as the result of the algorithm's work, if the input of the algorithm input receives string $ s $ .",
    "samples": [
        [
            "x\n",
            "x\n"
        ],
        [
            "yxyxy\n",
            "y\n"
        ],
        [
            "xxxxxy\n",
            "xxxx\n"
        ]
    ],
    "hint": "In the first test the algorithm will end after the first step of the algorithm, as it is impossible to apply any operation. Thus, the string won't change.\n\nIn the second test the transformation will be like this:\n\n1. string \"yxyxy\" transforms into string \"xyyxy\";\n2. string \"xyyxy\" transforms into string \"xyxyy\";\n3. string \"xyxyy\" transforms into string \"xxyyy\";\n4. string \"xxyyy\" transforms into string \"xyy\";\n5. string \"xyy\" transforms into string \"y\".\n\nAs a result, we've got string \"y\".\n\nIn the third test case only one transformation will take place: string \"xxxxxy\" transforms into string \"xxxx\". Thus, the answer will be string \"xxxx\".",
    "translation": "钦定一个由`X`和`Y`组成的字符串。  \n有两个操作\n1. 出现`YX`时交换他们\n2. 出现`XY`时删除他们\n\n你可以不断地做这些操作（优先做操作1  \n当你不能做任何操作时，输出此时的字符串。  \n\n@我不是箭毒蛙"
}