{
    "description": "There have recently been elections in the zoo. Overall there were $ 7 $ main political parties: one of them is the Little Elephant Political Party, $ 6 $ other parties have less catchy names.\n\nPolitical parties find their number in the ballot highly important. Overall there are $ m $ possible numbers: $ 1,2,...,m $ . Each of these $ 7 $ parties is going to be assigned in some way to exactly one number, at that, two distinct parties cannot receive the same number.\n\nThe Little Elephant Political Party members believe in the lucky digits $ 4 $ and $ 7 $ . They want to evaluate their chances in the elections. For that, they need to find out, how many correct assignments are there, such that the number of lucky digits in the Little Elephant Political Party ballot number is strictly larger than the total number of lucky digits in the ballot numbers of 6 other parties.\n\nHelp the Little Elephant Political Party, calculate this number. As the answer can be rather large, print the remainder from dividing it by $ 1000000007 $ $ (10^{9}+7) $ .",
    "inputFormat": "A single line contains a single positive integer $ m $ $ (7<=m<=10^{9}) $ — the number of possible numbers in the ballot.",
    "outputFormat": "In a single line print a single integer — the answer to the problem modulo $ 1000000007 $ $ (10^{9}+7) $ .",
    "samples": [
        [
            "7\n",
            "0\n"
        ],
        [
            "8\n",
            "1440\n"
        ]
    ],
    "hint": "",
    "translation": "有七个人，每个人可以在 $[1,m]$ 中选择一个数，但注意每个人选择的数不应该相同。定义一个人的幸运指数是他选择的数十进制按位拆分之后 $4$ 和 $7$ 的个数，希望求出第一个人的幸运指数比其他人总和还大的方案数。对 $10^9+7$ 取模。"
}