{
    "description": "One day Vasya was on a physics practical, performing the task on measuring the capacitance. He followed the teacher's advice and did as much as $ n $ measurements, and recorded the results in the notebook. After that he was about to show the results to the teacher, but he remembered that at the last lesson, the teacher had made his friend Petya redo the experiment because the largest and the smallest results differed by more than two times. Vasya is lazy, and he does not want to redo the experiment. He wants to do the task and go home play computer games. So he decided to cheat: before Vasya shows the measurements to the teacher, he will erase some of them, so as to make the largest and the smallest results of the remaining measurements differ in no more than two times. In other words, if the remaining measurements have the smallest result $ x $ , and the largest result $ y $ , then the inequality $ y<=2·x $ must fulfill. Of course, to avoid the teacher's suspicion, Vasya wants to remove as few measurement results as possible from his notes.\n\nHelp Vasya, find what minimum number of measurement results he will have to erase from his notes so that the largest and the smallest of the remaining results of the measurements differed in no more than two times.",
    "inputFormat": "The first line contains integer $ n $ ( $ 2<=n<=10^{5} $ ) — the number of measurements Vasya made. The second line contains $ n $ integers $ c_{1},c_{2},...,c_{n} $ ( $ 1<=c_{i}<=5000 $ ) — the results of the measurements. The numbers on the second line are separated by single spaces.",
    "outputFormat": "Print a single integer — the minimum number of results Vasya will have to remove.",
    "samples": [
        [
            "6\n4 5 3 8 3 7\n",
            "2\n"
        ],
        [
            "4\n4 3 2 4\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample you can remove the fourth and the sixth measurement results (values 8 and 7). Then the maximum of the remaining values will be 5, and the minimum one will be 3. Or else, you can remove the third and fifth results (both equal 3). After that the largest remaining result will be 8, and the smallest one will be 4.",
    "translation": "第一行输入n( 2<=n<=10^5)\r\n\r\n接下来包括n个数据ci（1<=ci<=5000）\r\n\r\n任取两个数x，y都满足y<=2*x\r\n\r\n为了达到这个条件所需要删除一些数据，求最小删除的个数\r\n\r\n注意CF上面明确了\r\n\r\nInput file input.txt\r\n\r\nOutput file output.txt\r\n\r\n而洛谷没有显示"
}