{
    "description": "Little Elephant loves magic squares very much.\n\nA magic square is a $ 3×3 $ table, each cell contains some positive integer. At that the sums of integers in all rows, columns and diagonals of the table are equal. The figure below shows the magic square, the sum of integers in all its rows, columns and diagonals equals 15.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF259B/aae3f0346c9185d03e3596ca4724b5a92e85979b.png)The Little Elephant remembered one magic square. He started writing this square on a piece of paper, but as he wrote, he forgot all three elements of the main diagonal of the magic square. Fortunately, the Little Elephant clearly remembered that all elements of the magic square did not exceed $ 10^{5} $ .\n\nHelp the Little Elephant, restore the original magic square, given the Elephant's notes.",
    "inputFormat": "The first three lines of the input contain the Little Elephant's notes. The first line contains elements of the first row of the magic square. The second line contains the elements of the second row, the third line is for the third row. The main diagonal elements that have been forgotten by the Elephant are represented by zeroes.\n\nIt is guaranteed that the notes contain exactly three zeroes and they are all located on the main diagonal. It is guaranteed that all positive numbers in the table do not exceed $ 10^{5} $ .",
    "outputFormat": "Print three lines, in each line print three integers — the Little Elephant's magic square. If there are multiple magic squares, you are allowed to print any of them. Note that all numbers you print must be positive and not exceed $ 10^{5} $ .\n\nIt is guaranteed that there exists at least one magic square that meets the conditions.",
    "samples": [
        [
            "0 1 1\n1 0 1\n1 1 0\n",
            "1 1 1\n1 1 1\n1 1 1\n"
        ],
        [
            "0 3 6\n5 0 5\n4 7 0\n",
            "6 3 6\n5 5 5\n4 7 4\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\n\n小象非常喜欢幻方。 幻方是一个3×3的表，每个单元格包含一些正整数。此时，表中所有行、列和对角线的整数之和相等。下图显示了幻方，其所有行、列和对角线中的整数之和等于15。 小象想起了一个幻方。他开始在一张纸上写这个正方形，但是当他写的时候，他忘记了幻方主对角线的所有三个元素。幸运的是，小象清楚地记得幻方的所有元素都没有超过10的5次方。 鉴于小象的笔记，帮助小象，恢复原来的幻方。\n\n\n##  输入格式\n\n输入的前三行包含小象的笔记。第一行包含幻方第一行的元素。第二行包含第二行的元素，第三行是第三行。大象忘记的主要对角线元素用零表示。 保证音符正好包含三个零，并且它们都位于主对角线上。保证表中所有正数不超过10的5次方。\n\n## 输出格式\n\n打印三行，每行打印三个整数——小象的幻方。如果有多个幻方，你可以打印其中任何一个。请注意，您打印的所有数字必须是正数，并且不超过10的5次方。 保证至少存在一个满足条件的幻方。"
}