{
    "description": "Vasya has got many devices that work on electricity. He's got $ n $ supply-line filters to plug the devices, the $ i $ -th supply-line filter has $ a_{i} $ sockets.\n\nOverall Vasya has got $ m $ devices and $ k $ electrical sockets in his flat, he can plug the devices or supply-line filters directly. Of course, he can plug the supply-line filter to any other supply-line filter. The device (or the supply-line filter) is considered plugged to electricity if it is either plugged to one of $ k $ electrical sockets, or if it is plugged to some supply-line filter that is in turn plugged to electricity.\n\nWhat minimum number of supply-line filters from the given set will Vasya need to plug all the devices he has to electricity? Note that all devices and supply-line filters take one socket for plugging and that he can use one socket to plug either one device or one supply-line filter.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ , $ k $ ( $ 1<=n,m,k<=50 $ ) — the number of supply-line filters, the number of devices and the number of sockets that he can plug to directly, correspondingly. The second line contains $ n $ space-separated integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=50 $ ) — number $ a_{i} $ stands for the number of sockets on the $ i $ -th supply-line filter.",
    "outputFormat": "Print a single number — the minimum number of supply-line filters that is needed to plug all the devices to electricity. If it is impossible to plug all the devices even using all the supply-line filters, print -1.",
    "samples": [
        [
            "3 5 3\n3 1 2\n",
            "1\n"
        ],
        [
            "4 7 2\n3 3 2 4\n",
            "2\n"
        ],
        [
            "5 5 1\n1 3 1 2 1\n",
            "-1\n"
        ]
    ],
    "hint": "In the first test case he can plug the first supply-line filter directly to electricity. After he plug it, he get 5 (3 on the supply-line filter and 2 remaining sockets for direct plugging) available sockets to plug. Thus, one filter is enough to plug 5 devices.\n\nOne of the optimal ways in the second test sample is to plug the second supply-line filter directly and plug the fourth supply-line filter to one of the sockets in the second supply-line filter. Thus, he gets exactly 7 sockets, available to plug: one to plug to the electricity directly, 2 on the second supply-line filter, 4 on the fourth supply-line filter. There's no way he can plug 7 devices if he use one supply-line filter.",
    "translation": "Vasya 有 $m$ 个电器需要用电，\n他有 $n$ 个插线板，\n第 $i$ 个插线板有 $a_i$ 个插口，\n每个插口可以插入另一个插线板或一个电器\n他的公寓一共有 $k$ 个插座，\n每个插座可以插入一个插线板或一个电器，\n求他最少需要多少个插线板，\n才可以让所有电器都通电。\n若无论如何都无法让所有电器通电，\n就输出 $-1$ 。\n"
}