{
    "description": "Emuskald is an innovative musician and always tries to push the boundaries of music production. Now he has come up with an idea for a revolutionary musical instrument — a rectangular harp.\n\nA rectangular harp is a rectangle $ n×m $ consisting of $ n $ rows and $ m $ columns. The rows are numbered 1 to $ n $ from top to bottom. Similarly the columns are numbered 1 to $ m $ from left to right. String pins are spaced evenly across every side, one per unit. Thus there are $ n $ pins on the left and right sides of the harp and $ m $ pins on its top and bottom. The harp has exactly $ n+m $ different strings, each string connecting two different pins, each on a different side of the harp.\n\nEmuskald has ordered his apprentice to construct the first ever rectangular harp. However, he didn't mention that no two strings can cross, otherwise it would be impossible to play the harp. Two strings cross if the segments connecting their pins intersect. To fix the harp, Emuskald can perform operations of two types:\n\n1. pick two different columns and swap their pins on each side of the harp, not changing the pins that connect each string;\n2. pick two different rows and swap their pins on each side of the harp, not changing the pins that connect each string;\n\nIn the following example, he can fix the harp by swapping two columns:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF269E/ca283618bc939db0f08167d6595154e1a2ad8e22.png)Help Emuskald complete his creation and find the permutations how the rows and columns of the harp need to be rearranged, or tell that it is impossible to do so. He can detach and reattach each string to its pins, so the physical layout of the strings doesn't matter.",
    "inputFormat": "The first line of input contains two space-separated integers numbers $ n $ and $ m $ ( $ 1<=n,m<=10^{5} $ ), the height and width of the harp in units. Each of the following $ n+m $ lines contains 4 space-separated tokens, describing a single string: two symbols $ a_{i} $ , $ b_{i} $ and two integer numbers $ p_{i} $ , $ q_{i} $ . The pair $ a_{i} $ , $ p_{i} $ describes the first pin, and the pair $ b_{i} $ , $ q_{i} $ describes the second pin of the string;\n\nA pair $ s $ , $ x $ describes the position of a single pin in a following way:\n\n1. $ s $ is equal to one of the symbols \"L\", \"T\", \"R\" or \"B\" (without quotes), which means that the pin is positioned on the left, top, right or bottom side of the harp accordingly;\n2. $ x $ is equal to the number of the row, if the pin is on the left or right border of the harp, and to the number of the column, if the pin is on the top or bottom border of the harp.\n\nIt is guaranteed that no two different strings are connected to the same pin.",
    "outputFormat": "If it is possible to rearrange the rows and columns to fix the harp, on the first line output $ n $ space-separated integers — the old numbers of rows now placed from top to bottom in the fixed harp. On the second line, output $ m $ space-separated integers — the old numbers of columns now placed from left to right in the fixed harp.\n\nIf it is impossible to rearrange the rows and columns to fix the harp, output \"No solution\" (without quotes).",
    "samples": [
        [
            "3 4\nL T 1 3\nL B 2 2\nL B 3 3\nT R 1 2\nT B 2 1\nT R 4 1\nB R 4 3\n",
            "1 2 3 \n3 2 1 4 \n"
        ],
        [
            "3 3\nL T 1 1\nT R 3 1\nR B 3 3\nB L 1 3\nL R 2 2\nT B 2 2\n",
            "No solution\n"
        ]
    ],
    "hint": ""
}