{
    "description": "Squirrel Liss loves nuts. Liss asks you to plant some nut trees.\n\nThere are $ n $ positions (numbered 1 to $ n $ from west to east) to plant a tree along a street. Trees grow one meter per month. At the beginning of each month you should process one query. The query is one of the following types:\n\n1. Plant a tree of height $ h $ at position $ p $ .\n2. Cut down the $ x $ -th existent (not cut) tree from the west (where $ x $ is 1-indexed). When we cut the tree it drops down and takes all the available place at the position where it has stood. So no tree can be planted at this position anymore.\n\nAfter processing each query, you should print the length of the longest increasing subsequence. A subset of existent trees is called an increasing subsequence if the height of the trees in the set is strictly increasing from west to east (for example, the westmost tree in the set must be the shortest in the set). The length of the increasing subsequence is the number of trees in it.\n\nNote that Liss don't like the trees with the same heights, so it is guaranteed that at any time no two trees have the exactly same heights.",
    "inputFormat": "The first line contains two integers: $ n $ and $ m $ ( $ 1<=n<=10^{5}; 1<=m<=2·10^{5} $ ) — the number of positions and the number of queries.\n\nNext $ m $ lines contains the information of queries by following formats:\n\n- If the $ i $ -th query is type 1, the $ i $ -th line contains three integers: 1, $ p_{i} $ , and $ h_{i} $ ( $ 1<=p_{i}<=n,1<=h_{i}<=10 $ ), where $ p_{i} $ is the position of the new tree and $ h_{i} $ is the initial height of the new tree.\n- If the $ i $ -th query is type 2, the $ i $ -th line contains two integers: 2 and $ x_{i} $ ( $ 1<=x_{i}<=10 $ ), where the $ x_{i} $ is the index of the tree we want to cut.\n\nThe input is guaranteed to be correct, i.e.,\n\n- For type 1 queries, $ p_{i} $ will be pairwise distinct.\n- For type 2 queries, $ x_{i} $ will be less than or equal to the current number of trees.\n- At any time no two trees have the exactly same heights.\n\nIn each line integers are separated by single spaces.",
    "outputFormat": "Print $ m $ integers — the length of the longest increasing subsequence after each query. Separate the numbers by whitespaces.",
    "samples": [
        [
            "4 6\n1 1 1\n1 4 4\n1 3 4\n2 2\n1 2 8\n2 3\n",
            "1\n2\n3\n2\n2\n2\n"
        ]
    ],
    "hint": "States of street after each query you can see on the following animation:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF264E/d9e4fa5cd79261f3aad9ee385bd25a1e662d547a.png)If your browser doesn't support animation png, please see the gif version here: http://212.193.37.254/codeforces/images/162/roadtree.gif",
    "translation": "在$ 1∼n $ 的位置能种树，刚开始能种树。  \n第$ i $ 个时刻会有操作：  \n1.在一个没种过树的位置$ p_i $ 种一颗高度为$ h_i $ 的树。  \n2.砍掉第$ x_i $ 棵树，保证这个位置以后不会种树。  \n每天树会长高1  \n每执行一次操作，输出最长上升子序列长度  \n任意时刻树的高度不同      \nTranslated by@Fheiwn "
}