{
    "description": "There are two sequences of colorful stones. The color of each stone is one of red, green, or blue. You are given two strings $ s $ and $ t $ . The $ i $ -th (1-based) character of $ s $ represents the color of the $ i $ -th stone of the first sequence. Similarly, the $ i $ -th (1-based) character of $ t $ represents the color of the $ i $ -th stone of the second sequence. If the character is \"R\", \"G\", or \"B\", the color of the corresponding stone is red, green, or blue, respectively.\n\nInitially Squirrel Liss is standing on the first stone of the first sequence and Cat Vasya is standing on the first stone of the second sequence. You can perform the following instructions zero or more times.\n\nEach instruction is one of the three types: \"RED\", \"GREEN\", or \"BLUE\". After an instruction $ c $ , the animals standing on stones whose colors are $ c $ will move one stone forward. For example, if you perform an instruction «RED», the animals standing on red stones will move one stone forward. You are not allowed to perform instructions that lead some animals out of the sequences. In other words, if some animals are standing on the last stones, you can't perform the instructions of the colors of those stones.\n\nA pair of positions (position of Liss, position of Vasya) is called a state. A state is called reachable if the state is reachable by performing instructions zero or more times from the initial state (1, 1). Calculate the number of distinct reachable states.",
    "inputFormat": "The input contains two lines. The first line contains the string $ s $ ( $ 1<=|s|<=10^{6} $ ). The second line contains the string $ t $ ( $ 1<=|t|<=10^{6} $ ). The characters of each string will be one of \"R\", \"G\", or \"B\".",
    "outputFormat": "Print the number of distinct reachable states in a single line.\n\nPlease, do not write the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "RBR\nRGG\n",
            "5\n"
        ],
        [
            "RGBB\nBRRBRR\n",
            "19\n"
        ],
        [
            "RRRRRRRRRR\nRRRRRRRR\n",
            "8\n"
        ]
    ],
    "hint": "In the first example, there are five reachable states: (1, 1), (2, 2), (2, 3), (3, 2), and (3, 3). For example, the state (3, 3) is reachable because if you perform instructions \"RED\", \"GREEN\", and \"BLUE\" in this order from the initial state, the state will be (3, 3). The following picture shows how the instructions work in this case.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF264D/ff8e8d184349ca742f85291d5c556a28aebdf7a7.png)",
    "translation": "两个串$ s,t $ ，字符只有RGB三种  \n刚开始有两个人在串的开头，记为$ (1,1) $ 。  \n假设当前为$ (x,y) $ 若$ s_x=s_y $ ，下一步能转移到$ (x+1,y+1) $ ,否则**只能到**$ (x,y+1) $ 或$ (x+1,y) $ 。  \n但任何时候不允许一个人走到串外  \nTranslated by @Fheiwn "
}