{
    "description": "Roma works in a company that sells TVs. Now he has to prepare a report for the last year.\n\nRoma has got a list of the company's incomes. The list is a sequence that consists of $ n $ integers. The total income of the company is the sum of all integers in sequence. Roma decided to perform exactly $ k $ changes of signs of several numbers in the sequence. He can also change the sign of a number one, two or more times.\n\nThe operation of changing a number's sign is the operation of multiplying this number by - $ 1 $ .\n\nHelp Roma perform the changes so as to make the total income of the company (the sum of numbers in the resulting sequence) maximum. Note that Roma should perform exactly $ k $ changes.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ $ (1<=n,k<=10^{5}) $ , showing, how many numbers are in the sequence and how many swaps are to be made.\n\nThe second line contains a non-decreasing sequence, consisting of $ n $ integers $ a_{i} $ $ (|a_{i}|<=10^{4}) $ .\n\nThe numbers in the lines are separated by single spaces. Please note that the given sequence is sorted in non-decreasing order.",
    "outputFormat": "In the single line print the answer to the problem — the maximum total income that we can obtain after exactly $ k $ changes.",
    "samples": [
        [
            "3 2\n-1 -1 1\n",
            "3\n"
        ],
        [
            "3 1\n-1 -1 1\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample we can get sequence \\[1, 1, 1\\], thus the total income equals $ 3 $ .\n\nIn the second test, the optimal strategy is to get sequence \\[-1, 1, 1\\], thus the total income equals $ 1 $ .",
    "translation": "## 题目描述\r\n一个人要统计他所在公司的总收入并且他想使总收入达到最大，收入写在一条清单上，总收入是清单上所有数之和。\r\n\r\n他有 $k$ 次操作的机会，每次操作可以将某个数一个数变成其相反数，例如 $1$ 变成 $−1$ （注意，他必须严格执行 $k$ 次）问总收入最大是多少？\r\n\r\n## 输入格式\r\n第一行有两个整数 $n,k$ $(1<=n,k<=105)$\r\n\r\n第二行有 n 个按升序排列整数 $a_1, a_2, a_3 ... a_n$ $(|a_i|<=10^4)$\r\n\r\n## 输出格式\r\n一个数\r\n\r\n## 输入输出样例\r\n### 输入 #1               \r\n\t3 2\r\n\t-1 -1 1\r\n### 输出 #1\r\n\t3\r\n### 输入 #2\r\n\t3 1\r\n\t-1 -1 1\r\n### 输出 #2\r\n\t1\r\n\r\n## 说明/提示\r\n在第一个样例中，我们可以得到序列 $[1,1,1]$ ，因此总收入等于 $3$。\r\n\r\n在第二个样例中，我们可以得到序列 $[-1,1,1]$，因此总收入等于 $1$。"
}