{
    "description": "As a big fan of Formula One, Charlie is really happy with the fact that he has to organize ticket sells for the next Grand Prix race in his own city. Unfortunately, the finacial crisis is striking everywhere and all the banknotes left in his country are valued either 10 euros or 20 euros. The price of all tickets for the race is 10 euros, so whenever someone comes to the ticket store only with 20 euro banknote Charlie must have a 10 euro banknote to give them change. Charlie realize that with the huge deficit of banknotes this could be a problem. Charlie has some priceless information but couldn't make use of it, so he needs your help. Exactly $ n+m $ people will come to buy a ticket. $ n $ of them will have only a single 10 euro banknote, and $ m $ of them will have only a single 20 euro banknote. Currently Charlie has $ k $ 10 euro banknotes, which he can use for change if needed. All $ n+m $ people will come to the ticket store in random order, all orders are equiprobable. Return the probability that the ticket selling process will run smoothly, i.e. Charlie will have change for every person with 20 euro banknote.",
    "inputFormat": "The input consist of a single line with three space separated integers, $ n $ , $ m $ and $ k $ ( $ 0<=n,m<=10^{5} $ , $ 0<=k<=10 $ ).",
    "outputFormat": "Output on a single line the desired probability with at least $ 4 $ digits after the decimal point.",
    "samples": [
        [
            "5 3 1\n",
            "0.857143\n"
        ],
        [
            "0 5 5\n",
            "1\n"
        ],
        [
            "0 1 0\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "足球赛要到了，小C负责卖票。票价为每人10元，而有n个人带了10元，m个人带了20元，开始的时候小C有k张10元。假定这n+m个人前来买票的顺序是随机的，试求小C能够顺利卖给这些人票的概率是多少。（译者:就是都能找开钱）\n\n输入:一行三个整数，n,m,k\n输出:一个浮点数，表示能够顺利卖票的概率（至少保留到四位小数）\n\nTranslated by 稀神探女"
}