{
    "description": "There is a sequence of colorful stones. The color of each stone is one of red, green, or blue. You are given a string $ s $ . The $ i $ -th (1-based) character of $ s $ represents the color of the $ i $ -th stone. If the character is \"R\", \"G\", or \"B\", the color of the corresponding stone is red, green, or blue, respectively.\n\nInitially Squirrel Liss is standing on the first stone. You perform instructions one or more times.\n\nEach instruction is one of the three types: \"RED\", \"GREEN\", or \"BLUE\". After an instruction $ c $ , if Liss is standing on a stone whose colors is $ c $ , Liss will move one stone forward, else she will not move.\n\nYou are given a string $ t $ . The number of instructions is equal to the length of $ t $ , and the $ i $ -th character of $ t $ represents the $ i $ -th instruction.\n\nCalculate the final position of Liss (the number of the stone she is going to stand on in the end) after performing all the instructions, and print its 1-based position. It is guaranteed that Liss don't move out of the sequence.",
    "inputFormat": "The input contains two lines. The first line contains the string $ s $ ( $ 1<=|s|<=50 $ ). The second line contains the string $ t $ ( $ 1<=|t|<=50 $ ). The characters of each string will be one of \"R\", \"G\", or \"B\". It is guaranteed that Liss don't move out of the sequence.",
    "outputFormat": "Print the final 1-based position of Liss in a single line.",
    "samples": [
        [
            "RGB\nRRR\n",
            "2\n"
        ],
        [
            "RRRBGBRBBB\nBBBRR\n",
            "3\n"
        ],
        [
            "BRRBGBRGRBGRGRRGGBGBGBRGBRGRGGGRBRRRBRBBBGRRRGGBBB\nBBRBGGRGRGBBBRBGRBRBBBBRBRRRBGBBGBBRRBBGGRBRRBRGRB\n",
            "15\n"
        ]
    ],
    "hint": "",
    "translation": "给你一个字符串 $s$ ， 再给一个字符串 $t$ （$|s| ,                     |t| \\leq 50$） ， 这两个字符串仅包含 ‘R’ 和 ‘G’ 和 ‘B’， 代表石头的 $3$ 种颜色 。起初，松鼠利斯站在第一块石头上 。 对于 $t$ 中的每一个字符 $t_i$ ，如果 $t_i$ 的字符和当前石头的颜色相等 ， 则松鼠利斯就向前跳 $1$ 步 ， 否则就原地不动。 \n\n输出一个整数，代表松鼠利斯在执行完命令后在第几块石头上。"
}