{
    "description": "Manao's friends often send him new songs. He never listens to them right away. Instead, he compiles them into a playlist. When he feels that his mind is open to new music, he opens the playlist and starts to listen to the songs.\n\nOf course, there are some songs that Manao doesn't particuarly enjoy. To get more pleasure from the received songs, he invented the following procedure of listening to the playlist:\n\n- If after listening to some song Manao realizes that he liked it, then he remembers it and starts to listen to the next unlistened song.\n- If after listening to some song Manao realizes that he did not like it, he listens to all the songs he liked up to this point and then begins to listen to the next unlistened song.\n\nFor example, if Manao has four songs in the playlist, A, B, C, D (in the corresponding order) and he is going to like songs A and C in the end, then the order of listening is the following:\n\n1. Manao listens to A, he likes it, he remembers it.\n2. Manao listens to B, he does not like it, so he listens to A, again.\n3. Manao listens to C, he likes the song and he remembers it, too.\n4. Manao listens to D, but does not enjoy it and re-listens to songs A and C.\n\nThat is, in the end Manao listens to song A three times, to song C twice and songs B and D once. Note that if Manao once liked a song, he will never dislike it on a subsequent listening.\n\nManao has received $ n $ songs: the $ i $ -th of them is $ l_{i} $ seconds long and Manao may like it with a probability of $ p_{i} $ percents. The songs could get on Manao's playlist in any order, so Manao wants to know the maximum expected value of the number of seconds after which the listening process will be over, for all possible permutations of the songs in the playlist.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=50000 $ ). The $ i $ -th of the following $ n $ lines contains two integers, separated by a single space — $ l_{i} $ and $ p_{i} $ ( $ 15<=l_{i}<=1000 $ , $ 0<=p_{i}<=100 $ ) — the length of the $ i $ -th song in seconds and the probability that Manao will like the song, in percents.",
    "outputFormat": "In a single line print a single real number — the maximum expected listening time over all permutations of songs. The answer will be considered valid if the absolute or relative error does not exceed $ 10^{-9} $ .",
    "samples": [
        [
            "3\n150 20\n150 50\n100 50\n",
            "537.500000000\n"
        ],
        [
            "4\n300 0\n300 50\n240 50\n360 80\n",
            "2121.000000000\n"
        ]
    ],
    "hint": "Consider the first test case. If Manao listens to the songs in the order in which they were originally compiled, the mathematical expectation will be equal to 467.5 seconds. The maximum expected value is obtained by putting the first song at the end of the playlist.\n\nConsider the second test case. The song which is 360 seconds long should be listened to first. The song 300 seconds long which Manao will dislike for sure should be put in the end.",
    "translation": "有 $n$ 首长度为 $l[i]$ 的歌，每首歌 $\\text{Manao}$ 有 $ p[i]$ 的概率喜欢。在听歌时，若 $\\text{Manao}$ 听到了一首不喜欢的歌他会再听完这首歌后返回去听之前所有喜欢的歌。问 $\\text{Manao}$ 听完这 $n$ 首歌的时间期望最大是多少。听歌的顺序由我们来安排。"
}