{
    "description": "Dima's got a staircase that consists of $ n $ stairs. The first stair is at height $ a_{1} $ , the second one is at $ a_{2} $ , the last one is at $ a_{n} $ ( $ 1<=a_{1}<=a_{2}<=...<=a_{n} $ ).\n\nDima decided to play with the staircase, so he is throwing rectangular boxes at the staircase from above. The $ i $ -th box has width $ w_{i} $ and height $ h_{i} $ . Dima throws each box vertically down on the first $ w_{i} $ stairs of the staircase, that is, the box covers stairs with numbers $ 1,2,...,w_{i} $ . Each thrown box flies vertically down until at least one of the two following events happen:\n\n- the bottom of the box touches the top of a stair;\n- the bottom of the box touches the top of a box, thrown earlier.\n\nWe only consider touching of the horizontal sides of stairs and boxes, at that touching with the corners isn't taken into consideration. Specifically, that implies that a box with width $ w_{i} $ cannot touch the stair number $ w_{i}+1 $ .\n\nYou are given the description of the staircase and the sequence in which Dima threw the boxes at it. For each box, determine how high the bottom of the box after landing will be. Consider a box to fall after the previous one lands.",
    "inputFormat": "The first line contains integer $ n $ $ (1<=n<=10^{5}) $ — the number of stairs in the staircase. The second line contains a non-decreasing sequence, consisting of $ n $ integers, $ a_{1},a_{2},...,a_{n} $ $ (1<=a_{i}<=10^{9}; a_{i}<=a_{i+1}) $ .\n\nThe next line contains integer $ m $ $ (1<=m<=10^{5}) $ — the number of boxes. Each of the following $ m $ lines contains a pair of integers $ w_{i},h_{i} $ $ (1<=w_{i}<=n; 1<=h_{i}<=10^{9}) $ — the size of the $ i $ -th thrown box.\n\nThe numbers in the lines are separated by spaces.",
    "outputFormat": "Print $ m $ integers — for each box the height, where the bottom of the box will be after landing. Print the answers for the boxes in the order, in which the boxes are given in the input.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in C++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "5\n1 2 3 6 6\n4\n1 1\n3 1\n1 1\n4 3\n",
            "1\n3\n4\n6\n"
        ],
        [
            "3\n1 2 3\n2\n1 1\n3 1\n",
            "1\n3\n"
        ],
        [
            "1\n1\n5\n1 2\n1 10\n1 10\n1 10\n1 10\n",
            "1\n3\n13\n23\n33\n"
        ]
    ],
    "hint": "The first sample are shown on the picture.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF272C/141a6409b5823a4a8bdecfcecc6a55967701b504.png)",
    "translation": "Dima有一个楼梯，由n阶台阶组成。台阶从左到右的高度依次为a1,a2,…an（保证不下降）。Dima将宽度为wi，高度为hi的箱子对齐楼梯左上角垂直放下，箱子会掉到楼梯上。箱子掉落在楼梯上的位置规定如下：\r\n箱子底部碰到楼梯或是其他箱子顶部就会水平停放在该位置。\r\nDima连续将m个箱子抛出后，求每个箱子的停放高度。"
}