{
    "description": "Dima came to the horse land. There are $ n $ horses living in the land. Each horse in the horse land has several enemies (enmity is a symmetric relationship). The horse land isn't very hostile, so the number of enemies of each horse is at most 3.\n\nRight now the horse land is going through an election campaign. So the horses trusted Dima to split them into two parts. At that the horses want the following condition to hold: a horse shouldn't have more than one enemy in its party.\n\nHelp Dima split the horses into parties. Note that one of the parties can turn out to be empty.",
    "inputFormat": "The first line contains two integers $ n,m $ ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF272E/dac9c4b7533b005d45a40124a615b184d0f4824d.png) — the number of horses in the horse land and the number of enemy pairs.\n\nNext $ m $ lines define the enemy pairs. The $ i $ -th line contains integers $ a_{i},b_{i} $ $ (1<=a_{i},b_{i}<=n; a_{i}≠b_{i}) $ , which mean that horse $ a_{i} $ is the enemy of horse $ b_{i} $ .\n\nConsider the horses indexed in some way from 1 to $ n $ . It is guaranteed that each horse has at most three enemies. No pair of enemies occurs more than once in the input.",
    "outputFormat": "Print a line, consisting of $ n $ characters: the $ i $ -th character of the line must equal \"0\", if the horse number $ i $ needs to go to the first party, otherwise this character should equal \"1\".\n\nIf there isn't a way to divide the horses as required, print -1.",
    "samples": [
        [
            "3 3\n1 2\n3 2\n3 1\n",
            "100\n"
        ],
        [
            "2 1\n2 1\n",
            "00\n"
        ],
        [
            "10 6\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4\n",
            "0110000000\n"
        ]
    ],
    "hint": "",
    "translation": "给定 $n$ 个点和 $m$ 条双向边，每个点最多有 $3$ 个点与它直接连接，将图分成两个部分，保证一个部分中的每个点在此部分中不存在 $2$ 个及以上的点与它直接连接。如果无解输出 $-1$，否则输出划分方案，划分在第一部分输出 $0$，划分在第二部分输出 $1$，不加空格。"
}