{
    "description": "Coming up with a new problem isn't as easy as many people think. Sometimes it is hard enough to name it. We'll consider a title original if it doesn't occur as a substring in any titles of recent Codeforces problems.\n\nYou've got the titles of $ n $ last problems — the strings, consisting of lowercase English letters. Your task is to find the shortest original title for the new problem. If there are multiple such titles, choose the lexicographically minimum one. Note, that title of the problem can't be an empty string.\n\nA substring $ s[l...\\ r] $ $ (1<=l<=r<=|s|) $ of string $ s=s_{1}s_{2}...\\ s_{|s|} $ (where $ |s| $ is the length of string $ s $ ) is string $ s_{l}s_{l+1}...\\ s_{r} $ .\n\nString $ x=x_{1}x_{2}...\\ x_{p} $ is lexicographically smaller than string $ y=y_{1}y_{2}...\\ y_{q} $ , if either $ p&lt;q $ and $ x_{1}=y_{1},x_{2}=y_{2},...\\ ,x_{p}=y_{p} $ , or there exists such number $ r $ $ (r&lt;p,r&lt;q) $ , that $ x_{1}=y_{1},x_{2}=y_{2},...\\ ,x_{r}=y_{r} $ and $ x_{r+1}&lt;y_{r+1} $ . The string characters are compared by their ASCII codes.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=30 $ ) — the number of titles you've got to consider. Then follow $ n $ problem titles, one per line. Each title only consists of lowercase English letters (specifically, it doesn't contain any spaces) and has the length from 1 to 20, inclusive.",
    "outputFormat": "Print a string, consisting of lowercase English letters — the lexicographically minimum shortest original title.",
    "samples": [
        [
            "5\nthreehorses\ngoodsubstrings\nsecret\nprimematrix\nbeautifulyear\n",
            "j\n"
        ],
        [
            "4\naa\nbdefghijklmn\nopqrstuvwxyz\nc\n",
            "ab\n"
        ]
    ],
    "hint": "In the first sample the first 9 letters of the English alphabet (a, b, c, d, e, f, g, h, i) occur in the problem titles, so the answer is letter j.\n\nIn the second sample the titles contain 26 English letters, so the shortest original title cannot have length 1. Title aa occurs as a substring in the first title.",
    "translation": "出一道新题并不是那么容易的一件事情。光是给题目起名字就是件麻烦事。\n\n我们说一个题目名字是原创性的，当且仅当它不是之前任何一个题目名字的子串。\n\n之前的所有题目名字有 $ n $  个，每个题目名字全部由小写英文字母组成。\n\n你的任务是构造一个最短的原创性的题目名字，如果这样的题目名字有多个，你需要输\n\n出字典序最小的那一个。"
}