{
    "description": "The Bitlandians are quite weird people. They have their own problems and their own solutions. They have their own thoughts and their own beliefs, they have their own values and their own merits. They have their own dishes and their own sausages!\n\nIn Bitland a sausage is an array of integers! A sausage's deliciousness is equal to the bitwise excluding OR (the $ xor $ operation) of all integers in that sausage.\n\nOne day, when Mr. Bitkoch (the local cook) was going to close his BitRestaurant, BitHaval and BitAryo, the most famous citizens of Bitland, entered the restaurant and each ordered a sausage.\n\nBut Mr. Bitkoch had only one sausage left. So he decided to cut a prefix (several, may be zero, first array elements) of the sausage and give it to BitHaval and a postfix (several, may be zero, last array elements) of the sausage and give it to BitAryo. Note that one or both pieces of the sausage can be empty. Of course, the cut pieces mustn't intersect (no array element can occur in both pieces).\n\nThe pleasure of BitHaval and BitAryo is equal to the bitwise XOR of their sausages' deliciousness. An empty sausage's deliciousness equals zero.\n\nFind a way to cut a piece of sausage for BitHaval and BitAryo that maximizes the pleasure of these worthy citizens.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=10^{5} $ ).\n\nThe next line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ $ (0<=a_{i}<=10^{12}) $ — Mr. Bitkoch's sausage.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "outputFormat": "Print a single integer — the maximum pleasure BitHaval and BitAryo can get from the dinner.",
    "samples": [
        [
            "2\n1 2\n",
            "3\n"
        ],
        [
            "3\n1 2 3\n",
            "3\n"
        ],
        [
            "2\n1000 1000\n",
            "1000\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个序列，选择一个前缀与一个与之不相交的后缀，使得所有被选择的数的异或和最大。"
}