{
    "description": "Farmer John is hosting a tennis tournament with his $ n $ cows. Each cow has a skill level $ s_{i} $ , and no two cows having the same skill level. Every cow plays every other cow exactly once in the tournament, and each cow beats every cow with skill level lower than its own.\n\nHowever, Farmer John thinks the tournament will be demoralizing for the weakest cows who lose most or all of their matches, so he wants to flip some of the results. In particular, at $ k $ different instances, he will take two integers $ a_{i},b_{i} $ $ (a_{i}<b_{i}) $ and flip all the results between cows with skill level between $ a_{i} $ and $ b_{i} $ inclusive. That is, for any pair $ x,y $ ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF283E/7acc269d103239529ceb47c1b525554954b93d55.png) he will change the result of the match on the final scoreboard (so if $ x $ won the match, the scoreboard will now display that $ y $ won the match, and vice versa). It is possible that Farmer John will change the result of a match multiple times. It is not guaranteed that $ a_{i} $ and $ b_{i} $ are equal to some cow's skill level.\n\nFarmer John wants to determine how balanced he made the tournament results look. In particular, he wants to count the number of triples of cows $ (p,q,r) $ for which the final leaderboard shows that cow $ p $ beats cow $ q $ , cow $ q $ beats cow $ r $ , and cow $ r $ beats cow $ p $ . Help him determine this number.\n\nNote that two triples are considered different if they do not contain the same set of cows (i.e. if there is a cow in one triple that is not in the other).",
    "inputFormat": "On the first line are two space-separated integers, $ n $ and $ k $ $ (3<=n<=10^{5}; 0<=k<=10^{5}) $ . On the next line are $ n $ space-separated distinct integers, $ s_{1},s_{2},...,s_{n} $ $ (1<=s_{i}<=10^{9}) $ , denoting the skill levels of the cows. On the next $ k $ lines are two space separated integers, $ a_{i} $ and $ b_{i} $ $ (1<=a_{i}<b_{i}<=10^{9}) $ representing the changes Farmer John made to the scoreboard in the order he makes it.",
    "outputFormat": "A single integer, containing the number of triples of cows $ (p,q,r) $ for which the final leaderboard shows that cow $ p $ beats cow $ q $ , cow $ q $ beats cow $ r $ , and cow $ r $ beats cow $ p $ .\n\nPlease do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "3 2\n1 2 3\n1 2\n2 3\n",
            "1\n"
        ],
        [
            "5 3\n5 9 4 1 7\n1 7\n2 8\n3 9\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample, cow 3 > cow 1, cow 3 > cow 2, and cow 2 > cow 1. However, the results between cows 1 and 2 and cows 2 and 3 are flipped, so now FJ's results show that cow 1 > cow 2, cow 2 > cow 3, and cow 3 > cow 1, so cows 1, 2, and 3 form a balanced triple.",
    "translation": "- 有 $n$ 头牛，$k$ 次操作。\n- 每头牛有个能力值 $s_i$。对于两头牛，令能力值大的那个向能力值小的那个连一条有向边。\n- 第 $i$ 次操作中，$\\rm Farmer\\ John$ 会选择一段区间 $[a_i, b_i]$，并且对于 $\\forall x, y \\in [1,n] \\land s_x,s_y \\in[a_i, b_i]$，将 $x$ 与 $y$ 间的连边反向。\n- 请你求出，进行 $k$ 次操作之后，图中有多少三元环。\n- $3 \\leq n \\leq 10^5$，$0 \\leq k \\leq 10^5$，$1 \\leq s_i \\leq 10^9$，$1 \\leq a_i < b_i \\leq 10^9$。保证 $s_i$ 互不相同，不保证 $a_i$ 或者 $b_i$ 与某个 $s_j$ 相同。"
}