{
    "description": "A double tourist path, located at a park in Ultima Thule, is working by the following principle:\n\n- We introduce the Cartesian coordinate system.\n- At some points of time there are two tourists going (for a walk) from points $ (-1,0) $ and $ (1,0) $ simultaneously. The first one is walking from $ (-1,0) $ , the second one is walking from $ (1,0) $ .\n- Both tourists in a pair move at the same speed $ 1 $ (distance unit per second), the first one moves along line $ x=-1 $ , the second one moves along line $ x=1 $ , both of them are moving in the positive direction of the $ Oy $ axis.\n- At some points of time walls appear. Wall $ (l_{i},r_{i}) $ is a segment between points $ (0,l_{i}) $ and $ (0,r_{i}) $ . Each wall appears immediately.\n\nThe Ultima Thule government wants to learn this for each pair of tourists that walk simultaneously: for how long (in seconds) will they not see each other? Two tourists don't see each other if the segment that connects their positions on the plane intersects at least one wall. Two segments intersect if they share at least one point. We assume that the segments' ends belong to the segments.\n\nHelp the government count the required time. Note that the walls can intersect (in any way) or coincide.",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ m $ ( $ 1<=n,m<=10^{5} $ ) — the number of pairs of tourists and the number of built walls. The next $ m $ lines contain three space-separated integers $ l_{i} $ , $ r_{i} $ and $ t_{i} $ each ( $ 0<=l_{i}<r_{i}<=10^{9} $ , $ 0<=t_{i}<=10^{9} $ ) — the wall ends and the time it appeared. The last line contains $ n $ distinct space-separated strictly increasing integers $ q_{1},q_{2},...,q_{n} $ ( $ 0<=q_{i}<=10^{9} $ ) — the points of time when pairs of tourists walk.\n\nAll points of time are given in seconds.",
    "outputFormat": "For each pair of tourists print on a single line a single integer — the time in seconds when the two tourists from the corresponding pair won't see each other. Print the numbers in the order in which the they go in the input.",
    "samples": [
        [
            "2 2\n1 4 3\n3 6 5\n0 1\n",
            "2\n4\n"
        ],
        [
            "3 3\n0 3 4\n0 1 2\n2 4 0\n1 3 4\n",
            "2\n4\n4\n"
        ]
    ],
    "hint": "",
    "translation": "在笛卡尔坐标系上\n\n起始位置$(-1,0),(1,0)$\n\n在某些时刻$q_i$会有两人竖直向上每秒移动一个单位\n\n在某些时刻$t_i$，会在点$ (0,l_i),(0,r_i)$间出现一堵墙\n\n对于每两个人，求他们能够互相看不见的时间\n\n输入格式：\n\n第一行两个数n,m，分别表示几对人和几面墙\n\n接下来m行，每行三个数$l_i,r_i,t_i$\n\n最后一行n个数，为$q_i$\n\nTranslated by Fheiwn"
}