{
    "description": "Shaass thinks a kitchen with all white floor tiles is so boring. His kitchen floor is made of $ n·m $ square tiles forming a $ n×m $ rectangle. Therefore he's decided to color some of the tiles in black so that the floor looks like a checkerboard, which is no two side-adjacent tiles should have the same color.\n\nShaass wants to use a painter robot to color the tiles. In the beginning the robot is standing in a border tile $ (x_{s},y_{s}) $ facing a diagonal direction (i.e. upper-left, upper-right, down-left or down-right). As the robot walks in the kitchen he paints every tile he passes even if it's painted before. Painting each tile consumes one unit of black paint. If at any moment the robot hits a wall of the kitchen he changes his direction according the reflection rules. Note that a tile gets painted when the robot enters the tile from another tile, in other words changing direction in the same tile doesn't lead to any painting. The first tile the robot is standing on, is also painted.\n\nThe robot stops painting the first moment the floor is checkered. Given the dimensions of the kitchen and the position of the robot, find out the amount of paint the robot consumes before it stops painting the floor.\n\nLet's consider an examples depicted below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF294D/9a76f461f123d79b09ad121ee5e2505584689476.png)If the robot starts at tile number 1 (the tile $ (1,1) $ ) of the left grid heading to down-right it'll pass tiles 1354236 and consumes 7 units of black paint on his way until he stops at tile number 6. But if it starts at tile number 1 in the right grid heading to down-right it will get stuck in a loop painting tiles 1, 2, and 3.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ , $ (2<=n,m<=10^{5}) $ . The second line contains two integers $ x_{s} $ and $ y_{s} $ $ (1<=x_{s}<=n,1<=y_{s}<=m) $ and the direction robot is facing initially. Direction is one of the strings: \"UL\" (upper-left direction), \"UR\" (upper-right), \"DL\" (down-left) or \"DR\" (down-right).\n\nNote, that record $ (x_{s},y_{s}) $ denotes the tile that is located at the $ x_{s} $ -th row from the top and at the $ y_{s} $ -th column from the left of the kitchen.\n\nIt's guaranteed that the starting position will be a border tile (a tile with less than four side-adjacent tiles).",
    "outputFormat": "Print the amount of paint the robot consumes to obtain a checkered kitchen floor. Or print -1 if it never happens.\n\nPlease do not use the %lld specificator to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specificator.",
    "samples": [
        [
            "3 4\n1 1 DR\n",
            "7\n"
        ],
        [
            "3 4\n3 3 DR\n",
            "11\n"
        ],
        [
            "3 3\n1 1 DR\n",
            "-1\n"
        ],
        [
            "3 3\n1 2 DL\n",
            "4\n"
        ]
    ],
    "hint": "",
    "translation": "Shaass有个机器人正在给厨房的n行m列瓷砖上色。初始时机器人站在$(X_s,Y_s)$上。Shass希望厨房瓷砖最后像棋盘一样黑白相间。即：没有两块相邻瓷砖颜色相同。\r\n\r\n机器人有\"UL\"左上，\"UR\"右上，\"DL\"左下，\"DR\"右下四种移动方式，当它撞墙时会遵循【光的反射】原则反弹。每当机器人移动到一块瓷砖上，它就给这块瓷砖上色（所以可能重复多次上色）\r\n\r\n如图，机器人一次经过1-3-5-4-2-3-6,一共7次给瓷砖上色，使得有6块瓷砖有颜色。\r\n\r\n输出机器人的步数，当机器人不能完成任务，输出-1."
}