{
    "description": "Yaroslav is playing a game called \"Time\". The game has a timer showing the lifespan he's got left. As soon as the timer shows 0, Yaroslav's character dies and the game ends. Also, the game has $ n $ clock stations, station number $ i $ is at point $ (x_{i},y_{i}) $ of the plane. As the player visits station number $ i $ , he increases the current time on his timer by $ a_{i} $ . The stations are for one-time use only, so if the player visits some station another time, the time on his timer won't grow.\n\nA player spends $ d·dist $ time units to move between stations, where $ dist $ is the distance the player has covered and $ d $ is some constant. The distance between stations $ i $ and $ j $ is determined as $ |x_{i}-x_{j}|+|y_{i}-y_{j}| $ .\n\nInitially, the player is at station number $ 1 $ , and the player has strictly more than zero and strictly less than one units of time. At station number $ 1 $ one unit of money can increase the time on the timer by one time unit (you can buy only integer number of time units).\n\nNow Yaroslav is wondering, how much money he needs to get to station $ n $ . Help Yaroslav. Consider the time to buy and to increase the timer value negligibly small.",
    "inputFormat": "The first line contains integers $ n $ and $ d $ $ (3<=n<=100,10^{3}<=d<=10^{5}) $ — the number of stations and the constant from the statement.\n\nThe second line contains $ n-2 $ integers: $ a_{2},a_{3},...,a_{n-1} $ $ (1<=a_{i}<=10^{3}) $ . The next $ n $ lines contain the coordinates of the stations. The $ i $ -th of them contains two integers $ x_{i} $ , $ y_{i} $ $ ( $ - $ 100<=x_{i},y_{i}<=100) $ .\n\nIt is guaranteed that no two stations are located at the same point.",
    "outputFormat": "In a single line print an integer — the answer to the problem.",
    "samples": [
        [
            "3 1000\n1000\n0 0\n0 1\n0 3\n",
            "2000\n"
        ],
        [
            "3 1000\n1000\n1 0\n1 1\n1 2\n",
            "1000\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\r\n坐标系中有$n$个点，Yaroslav要从第$1$个点走到第$n$个点，当他走到第$i$个点时，他能够恢复$a_i$单位时间，但只能够恢复一次（第$1$个点和第$n$个点无法恢复）。\r\n\r\n当他从一个点走到另一个点时，需要消耗$d\\times$两点间距离个单位的时间。途中他不能使自己的时间为负数。\r\n\r\n他可以在开始时为自己购买一些时间，每单位时间价值为$1$。求他需要为自己购买的时间的总价值。\r\n\r\n注：两点间的距离为其曼哈顿距离（即$|x_1-x_2|+|y_1-y_2|$）。\r\n\r\n## 输入\r\n第一行有两个数$n,d(3\\le n\\le 100,{10}^3\\le d\\le {10}^5)$，分别是点的个数和题目中的常量。\r\n\r\n第二行有$n-2$个整数，第$i$个数表示在第$i$个点所能恢复的时间$a_i$。\r\n\r\n接下来$n$行每行两个数$x_i,y_i$，表示第$i$个点的坐标。\r\n## 输出\r\n一个整数：从第$1$个点到第$n$个点所需购买的时间的价值。"
}