{
    "description": "The king Copa often has been reported about the Codeforces site, which is rapidly getting more and more popular among the brightest minds of the humanity, who are using it for training and competing. Recently Copa understood that to conquer the world he needs to organize the world Codeforces tournament. He hopes that after it the brightest minds will become his subordinates, and the toughest part of conquering the world will be completed.\n\nThe final round of the Codeforces World Finals 20YY is scheduled for $ DD $ . $ MM $ . $ YY $ , where $ DD $ is the day of the round, $ MM $ is the month and $ YY $ are the last two digits of the year. Bob is lucky to be the first finalist form Berland. But there is one problem: according to the rules of the competition, all participants must be at least 18 years old at the moment of the finals. Bob was born on $ BD $ . $ BM $ . $ BY $ . This date is recorded in his passport, the copy of which he has already mailed to the organizers. But Bob learned that in different countries the way, in which the dates are written, differs. For example, in the US the month is written first, then the day and finally the year. Bob wonders if it is possible to rearrange the numbers in his date of birth so that he will be at least 18 years old on the day $ DD $ . $ MM $ . $ YY $ . He can always tell that in his motherland dates are written differently. Help him.\n\nAccording to another strange rule, eligible participant must be born in the same century as the date of the finals. If the day of the finals is participant's 18-th birthday, he is allowed to participate.\n\nAs we are considering only the years from $ 2001 $ to $ 2099 $ for the year of the finals, use the following rule: the year is leap if it's number is divisible by four.",
    "inputFormat": "The first line contains the date $ DD $ . $ MM $ . $ YY $ , the second line contains the date $ BD $ . $ BM $ . $ BY $ . It is guaranteed that both dates are correct, and $ YY $ and $ BY $ are always in $ [01;99] $ .\n\nIt could be that by passport Bob was born after the finals. In this case, he can still change the order of numbers in date.",
    "outputFormat": "If it is possible to rearrange the numbers in the date of birth so that Bob will be at least 18 years old on the $ DD $ . $ MM $ . $ YY $ , output YES. In the other case, output NO.\n\nEach number contains exactly two digits and stands for day, month or year in a date. Note that it is permitted to rearrange only numbers, not digits.",
    "samples": [
        [
            "01.01.98\n01.01.80\n",
            "YES\n"
        ],
        [
            "20.10.20\n10.02.30\n",
            "NO\n"
        ],
        [
            "28.02.74\n28.02.64\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "## 题意描述\n关于 Codeforces 的网站 king Copa 经常被报道，使得它在要使用网站进行训练和比赛的人之间迅速流行开来。最近， Copa 明白，要征服世界，他需要组织世界 Codeforces 锦标赛。他希望在这次比赛之后之后，最聪明的人将成为被挑选出来成为他的下属，然后征服世界最艰难的部分将会完成。\n\nCodeforces 世界总决赛的最后一轮定于 $YY$ 年 $MM$ 月 $DD$ 日举行，其中 $DD$  是当天的日期， $MM$ 是当月的月份， $YY$ 是当年的年份的最后两位。Bob 很幸运地能成为来自 Berland 的一名决赛选手。但有一个问题：根据比赛规则，所有参赛者在决赛时必须年满 $18$ 岁。 Bob 出生于 $BY$ 年， $BM$ 月，$BD$ 日。这个日期记录在他的护照上，他的护照复印件已经寄给了组织者。但是 Bob 了解到，在不同的国家，日期的书写方式是不同的。例如，在美国，先写月份，然后写日期，最后写年份。\n\n鲍勃想知道是否有可能重新排列他出生日期的数字，以便他在 $YY$ 年， $MM$ 月， $DD$ 日那天至少 $18$ 岁。他看出，在他的祖国，日期写的顺序不一样。请帮帮他。\n根据另一个奇怪的规则，合格的参赛者必须与决赛日期出生在同一个世纪。如果决赛当天刚好是参赛者的 $18$ 岁生日，则他可以参加。\n\n因为我们只考虑从 $2001$ 年到 $2099$ 年的决赛年份，所以使用以下规则：如果年份的数字可以被 $4$ 整除，那么年份就是闰年。\n\n\n## 输入格式：\n第一行包括三个数字 $DD,MM,YY$ ，第二行包括三个数字 $BD,BM,BY$ ，数据保证两个日期的正确性，并且 $BY$ 和 $YY$ 保证在 $[ 01 ，99 ]$ 中。\n\n\n## 输出格式：\n如果可能通过重新排列出生日期的顺序，让 Bob 在比赛当天至少 $18$ 岁，则输出 YES 。如果不能，则输出 NO。"
}