{
    "description": "Advertising has become part of our routine. And now, in the era of progressive technologies, we need your ideas to make advertising better!\n\nIn this problem we'll look at a simplified version of context advertising. You've got a text, consisting of exactly $ n $ words. A standard advertising banner has exactly $ r $ lines, each line can contain at most $ c $ characters. The potential customer always likes it when they can see lots of advertising, so you should determine which maximum number of consecutive words from the text can be written on the banner. Single words in one line of the banner should be separated by spaces. You are allowed to insert more than one space at once. Note that you are not allowed to break the words, that is, each word in the text must occupy exactly one line in the banner. Besides, you cannot change the word order, that is, if you read the banner text consecutively, from top to bottom and from left to right, you should get some consecutive part of the advertisement text.\n\nMore formally, the statement can be written like that. Let's say that all words are indexed from $ 1 $ to $ n $ in the order in which they occur in the advertisement text. Then you have to choose all words, starting from some $ i $ -th one and ending with some $ j $ -th one $ (1<=i<=j<=n) $ , so that all of them could be written on the banner. There must be as many words as possible. See the samples for clarifications.",
    "inputFormat": "The first input line contains three integers $ n $ , $ r $ , $ c $ ( $ 1<=n,r,c<=10^{6}; r×c<=10^{6} $ ). The next line contains a text, consisting of $ n $ words. The words consist only of lowercase English letters and are not empty. The words in the lines are separated by single spaces. The total number of characters in all words doesn't exceed $ 5·10^{6} $ .",
    "outputFormat": "Print at most $ r $ lines, in each line print at most $ c $ characters — the optimal advertisement banner. If there are multiple advertisement banners, print any of them.\n\nNote that some lines of the banner can be empty. You are allowed not to print such lines.",
    "samples": [
        [
            "9 4 12\nthis is a sample text for croc final round\n",
            "this is a\nsample text\nfor croc\nfinal round\n"
        ],
        [
            "9 1 9\nthis is a sample text for croc final round\n",
            "this is a\n"
        ],
        [
            "6 2 3\ncroc a a a croc a\n",
            "a a\na\n"
        ],
        [
            "2 2 5\nfirst second\n",
            "first\n"
        ]
    ],
    "hint": "",
    "translation": "**题目描述**\r\n\r\n你有一个有$n$个**单词**的文本，请按要求重新编辑此文本后输出.\r\n\r\n以下为规定:\r\n\r\n$1$.一个单词中的每个字母都在一行上.\r\n\r\n$2$.单词之间以**若干**个空格分隔.\r\n\r\n$3$.最终的文本中的每个单词与原文本中顺序相同.\r\n\r\n$4$.最多有$r$行，每行最多$c$个**字符**.\r\n\r\n$5$.尽可能长.\r\n\r\n**输入格式**\r\n\r\n第一行包含三个整数 $n$，$r$，$c$（$1$ $\\leq$ $n$，$r$，$c$ $\\leq$ $10 ^ {6}$; $r\\times c$ $\\leq$ $10 ^ 6$）.下一行为一个文本，包括$n$个单词.单词仅包含小写英文字母，并且不能为空.所有单词中的字符总数不超过$5 \\times 10^{6}$.\r\n\r\n**输出格式**\r\n\r\n一行，符合要求的文本.如果有多个答案，请输出其中的任何一个.\r\n\r\n请注意，横幅的某些行可以为空.允许不输出这些行."
}