{
    "description": "Volodya likes listening to heavy metal and (occasionally) reading. No wonder Volodya is especially interested in texts concerning his favourite music style.\n\nVolodya calls a string powerful if it starts with \"heavy\" and ends with \"metal\". Finding all powerful substrings (by substring Volodya means a subsequence of consecutive characters in a string) in a given text makes our hero especially joyful. Recently he felt an enormous fit of energy while reading a certain text. So Volodya decided to count all powerful substrings in this text and brag about it all day long. Help him in this difficult task. Two substrings are considered different if they appear at the different positions in the text.\n\nFor simplicity, let us assume that Volodya's text can be represented as a single string.",
    "inputFormat": "Input contains a single non-empty string consisting of the lowercase Latin alphabet letters. Length of this string will not be greater than $ 10^{6} $ characters.",
    "outputFormat": "Print exactly one number — the number of powerful substrings of the given string.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in C++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "heavymetalisheavymetal\n",
            "3"
        ],
        [
            "heavymetalismetal\n",
            "2"
        ],
        [
            "trueheavymetalissotruewellitisalsosoheavythatyoucanalmostfeeltheweightofmetalonyou\n",
            "3"
        ]
    ],
    "hint": "In the first sample the string \"heavymetalisheavymetal\" contains powerful substring \"heavymetal\" twice, also the whole string \"heavymetalisheavymetal\" is certainly powerful.\n\nIn the second sample the string \"heavymetalismetal\" contains two powerful substrings: \"heavymetal\" and \"heavymetalismetal\".",
    "translation": "一串字符串，如果以“heavy”开头，以“metal”结尾，我们就称之为“强字符”。\n\n要求在给定的字符串中查找所有“强字符\"子字符串。如果两个子字符串出现在文本中的不同位置，则认为它们是不同的。\n输入输出格式\n\n输入：\n输入包含一个由小写拉丁字母组成的非空字符串。此字符串的长度将不大于10^6\n\n输出：\n只打印一个数字：给定字符串的强子字符串数。\n\n注意：\n请不要使用%LLD来读取或写入C++中的64位整数。最好使用cin、cout或%I64d。"
}