{
    "description": "Special Agent Smart Beaver works in a secret research department of ABBYY. He's been working there for a long time and is satisfied with his job, as it allows him to eat out in the best restaurants and order the most expensive and exotic wood types there.\n\nThe content special agent has got an important task: to get the latest research by British scientists on the English Language. These developments are encoded and stored in a large safe. The Beaver's teeth are strong enough, so the authorities assured that upon arriving at the place the beaver won't have any problems with opening the safe.\n\nAnd he finishes his aspen sprig and leaves for this important task. Of course, the Beaver arrived at the location without any problems, but alas. He can't open the safe with his strong and big teeth. At this point, the Smart Beaver get a call from the headquarters and learns that opening the safe with the teeth is not necessary, as a reliable source has sent the following information: the safe code consists of digits and has no leading zeroes. There also is a special hint, which can be used to open the safe. The hint is string $ s $ with the following structure:\n\n- if $ s_{i} $ = \"?\", then the digit that goes $ i $ -th in the safe code can be anything (between $ 0 $ to $ 9 $ , inclusively);\n- if $ s_{i} $ is a digit (between $ 0 $ to $ 9 $ , inclusively), then it means that there is digit $ s_{i} $ on position $ i $ in code;\n- if the string contains letters from \"A\" to \"J\", then all positions with the same letters must contain the same digits and the positions with distinct letters must contain distinct digits.\n- The length of the safe code coincides with the length of the hint.\n\nFor example, hint \"?JGJ9\" has such matching safe code variants: \"51919\", \"55959\", \"12329\", \"93539\" and so on, and has wrong variants such as: \"56669\", \"00111\", \"03539\" and \"13666\".\n\nAfter receiving such information, the authorities change the plan and ask the special agents to work quietly and gently and not to try to open the safe by mechanical means, and try to find the password using the given hint.\n\nAt a special agent school the Smart Beaver was the fastest in his platoon finding codes for such safes, but now he is not in that shape: the years take their toll ... Help him to determine the number of possible variants of the code to the safe, matching the given hint. After receiving this information, and knowing his own speed of entering codes, the Smart Beaver will be able to determine whether he will have time for tonight's show \"Beavers are on the trail\" on his favorite TV channel, or he should work for a sleepless night...",
    "inputFormat": "The first line contains string $ s $ — the hint to the safe code. String $ s $ consists of the following characters: ?, 0-9, A-J. It is guaranteed that the first character of string $ s $ doesn't equal to character $ 0 $ .\n\nThe input limits for scoring 30 points are (subproblem A1):\n\n- $ 1<=|s|<=5 $ .\n\nThe input limits for scoring 100 points are (subproblems A1+A2):\n\n- $ 1<=|s|<=10^{5} $ .\n\nHere $ |s| $ means the length of string $ s $ .",
    "outputFormat": "Print the number of codes that match the given hint.",
    "samples": [
        [
            "AJ\n",
            "81\n"
        ],
        [
            "1?AA\n",
            "100\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个字符串 $s$，对于每一个字符 $s_i$ 可能有以下几种情况：\n\n- $s_i$ 为数字时，这一位上的值为这个数字；\n\n- $s_i$ 为 $A$ ~ $J$ 时可代表 $0$ ~ $9$ 中的任意一个数字，相同的字母代表的数必须相同，不同的字母代表的数必须不同；\n\n- $s_i$ 为 $?$ 时可代表 $0$ ~ $9$ 中的任意一个数字。\n\n同时，规定字符串开头的数字不能为 $0$。\n\n根据输入的字符串 $s$，输出 $s$ 能表示数值的个数。"
}