{
    "description": "SmallR is a biologist. Her latest research finding is how to change the sex of dogs. In other words, she can change female dogs into male dogs and vice versa.\n\nShe is going to demonstrate this technique. Now SmallR has $ n $ dogs, the costs of each dog's change may be different. The dogs are numbered from 1 to $ n $ . The cost of change for dog $ i $ is $ v_{i} $ RMB. By the way, this technique needs a kind of medicine which can be valid for only one day. So the experiment should be taken in one day and each dog can be changed at most once.\n\nThis experiment has aroused extensive attention from all sectors of society. There are $ m $ rich folks which are suspicious of this experiment. They all want to bet with SmallR forcibly. If SmallR succeeds, the $ i $ -th rich folk will pay SmallR $ w_{i} $ RMB. But it's strange that they have a special method to determine whether SmallR succeeds. For $ i $ -th rich folk, in advance, he will appoint certain $ k_{i} $ dogs and certain one gender. He will think SmallR succeeds if and only if on some day the $ k_{i} $ appointed dogs are all of the appointed gender. Otherwise, he will think SmallR fails.\n\nIf SmallR can't satisfy some folk that isn't her friend, she need not pay him, but if someone she can't satisfy is her good friend, she must pay $ g $ RMB to him as apologies for her fail.\n\nThen, SmallR hope to acquire money as much as possible by this experiment. Please figure out the maximum money SmallR can acquire. By the way, it is possible that she can't obtain any money, even will lose money. Then, please give out the minimum money she should lose.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ , $ g $ $ (1<=n<=10^{4},0<=m<=2000,0<=g<=10^{4}) $ . The second line contains $ n $ integers, each is 0 or 1, the sex of each dog, 0 represent the female and 1 represent the male. The third line contains $ n $ integers $ v_{1},v_{2},...,v_{n} $ $ (0<=v_{i}<=10^{4}) $ .\n\nEach of the next $ m $ lines describes a rich folk. On the $ i $ -th line the first number is the appointed sex of $ i $ -th folk (0 or 1), the next two integers are $ w_{i} $ and $ k_{i} $ $ (0<=w_{i}<=10^{4},1<=k_{i}<=10) $ , next $ k_{i} $ distinct integers are the indexes of appointed dogs (each index is between 1 and $ n $ ). The last number of this line represents whether $ i $ -th folk is SmallR's good friend (0 — no or 1 — yes).",
    "outputFormat": "Print a single integer, the maximum money SmallR can gain. Note that the integer is negative if SmallR will lose money.",
    "samples": [
        [
            "5 5 9\n0 1 1 1 0\n1 8 6 2 3\n0 7 3 3 2 1 1\n1 8 1 5 1\n1 0 3 2 1 4 1\n0 8 3 4 2 1 0\n1 7 2 4 1 1\n",
            "2\n"
        ],
        [
            "5 5 8\n1 0 1 1 1\n6 5 4 2 8\n0 6 3 2 3 4 0\n0 8 3 3 2 4 0\n0 0 3 3 4 1 1\n0 10 3 4 3 1 1\n0 4 3 3 4 1 1\n",
            "16\n"
        ]
    ],
    "hint": "",
    "translation": "有一个长度为$n$  的$01$  串，将第$i$  个位置变为另外一个数字的代价是$v_i$  。\n有$m$  个要求\n每个要求的形式是\n首先确定若干位置都要是$0$  或者$1$  \n然后给定这$K$  个位置，如果些位置上都满足要求\n那么就可以得到$W_k$  元\n某些要求如果失败了还要倒着给$g$  元\n问最终能够得到的最大利润\n\n输入格式：\n第一行是$n,m,g$  \n第二行是初始的$01$ 串\n第三行是$V_i$  \n接下来$m$  行\n第一个数字表示这个集合都要是$0$  还是$1$  \n第二个数字$W_i$  表示利润，接下来$k_i$  表示这个集合中有$k$  个位置\n接下来是这$k$  个位置，\n最后还有一个$0/1$  ，如果是$1$  ，表示如果失败了还要倒着给$g$  元。  \n翻译贡献者UID：21283"
}