{
    "description": "Smart Beaver decided to be not only smart, but also a healthy beaver! And so he began to attend physical education classes at school X. In this school, physical education has a very creative teacher. One of his favorite warm-up exercises is throwing balls. Students line up. Each one gets a single ball in the beginning. The balls are numbered from $ 1 $ to $ n $ (by the demand of the inventory commission).\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF316D1/dd5cf282ea1c98183da55e6989050cd8eabdb84c.png) Figure 1. The initial position for $ n=5 $ . After receiving the balls the students perform the warm-up exercise. The exercise takes place in a few throws. For each throw the teacher chooses any two arbitrary different students who will participate in it. The selected students throw their balls to each other. Thus, after each throw the students remain in their positions, and the two balls are swapped.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF316D1/6b5342e8a9f57fae45c7b1e47abe66718bc85450.png) Figure 2. The example of a throw. In this case there was a throw between the students, who were holding the $ 2 $ -nd and the $ 4 $ -th balls. Since the warm-up has many exercises, each of them can only continue for little time. Therefore, for each student we know the maximum number of throws he can participate in. For this lessons maximum number of throws will be $ 1 $ or $ 2 $ .\n\nNote that after all phases of the considered exercise any ball can end up with any student. Smart Beaver decided to formalize it and introduced the concept of the \"ball order\". The ball order is a sequence of $ n $ numbers that correspond to the order of balls in the line. The first number will match the number of the ball of the first from the left student in the line, the second number will match the ball of the second student, and so on. For example, in figure $ 2 $ the order of the balls was ( $ 1 $ , $ 2 $ , $ 3 $ , $ 4 $ , $ 5 $ ), and after the throw it was ( $ 1 $ , $ 4 $ , $ 3 $ , $ 2 $ , $ 5 $ ). Smart beaver knows the number of students and for each student he knows the maximum number of throws in which he can participate. And now he is wondering: what is the number of distinct ways of ball orders by the end of the exercise.",
    "inputFormat": "The first line contains a single number $ n $ — the number of students in the line and the number of balls. The next line contains exactly $ n $ space-separated integers. Each number corresponds to a student in the line (the $ i $ -th number corresponds to the $ i $ -th from the left student in the line) and shows the number of throws he can participate in.\n\nThe input limits for scoring 30 points are (subproblem D1):\n\n- $ 1<=n<=10 $ .\n\nThe input limits for scoring 70 points are (subproblems D1+D2):\n\n- $ 1<=n<=500 $ .\n\nThe input limits for scoring 100 points are (subproblems D1+D2+D3):\n\n- $ 1<=n<=1000000 $ .",
    "outputFormat": "The output should contain a single integer — the number of variants of ball orders after the warm up exercise is complete. As the number can be rather large, print it modulo $ 1000000007 $ $ (10^{9}+7) $ .",
    "samples": [
        [
            "5\n1 2 2 1 2\n",
            "120\n"
        ],
        [
            "8\n1 2 2 1 2 1 1 2\n",
            "16800\n"
        ]
    ],
    "hint": "",
    "translation": "题意简述：有 $n$ 个同学，每个同学手里有一个球（球两两不同）。每次可以交换两个同学手中的球。现给定每个同学与他人交换球的次数的上限（上限不大于 $2$），问若干次交换后球有多少种可能的排列。答案对 $10^9+7$ 取模。\n\n范围：$n\\le10^6$."
}