{
    "description": "Ilya is a very good-natured lion. He likes maths. Of all mathematical objects, his favourite one is matrices. Now he's faced a complicated matrix problem he needs to solve.\n\nHe's got a square $ 2^{n}×2^{n} $ -sized matrix and $ 4^{n} $ integers. You need to arrange all these numbers in the matrix (put each number in a single individual cell) so that the beauty of the resulting matrix with numbers is maximum.\n\nThe beauty of a $ 2^{n}×2^{n} $ -sized matrix is an integer, obtained by the following algorithm:\n\n1. Find the maximum element in the matrix. Let's denote it as $ m $ .\n2. If $ n=0 $ , then the beauty of the matrix equals $ m $ . Otherwise, a matrix can be split into 4 non-intersecting $ 2^{n-1}×2^{n-1} $ -sized submatrices, then the beauty of the matrix equals the sum of number $ m $ and other four beauties of the described submatrices.\n\nAs you can see, the algorithm is recursive.\n\nHelp Ilya, solve the problem and print the resulting maximum beauty of the matrix.",
    "inputFormat": "The first line contains integer $ 4^{n} $ $ (1<=4^{n}<=2·10^{6}) $ . The next line contains $ 4^{n} $ integers $ a_{i} $ $ (1<=a_{i}<=10^{9}) $ — the numbers you need to arrange in the $ 2^{n}×2^{n} $ -sized matrix.",
    "outputFormat": "On a single line print the maximum value of the beauty of the described matrix.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "samples": [
        [
            "1\n13\n",
            "13\n"
        ],
        [
            "4\n1 2 3 4\n",
            "14\n"
        ]
    ],
    "hint": "Consider the second sample. You need to arrange the numbers in the matrix as follows:\n\n`<br></br>1 2<br></br>3 4<br></br>`Then the beauty of the matrix will equal: 4 + 1 + 2 + 3 + 4 = 14.",
    "translation": "给一个 $m\\times m$ 的矩阵 $a$，$m$ 为 $2^i$（$i\\in Z$）,设它的美丽值为矩阵最大元素值加四个 $\\frac m 2\\times \\frac m 2$ 的矩阵的美丽值之和（无法分拆则结束递归），给定 $m\\times m$ 的值以及每个元素的值，求能取到的最大美丽值。"
}