{
    "description": "You're a mikemon breeder currently in the middle of your journey to become a mikemon master. Your current obstacle is go through the infamous Biridian Forest.\n\nThe forest\n\nThe Biridian Forest is a two-dimensional grid consisting of $ r $ rows and $ c $ columns. Each cell in Biridian Forest may contain a tree, or may be vacant. A vacant cell may be occupied by zero or more mikemon breeders (there may also be breeders other than you in the forest). Mikemon breeders (including you) cannot enter cells with trees. One of the cells is designated as the exit cell.\n\nThe initial grid, including your initial position, the exit cell, and the initial positions of all other breeders, will be given to you. Here's an example of such grid (from the first example):\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/8ee22208cd0062c07e9af0eb11ef4d5b758bf95d.png)Moves\n\nBreeders (including you) may move in the forest. In a single move, breeders may perform one of the following actions:\n\n- Do nothing.\n- Move from the current cell to one of the four adjacent cells (two cells are adjacent if they share a side). Note that breeders cannot enter cells with trees.\n- If you are located on the exit cell, you may leave the forest. Only you can perform this move — all other mikemon breeders will never leave the forest by using this type of movement.\n\nAfter each time you make a single move, each of the other breeders simultaneously make a single move (the choice of which move to make may be different for each of the breeders).\n\nMikemon battle\n\nIf you and $ t $ $ (t&gt;0) $ mikemon breeders are located on the same cell, exactly $ t $ mikemon battles will ensue that time (since you will be battling each of those $ t $ breeders once). After the battle, all of those $ t $ breeders will leave the forest to heal their respective mikemons.\n\nNote that the moment you leave the forest, no more mikemon battles can ensue, even if another mikemon breeder move to the exit cell immediately after that. Also note that a battle only happens between you and another breeders — there will be no battle between two other breeders (there may be multiple breeders coexisting in a single cell).\n\nYour goal\n\nYou would like to leave the forest. In order to do so, you have to make a sequence of moves, ending with a move of the final type. Before you make any move, however, you post this sequence on your personal virtual idol Blog. Then, you will follow this sequence of moves faithfully.\n\nGoal of other breeders\n\nBecause you post the sequence in your Blog, the other breeders will all know your exact sequence of moves even before you make your first move. All of them will move in such way that will guarantee a mikemon battle with you, if possible. The breeders that couldn't battle you will do nothing.\n\nYour task\n\nPrint the minimum number of mikemon battles that you must participate in, assuming that you pick the sequence of moves that minimize this number. Note that you are not required to minimize the number of moves you make.",
    "inputFormat": "The first line consists of two integers: $ r $ and $ c $ ( $ 1<=r,c<=1000 $ ), denoting the number of rows and the number of columns in Biridian Forest. The next $ r $ rows will each depict a row of the map, where each character represents the content of a single cell:\n\n- 'T': A cell occupied by a tree.\n- 'S': An empty cell, and your starting position. There will be exactly one occurence of this in the map.\n- 'E': An empty cell, and where the exit is located. There will be exactly one occurence of this in the map.\n- A digit (0-9): A cell represented by a digit X means that the cell is empty and is occupied by X breeders (in particular, if X is zero, it means that the cell is not occupied by any breeder).\n\nIt is guaranteed that it will be possible for you to go from your starting position to the exit cell through a sequence of moves.",
    "outputFormat": "A single line denoted the minimum possible number of mikemon battles that you have to participate in if you pick a strategy that minimize this number.",
    "samples": [
        [
            "5 7\n000E0T3\nT0TT0T0\n010T0T0\n2T0T0T0\n0T0S000\n",
            "3\n"
        ],
        [
            "1 4\nSE23\n",
            "2\n"
        ]
    ],
    "hint": "The following picture illustrates the first example. The blue line denotes a possible sequence of moves that you should post in your blog:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/f3c398d841029ee7956ca78781c3f83530c9e0ff.png)The three breeders on the left side of the map will be able to battle you — the lone breeder can simply stay in his place until you come while the other two breeders can move to where the lone breeder is and stay there until you come. The three breeders on the right does not have a way to battle you, so they will stay in their place.\n\nFor the second example, you should post this sequence in your Blog:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/69e9c811c785412bb4dc30011edf64a5213c6aa5.png)Here's what happens. First, you move one cell to the right.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/be376caf594617206e3eac0440dc24aa3f4bdfec.png)Then, the two breeders directly to the right of the exit will simultaneously move to the left. The other three breeder cannot battle you so they will do nothing.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/ecbcc8af8eeb68d4b698bee6571ad4dc17b2cf28.png)You end up in the same cell with $ 2 $ breeders, so $ 2 $ mikemon battles are conducted. After those battles, all of your opponents leave the forest.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/10a7d95cf85b96b8cb705d2f9e9d036fa9d46363.png)Finally, you make another move by leaving the forest.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329B/f9aff007a8d2f80ba6eb8e88c7b77680a7069d7b.png)",
    "translation": "你发现你身处一片森林，你需要找到出口逃离这里。但是在森林中还有其他人和很多树木。他们会给你造成阻碍。\n\n### 输入格式\n输入 n 和 m，接下来输入一张 n\\*m 的二维地图，地图中只包含以下元素\n\n'T'：一棵树，不能通行。\n\n'S'：你的起始位置，在地图中只有一个。\n\n'E'：出口，在地图中也只有一个。\n\n0~9中的一个数字：其他人，并且可以从这点通行。\n\n### 输出格式\n输出在你到达出口前，到达出口的人的人数？（包括与你同时到达终点的人）"
}