{
    "description": "Daniel is organizing a football tournament. He has come up with the following tournament format:\n\n1. In the first several (possibly zero) stages, while the number of teams is even, they split in pairs and play one game for each pair. At each stage the loser of each pair is eliminated (there are no draws). Such stages are held while the number of teams is even.\n2. Eventually there will be an odd number of teams remaining. If there is one team remaining, it will be declared the winner, and the tournament ends. Otherwise each of the remaining teams will play with each other remaining team once in round robin tournament (if there are $ x $ teams, there will be ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF325B/e5061b7dfd3556627af3b421a8198ff388b1a5d3.png) games), and the tournament ends.\n\nFor example, if there were 20 teams initially, they would begin by playing 10 games. So, 10 teams would be eliminated, and the remaining 10 would play 5 games. Then the remaining 5 teams would play 10 games in a round robin tournament. In total there would be 10+5+10=25 games.\n\nDaniel has already booked the stadium for $ n $ games. Help him to determine how many teams he should invite so that the tournament needs exactly $ n $ games. You should print all possible numbers of teams that will yield exactly $ n $ games in ascending order, or -1 if there are no such numbers.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=10^{18} $ ), the number of games that should be played.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "outputFormat": "Print all possible numbers of invited teams in ascending order, one per line. If exactly $ n $ games cannot be played, output one number: -1.",
    "samples": [
        [
            "3\n",
            "3\n4\n"
        ],
        [
            "25\n",
            "20\n"
        ],
        [
            "2\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "有若干队伍参加足球赛。\r\n如果队伍数量为偶数，则两两配对进行比赛，最终淘汰一半的队伍。\r\n当所剩队伍数量为奇数，若剩下一支队，比赛结束；若剩下多支队，这些队伍进行单循环赛（即若有x支队，再进行x（x-1）/2场比赛）。\r\n\r\n比如，如果20支队参加比赛：\r\n\r\n1.两两配对，进行10场比赛，剩10支队\r\n\r\n2.两两配对，进行5场比赛，剩5支队\r\n\r\n3.剩下5支队进行单循环比赛，共10场比赛\r\n\r\n综上，一共进行了25场比赛\r\n\r\n给定比赛场数，计算可以有多少支队进行比赛，升序输出所有可能的队伍数。若无解，输出-1。\r\n\r\n输入格式：\r\n\r\n第一行输入一个整数n（1<=n<=10^18），n为比赛场数。\r\n\r\n输出格式：\r\n\r\n升序输出可能的队伍数，每行一个。若无解，输出-1."
}