{
    "description": "You are an adventurer currently journeying inside an evil temple. After defeating a couple of weak zombies, you arrived at a square room consisting of tiles forming an $ n×n $ grid. The rows are numbered $ 1 $ through $ n $ from top to bottom, and the columns are numbered $ 1 $ through $ n $ from left to right. At the far side of the room lies a door locked with evil magical forces. The following inscriptions are written on the door:\n\n The cleaning of all evil will awaken the door!Being a very senior adventurer, you immediately realize what this means. You notice that every single cell in the grid are initially evil. You should purify all of these cells.\n\nThe only method of tile purification known to you is by casting the \"Purification\" spell. You cast this spell on a single tile — then, all cells that are located in the same row and all cells that are located in the same column as the selected tile become purified (including the selected tile)! It is allowed to purify a cell more than once.\n\nYou would like to purify all $ n×n $ cells while minimizing the number of times you cast the \"Purification\" spell. This sounds very easy, but you just noticed that some tiles are particularly more evil than the other tiles. You cannot cast the \"Purification\" spell on those particularly more evil tiles, not even after they have been purified. They can still be purified if a cell sharing the same row or the same column gets selected by the \"Purification\" spell.\n\nPlease find some way to purify all the cells with the minimum number of spells cast. Print -1 if there is no such way.",
    "inputFormat": "The first line will contain a single integer $ n $ ( $ 1<=n<=100 $ ). Then, $ n $ lines follows, each contains $ n $ characters. The $ j $ -th character in the $ i $ -th row represents the cell located at row $ i $ and column $ j $ . It will be the character 'E' if it is a particularly more evil cell, and '.' otherwise.",
    "outputFormat": "If there exists no way to purify all the cells, output -1. Otherwise, if your solution casts $ x $ \"Purification\" spells (where $ x $ is the minimum possible number of spells), output $ x $ lines. Each line should consist of two integers denoting the row and column numbers of the cell on which you should cast the \"Purification\" spell.",
    "samples": [
        [
            "3\n.E.\nE.E\n.E.\n",
            "1 1\n2 2\n3 3\n"
        ],
        [
            "3\nEEE\nE..\nE.E\n",
            "-1\n"
        ],
        [
            "5\nEE.EE\nE.EE.\nE...E\n.EE.E\nEE.EE\n",
            "3 3\n1 3\n2 2\n4 4\n5 3"
        ]
    ],
    "hint": "The first example is illustrated as follows. Purple tiles are evil tiles that have not yet been purified. Red tile is the tile on which \"Purification\" is cast. Yellow tiles are the tiles being purified as a result of the current \"Purification\" spell. Green tiles are tiles that have been purified previously.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329A/04b73f6bd6d4f5c1ba16b8072ebad28ccdfa62cc.png)In the second example, it is impossible to purify the cell located at row $ 1 $ and column $ 1 $ .\n\nFor the third example:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF329A/8ffcc7f3e4ed4b4242d89f880e88ffce0ed4e4ab.png)",
    "translation": "翻译：你要净化一片大小为 $ n \\times n $ 的土地。定义一次操作：你可以选一个不是 $ \\texttt {E} $ 点的点，当你选择一个点时，与这个点的横坐标或纵坐标相等的点全被净化，每个点可以被净化多次，你要用最少的操作次数把这片土地净化完，输出所有你选择的点的坐标。\n\nby [UID 593299](https://www.luogu.com.cn/user/593299)"
}