{
    "description": "Boy Valera likes strings. And even more he likes them, when they are identical. That's why in his spare time Valera plays the following game. He takes any two strings, consisting of lower case Latin letters, and tries to make them identical. According to the game rules, with each move Valera can change one arbitrary character $ A_{i} $ in one of the strings into arbitrary character $ B_{i} $ , but he has to pay for every move a particular sum of money, equal to $ W_{i} $ . He is allowed to make as many moves as he needs. Since Valera is a very economical boy and never wastes his money, he asked you, an experienced programmer, to help him answer the question: what minimum amount of money should Valera have to get identical strings.",
    "inputFormat": "The first input line contains two initial non-empty strings $ s $ and $ t $ , consisting of lower case Latin letters. The length of each string doesn't exceed $ 10^{5} $ . The following line contains integer $ n $ ( $ 0\\le n\\le 500 $ ) — amount of possible changings. Then follow $ n $ lines, each containing characters $ A_{i} $ and $ B_{i} $ (lower case Latin letters) and integer $ W_{i} $ ( $ 0\\le W_{i}\\le100 $ ), saying that it's allowed to change character $ A_{i} $ into character $ B_{i} $ in any of the strings and spend sum of money $ W_{i} $ .",
    "outputFormat": "If the answer exists, output the answer to the problem, and the resulting string. Otherwise output -1 in the only line. If the answer is not unique, output any.",
    "samples": [
        [
            "uayd\nuxxd\n3\na x 8\nx y 13\nd c 3\n",
            "21\nuxyd\n"
        ],
        [
            "a\nb\n3\na b 2\na b 3\nb a 5\n",
            "2\nb\n"
        ],
        [
            "abc\nab\n6\na b 4\na b 7\nb a 8\nc b 11\nc a 3\na c 0\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "小男孩 Valera 喜欢字符串。当它们是相同的时候，他会更喜欢它们。这就是为什么 Valera 会在空闲时间玩下面这个游戏。\n他有两个由小写字母组成的字符串，根据游戏规则，Valera 每次可以将其中一个字符串中的任何一个字母 $A_i$ 变为 $B_i$，但要支付 $W_i$ 的代价。请你输出让两个字符串相同的最小代价，无解输出 $-1$。\n\n### 输入格式\n\n第 $1,2$ 行两个字符串。\n第 $3$ 行一个整数 $n$，表示可能的变化的个数。\n接下来 $n$ 行，每行两个字符一个整数分别表示$A_i$，$B_i$，与 $W_i$。\n\n### 输出格式\n\n无解输出 $-1$。\n有解一共 $2$ 行，第 $1$ 行一个整数表示最小代价；第 $2$ 行一个字符串表示最后相同的串。\n\n感谢 MloVtry 提供的翻译"
}