{
    "description": "Mad scientist Mike has constructed a rooted tree, which consists of $ n $ vertices. Each vertex is a reservoir which can be either empty or filled with water.\n\nThe vertices of the tree are numbered from 1 to $ n $ with the root at vertex 1. For each vertex, the reservoirs of its children are located below the reservoir of this vertex, and the vertex is connected with each of the children by a pipe through which water can flow downwards.\n\nMike wants to do the following operations with the tree:\n\n1. Fill vertex $ v $ with water. Then $ v $ and all its children are filled with water.\n2. Empty vertex $ v $ . Then $ v $ and all its ancestors are emptied.\n3. Determine whether vertex $ v $ is filled with water at the moment.\n\n Initially all vertices of the tree are empty.Mike has already compiled a full list of operations that he wants to perform in order. Before experimenting with the tree Mike decided to run the list through a simulation. Help Mike determine what results will he get after performing all the operations.",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 1<=n<=500000 $ ) — the number of vertices in the tree. Each of the following $ n-1 $ lines contains two space-separated numbers $ a_{i} $ , $ b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ , $ a_{i}≠b_{i} $ ) — the edges of the tree.\n\nThe next line contains a number $ q $ ( $ 1<=q<=500000 $ ) — the number of operations to perform. Each of the following $ q $ lines contains two space-separated numbers $ c_{i} $ ( $ 1<=c_{i}<=3 $ ), $ v_{i} $ ( $ 1<=v_{i}<=n $ ), where $ c_{i} $ is the operation type (according to the numbering given in the statement), and $ v_{i} $ is the vertex on which the operation is performed.\n\nIt is guaranteed that the given graph is a tree.",
    "outputFormat": "For each type 3 operation print 1 on a separate line if the vertex is full, and 0 if the vertex is empty. Print the answers to queries in the order in which the queries are given in the input.",
    "samples": [
        [
            "5\n1 2\n5 1\n2 3\n4 2\n12\n1 1\n2 3\n3 1\n3 2\n3 3\n3 4\n1 2\n2 4\n3 1\n3 3\n3 4\n3 5\n",
            "0\n0\n0\n1\n0\n1\n0\n1\n"
        ]
    ],
    "hint": "",
    "translation": "- 给出一棵以 $1$ 为根节点的 $n$ 个节点的有根树。每个点有一个权值，初始为 $0$。\n- $m$ 次操作。操作有 $3$ 种：\n    1. 将点 $u$ 和其子树上的所有节点的权值改为 $1$。\n    2. 将点 $u$ 到 $1$ 的路径上的所有节点的权值改为 $0$。\n    3. 询问点 $u$ 的权值。\n- $1\\le n,m\\le 5\\times 10^5$。"
}