{
    "description": "It is so boring in the summer holiday, isn't it? So Alice and Bob have invented a new game to play. The rules are as follows. First, they get a set of $ n $ distinct integers. And then they take turns to make the following moves. During each move, either Alice or Bob (the player whose turn is the current) can choose two distinct integers $ x $ and $ y $ from the set, such that the set doesn't contain their absolute difference $ |x-y| $ . Then this player adds integer $ |x-y| $ to the set (so, the size of the set increases by one).\n\nIf the current player has no valid move, he (or she) loses the game. The question is who will finally win the game if both players play optimally. Remember that Alice always moves first.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 2<=n<=100 $ ) — the initial number of elements in the set. The second line contains $ n $ distinct space-separated integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{9} $ ) — the elements of the set.",
    "outputFormat": "Print a single line with the winner's name. If Alice wins print \"Alice\", otherwise print \"Bob\" (without quotes).",
    "samples": [
        [
            "2\n2 3\n",
            "Alice\n"
        ],
        [
            "2\n5 3\n",
            "Alice\n"
        ],
        [
            "3\n5 6 7\n",
            "Bob\n"
        ]
    ],
    "hint": "Consider the first test sample. Alice moves first, and the only move she can do is to choose 2 and 3, then to add 1 to the set. Next Bob moves, there is no valid move anymore, so the winner is Alice.",
    "translation": "Alice与Bob发明了一种游戏。给出 $n$ 个不同的正整数，两人轮流做以下操作：\n\n1. 从序列中选出两个数 $x,y$，要求这两个数的差的绝对值 $|x-y|$ 不在序列中；\n2. 将这两个数的差的绝对值 $|x-y|$ 加入序列。\n\n当有一方无法完成这个操作时，即失败。Alice 先手，两方均选择最优策略，问哪方将获胜。\n\n### 输入\n\n第一行为一个整数 $n$，表示数字个数。\n第二行为 $n$ 个以空格分隔的数，代表初始的 $n$ 个数字。\n## 输出\n输出获胜者的名字，`Alice` 或 `Bob`。"
}