{
    "description": "Iahub is so happy about inventing bubble sort graphs that he's staying all day long at the office and writing permutations. Iahubina is angry that she is no more important for Iahub. When Iahub goes away, Iahubina comes to his office and sabotage his research work.\n\nThe girl finds an important permutation for the research. The permutation contains $ n $ distinct integers $ a_{1} $ , $ a_{2} $ , ..., $ a_{n} $ $ (1<=a_{i}<=n) $ . She replaces some of permutation elements with -1 value as a revenge.\n\nWhen Iahub finds out his important permutation is broken, he tries to recover it. The only thing he remembers about the permutation is it didn't have any fixed point. A fixed point for a permutation is an element $ a_{k} $ which has value equal to $ k $ $ (a_{k}=k) $ . Your job is to proof to Iahub that trying to recover it is not a good idea. Output the number of permutations which could be originally Iahub's important permutation, modulo $ 1000000007 $ ( $ 10^{9}+7 $ ).",
    "inputFormat": "The first line contains integer $ n $ ( $ 2<=n<=2000 $ ). On the second line, there are $ n $ integers, representing Iahub's important permutation after Iahubina replaces some values with -1.\n\nIt's guaranteed that there are no fixed points in the given permutation. Also, the given sequence contains at least two numbers -1 and each positive number occurs in the sequence at most once. It's guaranteed that there is at least one suitable permutation.",
    "outputFormat": "Output a single integer, the number of ways Iahub could recover his permutation, modulo $ 1000000007 $ ( $ 10^{9}+7 $ ).",
    "samples": [
        [
            "5\n-1 -1 4 3 -1\n",
            "2\n"
        ]
    ],
    "hint": "For the first test example there are two permutations with no fixed points are \\[2, 5, 4, 3, 1\\] and \\[5, 1, 4, 3, 2\\]. Any other permutation would have at least one fixed point.",
    "translation": "有一个长度为 $n$ 的排列 $a$，其中有一些位置被替换成了 `-1`。你需要尝试恢复这个排列，将 `-1` 替换回数字。\n求多少种可行方案使得得到的是一个排列且不存在 $a_i=i$ 的位置。\n\n感谢 @aface0427 贡献翻译、@皎月半洒花 添加 Latex."
}