{
    "description": "Xenia the programmer has a tree consisting of $ n $ nodes. We will consider the tree nodes indexed from 1 to $ n $ . We will also consider the first node to be initially painted red, and the other nodes — to be painted blue.\n\nThe distance between two tree nodes $ v $ and $ u $ is the number of edges in the shortest path between $ v $ and $ u $ .\n\nXenia needs to learn how to quickly execute queries of two types:\n\n1. paint a specified blue node in red;\n2. calculate which red node is the closest to the given one and print the shortest distance to the closest red node.\n\nYour task is to write a program which will execute the described queries.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ $ (2<=n<=10^{5},1<=m<=10^{5}) $ — the number of nodes in the tree and the number of queries. Next $ n-1 $ lines contain the tree edges, the $ i $ -th line contains a pair of integers $ a_{i},b_{i} $ $ (1<=a_{i},b_{i}<=n,a_{i}≠b_{i}) $ — an edge of the tree.\n\nNext $ m $ lines contain queries. Each query is specified as a pair of integers $ t_{i},v_{i} $ $ (1<=t_{i}<=2,1<=v_{i}<=n) $ . If $ t_{i}=1 $ , then as a reply to the query we need to paint a blue node $ v_{i} $ in red. If $ t_{i}=2 $ , then we should reply to the query by printing the shortest distance from some red node to node $ v_{i} $ .\n\nIt is guaranteed that the given graph is a tree and that all queries are correct.",
    "outputFormat": "For each second type query print the reply in a single line.",
    "samples": [
        [
            "5 4\n1 2\n2 3\n2 4\n4 5\n2 1\n2 5\n1 2\n2 5\n",
            "0\n3\n2\n"
        ]
    ],
    "hint": "",
    "translation": "给定一棵 $n$ 个节点的树，初始时 1 号节点为红色，其余为蓝色。\n\n要求支持如下操作：\n\n1. 将一个节点变为红色。\n2. 询问节点 $u$ 到最近红色节点的距离。\n\n共 $q$ 次操作。\n\n$$\n1 \\le n, q \\le 10 ^5\n$$"
}