{
    "description": "There are $ n $ schoolchildren, boys and girls, lined up in the school canteen in front of the bun stall. The buns aren't ready yet and the line is undergoing some changes.\n\nEach second all boys that stand right in front of girls, simultaneously swap places with the girls (so that the girls could go closer to the beginning of the line). In other words, if at some time the $ i $ -th position has a boy and the $ (i+1) $ -th position has a girl, then in a second, the $ i $ -th position will have a girl and the $ (i+1) $ -th one will have a boy.\n\nLet's take an example of a line of four people: a boy, a boy, a girl, a girl (from the beginning to the end of the line). Next second the line will look like that: a boy, a girl, a boy, a girl. Next second it will be a girl, a boy, a girl, a boy. Next second it will be a girl, a girl, a boy, a boy. The line won't change any more.\n\nYour task is: given the arrangement of the children in the line to determine the time needed to move all girls in front of boys (in the example above it takes 3 seconds). Baking buns takes a lot of time, so no one leaves the line until the line stops changing.",
    "inputFormat": "The first line contains a sequence of letters without spaces $ s_{1}s_{2}...\\ s_{n} $ $ (1<=n<=10^{6}) $ , consisting of capital English letters M and F. If letter $ s_{i} $ equals M, that means that initially, the line had a boy on the $ i $ -th position. If letter $ s_{i} $ equals F, then initially the line had a girl on the $ i $ -th position.",
    "outputFormat": "Print a single integer — the number of seconds needed to move all the girls in the line in front of the boys. If the line has only boys or only girls, print $ 0 $ .",
    "samples": [
        [
            "MFM\n",
            "1\n"
        ],
        [
            "MMFF\n",
            "3\n"
        ],
        [
            "FFMMM\n",
            "0\n"
        ]
    ],
    "hint": "In the first test case the sequence of changes looks as follows: MFM $ → $ FMM.\n\nThe second test sample corresponds to the sample from the statement. The sequence of changes is: MMFF $ → $ MFMF $ → $ FMFM $ → $ FFMM.",
    "translation": "F表示女生，M表示男生，每秒如果一个女生前边有一个男生，两个人就可以进行调换位子，问一共需要多少秒，所有的F都在左边，所有的M都在右边。"
}