{
    "description": "Vasya and Petya are using an interesting data storing structure: a pyramid.\n\nThe pyramid consists of $ n $ rows, the $ i $ -th row contains $ i $ cells. Each row is shifted half a cell to the left relative to the previous row. The cells are numbered by integers from 1 to ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF354D/150441d31156a32e0b2da63844d600138a543898.png) as shown on the picture below.\n\nAn example of a pyramid at $ n=5 $ is:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF354D/d20c874b33ade52ff093fc7598c0d4eb18280657.png)This data structure can perform operations of two types:\n\n1. Change the value of a specific cell. It is described by three integers: $ \"t i v\" $ , where $ t=1 $ (the type of operation), $ i $ — the number of the cell to change and $ v $ the value to assign to the cell.\n2. Change the value of some subpyramid. The picture shows a highlighted subpyramid with the top in cell $ 5 $ . It is described by $ s+2 $ numbers: $ \"t i v_{1} v_{2} ... v_{s}\" $ , where $ t=2 $ , $ i $ — the number of the top cell of the pyramid, $ s $ — the size of the subpyramid (the number of cells it has), $ v_{j} $ — the value you should assign to the $ j $ -th cell of the subpyramid.\n\nFormally: a subpyramid with top at the $ i $ -th cell of the $ k $ -th row (the $ 5 $ -th cell is the second cell of the third row) will contain cells from rows from $ k $ to $ n $ , the $ (k+p) $ -th row contains cells from the $ i $ -th to the $ (i+p) $ -th ( $ 0<=p<=n-k $ ).\n\nVasya and Petya had two identical pyramids. Vasya changed some cells in his pyramid and he now wants to send his changes to Petya. For that, he wants to find a sequence of operations at which Petya can repeat all Vasya's changes. Among all possible sequences, Vasya has to pick the minimum one (the one that contains the fewest numbers).\n\nYou have a pyramid of $ n $ rows with $ k $ changed cells. Find the sequence of operations which result in each of the $ k $ changed cells being changed by at least one operation. Among all the possible sequences pick the one that contains the fewest numbers.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1<=n,k<=10^{5} $ ).\n\nThe next $ k $ lines contain the coordinates of the modified cells $ r_{i} $ and $ c_{i} $ $ (1<=c_{i}<=r_{i}<=n) $ — the row and the cell's number in the row. All cells are distinct.",
    "outputFormat": "Print a single number showing how many numbers the final sequence has.",
    "samples": [
        [
            "4 5\n3 1\n3 3\n4 1\n4 3\n4 4\n",
            "10\n"
        ],
        [
            "7 11\n2 2\n3 1\n4 3\n5 1\n5 2\n5 5\n6 4\n7 2\n7 3\n7 4\n7 5\n",
            "26\n"
        ]
    ],
    "hint": "One of the possible solutions of the first sample consists of two operations:\n\n $ 2 4 v_{4} v_{7} v_{8} $\n\n $ 2 6 v_{6} v_{9} v_{10} $\n\nThe picture shows the changed cells color-highlighted. The subpyramid used by the first operation is highlighted blue and the subpyramid used by the first operation is highlighted yellow:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF354D/4b5b4aed53f70cd9b14e30579dbc963af8a3158b.png)",
    "translation": "题意\n\n一个n层的金字塔，你能进行两种操作。\n\n给某个点染色，代价是3。画一个子三角形，底边必须是金字塔的底边，代价是点数+2。\n\n现在有个黑点。要你覆盖所有黑点。\n数据范围\n$n,m\\le 10^5$\n\nTranslated by  Youngsc"
}