{
    "description": "Valera has $ 2·n $ cubes, each cube contains an integer from $ 10 $ to $ 99 $ . He arbitrarily chooses $ n $ cubes and puts them in the first heap. The remaining cubes form the second heap.\n\nValera decided to play with cubes. During the game he takes a cube from the first heap and writes down the number it has. Then he takes a cube from the second heap and write out its two digits near two digits he had written (to the right of them). In the end he obtained a single fourdigit integer — the first two digits of it is written on the cube from the first heap, and the second two digits of it is written on the second cube from the second heap.\n\nValera knows arithmetic very well. So, he can easily count the number of distinct fourdigit numbers he can get in the game. The other question is: how to split cubes into two heaps so that this number (the number of distinct fourdigit integers Valera can get) will be as large as possible?",
    "inputFormat": "The first line contains integer $ n $ $ (1<=n<=100) $ . The second line contains $ 2·n $ space-separated integers $ a_{i} $ $ (10<=a_{i}<=99) $ , denoting the numbers on the cubes.",
    "outputFormat": "In the first line print a single number — the maximum possible number of distinct four-digit numbers Valera can obtain. In the second line print $ 2·n $ numbers $ b_{i} $ $ (1<=b_{i}<=2) $ . The numbers mean: the $ i $ -th cube belongs to the $ b_{i} $ -th heap in your division.\n\nIf there are multiple optimal ways to split the cubes into the heaps, print any of them.",
    "samples": [
        [
            "1\n10 99\n",
            "1\n2 1 \n"
        ],
        [
            "2\n13 24 13 45\n",
            "4\n1 2 2 1 \n"
        ]
    ],
    "hint": "In the first test case Valera can put the first cube in the first heap, and second cube — in second heap. In this case he obtain number $ 1099 $ . If he put the second cube in the first heap, and the first cube in the second heap, then he can obtain number $ 9910 $ . In both cases the maximum number of distinct integers is equal to one.\n\nIn the second test case Valera can obtain numbers $ 1313,1345,2413,2445 $ . Note, that if he put the first and the third cubes in the first heap, he can obtain only two numbers $ 1324 $ and $ 1345 $ .",
    "translation": "给出2n个两位数，现在要将其分成两个集合，每个集合n个数，分好集合后每次可以从两个集合分别取出一个数字组成一个四位数，问如果分可以使得组成的数字种类最多"
}