{
    "description": "In Berland, there is the national holiday coming — the Flag Day. In the honor of this event the president of the country decided to make a big dance party and asked your agency to organize it. He has several conditions:\n\n- overall, there must be $ m $ dances;\n- exactly three people must take part in each dance;\n- each dance must have one dancer in white clothes, one dancer in red clothes and one dancer in blue clothes (these are the colors of the national flag of Berland).\n\nThe agency has $ n $ dancers, and their number can be less than $ 3m $ . That is, some dancers will probably have to dance in more than one dance. All of your dancers must dance on the party. However, if some dance has two or more dancers from a previous dance, then the current dance stops being spectacular. Your agency cannot allow that to happen, so each dance has at most one dancer who has danced in some previous dance.\n\nYou considered all the criteria and made the plan for the $ m $ dances: each dance had three dancers participating in it. Your task is to determine the clothes color for each of the $ n $ dancers so that the President's third condition fulfilled: each dance must have a dancer in white, a dancer in red and a dancer in blue. The dancers cannot change clothes between the dances.",
    "inputFormat": "The first line contains two space-separated integers $ n $ ( $ 3<=n<=10^{5} $ ) and $ m $ ( $ 1<=m<=10^{5} $ ) — the number of dancers and the number of dances, correspondingly. Then $ m $ lines follow, describing the dances in the order of dancing them. The $ i $ -th line contains three distinct integers — the numbers of the dancers that take part in the $ i $ -th dance. The dancers are numbered from $ 1 $ to $ n $ . Each dancer takes part in at least one dance.",
    "outputFormat": "Print $ n $ space-separated integers: the $ i $ -th number must represent the color of the $ i $ -th dancer's clothes ( $ 1 $ for white, $ 2 $ for red, $ 3 $ for blue). If there are multiple valid solutions, print any of them. It is guaranteed that at least one solution exists.",
    "samples": [
        [
            "7 3\n1 2 3\n1 4 5\n4 6 7\n",
            "1 2 3 3 2 2 1 \n"
        ],
        [
            "9 3\n3 6 9\n2 5 8\n1 4 7\n",
            "1 1 1 2 2 2 3 3 3 \n"
        ],
        [
            "5 2\n4 1 5\n3 1 2\n",
            "2 3 1 1 3 \n"
        ]
    ],
    "hint": "",
    "translation": "### 题意翻译\n有 $n$ 个人，分成 $m$ 组，每组有三个人，一个人可以出现在多个组中，组内人不会重复。每个人代表$1$，$2$，$3$中的一个，每个组里三个数字必须各出现一次。问给每个人分配的数字是什么。\n\n### 输入\n第一行有两个数 $n$ 和 $m$，分别代表人数和组数。接下来 $m$ 行每行有$3$个数代表第 $i$ 个组里的$3$个人。\n\n### 输出\n一共 $n$ 个数，代表第 $i$ 个人分配的数字。\n\n### 数据范围\n$3 \\leqslant n \\leqslant 10^5$，$1 \\leqslant m \\leqslant 10^5$"
}