{
    "description": "After a terrifying forest fire in Berland a forest rebirth program was carried out. Due to it $ N $ rows with $ M $ trees each were planted and the rows were so neat that one could map it on a system of coordinates so that the $ j $ -th tree in the $ i $ -th row would have the coordinates of $ (i,j) $ . However a terrible thing happened and the young forest caught fire. Now we must find the coordinates of the tree that will catch fire last to plan evacuation.\n\nThe burning began in $ K $ points simultaneously, which means that initially $ K $ trees started to burn. Every minute the fire gets from the burning trees to the ones that aren’t burning and that the distance from them to the nearest burning tree equals to 1.\n\nFind the tree that will be the last to start burning. If there are several such trees, output any.",
    "inputFormat": "The first input line contains two integers $ N,M $ ( $ 1<=N,M<=2000 $ ) — the size of the forest. The trees were planted in all points of the ( $ x,y $ ) ( $ 1<=x<=N,1<=y<=M $ ) type, $ x $ and $ y $ are integers.\n\nThe second line contains an integer $ K $ ( $ 1<=K<=10 $ ) — amount of trees, burning in the beginning.\n\nThe third line contains $ K $ pairs of integers: $ x_{1},y_{1},x_{2},y_{2},...,x_{k},y_{k} $ ( $ 1<=x_{i}<=N,1<=y_{i}<=M $ ) — coordinates of the points from which the fire started. It is guaranteed that no two points coincide.",
    "outputFormat": "Output a line with two space-separated integers $ x $ and $ y $ — coordinates of the tree that will be the last one to start burning. If there are several such trees, output any.",
    "samples": [
        [
            "3 3\n1\n2 2\n",
            "1 1\n"
        ],
        [
            "3 3\n1\n1 1\n",
            "3 3\n"
        ],
        [
            "3 3\n2\n1 1 3 3\n",
            "2 2"
        ]
    ],
    "hint": "",
    "translation": "**题目大意：**\n\n给定一个$n*m$的矩阵，从给定K个初始点向上下左右扩展，覆盖经过的点，问最晚覆盖的点的坐标（有多个就随便输出任意一个），点的坐标都是整数\n\n**输入格式：**\n\n第一个输入行包含两个整数$n,m(1<=n,m<=2000)$\n\n第二行包含一个整数$K(1 <=K<= 10)$，初始点个数\n\n第三行包含K对整数：$X_1,Y_1,X_2,Y_2,...,X_K,Y_K$初始点的坐标，保证没有两点重合。\n\n**输出格式：**\n\n用两个空格分隔的整数输出一行$X$和$Y$，即最后一个被覆盖的点\n\nPS：这道题CF上得加文件输入输出，即$input.txt$和$output.txt$，不然会WA。。。\n\n感谢@守望 提供翻译"
}