{
    "description": "Simon loves neatness. So before he goes to bed, Simon wants to complete all chores in the house.\n\nSimon's house looks like a rectangular table consisting of $ n $ rows and $ n $ columns from above. All rows of the table are numbered from $ 1 $ to $ n $ from top to bottom. All columns of the table are numbered from $ 1 $ to $ n $ from left to right. Each cell of the table is a room. Pair $ (x,y) $ denotes the room, located at the intersection of the $ x $ -th row and the $ y $ -th column. For each room we know if the light is on or not there.\n\nInitially Simon is in room $ (x_{0},y_{0}) $ . He wants to turn off the lights in all the rooms in the house, and then return to room $ (x_{0},y_{0}) $ . Suppose that at the current moment Simon is in the room $ (x,y) $ . To reach the desired result, he can perform the following steps:\n\n1. The format of the action is \"1\". The action is to turn on the light in room $ (x,y) $ . Simon cannot do it if the room already has light on.\n2. The format of the action is \"2\". The action is to turn off the light in room $ (x,y) $ . Simon cannot do it if the room already has light off.\n3. The format of the action is \"dir\" ( $ dir $ is a character). The action is to move to a side-adjacent room in direction $ dir $ . The direction can be left, right, up or down (the corresponding dir is L, R, U or D). Additionally, Simon can move only if he see a light in the direction $ dir $ . More formally, if we represent the room, Simon wants to go, as $ (nx,ny) $ , there shold be an integer $ k $ $ (k&gt;0) $ , that room $ (x+(nx-x)k,y+(ny-y)k) $ has a light. Of course, Simon cannot move out of his house.\n\nHelp Simon, find the sequence of actions that lets him achieve the desired result.",
    "inputFormat": "The first line contains three positive integers $ n,x_{0},y_{0} $ $ (2<=n<=500,1<=x_{0},y_{0}<=n) $ .\n\nNext $ n $ lines contain the description of rooms in the house. The $ i $ -th line contains $ n $ space-separated integers $ a_{i1},a_{i2},...,a_{in} $ . If number $ a_{ij} $ equals zero, then room $ (i,j) $ has light off, and if number $ a_{ij} $ equals one, then room $ (i,j) $ has light on. It is guaranteed that at least one room has light on.",
    "outputFormat": "If there is no desired sequence of actions, print \"NO\" (without the quotes). Otherwise, print \"YES\" (without the quotes) and the description of the required sequence of actions as a string. Note that you do not have to minimize the length of the sequence of actions but you shouldn't use more than $ 3·10^{6} $ actions.",
    "samples": [
        [
            "3 1 1\n1 0 0\n0 1 0\n1 0 0\n",
            "YES\nD1R2L2D2UU2\n"
        ],
        [
            "3 1 1\n1 0 0\n0 1 0\n0 0 1\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "Simon 的房子的俯视图呈一个 $n \\times n$ 的正方形。我们用 $\\left(x,y\\right)$，表示第 $x$ 行，第 $y$ 列的房间。现在用 $1$ 表示这些房间里的灯是开着的，$0$ 表示关着。已知 Simon 的卧室在 $\\left(x_0,y_0\\right)$，他现在想要从卧室出发关掉所有的灯。现有一下几种操作：\n\n1. 输出 $1$，表示将所在房间的灯打开，**在此之前它的灯必须是关着的**。\n1. 输出 $2$，表示将所在房间的灯关闭，**在此之前它的灯必须是开着的**。\n1. 输出 $U,D,L,R$，分别表示朝上，下，左，右面走一格，**此时你需要保证 Simon 面向的方向上至少有一盏亮着的灯，否则不能走**。\n\n你需要构造一种方案使得 Simon 从卧室出发，关掉所有的灯并返回卧室。注意你的操作次数应小于等于 $3 \\times 10^6$。"
}