{
    "description": "Hooray! Berl II, the king of Berland is making a knight tournament. The king has already sent the message to all knights in the kingdom and they in turn agreed to participate in this grand event.\n\nAs for you, you're just a simple peasant. There's no surprise that you slept in this morning and were late for the tournament (it was a weekend, after all). Now you are really curious about the results of the tournament. This time the tournament in Berland went as follows:\n\n- There are $ n $ knights participating in the tournament. Each knight was assigned his unique number — an integer from 1 to $ n $ .\n- The tournament consisted of $ m $ fights, in the $ i $ -th fight the knights that were still in the game with numbers at least $ l_{i} $ and at most $ r_{i} $ have fought for the right to continue taking part in the tournament.\n- After the $ i $ -th fight among all participants of the fight only one knight won — the knight number $ x_{i} $ , he continued participating in the tournament. Other knights left the tournament.\n- The winner of the last (the $ m $ -th) fight (the knight number $ x_{m} $ ) became the winner of the tournament.\n\nYou fished out all the information about the fights from your friends. Now for each knight you want to know the name of the knight he was conquered by. We think that the knight number $ b $ was conquered by the knight number $ a $ , if there was a fight with both of these knights present and the winner was the knight number $ a $ .\n\nWrite the code that calculates for each knight, the name of the knight that beat him.",
    "inputFormat": "The first line contains two integers $ n $ , $ m $ $ (2<=n<=3·10^{5}; 1<=m<=3·10^{5}) $ — the number of knights and the number of fights. Each of the following $ m $ lines contains three integers $ l_{i},r_{i},x_{i} $ $ (1<=l_{i}&lt;r_{i}<=n; l_{i}<=x_{i}<=r_{i}) $ — the description of the $ i $ -th fight.\n\nIt is guaranteed that the input is correct and matches the problem statement. It is guaranteed that at least two knights took part in each battle.",
    "outputFormat": "Print $ n $ integers. If the $ i $ -th knight lost, then the $ i $ -th number should equal the number of the knight that beat the knight number $ i $ . If the $ i $ -th knight is the winner, then the $ i $ -th number must equal $ 0 $ .",
    "samples": [
        [
            "4 3\n1 2 1\n1 3 3\n1 4 4\n",
            "3 1 4 0 "
        ],
        [
            "8 4\n3 5 4\n3 7 6\n2 8 8\n1 8 1\n",
            "0 8 4 6 4 8 6 1 "
        ]
    ],
    "hint": "Consider the first test case. Knights 1 and 2 fought the first fight and knight 1 won. Knights 1 and 3 fought the second fight and knight 3 won. The last fight was between knights 3 and 4, knight 4 won.",
    "translation": "（题目大意）：有n个骑士，他们每个人都被从1-n进行编号，他们现在需要进行一次比赛，且总共会进行m场比赛。每场比赛会在编号在Li-Ri这段区间内的骑士之间举行，对于每场比赛，它的胜利者的编号为Xi，其他的骑士会出局，之后无法进行比赛。最后留下的骑士就是这次比赛的最终胜利者。比赛结束后，每个骑士都想知道他被哪一个骑士击败了，请你告诉他们。\n\n输入格式\n\n第一行为两个整数n，m。代表有n个骑士参加m场比赛；\n\n之后的m行，每行3个整数Li，Ri，Xi，代表第i场比赛在编号在Li-Ri之间的骑士举行，胜利者的编号为Xi。\n\n保证输入数据正确，保证至少有两名骑士参加每一场战斗；\n\n输出格式\n\n输出只有一行，包括n个整数，第i个数代表第i个骑士被编号为第i个数的骑士打败，特别的，如果第i个骑士是最后的胜者，输出0；"
}