{
    "description": "Today the «Z» city residents enjoy a shell game competition. The residents are gathered on the main square to watch the breath-taking performance. The performer puts 3 non-transparent cups upside down in a row. Then he openly puts a small ball under one of the cups and starts to shuffle the cups around very quickly so that on the whole he makes exactly 3 shuffles. After that the spectators have exactly one attempt to guess in which cup they think the ball is and if the answer is correct they get a prize. Maybe you can try to find the ball too?",
    "inputFormat": "The first input line contains an integer from 1 to 3 — index of the cup which covers the ball before the shuffles. The following three lines describe the shuffles. Each description of a shuffle contains two distinct integers from 1 to 3 — indexes of the cups which the performer shuffled this time. The cups are numbered from left to right and are renumbered after each shuffle from left to right again. In other words, the cup on the left always has index 1, the one in the middle — index 2 and the one on the right — index 3.",
    "outputFormat": "In the first line output an integer from 1 to 3 — index of the cup which will have the ball after all the shuffles.",
    "samples": [
        [
            "1\n1 2\n2 1\n2 1\n",
            "2\n"
        ],
        [
            "1\n2 1\n3 1\n1 3\n",
            "2\n"
        ]
    ],
    "hint": "",
    "translation": "### 提示\n\n本题需要从 input.txt 读入输入，输出到 output.txt\n\n### 题目描述\n\n经典的转纸杯游戏。给定小球初始所在的纸杯位置和 $3$ 次交换纸杯的操作，问你最后小球的位置。\n\n### 输入格式\n\n第一行一个整数。标识小球的初始位置，之后 $3$ 行每行两个整数 $a,b$ 表示交换 $a,b$ 纸杯。（要注意的是：最左边的杯子编号永远为 $1$，最右边的编号永远为 $3$，不会随着交换而改变）\n\n### 输出格式\n\n一个整数，表示最后小球所在的纸杯编号。\n\n本题目中所有数字均不超过 $3$。"
}