{
    "description": "Valera loves to participate in competitions. Especially in programming contests. Today he has participated in the contest with his team, consisting of $ n $ students (including Valera). This contest was an individual competition, so each student in the team solved problems individually.\n\nAfter the contest was over, Valera was interested in results. He found out that:\n\n- each student in the team scored at least $ l $ points and at most $ r $ points;\n- in total, all members of the team scored exactly $ s_{all} $ points;\n- the total score of the $ k $ members of the team who scored the most points is equal to exactly $ s_{k} $ ; more formally, if $ a_{1},a_{2},...,a_{n} $ is the sequence of points earned by the team of students in the non-increasing order $ (a_{1}>=a_{2}>=...>=a_{n}) $ , then $ s_{k}=a_{1}+a_{2}+...+a_{k} $ .\n\nHowever, Valera did not find out exactly how many points each of $ n $ students scored. Valera asked you to recover any distribution of scores between the students of the team, such that all the conditions above are met.",
    "inputFormat": "The first line of the input contains exactly six integers $ n,k,l,r,s_{all},s_{k} $ ( $ 1<=n,k,l,r<=1000 $ ; $ l<=r $ ; $ k<=n $ ; $ 1<=s_{k}<=s_{all}<=10^{6} $ ).\n\nIt's guaranteed that the input is such that the answer exists.",
    "outputFormat": "Print exactly $ n $ integers $ a_{1},a_{2},...,a_{n} $ — the number of points each student scored. If there are multiple solutions, you can print any of them. You can print the distribution of points in any order.",
    "samples": [
        [
            "5 3 1 3 13 9\n",
            "2 3 2 3 3 "
        ],
        [
            "5 3 1 3 15 9\n",
            "3 3 3 3 3 "
        ]
    ],
    "hint": "",
    "translation": "Valera 爱编程比赛，他参加了一场比赛。这场比赛有 $n$ 个选手参加，每个选手的分数至少为 $l$ 分，至多为 $r$ 分，所有选手分数总和为 $s_{all}$，并且分数前 $k$ 大的选手的分数和为 $s_k$，请输出满足条件的所有选手的分数（顺序无所谓）。"
}