{
    "description": "Petya is a beginner programmer. He has already mastered the basics of the C++ language and moved on to learning algorithms. The first algorithm he encountered was insertion sort. Petya has already written the code that implements this algorithm and sorts the given integer zero-indexed array $ a $ of size $ n $ in the non-decreasing order.\n\n`for (int i = 1; i < n; i = i + 1)<br></br>{<br></br>   int j = i; <br></br>   while (j > 0 && a[j] < a[j - 1])<br></br>   {<br></br>      swap(a[j], a[j - 1]); // swap elements a[j] and a[j - 1]<br></br>      j = j - 1;<br></br>   }<br></br>}<br></br>`Petya uses this algorithm only for sorting of arrays that are permutations of numbers from $ 0 $ to $ n-1 $ . He has already chosen the permutation he wants to sort but he first decided to swap some two of its elements. Petya wants to choose these elements in such a way that the number of times the sorting executes function swap, was minimum. Help Petya find out the number of ways in which he can make the swap and fulfill this requirement.\n\nIt is guaranteed that it's always possible to swap two elements of the input permutation in such a way that the number of swap function calls decreases.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2<=n<=5000 $ ) — the length of the permutation. The second line contains $ n $ different integers from $ 0 $ to $ n-1 $ , inclusive — the actual permutation.",
    "outputFormat": "Print two integers: the minimum number of times the swap function is executed and the number of such pairs $ (i,j) $ that swapping the elements of the input permutation with indexes $ i $ and $ j $ leads to the minimum number of the executions.",
    "samples": [
        [
            "5\n4 0 3 1 2\n",
            "3 2\n"
        ],
        [
            "5\n1 2 3 4 0\n",
            "3 4\n"
        ]
    ],
    "hint": "In the first sample the appropriate pairs are $ (0,3) $ and $ (0,4) $ .\n\nIn the second sample the appropriate pairs are $ (0,4) $ , $ (1,4) $ , $ (2,4) $ and $ (3,4) $ .",
    "translation": "给出一个长度为$N$的无序序列，序列为$0$到$N-1$的排列，现在需要你用冒泡排序来将序列排成从小到大有序的序列\n\n你可以执行一次交换两个元素$i,j(i\\neq j,1\\le i\\leq n)$，使得执行冒泡排序时，交换相邻元素的次数最少\n\n要你求出交换相邻元素的最少次数和满足交换相邻元素的次数最少的方案数"
}