{
    "description": "Valera is a lazy student. He has $ m $ clean bowls and $ k $ clean plates.\n\nValera has made an eating plan for the next $ n $ days. As Valera is lazy, he will eat exactly one dish per day. At that, in order to eat a dish, he needs exactly one clean plate or bowl. We know that Valera can cook only two types of dishes. He can eat dishes of the first type from bowls and dishes of the second type from either bowls or plates.\n\nWhen Valera finishes eating, he leaves a dirty plate/bowl behind. His life philosophy doesn't let him eat from dirty kitchenware. So sometimes he needs to wash his plate/bowl before eating. Find the minimum number of times Valera will need to wash a plate/bowl, if he acts optimally.",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ , $ k $ ( $ 1<=n,m,k<=1000 $ ) — the number of the planned days, the number of clean bowls and the number of clean plates.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=2 $ ). If $ a_{i} $ equals one, then on day $ i $ Valera will eat a first type dish. If $ a_{i} $ equals two, then on day $ i $ Valera will eat a second type dish.",
    "outputFormat": "Print a single integer — the minimum number of times Valera will need to wash a plate/bowl.",
    "samples": [
        [
            "3 1 1\n1 2 1\n",
            "1\n"
        ],
        [
            "4 3 1\n1 1 1 1\n",
            "1\n"
        ],
        [
            "3 1 2\n2 2 2\n",
            "0\n"
        ],
        [
            "8 2 2\n1 2 1 2 1 2 1 2\n",
            "4\n"
        ]
    ],
    "hint": "In the first sample Valera will wash a bowl only on the third day, so the answer is one.\n\nIn the second sample, Valera will have the first type of the dish during all four days, and since there are only three bowls, he will wash a bowl exactly once.\n\nIn the third sample, Valera will have the second type of dish for all three days, and as they can be eaten from either a plate or a bowl, he will never need to wash a plate/bowl.",
    "translation": "Valera有m个干净的碗和k个干净的盘子，在接下来的n天中，他每天要吃一道菜。菜分两种，第一种必须用一个干净的碗，第二种可以用一个干净的碗或一个干净的盘子，用完后碗或盘子就会变脏，再次使用就要清洗，现在给定每天吃哪种菜，请你安排每天使用碗还是盘子，使得清洗的次数最少"
}