{
    "description": "Levko loves sports pathfinding competitions in his city very much. In order to boost his performance, Levko spends his spare time practicing. The practice is a game.\n\nThe city consists of $ n $ intersections connected by $ m+k $ directed roads. Two or more roads can connect the same pair of intersections. Besides, there can be roads leading from an intersection to itself.\n\nLevko and Zenyk are playing a game. First Levko stands on intersection $ s_{1} $ , and Zenyk stands on intersection $ s_{2} $ . They both want to get to intersection $ f $ . The person who does it quicker wins. If they get there at the same time, the game ends with a draw. By agreement both players start simultaneously and move with the same speed.\n\nLevko wants to win very much. He knows the lengths of all the roads in the city. Also he knows that he can change the lengths of some roads (there are $ k $ such roads at all) if he pays the government. So, the government can change the length of the $ i $ -th road to any integer value in the segment \\[ $ l_{i} $ , $ r_{i} $ \\] (both borders inclusive). Levko wondered if he can reconstruct the roads so as to win the game and whether he can hope for the draw if he cannot win.\n\nYou should consider that both players play optimally well. It is guaranteed that we can get from intersections $ s_{1} $ and $ s_{2} $ to intersection $ f $ .",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=10^{4} $ , $ 1<=k<=100 $ ). The second line contains three integers $ s_{1} $ , $ s_{2} $ and $ f $ ( $ 1<=s_{1},s_{2},f<=n $ ).\n\nThe next $ m $ lines contains the descriptions of the roads that cannot be changed by Levko. Each line contains three integers $ a_{i} $ , $ b_{i} $ and $ c_{i} $ ( $ 1<=a_{i},b_{i}<=n,1<=c_{i}<=10^{9} $ ), representing a road from intersection $ a_{i} $ to intersection $ b_{i} $ of length $ c_{i} $ .\n\nThe next $ k $ lines contains the descriptions of the roads that can be changed by Levko. Each line contains four integers $ a_{i} $ , $ b_{i} $ , $ l_{i} $ and $ r_{i} $ ( $ 1<=a_{i},b_{i}<=n,1<=l_{i}<=r_{i}<=10^{9} $ ), representing a road from intersection $ a_{i} $ to intersection $ b_{i} $ , Levko can set the road's length within limits $ [l_{i},r_{i}] $ .\n\nConsider all intersections numbered from 1 to $ n $ . It is guaranteed that you can get from intersections $ s_{1} $ and $ s_{2} $ to intersection $ f $ .",
    "outputFormat": "In the first line print string \"WIN\" (without the quotes) if Levko can win this game, string \"DRAW\" (without the quotes) if Levko can end the game with a draw and \"LOSE\" (without the quotes) if he loses for sure.\n\nIf the answer is \"WIN\" or \"DRAW\", then print on the second line $ k $ space-separated integers — the length of the roads Levko sets in the order they occur in the input.",
    "samples": [
        [
            "4 1 3\n1 3 4\n3 2 2\n1 2 1 3\n2 4 1 3\n3 4 1 3\n",
            "WIN\n1 1 3 "
        ],
        [
            "4 1 3\n1 3 4\n3 2 2\n1 2 1 3\n2 4 1 3\n3 4 1 2\n",
            "DRAW\n1 1 2 "
        ],
        [
            "5 4 2\n1 2 5\n1 3 3\n1 4 4\n2 3 2\n2 4 3\n3 5 1 5\n4 5 4 7\n",
            "LOSE\n"
        ]
    ],
    "hint": "",
    "translation": "你和你的朋友在一张有 $n$（$n\\le 10^4$）个点， $m+k$（$m \\le 10^4$，$k\\le 100$）条边的带权有向图上玩一个游戏.\n    \n一开始你们分别处在$S_1$和$S_2$上,你们需要到达$T$.\n    \n你可以将给定的$k$(≤$100$)条边的权值修改为$[L,R]$中任何数.\n    \n在开局时,每条边的权值都在$[L,R]$中.\n    \n问你是否能先到达$T$,如果不能,能否达成平局.\n"
}