{
    "description": "Sereja loves all sorts of algorithms. He has recently come up with a new algorithm, which receives a string as an input. Let's represent the input string of the algorithm as $ q=q_{1}q_{2}...\\ q_{k} $ . The algorithm consists of two steps:\n\n1. Find any continuous subsequence (substring) of three characters of string $ q $ , which doesn't equal to either string \"zyx\", \"xzy\", \"yxz\". If $ q $ doesn't contain any such subsequence, terminate the algorithm, otherwise go to step 2.\n2. Rearrange the letters of the found subsequence randomly and go to step 1.\n\nSereja thinks that the algorithm works correctly on string $ q $ if there is a non-zero probability that the algorithm will be terminated. But if the algorithm anyway will work for infinitely long on a string, then we consider the algorithm to work incorrectly on this string.\n\nSereja wants to test his algorithm. For that, he has string $ s=s_{1}s_{2}...\\ s_{n} $ , consisting of $ n $ characters. The boy conducts a series of $ m $ tests. As the $ i $ -th test, he sends substring $ s_{li}s_{li}+1...\\ s_{ri} $ $ (1<=l_{i}<=r_{i}<=n) $ to the algorithm input. Unfortunately, the implementation of his algorithm works too long, so Sereja asked you to help. For each test $ (l_{i},r_{i}) $ determine if the algorithm works correctly on this test or not.",
    "inputFormat": "The first line contains non-empty string $ s $ , its length ( $ n $ ) doesn't exceed $ 10^{5} $ . It is guaranteed that string $ s $ only contains characters: 'x', 'y', 'z'.\n\nThe second line contains integer $ m $ $ (1<=m<=10^{5}) $ — the number of tests. Next $ m $ lines contain the tests. The $ i $ -th line contains a pair of integers $ l_{i} $ , $ r_{i} $ $ (1<=l_{i}<=r_{i}<=n) $ .",
    "outputFormat": "For each test, print \"YES\" (without the quotes) if the algorithm works correctly on the corresponding test and \"NO\" (without the quotes) otherwise.",
    "samples": [
        [
            "zyxxxxxxyyz\n5\n5 5\n1 3\n1 11\n1 4\n3 6\n",
            "YES\nYES\nNO\nYES\nNO\n"
        ]
    ],
    "hint": "In the first example, in test one and two the algorithm will always be terminated in one step. In the fourth test you can get string \"xzyx\" on which the algorithm will terminate. In all other tests the algorithm doesn't work correctly.",
    "translation": "给出一个字符串，元素只有 $x$,$y$,$z$ 这三种，现给出一个区间$[l,r]$，这个区间内的字符可以任意调换，如果变换之后这个区间字符串的所有子串都是 $\"zyx\"$ 或 $\"xzy\"$ 或 \n$\"yxz\"$的话，输出  ```yes```（若 $r-l<2$ 也输出 ```YES```），否则输出```NO```。\n\nTranslate by @qjxqjx"
}