{
    "description": "Dima and Inna love spending time together. The problem is, Seryozha isn't too enthusiastic to leave his room for some reason. But Dima and Inna love each other so much that they decided to get criminal...\n\nDima constructed a trap graph. He shouted: \"Hey Seryozha, have a look at my cool graph!\" to get his roommate interested and kicked him into the first node.\n\nA trap graph is an undirected graph consisting of $ n $ nodes and $ m $ edges. For edge number $ k $ , Dima denoted a range of integers from $ l_{k} $ to $ r_{k} $ $ (l_{k}<=r_{k}) $ . In order to get out of the trap graph, Seryozha initially (before starting his movements) should pick some integer (let's call it $ x $ ), then Seryozha must go some way from the starting node with number $ 1 $ to the final node with number $ n $ . At that, Seryozha can go along edge $ k $ only if $ l_{k}<=x<=r_{k} $ .\n\nSeryozha is a mathematician. He defined the loyalty of some path from the $ 1 $ -st node to the $ n $ -th one as the number of integers $ x $ , such that if he initially chooses one of them, he passes the whole path. Help Seryozha find the path of maximum loyalty and return to his room as quickly as possible!",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ $ (2<=n<=10^{3},0<=m<=3·10^{3}) $ . Then follow $ m $ lines describing the edges. Each line contains four integers $ a_{k} $ , $ b_{k} $ , $ l_{k} $ and $ r_{k} $ $ (1<=a_{k},b_{k}<=n,1<=l_{k}<=r_{k}<=10^{6}) $ . The numbers mean that in the trap graph the $ k $ -th edge connects nodes $ a_{k} $ and $ b_{k} $ , this edge corresponds to the range of integers from $ l_{k} $ to $ r_{k} $ .\n\nNote that the given graph can have loops and multiple edges.",
    "outputFormat": "In a single line of the output print an integer — the maximum loyalty among all paths from the first node to the $ n $ -th one. If such paths do not exist or the maximum loyalty equals 0, print in a single line \"Nice work, Dima!\" without the quotes.",
    "samples": [
        [
            "4 4\n1 2 1 10\n2 4 3 5\n1 3 1 5\n2 4 2 7\n",
            "6\n"
        ],
        [
            "5 6\n1 2 1 10\n2 5 11 20\n1 4 2 5\n1 3 10 11\n3 4 12 10000\n4 5 6 6\n",
            "Nice work, Dima!\n"
        ]
    ],
    "hint": "Explanation of the first example.\n\nOverall, we have 2 ways to get from node 1 to node 4: first you must go along the edge 1-2 with range \\[1-10\\], then along one of the two edges 2-4.\n\nOne of them contains range \\[3-5\\], that is, we can pass through with numbers 3, 4, 5. So the loyalty of such path is 3.\n\nIf we go along edge 2-4 with range \\[2-7\\], then we can pass through with numbers 2, 3, 4, 5, 6, 7. The loyalty is 6. That is the answer.\n\nThe edge 1-2 have no influence on the answer because its range includes both ranges of the following edges.",
    "translation": "给出一个 $n$ 个点，$m$ 条边的无向图，每条边有区间 $\\left[l_i,r_i\\right]$，求从 $1$ 到 $n$ 路径组成的边集，使该边集中所有区间的交内的正整数元素个数最多。"
}