{
    "description": "John Doe has recently found a \"Free Market\" in his city — that is the place where you can exchange some of your possessions for other things for free.\n\nJohn knows that his city has $ n $ items in total (each item is unique). You can bring any number of items to the market and exchange them for any other one. Note that each item is one of a kind and that means that you cannot exchange set $ {a,b} $ for set $ {v,a} $ . However, you can always exchange set $ x $ for any set $ y $ , unless there is item $ p $ , such that $ p $ occurs in $ x $ and $ p $ occurs in $ y $ .\n\nFor each item, John knows its value $ c_{i} $ . John's sense of justice doesn't let him exchange a set of items $ x $ for a set of items $ y $ , if $ s(x)+d&lt;s(y) $ ( $ s(x) $ is the total price of items in the set $ x $ ).\n\nDuring one day John can exchange only one set of items for something else. Initially, he has no items. John wants to get a set of items with the maximum total price. Find the cost of such set and the minimum number of days John can get it in.",
    "inputFormat": "The first line contains two space-separated integers $ n $ , $ d $ ( $ 1<=n<=50 $ , $ 1<=d<=10^{4} $ ) — the number of items on the market and John's sense of justice value, correspondingly. The second line contains $ n $ space-separated integers $ c_{i} $ ( $ 1<=c_{i}<=10^{4} $ ).",
    "outputFormat": "Print two space-separated integers: the maximum possible price in the set of items John can get and the minimum number of days needed to get such set.",
    "samples": [
        [
            "3 2\n1 3 10\n",
            "4 3\n"
        ],
        [
            "3 5\n1 2 3\n",
            "6 2\n"
        ],
        [
            "10 10000\n10000 9999 1 10000 10000 10000 1 2 3 4\n",
            "50010 6\n"
        ]
    ],
    "hint": "In the first sample John can act like this:\n\n- Take the first item ( $ 1-0<=2 $ ).\n- Exchange the first item for the second one ( $ 3-1<=2 $ ).\n- Take the first item ( $ 1-0<=2 $ ).",
    "translation": "有 $n$ 个品种的物品，每个物品的价格为 $c_i$，每次你可以从你拥有的物品中挑取部分去商店去兑换，也可以什么都不拿。兑换有如下限制：\n\n1. 你拿去兑换的物品（不妨设拿去兑换的物品可空集合为 $S$），都要换成集合 $S$ 所没有的。比如 $(a,b) \\to (v,a)$ 就是不合法的。\n\n2. 你拿去兑换的物品集 $S_1$ 里的价值和 $\\mathit{cost}_1$ 与你兑换回来的物品集 $S_2$ 里的价值和 $\\mathit{cost}_2$ 需要满足：$\\mathit{cost}_1 + d \\ge \\mathit{cost}_2$。\n\n每天只能去兑换一次。\n\n问通过兑换可以获得的物品集的价值和最大值，以及所需的兑换天数。\n"
}