{
    "description": "Kostya is a progamer specializing in the discipline of Dota 2. Valve Corporation, the developer of this game, has recently released a new patch which turned the balance of the game upside down. Kostya, as the captain of the team, realizes that the greatest responsibility lies on him, so he wants to resort to the analysis of innovations patch from the mathematical point of view to choose the best heroes for his team in every game.\n\nA Dota 2 match involves two teams, each of them must choose some heroes that the players of the team are going to play for, and it is forbidden to choose the same hero several times, even in different teams. In large electronic sports competitions where Kostya's team is going to participate, the matches are held in the Captains Mode. In this mode the captains select the heroes by making one of two possible actions in a certain, predetermined order: pick or ban.\n\n- To pick a hero for the team. After the captain picks, the picked hero goes to his team (later one of a team members will play it) and can no longer be selected by any of the teams.\n- To ban a hero. After the ban the hero is not sent to any of the teams, but it still can no longer be selected by any of the teams.\n\nThe team captain may miss a pick or a ban. If he misses a pick, a random hero is added to his team from those that were available at that moment, and if he misses a ban, no hero is banned, as if there was no ban.\n\nKostya has already identified the strength of all the heroes based on the new patch fixes. Of course, Kostya knows the order of picks and bans. The strength of a team is the sum of the strengths of the team's heroes and both teams that participate in the match seek to maximize the difference in strengths in their favor. Help Kostya determine what team, the first one or the second one, has advantage in the match, and how large the advantage is.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2<=n<=100 $ ) — the number of heroes in Dota 2.\n\nThe second line contains $ n $ integers $ s_{1} $ , $ s_{2} $ , ..., $ s_{n} $ ( $ 1<=s_{i}<=10^{6} $ ) — the strengths of all the heroes.\n\nThe third line contains a single integer $ m $ ( $ 2<=m<=min(n,20) $ ) — the number of actions the captains of the team must perform.\n\nNext $ m $ lines look like \" $ action team $ \", where $ action $ is the needed action: a pick (represented as a \"p\") or a ban (represented as a \"b\"), and $ team $ is the number of the team that needs to perform the action (number $ 1 $ or $ 2 $ ).\n\nIt is guaranteed that each team makes at least one pick. Besides, each team has the same number of picks and the same number of bans.",
    "outputFormat": "Print a single integer — the difference between the strength of the first team and the strength of the second team if the captains of both teams will act optimally well.",
    "samples": [
        [
            "2\n2 1\n2\np 1\np 2\n",
            "1\n"
        ],
        [
            "6\n6 4 5 4 5 5\n4\nb 2\np 1\nb 1\np 2\n",
            "0\n"
        ],
        [
            "4\n1 2 3 4\n4\np 2\nb 2\np 1\nb 1\n",
            "-2\n"
        ]
    ],
    "hint": "",
    "translation": "有两个队在游戏Dota 2里选择英雄。有$n$个英雄，每个英雄的力量为$s_i$。两个队伍一共要操作$m$次。操作有两种：\n\n操作'p'会选择一个英雄，并且获得该英雄的力量。选择这个英雄后，这个英雄就不能被任意队伍再次选择。\n\n操作'b'会禁用一个英雄，禁用这个英雄后，这个英雄就不能被任意队伍再次选择。\n\n操作时队伍可以选择跳过一次操作。\n\n如果跳过'p'操作，一个随机的英雄将会被加入队伍，并且获得该英雄的力量。\n\n如果跳过'b'操作，没有英雄将被禁用。\n\n求第一个队伍的英雄力量之和减去第二个队伍的英雄力量之和的最大值。"
}