{
    "description": "Pavel loves grid mazes. A grid maze is an $ n×m $ rectangle maze where each cell is either empty, or is a wall. You can go from one cell to another only if both cells are empty and have a common side.\n\nPavel drew a grid maze with all empty cells forming a connected area. That is, you can go from any empty cell to any other one. Pavel doesn't like it when his maze has too little walls. He wants to turn exactly $ k $ empty cells into walls so that all the remaining cells still formed a connected area. Help him.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ , $ k $ ( $ 1<=n,m<=500 $ , $ 0<=k&lt;s $ ), where $ n $ and $ m $ are the maze's height and width, correspondingly, $ k $ is the number of walls Pavel wants to add and letter $ s $ represents the number of empty cells in the original maze.\n\nEach of the next $ n $ lines contains $ m $ characters. They describe the original maze. If a character on a line equals \".\", then the corresponding cell is empty and if the character equals \"\\#\", then the cell is a wall.",
    "outputFormat": "Print $ n $ lines containing $ m $ characters each: the new maze that fits Pavel's requirements. Mark the empty cells that you transformed into walls as \"X\", the other cells must be left without changes (that is, \".\" and \"\\#\").\n\nIt is guaranteed that a solution exists. If there are multiple solutions you can output any of them.",
    "samples": [
        [
            "3 4 2\n#..#\n..#.\n#...\n",
            "#.X#\nX.#.\n#...\n"
        ],
        [
            "5 4 5\n#...\n#.#.\n.#..\n...#\n.#.#\n",
            "#XXX\n#X#.\nX#..\n...#\n.#.#\n"
        ]
    ],
    "hint": "",
    "translation": "题目描述：\n\n小P非常的喜欢方格迷宫。方格迷宫是一个n*m的由墙和空地构成的长方形方阵。只有当两点满足四联通条件时才能走过去。\n\n小P画了一个迷宫，里面所有的空地都是四连通的。但~~闲着没事干的~~小P认为自己画的迷宫里小墙太多了很难看，所以他希望能够通过把迷宫中k个格子从空地变成墙但不破坏整张图的连通性（即仍然保持所有空地在一个四连通块中）\n\n但是小P太蠢了做不来，请你帮助他。\n\n输入：\n第一行n,m,k（描述如题）\n第二到n+1行：\n每行m个字符，分别是'.'或'#'。 '.'表示空地，'#'表示墙。\n输出：\n把整张图原样打出来，但是被你修改的格子输出'X'。\n\n（题意基本正确）"
}