{
    "description": "Dima's spent much time thinking what present to give to Inna and gave her an empty sequence $ w $ . Now they want to fill sequence $ w $ with numbers zero and one. For that, they decided to play an amusing game.\n\nBefore the game begins, Dima chooses $ m $ integers $ a_{1},a_{2},...,a_{m} $ $ (1<=a_{1}<a_{2}<...<a_{m}) $ . Then Inna and Dima start playing, that is, adding numbers to sequence $ w $ . Each new number they choose is added to the end of the sequence. At some moments of time Dima feels that the game is going to end too soon (and he wants to play with Inna as long as possible), so he hits a table hard with his fist. At that the $ a_{1} $ -th, $ a_{2} $ -th, $ a_{3} $ -th, $ ... $ , $ a_{k} $ -th numbers from the beginning simultaneously fall out of the sequence (the sequence gets $ k $ numbers less). Here $ k $ is such maximum number that value $ a_{k} $ doesn't exceed the current length of the sequence. If number $ a_{1} $ is larger than the current length of $ w $ , then nothing falls out of the sequence.\n\nYou are given the chronological sequence of events in the game. Each event is either adding a number to the end of sequence $ w $ or Dima's hit on the table. Calculate the sequence $ w $ after all these events happen.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ $ (1<=n,m<=10^{6}) $ showing how many events took place and how many numbers Dima chose.\n\nThe next line contains $ m $ distinct integers $ a_{i} $ $ (1<=a_{i}<=10^{6}) $ sorted in the increasing order.\n\nNext $ n $ lines describe the events in the chronological order. Each line contains a single integer: -1, 0 or 1. Number -1 means that Dima hits the table. Number 0 means that Inna and Dima add number 0 to the end of the sequence. Number 1 means that Inna and Dima add number 1 to the end of the sequence.",
    "outputFormat": "In a single line print a sequence of numbers 0 and 1 — the elements of the sequence after all events happen. Print the elements of the sequence in the order from the beginning to the end of the sequence.\n\nIf after all events the sequence ends up empty, print \"Poor stack!\".",
    "samples": [
        [
            "10 3\n1 3 6\n-1\n1\n1\n0\n0\n-1\n0\n1\n-1\n1\n",
            "011\n"
        ],
        [
            "2 1\n1\n1\n-1\n",
            "Poor stack!\n"
        ]
    ],
    "hint": "",
    "translation": "\n\n初始有一个空的序列 w。现在想用数字 0 和 1 填充该序列 w，或者从序列 w 删除一些数字。\n\n一开始有 m 个整数 a1, a2, ..., am（1 ≤ a1 < a2 < ... < am）。接下来可以给序列 w 添加数字，每个数字都被添加到序列的末尾；也可以删除序列 w 中的一些数字。删除数字的个数是从 m 个数中选取，从开始的第 a1，第 a2，第 a3，...，第 ak（k ≤ m）。这里的 k 选择必须满足 ak 的值不超过序列当前长度的最大数。如果数字 a1 大于 w 的当前长度，则没有任何数字补删除。\n\n问 n 个操作后序列 w 的结果是什么？\n\n感谢@如我西沉 提供的翻译"
}