{
    "description": "Pavel is going to make a game of his dream. However, he knows that he can't make it on his own so he founded a development company and hired $ n $ workers of staff. Now he wants to pick $ n $ workers from the staff who will be directly responsible for developing a game.\n\nEach worker has a certain skill level $ v_{i} $ . Besides, each worker doesn't want to work with the one whose skill is very different. In other words, the $ i $ -th worker won't work with those whose skill is less than $ l_{i} $ , and with those whose skill is more than $ r_{i} $ .\n\nPavel understands that the game of his dream isn't too hard to develop, so the worker with any skill will be equally useful. That's why he wants to pick a team of the maximum possible size. Help him pick such team.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of workers Pavel hired.\n\nEach of the following $ n $ lines contains three space-separated integers $ l_{i} $ , $ v_{i} $ , $ r_{i} $ ( $ 1<=l_{i}<=v_{i}<=r_{i}<=3·10^{5} $ ) — the minimum skill value of the workers that the $ i $ -th worker can work with, the $ i $ -th worker's skill and the maximum skill value of the workers that the $ i $ -th worker can work with.",
    "outputFormat": "In the first line print a single integer $ m $ — the number of workers Pavel must pick for developing the game.\n\nIn the next line print $ m $ space-separated integers — the numbers of the workers in any order.\n\nIf there are multiple optimal solutions, print any of them.",
    "samples": [
        [
            "4\n2 8 9\n1 4 7\n3 6 8\n5 8 10\n",
            "3\n1 3 4\n"
        ],
        [
            "6\n3 5 16\n1 6 11\n4 8 12\n7 9 16\n2 10 14\n8 13 15\n",
            "4\n1 2 3 5\n"
        ]
    ],
    "hint": "",
    "translation": "有$ n $个工人，第$ i $个工人的能力是$ v_i $,他只与能力在$ l_i $到$ r_i $之间的人在一起工作，问最多能选出多少人一起工作并输出方案。\n\n感谢@mengbierr 提供的翻译"
}