{
    "description": "Soon there will be held the world's largest programming contest, but the testing system still has $ m $ bugs. The contest organizer, a well-known university, has no choice but to attract university students to fix all the bugs. The university has $ n $ students able to perform such work. The students realize that they are the only hope of the organizers, so they don't want to work for free: the $ i $ -th student wants to get $ c_{i} $ 'passes' in his subjects (regardless of the volume of his work).\n\nBugs, like students, are not the same: every bug is characterized by complexity $ a_{j} $ , and every student has the level of his abilities $ b_{i} $ . Student $ i $ can fix a bug $ j $ only if the level of his abilities is not less than the complexity of the bug: $ b_{i}>=a_{j} $ , and he does it in one day. Otherwise, the bug will have to be fixed by another student. Of course, no student can work on a few bugs in one day. All bugs are not dependent on each other, so they can be corrected in any order, and different students can work simultaneously.\n\nThe university wants to fix all the bugs as quickly as possible, but giving the students the total of not more than $ s $ passes. Determine which students to use for that and come up with the schedule of work saying which student should fix which bug.",
    "inputFormat": "The first line contains three space-separated integers: $ n $ , $ m $ and $ s $ ( $ 1<=n,m<=10^{5} $ , $ 0<=s<=10^{9} $ ) — the number of students, the number of bugs in the system and the maximum number of passes the university is ready to give the students.\n\nThe next line contains $ m $ space-separated integers $ a_{1} $ , $ a_{2} $ , ..., $ a_{m} $ ( $ 1<=a_{i}<=10^{9} $ ) — the bugs' complexities.\n\nThe next line contains $ n $ space-separated integers $ b_{1} $ , $ b_{2} $ , ..., $ b_{n} $ ( $ 1<=b_{i}<=10^{9} $ ) — the levels of the students' abilities.\n\nThe next line contains $ n $ space-separated integers $ c_{1} $ , $ c_{2} $ , ..., $ c_{n} $ ( $ 0<=c_{i}<=10^{9} $ ) — the numbers of the passes the students want to get for their help.",
    "outputFormat": "If the university can't correct all bugs print \"NO\".\n\nOtherwise, on the first line print \"YES\", and on the next line print $ m $ space-separated integers: the $ i $ -th of these numbers should equal the number of the student who corrects the $ i $ -th bug in the optimal answer. The bugs should be corrected as quickly as possible (you must spend the minimum number of days), and the total given passes mustn't exceed $ s $ . If there are multiple optimal answers, you can output any of them.",
    "samples": [
        [
            "3 4 9\n1 3 1 2\n2 1 3\n4 3 6\n",
            "YES\n2 3 2 3\n"
        ],
        [
            "3 4 10\n2 3 1 2\n2 1 3\n4 3 6\n",
            "YES\n1 3 1 3\n"
        ],
        [
            "3 4 9\n2 3 1 2\n2 1 3\n4 3 6\n",
            "YES\n3 3 2 3\n"
        ],
        [
            "3 4 5\n1 3 1 2\n2 1 3\n5 3 6\n",
            "NO\n"
        ]
    ],
    "hint": "Consider the first sample.\n\nThe third student (with level 3) must fix the 2nd and 4th bugs (complexities 3 and 2 correspondingly) and the second student (with level 1) must fix the 1st and 3rd bugs (their complexity also equals 1). Fixing each bug takes one day for each student, so it takes 2 days to fix all bugs (the students can work in parallel).\n\nThe second student wants 3 passes for his assistance, the third student wants 6 passes. It meets the university's capabilities as it is ready to give at most 9 passes.",
    "translation": "## 题目描述\r\n\r\n给出$\\ n\\ $个人的能力值,$\\ m\\ $个问题的难度值,请第$\\ i\\ $个人需要的花费,花钱的上限$\\ s\\ $。\r\n\r\n每个人能解决难度值小于等于他能力值的问题。\r\n\r\n求出能否在花钱不超过$\\ s\\ $的情况下把所有问题解决。\r\n\r\n每个人解决一个问题都需要$\\ 1\\ $天时间,不同学生可以并行,找一种最快的方案。\r\n\r\n如果可以解决输出$\\texttt\\ YES\\ $,并输出每个问题由谁来解决的最快的方案,多种方案输出任意一种。\r\n\r\n如果不行输出$\\texttt\\ NO\\ $。\r\n\r\n## 输入 \r\n\r\n第一行三个空格分隔的整数$\\texttt\\ n,m,s\\ (1≤n,m≤10^5,0≤s≤10^9),$分别表示学生人数,问题数,花费上限。\r\n\r\n接下来一行$\\ m\\ $个整数$\\ a_1,a_2,…,a_m(1≤a_i≤10^9)\\ $表示问题难度值。\r\n\r\n接下来一行$\\ n\\ $个整数$\\ b_1,b_2,…,b_n(1≤b_i≤10^9)\\ $表示学生能力值。\r\n\r\n接下来一行$\\ n\\ $个整数$\\ c_1,c_2,…,c_n(0≤c_i≤10^9)\\ $表示每个学生解决问题的费用。\r\n## 输出 \r\n\r\n第一行，解决不了所有问题输出$\\ NO\\ $,否则输出$\\ YES\\ $\r\n\r\n第二行,$\\ m\\ $个空格分隔的整数,第$\\ i\\ $个表示解决$\\ i\\ $号问题的学生编号。\r\n"
}