{
    "description": "Cucumber boy is fan of Kyubeat, a famous music game.\n\nKyubeat has $ 16 $ panels for playing arranged in $ 4×4 $ table. When a panel lights up, he has to press that panel.\n\nEach panel has a timing to press (the preffered time when a player should press it), and Cucumber boy is able to press at most $ k $ panels in a time with his one hand. Cucumber boy is trying to press all panels in perfect timing, that is he wants to press each panel exactly in its preffered time. If he cannot press the panels with his two hands in perfect timing, his challenge to press all the panels in perfect timing will fail.\n\nYou are given one scene of Kyubeat's panel from the music Cucumber boy is trying. Tell him is he able to press all the panels in perfect timing.",
    "inputFormat": "The first line contains a single integer $ k $ ( $ 1<=k<=5 $ ) — the number of panels Cucumber boy can press with his one hand.\n\nNext 4 lines contain 4 characters each (digits from 1 to 9, or period) — table of panels. If a digit $ i $ was written on the panel, it means the boy has to press that panel in time $ i $ . If period was written on the panel, he doesn't have to press that panel.",
    "outputFormat": "Output \"YES\" (without quotes), if he is able to press all the panels in perfect timing. If not, output \"NO\" (without quotes).",
    "samples": [
        [
            "1\n.135\n1247\n3468\n5789\n",
            "YES\n"
        ],
        [
            "5\n..1.\n1111\n..1.\n..1.\n",
            "YES\n"
        ],
        [
            "1\n....\n12.1\n.2..\n.2..\n",
            "NO\n"
        ]
    ],
    "hint": "In the third sample boy cannot press all panels in perfect timing. He can press all the panels in timing in time 1, but he cannot press the panels in time 2 in timing with his two hands.",
    "translation": "一共有 $4\\times4=16$ 个格子，每个格子 $(i,j)$ 需要在 $t_{i,j}$ 时刻点击（若为星号则不需要点击），你每只手同一时刻只能点击 $k$ 个格子（**注意你有两只手！**），求你是否能完成任务。  \n$t_{i,j}$ 是一个 $1-9$ 的数字。"
}