{
    "description": "You have a map as a rectangle table. Each cell of the table is either an obstacle, or a treasure with a certain price, or a bomb, or an empty cell. Your initial position is also given to you.\n\nYou can go from one cell of the map to a side-adjacent one. At that, you are not allowed to go beyond the borders of the map, enter the cells with treasures, obstacles and bombs. To pick the treasures, you need to build a closed path (starting and ending in the starting cell). The closed path mustn't contain any cells with bombs inside. Let's assume that the sum of the treasures' values that are located inside the closed path equals $ v $ , and besides, you've made $ k $ single moves (from one cell to another) while you were going through the path, then such path brings you the profit of $ v-k $ rubles.\n\nYour task is to build a closed path that doesn't contain any bombs and brings maximum profit.\n\nNote that the path can have self-intersections. In order to determine if a cell lies inside a path or not, use the following algorithm:\n\n1. Assume that the table cells are points on the plane (the table cell on the intersection of the $ i $ -th column and the $ j $ -th row is point $ (i,j) $ ). And the given path is a closed polyline that goes through these points.\n2. You need to find out if the point $ p $ of the table that is not crossed by the polyline lies inside the polyline.\n3. Let's draw a ray that starts from point $ p $ and does not intersect other points of the table (such ray must exist).\n4. Let's count the number of segments of the polyline that intersect the painted ray. If this number is odd, we assume that point $ p $ (and consequently, the table cell) lie inside the polyline (path). Otherwise, we assume that it lies outside.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ $ (1<=n,m<=20) $ — the sizes of the table. Next $ n $ lines each contains $ m $ characters — the description of the table. The description means the following:\n\n- character \"B\" is a cell with a bomb;\n- character \"S\" is the starting cell, you can assume that it's empty;\n- digit $ c $ (1-8) is treasure with index $ c $ ;\n- character \".\" is an empty cell;\n- character \"\\#\" is an obstacle.\n\nAssume that the map has $ t $ treasures. Next $ t $ lines contain the prices of the treasures. The $ i $ -th line contains the price of the treasure with index $ i $ , $ v_{i} $ $ (-200<=v_{i}<=200) $ . It is guaranteed that the treasures are numbered from 1 to $ t $ . It is guaranteed that the map has not more than 8 objects in total. Objects are bombs and treasures. It is guaranteed that the map has exactly one character \"S\".",
    "outputFormat": "Print a single integer — the maximum possible profit you can get.",
    "samples": [
        [
            "4 4\n....\n.S1.\n....\n....\n10\n",
            "2\n"
        ],
        [
            "7 7\n.......\n.1###2.\n.#...#.\n.#.B.#.\n.3...4.\n..##...\n......S\n100\n100\n100\n100\n",
            "364\n"
        ],
        [
            "7 8\n........\n........\n....1B..\n.S......\n....2...\n3.......\n........\n100\n-100\n100\n",
            "0\n"
        ],
        [
            "1 1\nS\n",
            "0\n"
        ]
    ],
    "hint": "In the first example the answer will look as follows.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF375C/cb0dbb1d435c2b4c4d748d9831291d273e4bf3cf.png)In the second example the answer will look as follows.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF375C/8027ff788009012e6263f482eda32fa57c7a9ae8.png)In the third example you cannot get profit.\n\nIn the fourth example you cannot get profit as you cannot construct a closed path with more than one cell.",
    "translation": "给你一个 $N \\times M$ 的地图（$N,M \\le 20$），地图上 `#` 表示障碍物，`B` 表示炸弹，数字表示宝藏序号（宝藏+炸弹个数 $\\le 8$），每个宝藏有价值（$-200 \\le v \\le 200$），`S` 表示出发点。每次移动可以从一个格子移动到相邻格子（上下左右）。寻找一条路径从 `S` 出发再回到 `S` 的封闭路径，移动步数记为 $K$，这个路径所包围的宝藏价值总和记为 $V$，则这条路径的价值为 $V - K$。题目即是求可行的最大的路径价值，并且不能包围炸弹。\n\n## 输入格式：\n\n第一行两个整数 $N, M$ 表示地图的长和宽 \n\n接下来 $N$ 行，每行 $M$ 个字符，描述整个地图，地图只可能包含如下字符: \n\n字符 `B` 表示炸弹；\n\n字符 `S` 表示起点,保证有且只有一个；\n\n数字 $c$（$1 \\sim 8$）代表宝藏标号，宝藏和炸弹加起来最多只有 $8$ 个；\n\n字符 `.` 表示空白格；\n\n字符 `#` 表示障碍物(墙)；\n\n假设地图包含 $t$ 个宝藏，接下来 $t$ 行，每行一个整数 $v_i$（$-200 \\le v_i \\le 200$），依序表示第 $i$ 个宝藏的价值。\n\n## 输出格式：\n\n一个整数，即能够获得的最大价值\n\n感谢@xjdx 提供的翻译"
}