{
    "description": "Iahubina is tired of so many complicated languages, so she decided to invent a new, simple language. She already made a dictionary consisting of $ n $ 3-words. A 3-word is a sequence of exactly $ 3 $ lowercase letters of the first 24 letters of the English alphabet ( $ a $ to $ x $ ). She decided that some of the letters are vowels, and all the others are consonants. The whole language is based on a simple rule: any word that contains at least one vowel is correct.\n\nIahubina forgot which letters are the vowels, and wants to find some possible correct sets of vowels. She asks Iahub questions. In each question, she will give Iahub a set of letters considered vowels (in this question). For each question she wants to know how many words of the dictionary are correct, considering the given set of vowels.\n\nIahubina wants to know the $ xor $ of the squared answers to all the possible questions. There are $ 2^{24} $ different questions, they are all subsets of the set of the first 24 letters of the English alphabet. Help Iahub find that number.",
    "inputFormat": "The first line contains one integer, $ n $ $ (1<=n<=10^{4}) $ . Each of the next $ n $ lines contains a 3-word consisting of $ 3 $ lowercase letters. There will be no two identical 3-words.",
    "outputFormat": "Print one number, the $ xor $ of the squared answers to the queries.",
    "samples": [
        [
            "5\nabc\naaa\nada\nbcd\ndef\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "给出n个长度为3的由′a′~′x′组成的单词，一个单词是正确的当且仅当其包含至少一个元音字母。\n这里的元音字母是`a`-`x`的一个子集。\n对于所有元音字母集合，求这n个单词中正确单词的数量平方的异或和。"
}