{
    "description": "Fox Ciel is playing a card game with her friend Fox Jiro. There are $ n $ piles of cards on the table. And there is a positive integer on each card.\n\nThe players take turns and Ciel takes the first turn. In Ciel's turn she takes a card from the top of any non-empty pile, and in Jiro's turn he takes a card from the bottom of any non-empty pile. Each player wants to maximize the total sum of the cards he took. The game ends when all piles become empty.\n\nSuppose Ciel and Jiro play optimally, what is the score of the game?",
    "inputFormat": "The first line contain an integer $ n $ ( $ 1<=n<=100 $ ). Each of the next $ n $ lines contains a description of the pile: the first integer in the line is $ s_{i} $ ( $ 1<=s_{i}<=100 $ ) — the number of cards in the $ i $ -th pile; then follow $ s_{i} $ positive integers $ c_{1} $ , $ c_{2} $ , ..., $ c_{k} $ , ..., $ c_{si} $ ( $ 1<=c_{k}<=1000 $ ) — the sequence of the numbers on the cards listed from top of the current pile to bottom of the pile.",
    "outputFormat": "Print two integers: the sum of Ciel's cards and the sum of Jiro's cards if they play optimally.",
    "samples": [
        [
            "2\n1 100\n2 1 10\n",
            "101 10\n"
        ],
        [
            "1\n9 2 8 6 5 9 4 7 1 3\n",
            "30 15\n"
        ],
        [
            "3\n3 1 3 2\n3 5 4 6\n2 8 7\n",
            "18 18\n"
        ],
        [
            "3\n3 1000 1000 1000\n6 1000 1000 1000 1000 1000 1000\n5 1000 1000 1000 1000 1000\n",
            "7000 7000\n"
        ]
    ],
    "hint": "In the first example, Ciel will take the cards with number 100 and 1, Jiro will take the card with number 10.\n\nIn the second example, Ciel will take cards with numbers 2, 8, 6, 5, 9 and Jiro will take cards with numbers 4, 7, 1, 3.",
    "translation": "桌子上有 $n$ 堆牌。每张牌上都有一个正整数。Ciel可以从任何非空牌堆的顶部取出一张牌，Jiro可以从任何非空牌堆的底部取出一张牌。Ciel先取，当所有的牌堆都变空时游戏结束。他们都想最大化他所拿牌的分数（即每张牌上正整数的和）。问他们所拿牌的分数分别是多少？"
}