{
    "description": "On a number axis directed from the left rightwards, $ n $ marbles with coordinates $ x_{1},x_{2},...,x_{n} $ are situated. Let's assume that the sizes of the marbles are infinitely small, that is in this task each of them is assumed to be a material point. You can stick pins in some of them and the cost of sticking in the marble number $ i $ is equal to $ c_{i} $ , number $ c_{i} $ may be negative. After you choose and stick the pins you need, the marbles will start to roll left according to the rule: if a marble has a pin stuck in it, then the marble doesn't move, otherwise the marble rolls all the way up to the next marble which has a pin stuck in it and stops moving there. If there is no pinned marble on the left to the given unpinned one, it is concluded that the marble rolls to the left to infinity and you will pay an infinitely large fine for it. If no marble rolled infinitely to the left, then the fine will consist of two summands:\n\n- the sum of the costs of stuck pins;\n- the sum of the lengths of the paths of each of the marbles, that is the sum of absolute values of differences between their initial and final positions.\n\nYour task is to choose and pin some marbles in the way that will make the fine for you to pay as little as possible.",
    "inputFormat": "The first input line contains an integer $ n $ ( $ 1<=n<=3000 $ ) which is the number of marbles. The next $ n $ lines contain the descriptions of the marbles in pairs of integers $ x_{i} $ , $ c_{i} $ ( $ -10^{9}<=x_{i},c_{i}<=10^{9} $ ). The numbers are space-separated. Each description is given on a separate line. No two marbles have identical initial positions.",
    "outputFormat": "Output the single number — the least fine you will have to pay.",
    "samples": [
        [
            "3\n2 3\n3 4\n1 2\n",
            "5\n"
        ],
        [
            "4\n1 7\n3 1\n5 10\n6 1\n",
            "11\n"
        ]
    ],
    "hint": "",
    "translation": "给你 $n(n<=3000)$ 个弹珠，它们位于数轴上。给你弹珠的坐标 $x_i$ 在弹珠 $i$ 上面花费 $C_i$ 的钱 可以使弹珠在原地不动$($ -$109<=x_i,C_i<=109)$，游戏开始时，所有的弹珠向左滚动，直到碰到定在原地不动的弹珠，其花费是其滚动的距离。总花费=开始前的花费+弹珠滚动的花费，问最小的花费是多少。\n\nBy @[Dimly_dust](https://www.luogu.com.cn/user/316896)"
}