{
    "description": "On the Berland Dependence Day it was decided to organize a great marathon. Berland consists of $ n $ cities, some of which are linked by two-way roads. Each road has a certain length. The cities are numbered from 1 to $ n $ . It is known that one can get from any city to any other one by the roads.\n\n $ n $ runners take part in the competition, one from each city. But Berland runners are talkative by nature and that's why the juries took measures to avoid large crowds of marathon participants. The jury decided that every runner should start the marathon from their hometown. Before the start every sportsman will get a piece of paper containing the name of the city where the sportsman's finishing line is. The finish is chosen randomly for every sportsman but it can't coincide with the sportsman's starting point. Several sportsmen are allowed to finish in one and the same city. All the sportsmen start simultaneously and everyone runs the shortest route from the starting point to the finishing one. All the sportsmen run at one speed which equals to $ 1 $ .\n\nAfter the competition a follow-up table of the results will be composed where the sportsmen will be sorted according to the nondecrease of time they spent to cover the distance. The first $ g $ sportsmen in the table will get golden medals, the next $ s $ sportsmen will get silver medals and the rest will get bronze medals. Besides, if two or more sportsmen spend the same amount of time to cover the distance, they are sorted according to the number of the city where a sportsman started to run in the ascending order. That means no two sportsmen share one and the same place.\n\nAccording to the rules of the competition the number of gold medals $ g $ must satisfy the inequation $ g_{1}<=g<=g_{2} $ , where $ g_{1} $ and $ g_{2} $ are values formed historically. In a similar way, the number of silver medals $ s $ must satisfy the inequation $ s_{1}<=s<=s_{2} $ , where $ s_{1} $ and $ s_{2} $ are also values formed historically.\n\nAt present, before the start of the competition, the destination points of every sportsman are unknown. However, the press demands details and that's why you are given the task of counting the number of the ways to distribute the medals. Two ways to distribute the medals are considered different if at least one sportsman could have received during those distributions different kinds of medals.",
    "inputFormat": "The first input line contains given integers $ n $ and $ m $ ( $ 3<=n<=50 $ , $ n-1<=m<=1000 $ ), where $ n $ is the number of Berland towns and $ m $ is the number of roads.\n\nNext in $ m $ lines road descriptions are given as groups of three integers $ v $ , $ u $ , $ c $ , which are the numbers of linked towns and its length ( $ 1<=v,u<=n $ , $ v≠u $ , $ 1<=c<=1000 $ ). Every pair of cities have no more than one road between them.\n\nThe last line contains integers $ g_{1} $ , $ g_{2} $ , $ s_{1} $ , $ s_{2} $ ( $ 1<=g_{1}<=g_{2} $ , $ 1<=s_{1}<=s_{2} $ , $ g_{2}+s_{2}&lt;n $ ). The input data numbers, located on one line, are space-separated.",
    "outputFormat": "Print the single number — the number of ways to distribute the medals. It is guaranteed that the number fits in the standard 64-bit signed data type.",
    "samples": [
        [
            "3 2\n1 2 1\n2 3 1\n1 1 1 1\n",
            "3\n"
        ],
        [
            "4 5\n1 2 2\n2 3 1\n3 4 2\n4 1 2\n1 3 3\n1 2 1 1\n",
            "19\n"
        ],
        [
            "3 3\n1 2 2\n2 3 1\n3 1 2\n1 1 1 1\n",
            "4\n"
        ]
    ],
    "hint": "",
    "translation": "+ 有 $n$ 个运动员参加马拉松，马拉松在一个 $n$ 个点， $m$ 条边（带边权）的图上进行。第 $i$ 个运动员从 $i$ 号点出发，终点不固定，但不能是起点，几个运动员可以在同一个地方停下。\r\n\r\n+ 每个运动员速度都是 $1$，到达终点都花了一定的时间，将这些时间升序排序，取前 $g$ 名为金牌，第 $g+1$ 到第 $s$ 名为银牌 $(g1 \\le g \\le g2,s1 \\le s \\le s2)$。\r\n\r\n+ 求一共有多少种不同的奖牌分配方案。两个方案不同当且仅当至少有一人获得的奖牌不同。\r\n\r\n+ $ 3 \\le n \\le 50,n-1 \\le m \\le 1000$"
}