{
    "description": "Sereja loves number sequences very much. That's why he decided to make himself a new one following a certain algorithm.\n\nSereja takes a blank piece of paper. Then he starts writing out the sequence in $ m $ stages. Each time he either adds a new number to the end of the sequence or takes $ l $ first elements of the current sequence and adds them $ c $ times to the end. More formally, if we represent the current sequence as $ a_{1},a_{2},...,a_{n} $ , then after we apply the described operation, the sequence transforms into $ a_{1},a_{2},...,a_{n}[,a_{1},a_{2},...,a_{l}] $ (the block in the square brackets must be repeated $ c $ times).\n\nA day has passed and Sereja has completed the sequence. He wonders what are the values of some of its elements. Help Sereja.",
    "inputFormat": "The first line contains integer $ m $ $ (1<=m<=10^{5}) $ — the number of stages to build a sequence.\n\nNext $ m $ lines contain the description of the stages in the order they follow. The first number in the line is a type of stage (1 or 2). Type 1 means adding one number to the end of the sequence, in this case the line contains integer $ x_{i} $ $ (1<=x_{i}<=10^{5}) $ — the number to add. Type 2 means copying a prefix of length $ l_{i} $ to the end $ c_{i} $ times, in this case the line further contains two integers $ l_{i},c_{i} $ $ (1<=l_{i}<=10^{5},1<=c_{i}<=10^{4}) $ , $ l_{i} $ is the length of the prefix, $ c_{i} $ is the number of copyings. It is guaranteed that the length of prefix $ l_{i} $ is never larger than the current length of the sequence.\n\nThe next line contains integer $ n $ $ (1<=n<=10^{5}) $ — the number of elements Sereja is interested in. The next line contains the numbers of elements of the final sequence Sereja is interested in. The numbers are given in the strictly increasing order. It is guaranteed that all numbers are strictly larger than zero and do not exceed the length of the resulting sequence. Consider the elements of the final sequence numbered starting from $ 1 $ from the beginning to the end of the sequence.\n\nPlease, do not use the %lld specifier to read or write 64-bit integers in С++. It is preferred to use the cin, cout streams or the %I64d specifier.",
    "outputFormat": "Print the elements that Sereja is interested in, in the order in which their numbers occur in the input.",
    "samples": [
        [
            "6\n1 1\n1 2\n2 2 1\n1 3\n2 5 2\n1 4\n16\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16\n",
            "1 2 1 2 3 1 2 1 2 3 1 2 1 2 3 4\n"
        ]
    ],
    "hint": "",
    "translation": "题面：\n\n初始有一个空序列,有m次操作,每次给出一种操作:\n1. 在序列末尾添加一个数x.\n2. 将序列长度为l的前缀复制c次插入到序列末尾.\n\n有n组询问，每组询问为操作完的序列上第i号点的值.\n输入数据：\n\n第一行一个m\n接下来m行操作,形如<1,x> or <2,l,c>\n第m+2行一个n\n接下来n个数,分别询问第i号位上的值.\n输出数据：\n\n仅一行,n个询问的输出.\n数据范围：\n\nm:[1,1e5]\nx:[1,1e5]\nl:[1,1e5]\nc:[1,1e4]\nn:[1,1e5]\ni<sizeof(long long)\n注意：\n\n记得开long long!\n翻译贡献者：尘染梦"
}