{
    "description": "George is a cat, so he loves playing very much.\n\nVitaly put $ n $ cards in a row in front of George. Each card has one integer written on it. All cards had distinct numbers written on them. Let's number the cards from the left to the right with integers from $ 1 $ to $ n $ . Then the $ i $ -th card from the left contains number $ p_{i} $ ( $ 1<=p_{i}<=n $ ).\n\nVitaly wants the row to have exactly $ k $ cards left. He also wants the $ i $ -th card from left to have number $ b_{i} $ written on it. Vitaly gave a task to George, to get the required sequence of cards using the remove operation $ n-k $ times.\n\nIn one remove operation George can choose $ w $ ( $ 1<=w $ ; $ w $ is not greater than the current number of cards in the row) contiguous cards (contiguous subsegment of cards). Let's denote the numbers written on these card as $ x_{1},x_{2},...,x_{w} $ (from the left to the right). After that, George can remove the card $ x_{i} $ , such that $ x_{i}<=x_{j} $ for each $ j $ $ (1<=j<=w) $ . After the described operation George gets $ w $ pieces of sausage.\n\nGeorge wondered: what maximum number of pieces of sausage will he get in total if he reaches his goal and acts optimally well? Help George, find an answer to his question!",
    "inputFormat": "The first line contains integers $ n $ and $ k $ ( $ 1<=k<=n<=10^{6} $ ) — the initial and the final number of cards.\n\nThe second line contains $ n $ distinct space-separated integers $ p_{1},p_{2},...,p_{n} $ ( $ 1<=p_{i}<=n $ ) — the initial row of cards.\n\nThe third line contains $ k $ space-separated integers $ b_{1},b_{2},...,b_{k} $ — the row of cards that you need to get. It is guaranteed that it's possible to obtain the given row by using the remove operation for $ n-k $ times.",
    "outputFormat": "Print a single integer — the maximum number of pieces of sausage that George can get if he acts optimally well.",
    "samples": [
        [
            "3 2\n2 1 3\n1 3\n",
            "1\n"
        ],
        [
            "10 5\n1 2 3 4 5 6 7 8 9 10\n2 4 6 8 10\n",
            "30\n"
        ]
    ],
    "hint": "",
    "translation": "给出一个 $1$ 到 $n$ 的排列（输入中的数组 $p$ ），并给出一个长为 $k$ 的数组 $b$ ，要求从 $p$ 中删去 $n - k$ 个元素后得到数组 $b$ 。\n\n删除操作的定义：选取一个区间 $[l, r]$ ，删去其中最小的元素，并获得 $r - l + 1$ 的分数。\n\n请你输出最终得分的最大值，保证有解。\n\n$1 \\leq k \\leq n \\leq 10^{6}$"
}