{
    "description": "During the break, we decided to relax and play dominoes. Our box with Domino was empty, so we decided to borrow the teacher's dominoes.\n\nThe teacher responded instantly at our request. He put $ nm $ dominoes on the table as an $ n×2m $ rectangle so that each of the $ n $ rows contained $ m $ dominoes arranged horizontally. Each half of each domino contained number (0 or 1).\n\nWe were taken aback, and the teacher smiled and said: \"Consider some arrangement of dominoes in an $ n×2m $ matrix. Let's count for each column of the matrix the sum of numbers in this column. Then among all such sums find the maximum one. Can you rearrange the dominoes in the matrix in such a way that the maximum sum will be minimum possible? Note that it is prohibited to change the orientation of the dominoes, they all need to stay horizontal, nevertheless dominoes are allowed to rotate by 180 degrees. As a reward I will give you all my dominoes\".\n\nWe got even more taken aback. And while we are wondering what was going on, help us make an optimal matrix of dominoes.",
    "inputFormat": "The first line contains integers $ n $ , $ m $ ( $ 1<=n,m<=10^{3} $ ).\n\nIn the next lines there is a description of the teachers' matrix. Each of next $ n $ lines contains $ m $ dominoes. The description of one domino is two integers (0 or 1), written without a space — the digits on the left and right half of the domino.",
    "outputFormat": "Print the resulting matrix of dominoes in the format: $ n $ lines, each of them contains $ m $ space-separated dominoes.\n\nIf there are multiple optimal solutions, print any of them.",
    "samples": [
        [
            "2 3\n01 11 00\n00 01 11\n",
            "11 11 10\n00 00 01\n"
        ],
        [
            "4 1\n11\n10\n01\n00\n",
            "11\n10\n01\n00\n"
        ]
    ],
    "hint": "Consider the answer for the first sample. There, the maximum sum among all columns equals $ 1 $ (the number of columns is $ 6 $ , and not $ 3 $ ). Obviously, this maximum can't be less than $ 1 $ , then such matrix is optimal.\n\nNote that the dominoes can be rotated by $ 180 $ degrees.",
    "translation": "有一个 $n \\times 2m$ 大小的棋盘,每一个多米诺骨牌占 $1 \\times 2$ 的格子,且一定是横向摆放\r\n\r\n即每一个多米诺骨牌可能是$\\text{'11''10''01''00'}$中的一种\r\n\r\n问将棋盘上的骨牌重新摆放(可以将骨牌左右颠倒)后,使每一列上$\\text{'1'}$的个数的最大值最小的其中一种方案"
}