{
    "description": "When new students come to the Specialized Educational and Scientific Centre (SESC) they need to start many things from the beginning. Sometimes the teachers say (not always unfairly) that we cannot even count. So our teachers decided to teach us arithmetics from the start. And what is the best way to teach students add and subtract? — That's right, using counting sticks! An here's our new task:\n\nAn expression of counting sticks is an expression of type:\n\n\\[ $ A $ sticks\\]\\[sign +\\]\\[ $ B $ sticks\\]\\[sign =\\]\\[ $ C $ sticks\\] $ (1<=A,B,C) $ . Sign + consists of two crossed sticks: one vertical and one horizontal. Sign = consists of two horizontal sticks. The expression is arithmetically correct if $ A+B=C $ .\n\nWe've got an expression that looks like $ A+B=C $ given by counting sticks. Our task is to shift at most one stick (or we can shift nothing) so that the expression became arithmetically correct. Note that we cannot remove the sticks from the expression, also we cannot shift the sticks from the signs + and =.\n\nWe really aren't fabulous at arithmetics. Can you help us?",
    "inputFormat": "The single line contains the initial expression. It is guaranteed that the expression looks like $ A+B=C $ , where $ 1<=A,B,C<=100 $ .",
    "outputFormat": "If there isn't a way to shift the stick so the expression becomes correct, print on a single line \"Impossible\" (without the quotes). If there is a way, print the resulting expression. Follow the format of the output from the test samples. Don't print extra space characters.\n\nIf there are multiple correct answers, print any of them. For clarifications, you are recommended to see the test samples.",
    "samples": [
        [
            "||+|=|||||\n",
            "|||+|=||||\n"
        ],
        [
            "|||||+||=||\n",
            "Impossible\n"
        ],
        [
            "|+|=||||||\n",
            "Impossible\n"
        ],
        [
            "||||+||=||||||\n",
            "||||+||=||||||\n"
        ]
    ],
    "hint": "In the first sample we can shift stick from the third group of sticks to the first one.\n\nIn the second sample we cannot shift vertical stick from + sign to the second group of sticks. So we cannot make a - sign.\n\nThere is no answer in the third sample because we cannot remove sticks from the expression.\n\nIn the forth sample the initial expression is already arithmetically correct and that is why we don't have to shift sticks.",
    "translation": "给定一个由火柴棒组成的等式，格式会是这样：\n\t\n    |||+||=|||||\n不过，这个等式不一定成立，所以你需要把等号左边移一根火柴棒到右边，或者从等号右边移一根火柴棒到左边\n\n如果原来的等式可以成立或移动一根后可以成立，请输出成立的等式\n\n否则输出\"Impossible\"（不带引号）"
}