{
    "description": "A group of tourists is going to kayak and catamaran tour. A rented lorry has arrived to the boat depot to take kayaks and catamarans to the point of departure. It's known that all kayaks are of the same size (and each of them occupies the space of 1 cubic metre), and all catamarans are of the same size, but two times bigger than kayaks (and occupy the space of 2 cubic metres).\n\nEach waterborne vehicle has a particular carrying capacity, and it should be noted that waterborne vehicles that look the same can have different carrying capacities. Knowing the truck body volume and the list of waterborne vehicles in the boat depot (for each one its type and carrying capacity are known), find out such set of vehicles that can be taken in the lorry, and that has the maximum total carrying capacity. The truck body volume of the lorry can be used effectively, that is to say you can always put into the lorry a waterborne vehicle that occupies the space not exceeding the free space left in the truck body.",
    "inputFormat": "The first line contains a pair of integer numbers $ n $ and $ v $ ( $ 1<=n<=10^{5} $ ; $ 1<=v<=10^{9} $ ), where $ n $ is the number of waterborne vehicles in the boat depot, and $ v $ is the truck body volume of the lorry in cubic metres. The following $ n $ lines contain the information about the waterborne vehicles, that is a pair of numbers $ t_{i} $ , $ p_{i} $ ( $ 1<=t_{i}<=2 $ ; $ 1<=p_{i}<=10^{4} $ ), where $ t_{i} $ is the vehicle type ( $ 1 $ – a kayak, $ 2 $ – a catamaran), and $ p_{i} $ is its carrying capacity. The waterborne vehicles are enumerated in order of their appearance in the input file.",
    "outputFormat": "In the first line print the maximum possible carrying capacity of the set. In the second line print a string consisting of the numbers of the vehicles that make the optimal set. If the answer is not unique, print any of them.",
    "samples": [
        [
            "3 2\n1 2\n2 7\n1 3\n",
            "7\n2\n"
        ]
    ],
    "hint": "",
    "translation": "#### 题目描述  \n\n给定整数 $n,v$。  \n\n有一辆载重量为 $v$ 的货车，准备运送两种物品。物品 A 的重量为 $1$，物体 B 的重量为 $2$，每个物品都有一个价值 $p_i$。求货车可以运送的物品的最大价值。  \n#### 输入格式\n第一个行包含两个整数 $n$ 和 $v$，分别表示有 $n$ 个物品，货车的载重量为 $v$。（$1\\le n\\le10^5$，$1\\le v\\le10^9$）\n\n接下来 $n$ 行，每行两个整数，分别表示物品的重量 $t_i$ 和价值 $p_i$。（$t_i=1$ 或 $2$，$1\\le p_i\\le10^4$）\n\n#### 输出格式\n\n第一行，一个整数，表示价值之和的最大值。\n\n第二行，构成最大价值的物品的编号（如果答案不唯一，请输出其中任何一个）。"
}