{
    "description": "Certainly, everyone is familiar with tic-tac-toe game. The rules are very simple indeed. Two players take turns marking the cells in a $ 3×3 $ grid (one player always draws crosses, the other — noughts). The player who succeeds first in placing three of his marks in a horizontal, vertical or diagonal line wins, and the game is finished. The player who draws crosses goes first. If the grid is filled, but neither Xs, nor 0s form the required line, a draw is announced.\n\nYou are given a $ 3×3 $ grid, each grid cell is empty, or occupied by a cross or a nought. You have to find the player (first or second), whose turn is next, or print one of the verdicts below:\n\n- illegal — if the given board layout can't appear during a valid game;\n- the first player won — if in the given board layout the first player has just won;\n- the second player won — if in the given board layout the second player has just won;\n- draw — if the given board layout has just let to a draw.",
    "inputFormat": "The input consists of three lines, each of the lines contains characters \".\", \"X\" or \"0\" (a period, a capital letter X, or a digit zero).",
    "outputFormat": "Print one of the six verdicts: first, second, illegal, the first player won, the second player won or draw.",
    "samples": [
        [
            "X0X\n.0.\n.X.\n",
            "second\n"
        ]
    ],
    "hint": "",
    "translation": "当然，大家都熟悉井字棋游戏。 这些规则确实很简单。 两个玩家A、B轮流在3x3的方格的单元格中画符号（玩家A总是画“X”，玩家B总是画“0”）。 首先在水平、垂直或对角线上出现3个相同的符号的玩家获胜，比赛结束。 玩家A总是为先手。 如果3x3的方格被填满，但是在所有水平、垂直或对角线上均未出现3个相同的符号，宣布平局。\n\n给你一个3*3的方格，每个单元格是“.”（空白），“X”或“0”。 你必须输出以下内容之一：\n\n玩家A走棋（输出“first”）——如果出现给定的状态后，下一步为玩家A走棋。 \n\n玩家B走棋（输出“second”）——如果出现给定的状态后，下一步为玩家B走棋。\n\n非法（输出“illegal”）——如果给定的状态无法在正常游戏过程中出现。\n\n玩家A胜利（输出“the first player won”）——如果给定的状态中玩家A胜利。\n\n玩家B胜利（输出“the second player won”）——如果给定的状态中玩家B胜利。\n\n平局（输出“draw”）——如果给定的状态是平局。"
}