{
    "description": "The Queen of England has $ n $ trees growing in a row in her garden. At that, the $ i $ -th $ (1<=i<=n) $ tree from the left has height $ a_{i} $ meters. Today the Queen decided to update the scenery of her garden. She wants the trees' heights to meet the condition: for all $ i $ $ (1<=i&lt;n) $ , $ a_{i+1}-a_{i}=k $ , where $ k $ is the number the Queen chose.\n\nUnfortunately, the royal gardener is not a machine and he cannot fulfill the desire of the Queen instantly! In one minute, the gardener can either decrease the height of a tree to any positive integer height or increase the height of a tree to any positive integer height. How should the royal gardener act to fulfill a whim of Her Majesty in the minimum number of minutes?",
    "inputFormat": "The first line contains two space-separated integers: $ n $ , $ k $ ( $ 1<=n,k<=1000) $ . The second line contains $ n $ space-separated integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=1000 $ ) — the heights of the trees in the row.",
    "outputFormat": "In the first line print a single integer $ p $ — the minimum number of minutes the gardener needs. In the next $ p $ lines print the description of his actions.\n\nIf the gardener needs to increase the height of the $ j $ -th ( $ 1<=j<=n $ ) tree from the left by $ x $ $ (x>=1) $ meters, then print in the corresponding line \"+ j x\". If the gardener needs to decrease the height of the $ j $ -th ( $ 1<=j<=n $ ) tree from the left by $ x $ $ (x>=1) $ meters, print on the corresponding line \"- j x\".\n\nIf there are multiple ways to make a row of trees beautiful in the minimum number of actions, you are allowed to print any of them.",
    "samples": [
        [
            "4 1\n1 2 1 5\n",
            "2\n+ 3 2\n- 4 1\n"
        ],
        [
            "4 1\n1 2 3 4\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "## 题意\n有$n$个正整数，可以对一个数进行修改(修改后也是正整数)，要求修改之后满足$a_i+k=a_{i+1}$,求最少的修改次数以及具体的修改方案\n\n## 输入格式\n第一行:$n$和$k$\n\n第二行:$n$个数,表示初始的$a_i$\n\n## 输出格式\n 若不用修改,只要输出0\n\n 若需要修改;\n \n - 第一行:最小的修改次数\n - 接下来的若干行,对于**被修改的**$a_i$,其修改后值为$b_i$,若$b_i>a_i$,输出:\"+ i ($b_i-a_i$)\";若$a_i>b_i$,输出:\"- i $(a_i-b_i)$\"\n"
}