{
    "description": "Little Vasya went to the supermarket to get some groceries. He walked about the supermarket for a long time and got a basket full of products. Now he needs to choose the cashier to pay for the products.\n\nThere are $ n $ cashiers at the exit from the supermarket. At the moment the queue for the $ i $ -th cashier already has $ k_{i} $ people. The $ j $ -th person standing in the queue to the $ i $ -th cashier has $ m_{i,j} $ items in the basket. Vasya knows that:\n\n- the cashier needs 5 seconds to scan one item;\n- after the cashier scans each item of some customer, he needs 15 seconds to take the customer's money and give him the change.\n\nOf course, Vasya wants to select a queue so that he can leave the supermarket as soon as possible. Help him write a program that displays the minimum number of seconds after which Vasya can get to one of the cashiers.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=100 $ ) — the number of cashes in the shop. The second line contains $ n $ space-separated integers: $ k_{1},k_{2},...,k_{n} $ ( $ 1<=k_{i}<=100 $ ), where $ k_{i} $ is the number of people in the queue to the $ i $ -th cashier.\n\nThe $ i $ -th of the next $ n $ lines contains $ k_{i} $ space-separated integers: $ m_{i,1},m_{i,2},...,m_{i,ki} $ ( $ 1<=m_{i,j}<=100 $ ) — the number of products the $ j $ -th person in the queue for the $ i $ -th cash has.",
    "outputFormat": "Print a single integer — the minimum number of seconds Vasya needs to get to the cashier.",
    "samples": [
        [
            "1\n1\n1\n",
            "20\n"
        ],
        [
            "4\n1 4 3 2\n100\n1 2 2 3\n1 9 1\n7 8\n",
            "100\n"
        ]
    ],
    "hint": "In the second test sample, if Vasya goes to the first queue, he gets to the cashier in $ 100·5+15=515 $ seconds. But if he chooses the second queue, he will need $ 1·5+2·5+2·5+3·5+4·15=100 $ seconds. He will need $ 1·5+9·5+1·5+3·15=100 $ seconds for the third one and $ 7·5+8·5+2·15=105 $ seconds for the fourth one. Thus, Vasya gets to the cashier quicker if he chooses the second or the third queue.",
    "translation": "超市出口有 $n$ 个收银员，第 $i$ 个收银员的队列中一共排了 $k_i$ 个顾客，其中第 $i$ 个收银员的第 $j$ 个顾客购买了 $m_{i,j}$ 件商品。结账流程是：\n\n- 每件商品需要花 $5$ 秒钟扫描；\n- 扫描完某位顾客的全部商品后，需要花 $15$ 秒钟来付款和找零。\n\n现在可以任选一个队列去排队，输出最少需要多少秒才能到达收银员面前。"
}