{
    "description": "Valera is a little boy. Yesterday he got a huge Math hometask at school, so Valera didn't have enough time to properly learn the English alphabet for his English lesson. Unfortunately, the English teacher decided to have a test on alphabet today. At the test Valera got a square piece of squared paper. The length of the side equals $ n $ squares ( $ n $ is an odd number) and each unit square contains some small letter of the English alphabet.\n\nValera needs to know if the letters written on the square piece of paper form letter \"X\". Valera's teacher thinks that the letters on the piece of paper form an \"X\", if:\n\n- on both diagonals of the square paper all letters are the same;\n- all other squares of the paper (they are not on the diagonals) contain the same letter that is different from the letters on the diagonals.\n\nHelp Valera, write the program that completes the described task for him.",
    "inputFormat": "The first line contains integer $ n $ ( $ 3<=n&lt;300 $ ; $ n $ is odd). Each of the next $ n $ lines contains $ n $ small English letters — the description of Valera's paper.",
    "outputFormat": "Print string \"YES\", if the letters on the paper form letter \"X\". Otherwise, print string \"NO\". Print the strings without quotes.",
    "samples": [
        [
            "5\nxooox\noxoxo\nsoxoo\noxoxo\nxooox\n",
            "NO\n"
        ],
        [
            "3\nwsw\nsws\nwsw\n",
            "YES\n"
        ],
        [
            "3\nxpx\npxp\nxpe\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "Valera是一个小男孩。昨天，他的数学作业很多，因此他没有时间去温习英语课的单词表。不幸的是，英语老师决定在今天的课上进行一场单词小测。测试中，发下的试卷是正方形的，由许多小格子组成，共有n行n列（n是奇数），每个单位的小格子都包含一个英文字母。\n\nValera需要知道试卷上的小字母是否会组成一个大写字母“X”的形状。Valera的老师认为试卷上的字母会构成“X”，当且仅当：\n\n1、所有对角线上的格子所包含的字母必须一致。\n\n2、其他所有格子（不在对角线上的），也必须由相同的字母所组成且这个字母不能与对角线上的字母相同。\n\n请你按照题面描述，编程帮Valera解决这个问题。\n\n\n输入格式：\n\n第1行包含一个整数n（3 <= n < 300，n是奇数）\n\n第2~n+1行，每行包含n个英文字母，如题面描述。\n\n输出格式\n\n如果试卷上的字母能构成“X”，输出字符串“YES”；如果不能，则输出字符串“NO”。\n\n输出不加双引号。"
}