{
    "description": "Little Petya wanted to give an April Fools Day present to some scientists. After some hesitation he decided to give them the array that he got as a present in Codeforces Round #153 (Div.2). The scientists rejoiced at the gift and decided to put some important facts to this array. Here are the first few of the facts:\n\n- The highest mountain above sea level in the world is Mount Everest. Its peak rises to 8848 m.\n- The largest board game tournament consisted of 958 participants playing chapaev.\n- The largest online maths competition consisted of 12766 participants.\n- The Nile is credited as the longest river in the world. From its farthest stream in Burundi, it extends 6695 km in length.\n- While not in flood, the main stretches of the Amazon river in South America can reach widths of up to 1100 km at its widest points.\n- Angel Falls is the highest waterfall. Its greatest single drop measures 807 m.\n- The Hotel Everest View above Namche, Nepal — the village closest to Everest base camp – is at a record height of 31962 m\n- Uranium is the heaviest of all the naturally occurring elements. Its most common isotope has a nucleus containing 146 neutrons.\n- The coldest permanently inhabited place is the Siberian village of Oymyakon, where the temperature of -68°C was registered in the twentieth century.\n- The longest snake held in captivity is over 25 feet long. Its name is Medusa.\n- Colonel Meow holds the world record for longest fur on a cat — almost 134 centimeters.\n- Sea otters can have up to 10000 hairs per square inch. This is the most dense fur in the animal kingdom.\n- The largest state of USA is Alaska; its area is 663268 square miles\n- Alaska has a longer coastline than all of the other 49 U.S. States put together: it is 154103 miles long.\n- Lake Baikal is the largest freshwater lake in the world. It reaches 1642 meters in depth and contains around one-fifth of the world’s unfrozen fresh water.\n- The most colorful national flag is the one of Turkmenistan, with 106 colors.",
    "inputFormat": "The input will contain a single integer between 1 and 16.",
    "outputFormat": "Output a single integer.",
    "samples": [
        [
            "1\n",
            "1\n"
        ],
        [
            "7\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "输入一个n，输出上面的第n句话是否正确。正确输出1，反之输出0\nTranslated by @chen_zhe "
}