{
    "description": "Valera takes part in the Berland Marathon. The marathon race starts at the stadium that can be represented on the plane as a square whose lower left corner is located at point with coordinates $ (0,0) $ and the length of the side equals $ a $ meters. The sides of the square are parallel to coordinate axes.\n\nAs the length of the marathon race is very long, Valera needs to have extra drink during the race. The coach gives Valera a bottle of drink each $ d $ meters of the path. We know that Valera starts at the point with coordinates $ (0,0) $ and runs counter-clockwise. That is, when Valera covers $ a $ meters, he reaches the point with coordinates $ (a,0) $ . We also know that the length of the marathon race equals $ nd+0.5 $ meters.\n\nHelp Valera's coach determine where he should be located to help Valera. Specifically, determine the coordinates of Valera's positions when he covers $ d,2·d,...,n·d $ meters.",
    "inputFormat": "The first line contains two space-separated real numbers $ a $ and $ d $ $ (1<=a,d<=10^{5}) $ , given with precision till $ 4 $ decimal digits after the decimal point. Number $ a $ denotes the length of the square's side that describes the stadium. Number $ d $ shows that after each $ d $ meters Valera gets an extra drink.\n\nThe second line contains integer $ n $ $ (1<=n<=10^{5}) $ showing that Valera needs an extra drink $ n $ times.",
    "outputFormat": "Print $ n $ lines, each line should contain two real numbers $ x_{i} $ and $ y_{i} $ , separated by a space. Numbers $ x_{i} $ and $ y_{i} $ in the $ i $ -th line mean that Valera is at point with coordinates $ (x_{i},y_{i}) $ after he covers $ i·d $ meters. Your solution will be considered correct if the absolute or relative error doesn't exceed $ 10^{-4} $ .\n\nNote, that this problem have huge amount of output data. Please, do not use cout stream for output in this problem.",
    "samples": [
        [
            "2 5\n2\n",
            "1.0000000000 2.0000000000\n2.0000000000 0.0000000000\n"
        ],
        [
            "4.147 2.8819\n6\n",
            "2.8819000000 0.0000000000\n4.1470000000 1.6168000000\n3.7953000000 4.1470000000\n0.9134000000 4.1470000000\n0.0000000000 2.1785000000\n0.7034000000 0.0000000000\n"
        ]
    ],
    "hint": "",
    "translation": "\r\n\r\n瓦莱拉参加了柏林马拉松比赛。马拉松比赛从体育场开始，体育场可以在平面上表示为一个正方形，其左下角位于坐标（0,0）处，边长等于a米。正方形的边与坐标轴平行。\r\n\r\n由于马拉松比赛的时间很长，瓦莱拉需要在比赛中多喝水。教练每走d米就给瓦莱拉一瓶饮料。我们知道瓦莱拉从坐标（0,0）的点开始逆时针运行。也就是说，当瓦莱拉跑过A米时，他到达坐标（A，0）的点。我们也知道马拉松比赛的长度等于n d* +0.5米。\r\n\r\n帮助瓦莱拉的教练确定他应该在哪里帮助瓦莱拉。具体来说，确定瓦莱拉在d、2 d、…、n d 米时的位置坐标。\r\n\r\n第一行包含两个空格分隔的实数a和d（1<=a，d<=10^5 ）\r\n\r\n精确到小数点后4位。数字a表示描述体育场的广场边长。数字d显示，在每d米后，瓦莱拉得到一个额外的饮料。\r\n\r\n第二行包含整数n（1<=n<=10^5）显示瓦莱拉需要额外喝几杯。\r\n\r\n\r\ntranslate by @JasonZRY\r\n"
}