{
    "description": "Not so long ago as a result of combat operations the main Berland place of interest — the magic clock — was damaged. The cannon's balls made several holes in the clock, that's why the residents are concerned about the repair. The magic clock can be represented as an infinite Cartesian plane, where the origin corresponds to the clock center. The clock was painted two colors as is shown in the picture:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF40A/c1bd1b57bbf2da58f15b524cdd013275d04d74c2.png)The picture shows only the central part of the clock. This coloring naturally extends to infinity.\n\nThe balls can be taken to be points on the plane. Your task is to find the color of the area, damaged by the given ball.\n\nAll the points located on the border of one of the areas have to be considered painted black.",
    "inputFormat": "The first and single line contains two integers $ x $ and $ y $ — the coordinates of the hole made in the clock by the ball. Each of the numbers $ x $ and $ y $ has an absolute value that does not exceed $ 1000 $ .",
    "outputFormat": "Find the required color.\n\nAll the points between which and the origin of coordinates the distance is integral-value are painted black.",
    "samples": [
        [
            "-2 1\n",
            "white\n"
        ],
        [
            "2 1\n",
            "black\n"
        ],
        [
            "4 3\n",
            "black\n"
        ]
    ],
    "hint": "",
    "translation": "### 题面描述\n\n不久前，由于战争，Berland 的主要标志魔力钟损坏了。大炮在钟面上炸出了几个洞。这就是为什么居民要修复这个钟的原因。这个钟可以看做一个无限的 Cartesian 平面。钟被涂上了两种颜色，如图所示：\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF40A/c1bd1b57bbf2da58f15b524cdd013275d04d74c2.png)\n\n这张图只显示了魔力钟的中心部位，颜色一直按照此规律延伸到无穷远处。\n\n炮弹可以看做平面上的点。你的任务就是找到被炮弹损坏区域的颜色。\n\n位于边界上的点必须被认为黑色。\n\n### 输入格式\n\n输入仅一行，包含了两个整数 $x$ 和 $y$——炮弹在钟面上的坐标。每个数字 $x$ 和 $y$ 的绝对值不超过 $1000$。\n\n### 输出格式\n\n找到的颜色。位于边界上的点必须被认为黑色。"
}