{
    "description": "You have $ a $ nuts and lots of boxes. The boxes have a wonderful feature: if you put $ x $ $ (x>=0) $ divisors (the spacial bars that can divide a box) to it, you get a box, divided into $ x+1 $ sections.\n\nYou are minimalist. Therefore, on the one hand, you are against dividing some box into more than $ k $ sections. On the other hand, you are against putting more than $ v $ nuts into some section of the box. What is the minimum number of boxes you have to use if you want to put all the nuts in boxes, and you have $ b $ divisors?\n\nPlease note that you need to minimize the number of used boxes, not sections. You do not have to minimize the number of used divisors.",
    "inputFormat": "The first line contains four space-separated integers $ k $ , $ a $ , $ b $ , $ v $ ( $ 2<=k<=1000 $ ; $ 1<=a,b,v<=1000 $ ) — the maximum number of sections in the box, the number of nuts, the number of divisors and the capacity of each section of the box.",
    "outputFormat": "Print a single integer — the answer to the problem.",
    "samples": [
        [
            "3 10 3 3\n",
            "2\n"
        ],
        [
            "3 10 1 3\n",
            "3\n"
        ],
        [
            "100 100 1 1000\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample you can act like this:\n\n- Put two divisors to the first box. Now the first box has three sections and we can put three nuts into each section. Overall, the first box will have nine nuts.\n- Do not put any divisors into the second box. Thus, the second box has one section for the last nut.\n\nIn the end we've put all the ten nuts into boxes.\n\nThe second sample is different as we have exactly one divisor and we put it to the first box. The next two boxes will have one section each.",
    "translation": "你有任意多个箱子和 $a$ 个坚果，$b$ 个隔板，$x$ 个隔板可以将箱子分成 $x+1$ 个区间，每个盒子不能被分成超过 $k$ 个区间，每个区间最多只能放 $v$ 个坚果。  \n给定 $k,a,b,v$，问装下所有坚果需要多少个箱子。"
}