{
    "description": "The last product of the R2 company in the 2D games' field is a new revolutionary algorithm of searching for the shortest path in a $ 2×n $ maze.\n\nImagine a maze that looks like a $ 2×n $ rectangle, divided into unit squares. Each unit square is either an empty cell or an obstacle. In one unit of time, a person can move from an empty cell of the maze to any side-adjacent empty cell. The shortest path problem is formulated as follows. Given two free maze cells, you need to determine the minimum time required to go from one cell to the other.\n\nUnfortunately, the developed algorithm works well for only one request for finding the shortest path, in practice such requests occur quite often. You, as the chief R2 programmer, are commissioned to optimize the algorithm to find the shortest path. Write a program that will effectively respond to multiple requests to find the shortest path in a $ 2×n $ maze.",
    "inputFormat": "The first line contains two integers, $ n $ and $ m $ $ (1<=n<=2·10^{5}; 1<=m<=2·10^{5}) $ — the width of the maze and the number of queries, correspondingly. Next two lines contain the maze. Each line contains $ n $ characters, each character equals either '.' (empty cell), or 'X' (obstacle).\n\nEach of the next $ m $ lines contains two integers $ v_{i} $ and $ u_{i} $ $ (1<=v_{i},u_{i}<=2n) $ — the description of the $ i $ -th request. Numbers $ v_{i} $ , $ u_{i} $ mean that you need to print the value of the shortest path from the cell of the maze number $ v_{i} $ to the cell number $ u_{i} $ . We assume that the cells of the first line of the maze are numbered from $ 1 $ to $ n $ , from left to right, and the cells of the second line are numbered from $ n+1 $ to $ 2n $ from left to right. It is guaranteed that both given cells are empty.",
    "outputFormat": "Print $ m $ lines. In the $ i $ -th line print the answer to the $ i $ -th request — either the size of the shortest path or -1, if we can't reach the second cell from the first one.",
    "samples": [
        [
            "4 7\n.X..\n...X\n5 1\n1 3\n7 7\n1 4\n6 1\n4 7\n5 7\n",
            "1\n4\n0\n5\n2\n2\n2\n"
        ],
        [
            "10 3\nX...X..X..\n..X...X..X\n11 7\n7 18\n18 10\n",
            "9\n-1\n3\n"
        ]
    ],
    "hint": "",
    "translation": "- 有一个 $2\\times n$ 的迷宫，有一些格子不能走。能走的格子用 `.` 表示，不能走的用 `X` 表示。\n- 第一行的格子编号为 $1\\sim n$，第二行的格子编号为 $n+1\\sim 2n$。\n- 有 $m$ 组询问，每组询问给出两个数 $u,v$，您需要回答：编号为 $u$ 的格子和编号为 $v$ 的格子之间的最短路。保证 $u$ 号格子和 $v$ 号格子是能走的。如果 $u,v$ 两个格子间不可达，输出 `-1`。\n- $1\\le n,m\\le 2\\times 10^5$，$1\\le u,v\\le 2n$。"
}