{
    "description": "The R1 company has recently bought a high rise building in the centre of Moscow for its main office. It's time to decorate the new office, and the first thing to do is to write the company's slogan above the main entrance to the building.\n\nThe slogan of the company consists of $ n $ characters, so the decorators hung a large banner, $ n $ meters wide and $ 1 $ meter high, divided into $ n $ equal squares. The first character of the slogan must be in the first square (the leftmost) of the poster, the second character must be in the second square, and so on.\n\nOf course, the R1 programmers want to write the slogan on the poster themselves. To do this, they have a large (and a very heavy) ladder which was put exactly opposite the $ k $ -th square of the poster. To draw the $ i $ -th character of the slogan on the poster, you need to climb the ladder, standing in front of the $ i $ -th square of the poster. This action (along with climbing up and down the ladder) takes one hour for a painter. The painter is not allowed to draw characters in the adjacent squares when the ladder is in front of the $ i $ -th square because the uncomfortable position of the ladder may make the characters untidy. Besides, the programmers can move the ladder. In one hour, they can move the ladder either a meter to the right or a meter to the left.\n\nDrawing characters and moving the ladder is very tiring, so the programmers want to finish the job in as little time as possible. Develop for them an optimal poster painting plan!",
    "inputFormat": "The first line contains two integers, $ n $ and $ k $ $ (1<=k<=n<=100) $ — the number of characters in the slogan and the initial position of the ladder, correspondingly. The next line contains the slogan as $ n $ characters written without spaces. Each character of the slogan is either a large English letter, or digit, or one of the characters: '.', '!', ',', '?'.",
    "outputFormat": "In $ t $ lines, print the actions the programmers need to make. In the $ i $ -th line print:\n\n- \"LEFT\" (without the quotes), if the $ i $ -th action was \"move the ladder to the left\";\n- \"RIGHT\" (without the quotes), if the $ i $ -th action was \"move the ladder to the right\";\n- \"PRINT $ x $ \" (without the quotes), if the $ i $ -th action was to \"go up the ladder, paint character $ x $ , go down the ladder\".\n\nThe painting time (variable $ t $ ) must be minimum possible. If there are multiple optimal painting plans, you can print any of them.",
    "samples": [
        [
            "2 2\nR1\n",
            "PRINT 1\nLEFT\nPRINT R\n"
        ],
        [
            "2 1\nR1\n",
            "PRINT R\nRIGHT\nPRINT 1\n"
        ],
        [
            "6 4\nGO?GO!\n",
            "RIGHT\nRIGHT\nPRINT !\nLEFT\nPRINT O\nLEFT\nPRINT G\nLEFT\nPRINT ?\nLEFT\nPRINT O\nLEFT\nPRINT G\n"
        ]
    ],
    "hint": "Note that the ladder cannot be shifted by less than one meter. The ladder can only stand in front of some square of the poster. For example, you cannot shift a ladder by half a meter and position it between two squares. Then go up and paint the first character and the second character.",
    "translation": "### 题意简述\n\n某公司要挂一个横幅来写口号。 该公司的口号由n字组成，横幅长n米，宽1米，分割成了n个1* 1的格子（紧挨着排成一行）。口号的第一个字写在第一格，最后一个字写在最后一格，整行格子正好填满。他们有一个梯子，一开始放在第k格上。 要在海报上画标语的第m个字符，你需要爬上梯子，站在海报的第m个正方形前面。 这个动作（连同爬上和爬下梯子）对一个画家来说需要一个小时。 画家只能在正对的格子上绘制。当然梯子可以移动。在一个小时内，他们可以把梯子向右移动一米，或者向左移动一米。 请你规划出耗时最短的画完横幅的方案。\n\n### 输入格式\n输入共两行\n\n第一行：两个整数，n和k，意义如上。（1<=k<=n<=100）\n\n第二行包含没有空格的n字符的口号。 口号的每个字符要么是一个大的英文字母，要么是数字，要么是一个字符：‘。 ‘，’！ ‘，’，‘，’？ ‘。\n\n### 输出格式\n在每一行中，打印工作人员的操作。\n\n如果向左挪梯子，输出“LEFT”。\n\n同理，向右挪梯子输出“RIGHT”。\n\n如果是上梯子，画字符，再下来，就输出“PRINT x”，其中“x”表示那个字符。\n\n所有输出后均需换行，均不输出引号。\n\n绘画时间必须是最小的可能。 如果有多个最佳绘画计划，您可以打印其中任何一个。 \n\n### 说明与提示\n\n梯子不能移动非整数的距离（即不能小于1m），您也不能站在两个正方形中间来试图一次性绘制两个字符。\n\n"
}