{
    "description": "One day, at the \"Russian Code Cup\" event it was decided to play football as an out of competition event. All participants was divided into $ n $ teams and played several matches, two teams could not play against each other more than once.\n\nThe appointed Judge was the most experienced member — Pavel. But since he was the wisest of all, he soon got bored of the game and fell asleep. Waking up, he discovered that the tournament is over and the teams want to know the results of all the matches.\n\nPavel didn't want anyone to discover about him sleeping and not keeping an eye on the results, so he decided to recover the results of all games. To do this, he asked all the teams and learned that the real winner was friendship, that is, each team beat the other teams exactly $ k $ times. Help Pavel come up with chronology of the tournir that meets all the conditions, or otherwise report that there is no such table.",
    "inputFormat": "The first line contains two integers — $ n $ and $ k $ ( $ 1<=n,k<=1000 $ ).",
    "outputFormat": "In the first line print an integer $ m $ — number of the played games. The following $ m $ lines should contain the information about all the matches, one match per line. The $ i $ -th line should contain two integers $ a_{i} $ and $ b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ ; $ a_{i}≠b_{i} $ ). The numbers $ a_{i} $ and $ b_{i} $ mean, that in the $ i $ -th match the team with number $ a_{i} $ won against the team with number $ b_{i} $ . You can assume, that the teams are numbered from $ 1 $ to $ n $ .\n\nIf a tournir that meets the conditions of the problem does not exist, then print -1.",
    "samples": [
        [
            "3 1\n",
            "3\n1 2\n2 3\n3 1\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\r\n\r\n在某一届的“代码杯”中，举办方决定让各个队伍踢踢足球。所有参赛者被分为$n$个队，进行了几场比赛，每两个队踢一场。\r\n\r\n\r\n裁判帕维尔在比赛时睡着了，醒来后，他发现比赛已经结束了，各队都想知道所有比赛的结果。\r\n\r\n帕维尔不想让任何人发现他在睡觉，他迫切知道比赛的结果（因为他是裁判）。因此，他询问了所有的球队，每支球队击败其他球队正好$k$次。帮助帕维尔找出符合条件的所有比赛结果可能性，如果不可能，输出$-1$。\r\n\r\n## 输入格式\r\n\r\n一行，为$n$和$k$。（$1<=n$，$k<=1000$）\r\n\r\n## 输出格式\r\n\r\n第一行，一个整数$m$，代表有$m$种可能性。\r\n\r\n接下来$m$行，分别代表每种可能性的比赛结果。"
}