{
    "description": "During a recent research Berland scientists found out that there were $ n $ cities in Ancient Berland, joined by two-way paths. Any two cities are joined by no more than one path. No path joins a city with itself. According to a well-known tradition, the road network was built so that it would be impossible to choose three cities from each of which one can get to any other one directly. That is, there was no cycle exactly as long as 3. Unfortunately, the road map has not been preserved till nowadays. Now the scientists are interested how much developed a country Ancient Berland was. Help them - find, what maximal number of roads could be in the country. You also have to restore any of the possible road maps.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=100 $ ) — the number of cities in Berland.",
    "outputFormat": "On the first line must be printed number $ m $ — the maximal number of roads in Berland. Then print $ m $ lines containing two numbers each — the numbers of cities that the given road joins. The cities are numbered with integers from $ 1 $ to $ n $ . If there are several variants of solving the problem, print any of them.",
    "samples": [
        [
            "3\n",
            "2\n1 2\n2 3\n"
        ],
        [
            "4\n",
            "4\n1 2\n2 3\n3 4\n4 1\n"
        ]
    ],
    "hint": "",
    "translation": "【题目大意】\n求结点数为n 、任意取三结点均为连通图但不是环的无向图的最大边数m ，并输出任意一种可能。\n\n输入：\n\n一个数n （1<=n<=100）\n\n输出：\n\n第1行1个数m （意义见题目描述）\n\n第2~m +1行输出其中一种可能，其中每行两个数x 、y ，表示结点x 、y 间有一条边。"
}