{
    "description": "The finalists of the \"Russian Code Cup\" competition in 2214 will be the participants who win in one of the elimination rounds.\n\nThe elimination rounds are divided into main and additional. Each of the main elimination rounds consists of $ c $ problems, the winners of the round are the first $ n $ people in the rating list. Each of the additional elimination rounds consists of $ d $ problems. The winner of the additional round is one person. Besides, $ k $ winners of the past finals are invited to the finals without elimination.\n\nAs a result of all elimination rounds at least $ n·m $ people should go to the finals. You need to organize elimination rounds in such a way, that at least $ n·m $ people go to the finals, and the total amount of used problems in all rounds is as small as possible.",
    "inputFormat": "The first line contains two integers $ c $ and $ d $ ( $ 1<=c,d<=100 $ ) — the number of problems in the main and additional rounds, correspondingly. The second line contains two integers $ n $ and $ m $ ( $ 1<=n,m<=100 $ ). Finally, the third line contains an integer $ k $ ( $ 1<=k<=100 $ ) — the number of the pre-chosen winners.",
    "outputFormat": "In the first line, print a single integer — the minimum number of problems the jury needs to prepare.",
    "samples": [
        [
            "1 10\n7 2\n1\n",
            "2\n"
        ],
        [
            "2 2\n2 1\n2\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "\n题目背景\n\n在2214年的的 \"Russian代码杯\" 的决赛选手将是在淘汰赛中的获胜者。\n题目描述\n\n两种形式的选拔赛 淘汰赛有两种形式，我们把他叫正常赛与特殊赛，正常赛中的题目为c道，获胜的n个人可以参加决赛。特殊赛题目为d道，获胜的1个人可参加决赛。此外，有k位大佬拥有报送名额，不用参加淘汰赛。（黑幕）\n\n组委会需要你组织好各轮淘汰赛，比赛用到的题目要最少，但是保证在所有淘汰赛结束后，有n.m位选手进入决赛。\n输入格式\n\n第1行输入c和d（1<=c,d<=100）\n\n第2行输入n和m（1<=n,m<=100）\n\n第3行输入k（1<=k<=100）\n\n（c,d,n,m,k为正整数）\n输出格式\n\n输出最少需要多少道题目\n"
}