{
    "description": "It's holiday. Mashmokh and his boss, Bimokh, are playing a game invented by Mashmokh.\n\nIn this game Mashmokh writes sequence of $ n $ distinct integers on the board. Then Bimokh makes several (possibly zero) moves. On the first move he removes the first and the second integer from from the board, on the second move he removes the first and the second integer of the remaining sequence from the board, and so on. Bimokh stops when the board contains less than two numbers. When Bimokh removes numbers $ x $ and $ y $ from the board, he gets $ gcd(x,y) $ points. At the beginning of the game Bimokh has zero points.\n\nMashmokh wants to win in the game. For this reason he wants his boss to get exactly $ k $ points in total. But the guy doesn't know how choose the initial sequence in the right way.\n\nPlease, help him. Find $ n $ distinct integers $ a_{1},a_{2},...,a_{n} $ such that his boss will score exactly $ k $ points. Also Mashmokh can't memorize too huge numbers. Therefore each of these integers must be at most $ 10^{9} $ .",
    "inputFormat": "The first line of input contains two space-separated integers $ n,k (1<=n<=10^{5}; 0<=k<=10^{8}) $ .",
    "outputFormat": "If such sequence doesn't exist output -1 otherwise output $ n $ distinct space-separated integers $ a_{1},a_{2},...,a_{n} (1<=a_{i}<=10^{9}) $ .",
    "samples": [
        [
            "5 2\n",
            "1 2 3 4 5\n"
        ],
        [
            "5 3",
            "2 4 3 7 1"
        ],
        [
            "7 2\n",
            "-1\n"
        ]
    ],
    "hint": " $ gcd(x,y) $ is greatest common divisor of $ x $ and $ y $ .",
    "translation": "今天放假！Mashmokh 和他的老板 Bimokh 正在玩由 Mashmokh 发明的一个游戏。\n\n在这个游戏中，Mashmokh 写下一个包含 $n$ 个不同整数的序列。然后 Bimokh 按照下面的方法操作了几次（有可能是零次）：\n\n- 第一步，他从序列上删除第一个和第二个整数。\n- 第二步，他从序列上删除剩余序列的第一个和第二个整数，依此类推。\n\n当序列里包含的数字少于两个时，他才会停止。当 Bimokh 从板上删除数字 $x$ 和 $y$ 时，他会得到 $\\gcd(x,y)$ 分。每场游戏的比分都是从 $0$ 开始的。\n\nMashmokh 想要在游戏中获胜。出于这个原因，他希望 Bimokh 在操作完之后总得分为 $k$ 分。但 Mashmokh 不知道怎么选择初始序列才能达到这个目的。\n\n请你替他求出 $n$个不同的整数 $a_{1},a_{2},...,a_{n}$，使 Bimokh 在操作完之后的总得分为 $k$。此外，Mashmokh 不能记住太多的数字。因此，这些数最大不超过 $10 ^{9}$。"
}