{
    "description": "Not so long ago company R2 bought company R1 and consequently, all its developments in the field of multicore processors. Now the R2 laboratory is testing one of the R1 processors.\n\nThe testing goes in $ n $ steps, at each step the processor gets some instructions, and then its temperature is measured. The head engineer in R2 is keeping a report record on the work of the processor: he writes down the minimum and the maximum measured temperature in his notebook. His assistant had to write down all temperatures into his notebook, but (for unknown reasons) he recorded only $ m $ .\n\nThe next day, the engineer's assistant filed in a report with all the $ m $ temperatures. However, the chief engineer doubts that the assistant wrote down everything correctly (naturally, the chief engineer doesn't doubt his notes). So he asked you to help him. Given numbers $ n $ , $ m $ , $ min $ , $ max $ and the list of $ m $ temperatures determine whether you can upgrade the set of $ m $ temperatures to the set of $ n $ temperatures (that is add $ n-m $ temperatures), so that the minimum temperature was $ min $ and the maximum one was $ max $ .",
    "inputFormat": "The first line contains four integers $ n,m,min,max $ $ (1<=m&lt;n<=100; 1<=min&lt;max<=100) $ . The second line contains $ m $ space-separated integers $ t_{i} $ $ (1<=t_{i}<=100) $ — the temperatures reported by the assistant.\n\nNote, that the reported temperatures, and the temperatures you want to add can contain equal temperatures.",
    "outputFormat": "If the data is consistent, print 'Correct' (without the quotes). Otherwise, print 'Incorrect' (without the quotes).",
    "samples": [
        [
            "2 1 1 2\n1\n",
            "Correct\n"
        ],
        [
            "3 1 1 3\n2\n",
            "Correct\n"
        ],
        [
            "2 1 1 3\n2\n",
            "Incorrect\n"
        ]
    ],
    "hint": "In the first test sample one of the possible initial configurations of temperatures is \\[1, 2\\].\n\nIn the second test sample one of the possible initial configurations of temperatures is \\[2, 1, 3\\].\n\nIn the third test sample it is impossible to add one temperature to obtain the minimum equal to 1 and the maximum equal to 3.",
    "translation": "原来有 $n$ 个数，给你其中的 $m$ 个数 $t_{1 \\dots m}$，求这 $n$ 个数是否可能最小值 为 $min$，最大值为 $max$。\n\n$1\\le n,m,min,max,t_i\\le 100$"
}