{
    "description": "Recently, a start up by two students of a state university of city F gained incredible popularity. Now it's time to start a new company. But what do we call it?\n\nThe market analysts came up with a very smart plan: the name of the company should be identical to its reflection in a mirror! In other words, if we write out the name of the company on a piece of paper in a line (horizontally, from left to right) with large English letters, then put this piece of paper in front of the mirror, then the reflection of the name in the mirror should perfectly match the line written on the piece of paper.\n\nThere are many suggestions for the company name, so coming up to the mirror with a piece of paper for each name wouldn't be sensible. The founders of the company decided to automatize this process. They asked you to write a program that can, given a word, determine whether the word is a 'mirror' word or not.",
    "inputFormat": "The first line contains a non-empty name that needs to be checked. The name contains at most $ 10^{5} $ large English letters. The name will be written with the next sans serif font:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF420A/accf07de9beb8006c8cbefb59ee21f43a0cca810.png)",
    "outputFormat": "Print 'YES' (without the quotes), if the given name matches its mirror reflection. Otherwise, print 'NO' (without the quotes).",
    "samples": [
        [
            "AHA\n",
            "YES\n"
        ],
        [
            "Z\n",
            "NO\n"
        ],
        [
            "XO\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "输入一个由大写字母组成的字符串，判断它反过来后是不是等于原样，是的话输出“YES”，否则“NO”（不带引号）\n\n（比如H、AWA、TATATATAT可以，Z、FAF、IDONTLIKECPLUSPLUS不可以）"
}