{
    "description": "Sereja has two sequences $ a_{1},a_{2},...,a_{n} $ and $ b_{1},b_{2},...,b_{m} $ , consisting of integers. One day Sereja got bored and he decided two play with them. The rules of the game was very simple. Sereja makes several moves, in one move he can perform one of the following actions:\n\n1. Choose several (at least one) first elements of sequence $ a $ (non-empty prefix of $ a $ ), choose several (at least one) first elements of sequence $ b $ (non-empty prefix of $ b $ ); the element of sequence $ a $ with the maximum index among the chosen ones must be equal to the element of sequence $ b $ with the maximum index among the chosen ones; remove the chosen elements from the sequences.\n2. Remove all elements of both sequences.\n\nThe first action is worth $ e $ energy units and adds one dollar to Sereja's electronic account. The second action is worth the number of energy units equal to the number of elements Sereja removed from the sequences before performing this action. After Sereja performed the second action, he gets all the money that he earned on his electronic account during the game.\n\nInitially Sereja has $ s $ energy units and no money on his account. What maximum number of money can Sereja get? Note, the amount of Seraja's energy mustn't be negative at any time moment.",
    "inputFormat": "The first line contains integers $ n $ , $ m $ , $ s $ , $ e $ $ (1<=n,m<=10^{5}; 1<=s<=3·10^{5}; 10^{3}<=e<=10^{4}) $ . The second line contains $ n $ integers $ a_{1} $ , $ a_{2} $ , $ ... $ , $ a_{n} $ $ (1<=a_{i}<=10^{5}) $ . The third line contains $ m $ integers $ b_{1} $ , $ b_{2} $ , $ ... $ , $ b_{m} $ $ (1<=b_{i}<=10^{5}) $ .",
    "outputFormat": "Print a single integer — maximum number of money in dollars that Sereja can get.",
    "samples": [
        [
            "5 5 100000 1000\n1 2 3 4 5\n3 2 4 5 1\n",
            "3\n"
        ],
        [
            "3 4 3006 1000\n1 2 3\n1 2 4 3\n",
            "2\n"
        ]
    ],
    "hint": "",
    "translation": "某个虚拟游戏，给定长度为 $N(1\\leq N\\le 10^5)$ 的序列 $A$ 和长度为 $M$ 的序列 $B$，其中 $1\\leq A_i,B_i \\le\n10^5$。\n\n每次消耗能量 $E(10^3\\leq E\\leq 10^4)$ 可以分别从两个序列中移除若干前缀项，要求各自移除的两个前缀中的最后一项的值相等，并且获得一个虚拟货币。把累计的虚拟货币兑现成现实财富，需要花费 **移除元素个数等值的能量**。\n\n问在给定能量 $S(1\\leq S\\le 3\\times 10^5)$，最多能获得多少财富。"
}