{
    "description": "Your city has $ n $ junctions. There are $ m $ one-way roads between the junctions. As a mayor of the city, you have to ensure the security of all the junctions.\n\nTo ensure the security, you have to build some police checkposts. Checkposts can only be built in a junction. A checkpost at junction $ i $ can protect junction $ j $ if either $ i=j $ or the police patrol car can go to $ j $ from $ i $ and then come back to $ i $ .\n\nBuilding checkposts costs some money. As some areas of the city are more expensive than others, building checkpost at some junctions might cost more money than other junctions.\n\nYou have to determine the minimum possible money needed to ensure the security of all the junctions. Also you have to find the number of ways to ensure the security in minimum price and in addition in minimum number of checkposts. Two ways are different if any of the junctions contains a checkpost in one of them and do not contain in the other.",
    "inputFormat": "In the first line, you will be given an integer $ n $ , number of junctions $ (1<=n<=10^{5}) $ . In the next line, $ n $ space-separated integers will be given. The $ i^{th} $ integer is the cost of building checkpost at the $ i^{th} $ junction (costs will be non-negative and will not exceed $ 10^{9} $ ).\n\nThe next line will contain an integer $ m (0<=m<=3·10^{5}) $ . And each of the next $ m $ lines contains two integers $ u_{i} $ and $ v_{i} (1<=u_{i},v_{i}<=n; u≠v) $ . A pair $ u_{i},v_{i} $ means, that there is a one-way road which goes from $ u_{i} $ to $ v_{i} $ . There will not be more than one road between two nodes in the same direction.",
    "outputFormat": "Print two integers separated by spaces. The first one is the minimum possible money needed to ensure the security of all the junctions. And the second one is the number of ways you can ensure the security modulo $ 1000000007 $ $ (10^{9}+7) $ .",
    "samples": [
        [
            "3\n1 2 3\n3\n1 2\n2 3\n3 2\n",
            "3 1\n"
        ],
        [
            "5\n2 8 0 6 0\n6\n1 4\n1 3\n2 4\n3 4\n4 5\n5 1\n",
            "8 2\n"
        ],
        [
            "10\n1 3 2 2 1 3 1 4 10 10\n12\n1 2\n2 3\n3 1\n3 4\n4 5\n5 6\n5 7\n6 4\n7 3\n8 9\n9 10\n10 9\n",
            "15 6\n"
        ],
        [
            "2\n7 91\n2\n1 2\n2 1\n",
            "7 1\n"
        ]
    ],
    "hint": "",
    "translation": "题目描述\n你的城市有N个路口。路口之间有一条单程道路。作为城市的市长，你必须确保所有路口的安全。\n\n为了确保安全，你必须建造一些警察检查站。一个检查站只能建在一个路口。 如果有一个检查站在i路口，保护j的条件是：i==j或者警察巡逻车可以从i走到j，并且能回到i。\n\n建造检查站要花一些钱。 由于城市的某些地区比其他地区更昂贵，在某些路口修建检查站可能比其他路口花费更多的钱。\n\n你必须确定以确保所有路口的安全所需的最低资金。\n\n此外，你必须找到以的最低价格和在最小数量的检查站确保安全的方案数。\n\n如果其中任何一个路口包含其中一个检查点而不包含在另一个路口中，则两种方式是不同的。\n\n答案模 1000000007(10^9+7)1000000007(10 \n9\n +7)\n输入输出格式\n输入格式：\nn (路口数)\n\nn个数 (每个路口建检查站的花费)\n\nm (以下m行是m条有向道路)\n\nx y (一条从x到y的有向道路)\n\n输出格式：\n一行用空格分割的两个数：\n\n最小花费 方案数"
}