{
    "description": "This time our child has a simple polygon. He has to find the number of ways to split the polygon into non-degenerate triangles, each way must satisfy the following requirements:\n\n- each vertex of each triangle is one of the polygon vertex;\n- each side of the polygon must be the side of exactly one triangle;\n- the area of intersection of every two triangles equals to zero, and the sum of all areas of triangles equals to the area of the polygon;\n- each triangle must be completely inside the polygon;\n- each side of each triangle must contain exactly two vertices of the polygon.\n\nThe picture below depicts an example of a correct splitting.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF437E/a8e2701cc66365983a77c546adbf6d2315ebb4eb.png)Please, help the child. Calculate the described number of ways modulo $ 1000000007 $ $ (10^{9}+7) $ for him.",
    "inputFormat": "The first line contains one integer $ n $ $ (3<=n<=200) $ — the number of vertices of the polygon. Then follow $ n $ lines, each line containing two integers. The $ i $ -th line contains $ x_{i},y_{i} $ $ (|x_{i}|,|y_{i}|<=10^{7}) $ — the $ i $ -th vertex of the polygon in clockwise or counterclockwise order.\n\nIt's guaranteed that the polygon is simple.",
    "outputFormat": "Output the number of ways modulo $ 1000000007 $ $ (10^{9}+7) $ .",
    "samples": [
        [
            "4\n0 0\n0 1\n1 1\n1 0\n",
            "2\n"
        ],
        [
            "4\n0 0\n1 0\n0 1\n-1 0\n",
            "1\n"
        ],
        [
            "5\n0 0\n1 0\n1 1\n0 1\n-2 -1\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample, there are two possible splittings:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF437E/02e2009a70acb17a1ce2cf1ec7df448a4afdd92f.png)In the second sample, there are only one possible splitting:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF437E/2a38e13bdc3c393812a8729aaf5a7d6b365647bf.png)",
    "translation": "给出$n$个点，求这个多边形的三角剖分的方案数\n\nmod 1e9+7"
}