{
    "description": "In this problem you will need to deal with an $ n×m $ grid graph. The graph's vertices are the nodes of the $ n×m $ grid. The graph's edges are all the sides and diagonals of the grid's unit squares.\n\nThe figure below shows a $ 3×5 $ graph. The black lines are the graph's edges, the colored circles are the graph's vertices. The vertices of the graph are painted on the picture for a reason: the coloring is a correct vertex coloring of the $ 3×5 $ graph into four colors. A graph coloring is correct if and only if each vertex is painted and no two vertices connected by an edge are painted the same color.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF435E/3bf484c3ac261bc390a50b90927cfdf12af83fc1.png)You are given the size of the grid graph $ n×m $ and the colors of some of its vertices. Find any way how to paint the unpainted vertices of the graph in 4 colors to make the final coloring a correct vertex graph coloring. If there is no such correct vertex coloring, say that the answer doesn't exist.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ $ (2<=n,m<=1000) $ . Each of the next $ n $ lines consists of $ m $ characters — the given graph. Each character is either «0», «1», «2», «3», «4». Character «0» means that the corresponding vertex is unpainted, otherwise the character means the color of the vertex.\n\nAssume that all the available colors are numbered from $ 1 $ to $ 4 $ .",
    "outputFormat": "If there is no way to get correct vertex coloring of the graph, print 0 in a single line. Otherwise print the colored $ n×m $ graph. Print the graph in the same format as in the input.\n\nIf multiple answers exist, print any of them.",
    "samples": [
        [
            "3 5\n10101\n00020\n01000\n",
            "13131\n42424\n31313\n"
        ],
        [
            "2 2\n00\n00\n",
            "12\n34\n"
        ],
        [
            "2 2\n11\n00\n",
            "0\n"
        ]
    ],
    "hint": "The answer to the first sample is shown on the picture (1 — green color, 2 — blue, 3 — dark blue, 4 — pink).\n\nIn the second sample there exists 4! answers, each of them is considered correct.\n\nIn the third sample two vertices with equal colors are connected. So the correct vertex coloring couldn't be obtained.",
    "translation": "给定大小为 $n \\times m$ 的网格图和其中一些顶点的颜色。找到一种方法，用 $4$ 种颜色来绘制图形中未绘制的顶点，以使由一条边连接的两个顶点没有涂上相同的颜色。如果没有正确的着色方法，就说答案不存在，输出 `0`。\n\nby [saixingzhe](https://www.luogu.com.cn/user/652816)。"
}