{
    "description": "Once upon a time a child got a test consisting of multiple-choice questions as homework. A multiple-choice question consists of four choices: A, B, C and D. Each choice has a description, and the child should find out the only one that is correct.\n\nFortunately the child knows how to solve such complicated test. The child will follow the algorithm:\n\n- If there is some choice whose description at least twice shorter than all other descriptions, or at least twice longer than all other descriptions, then the child thinks the choice is great.\n- If there is exactly one great choice then the child chooses it. Otherwise the child chooses C (the child think it is the luckiest choice).\n\nYou are given a multiple-choice questions, can you predict child's choose?",
    "inputFormat": "The first line starts with \"A.\" (without quotes), then followed the description of choice A. The next three lines contains the descriptions of the other choices in the same format. They are given in order: B, C, D. Please note, that the description goes after prefix \"X.\", so the prefix mustn't be counted in description's length.\n\nEach description is non-empty and consists of at most $ 100 $ characters. Each character can be either uppercase English letter or lowercase English letter, or \"\\_\".",
    "outputFormat": "Print a single line with the child's choice: \"A\", \"B\", \"C\" or \"D\" (without quotes).",
    "samples": [
        [
            "A.VFleaKing_is_the_author_of_this_problem\nB.Picks_is_the_author_of_this_problem\nC.Picking_is_the_author_of_this_problem\nD.Ftiasch_is_cute\n",
            "D\n"
        ],
        [
            "A.ab\nB.abcde\nC.ab\nD.abc\n",
            "C\n"
        ],
        [
            "A.c\nB.cc\nC.c\nD.c\n",
            "B\n"
        ]
    ],
    "hint": "In the first sample, the first choice has length 39, the second one has length 35, the third one has length 37, and the last one has length 15. The choice D (length 15) is twice shorter than all other choices', so it is great choice. There is no other great choices so the child will choose D.\n\nIn the second sample, no choice is great, so the child will choose the luckiest choice C.\n\nIn the third sample, the choice B (length 2) is twice longer than all other choices', so it is great choice. There is no other great choices so the child will choose B.",
    "translation": "有个孩子在做选择题。每道选择题有4个选项，每个选项由它的序号（\"A.\",\"B.\",\"C.\",\"D.\"中的一个）和它的描述（一个字符串）组成。孩子需要选出唯一正确的选项。\n\n孩子会遵循如下算法：\n+ 如果某个选项的**描述**的长度是其他选项的描述的长度的两倍及以上，或其他选项的描述的长度都是这个选项的两倍及以上，那么孩子会认为这个选项是优秀的。\n+ 如果有且仅有一个优秀的选项，那么孩子会选择它。否则孩子会选择C（因为C是幸运的选项）。\n\n给你一道选择题，请预测孩子的选择。"
}