{
    "description": "You have an $ n×m $ rectangle table, its cells are not initially painted. Your task is to paint all cells of the table. The resulting picture should be a tiling of the table with squares. More formally:\n\n- each cell must be painted some color (the colors are marked by uppercase Latin letters);\n- we will assume that two cells of the table are connected if they are of the same color and share a side; each connected region of the table must form a square.\n\nGiven $ n $ and $ m $ , find lexicographically minimum coloring of the table that meets the described properties.",
    "inputFormat": "The first line contains two integers, $ n $ and $ m $ $ (1<=n,m<=100) $ .",
    "outputFormat": "Print lexicographically minimum coloring of the table that meets the described conditions.\n\nOne coloring (let's call it X) is considered lexicographically less than the other one (let's call it Y), if:\n\n- consider all the table cells from left to right and from top to bottom (first, the first cell in the first row, then the second cell in the first row and so on);\n- let's find in this order the first cell that has distinct colors in two colorings;\n- the letter that marks the color of the cell in X, goes alphabetically before the letter that marks the color of the cell in Y.",
    "samples": [
        [
            "1 3\n",
            "ABA\n"
        ],
        [
            "2 2\n",
            "AA\nAA\n"
        ],
        [
            "3 4\n",
            "AAAB\nAAAC\nAAAB\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个$n\\times m$的矩阵，要求每个格子填充一个大写字母，相同大写字母组成的连通块必须是一个正方形，求字典序最小的填充方法。\r\n\r\n比较字典序（设2个矩阵为$X$、$Y$）：\r\n\r\n令字符串$S_X=X_{1,1}X_{1,2}...X_{2,1}X_{2,2}...X_{n,m}$，$S_Y=Y_{1,1}Y_{1,2}...aY_{2,1}Y_{2,2}...Y_{n,m}$（其中$X_{i,j}$表示$X$矩阵第$i$行第$j$列的大写字母,$Y_{i,j}$同理）。\r\n\r\n两个矩阵的字典序大小就是字符串$S_X$和字符串$S_Y$的字典序大小。\r\n\r\n给定$n,m$，输出字典序最小的矩阵"
}