{
    "description": "Everyone who has played Cut the Rope knows full well how the gameplay is organized. All levels in the game are divided into boxes. Initially only one box with some levels is available. Player should complete levels to earn stars, collecting stars opens new box with levels.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF436E/17b1896a1f51431c95d9715d9bee7717c44e7cec.png)Imagine that you are playing Cut the Rope for the first time. Currently you have only the levels of the first box (by the way, it is called \"Cardboard Box\"). Each level is characterized by two integers: $ a_{i} $ — how long it takes to complete the level for one star, $ b_{i} $ — how long it takes to complete the level for two stars $ (a_{i}&lt;b_{i}) $ .\n\nYou want to open the next box as quickly as possible. So, you need to earn at least $ w $ stars. How do make it happen? Note that the level can be passed only once: either for one star or for two. You do not necessarily need to pass all the levels.",
    "inputFormat": "The first line contains two integers $ n $ and $ w $ $ (1<=n<=3·10^{5}; 1<=w<=2n) $ — the number of levels in the first box and the number of stars you need to open another box. Each of the following $ n $ lines contains two integers $ a_{i} $ and $ b_{i} $ $ (1<=a_{i}&lt;b_{i}<=10^{9}) $ — the attributes of the $ i $ -th level.",
    "outputFormat": "In the first line print integer $ t $ — the minimum time you need to open the next box.\n\nIn the next line, print $ n $ digits without spaces — the description of the optimal scenario:\n\n- if you need to pass the $ i $ -th level for one star, the $ i $ -th digit should equal 1;\n- if you need to pass the $ i $ -th level for two stars, the $ i $ -th digit should equal 2;\n- if you do not need to pass the $ i $ -th level at all, the $ i $ -th digit should equal 0.",
    "samples": [
        [
            "2 3\n1 2\n1 2\n",
            "3\n12\n"
        ],
        [
            "5 3\n10 20\n5 10\n10 20\n6 9\n25 30\n",
            "14\n01020\n"
        ]
    ],
    "hint": "In the first test sample, answer 21 is also assumed correct.",
    "translation": "$n$ 个关卡，对每个关卡，你可以花 $a_i$ 代价得到一颗星，也可以花 $b_i$ 代价得到两颗星，也可以不玩。问获得 $w$ 颗星最少需要多少时间。"
}