{
    "description": "Devu is a dumb guy, his learning curve is very slow. You are supposed to teach him $ n $ subjects, the $ i^{th} $ subject has $ c_{i} $ chapters. When you teach him, you are supposed to teach all the chapters of a subject continuously.\n\nLet us say that his initial per chapter learning power of a subject is $ x $ hours. In other words he can learn a chapter of a particular subject in $ x $ hours.\n\nWell Devu is not complete dumb, there is a good thing about him too. If you teach him a subject, then time required to teach any chapter of the next subject will require exactly 1 hour less than previously required (see the examples to understand it more clearly). Note that his per chapter learning power can not be less than 1 hour.\n\nYou can teach him the $ n $ subjects in any possible order. Find out minimum amount of time (in hours) Devu will take to understand all the subjects and you will be free to do some enjoying task rather than teaching a dumb guy.\n\nPlease be careful that answer might not fit in 32 bit data type.",
    "inputFormat": "The first line will contain two space separated integers $ n $ , $ x $ ( $ 1<=n,x<=10^{5} $ ). The next line will contain $ n $ space separated integers: $ c_{1},c_{2},...,c_{n} $ ( $ 1<=c_{i}<=10^{5} $ ).",
    "outputFormat": "Output a single integer representing the answer to the problem.",
    "samples": [
        [
            "2 3\n4 1\n",
            "11\n"
        ],
        [
            "4 2\n5 1 2 1\n",
            "10\n"
        ],
        [
            "3 3\n1 1 1\n",
            "6\n"
        ]
    ],
    "hint": "Look at the first example. Consider the order of subjects: $ 1 $ , $ 2 $ . When you teach Devu the first subject, it will take him $ 3 $ hours per chapter, so it will take $ 12 $ hours to teach first subject. After teaching first subject, his per chapter learning time will be $ 2 $ hours. Now teaching him second subject will take $ 2×1=2 $ hours. Hence you will need to spend $ 12+2=14 $ hours.\n\nConsider the order of subjects: $ 2 $ , $ 1 $ . When you teach Devu the second subject, then it will take him $ 3 $ hours per chapter, so it will take $ 3×1=3 $ hours to teach the second subject. After teaching the second subject, his per chapter learning time will be $ 2 $ hours. Now teaching him the first subject will take $ 2×4=8 $ hours. Hence you will need to spend $ 11 $ hours.\n\nSo overall, minimum of both the cases is $ 11 $ hours.\n\nLook at the third example. The order in this example doesn't matter. When you teach Devu the first subject, it will take him $ 3 $ hours per chapter. When you teach Devu the second subject, it will take him $ 2 $ hours per chapter. When you teach Devu the third subject, it will take him $ 1 $ hours per chapter. In total it takes $ 6 $ hours.",
    "translation": "你要教 Devu 学习 $n$ 个章节。第 $i$ 个章节有 $c_{i}$ 节课。当你教了某个章节的其中一节课，你应该教完这个学科的所有章节。Devu 对每节课的初始学习时间为 $X$ 小时。\n\n你每教完他一个章节，那么教下一个章节的任何一节课所需的时间将比以前所需的时间少 $1$ 个小时。（请参阅示例以更清楚地理解它）。他每章的学习时间不能低于 $1$ 小时。\n\n你可以随意地安排教每个章节的顺序。找出 Devu 理解所有科目所需的最短时间。"
}