{
    "description": "Vasya decided to write an anonymous letter cutting the letters out of a newspaper heading. He knows heading $ s_{1} $ and text $ s_{2} $ that he wants to send. Vasya can use every single heading letter no more than once. Vasya doesn't have to cut the spaces out of the heading — he just leaves some blank space to mark them. Help him; find out if he will manage to compose the needed text.",
    "inputFormat": "The first line contains a newspaper heading $ s_{1} $ . The second line contains the letter text $ s_{2} $ . $ s_{1} $ и $ s_{2} $ are non-empty lines consisting of spaces, uppercase and lowercase Latin letters, whose lengths do not exceed 200 symbols. The uppercase and lowercase letters should be differentiated. Vasya does not cut spaces out of the heading.",
    "outputFormat": "If Vasya can write the given anonymous letter, print YES, otherwise print NO",
    "samples": [
        [
            "Instead of dogging Your footsteps it disappears but you dont notice anything\nwhere is your dog\n",
            "NO\n"
        ],
        [
            "Instead of dogging Your footsteps it disappears but you dont notice anything\nYour dog is upstears\n",
            "YES\n"
        ],
        [
            "Instead of dogging your footsteps it disappears but you dont notice anything\nYour dog is upstears\n",
            "NO\n"
        ],
        [
            "abcdefg hijk\nk j i h g f e d c b a\n",
            "YES\n"
        ]
    ],
    "hint": "",
    "translation": "### 题面描述\n\nVasya 决定利用报纸上的一段文字写一封匿名信。他可以从报纸上剪下一段文字（或字母），把他们粘贴到匿名信上去。已经剪下的文字不可重复使用。当然，匿名信中的空格不需要剪——他只要在空格处作出标记即可。现在，他知道报纸上的文字 $s1$ 和他即将写下的匿名信的内容 $s2$，请你帮他看看，他能否完成匿名信的书写。\n\n### 输入格式\n\n两行，分别是 $s1$ 和 $s2$（无空行），长度不超过 $200$，英文字母区分大小写，信中空格不作处理。\n\n### 输出格式\n\n写的出来就输出`YES`，否则输出`NO`。"
}