{
    "description": "Ryouko is an extremely forgetful girl, she could even forget something that has just happened. So in order to remember, she takes a notebook with her, called Ryouko's Memory Note. She writes what she sees and what she hears on the notebook, and the notebook became her memory.\n\nThough Ryouko is forgetful, she is also born with superb analyzing abilities. However, analyzing depends greatly on gathered information, in other words, memory. So she has to shuffle through her notebook whenever she needs to analyze, which is tough work.\n\nRyouko's notebook consists of $ n $ pages, numbered from 1 to $ n $ . To make life (and this problem) easier, we consider that to turn from page $ x $ to page $ y $ , $ |x-y| $ pages should be turned. During analyzing, Ryouko needs $ m $ pieces of information, the $ i $ -th piece of information is on page $ a_{i} $ . Information must be read from the notebook in order, so the total number of pages that Ryouko needs to turn is ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF433C/b1558cfe9712df6ce45ac8cd0bb182f42456cdc9.png).\n\nRyouko wants to decrease the number of pages that need to be turned. In order to achieve this, she can merge two pages of her notebook. If Ryouko merges page $ x $ to page $ y $ , she would copy all the information on page $ x $ to $ y (1<=x,y<=n) $ , and consequently, all elements in sequence $ a $ that was $ x $ would become $ y $ . Note that $ x $ can be equal to $ y $ , in which case no changes take place.\n\nPlease tell Ryouko the minimum number of pages that she needs to turn. Note she can apply the described operation at most once before the reading. Note that the answer can exceed 32-bit integers.",
    "inputFormat": "The first line of input contains two integers $ n $ and $ m (1<=n,m<=10^{5}) $ .\n\nThe next line contains $ m $ integers separated by spaces: $ a_{1},a_{2},...,a_{m} $ $ (1<=a_{i}<=n) $ .",
    "outputFormat": "Print a single integer — the minimum number of pages Ryouko needs to turn.",
    "samples": [
        [
            "4 6\n1 2 3 4 3 2\n",
            "3\n"
        ],
        [
            "10 5\n9 4 3 8 8\n",
            "6\n"
        ]
    ],
    "hint": "In the first sample, the optimal solution is to merge page 4 to 3, after merging sequence $ a $ becomes $ {1,2,3,3,3,2} $ , so the number of pages Ryouko needs to turn is $ |1-2|+|2-3|+|3-3|+|3-3|+|3-2|=3 $ .\n\nIn the second sample, optimal solution is achieved by merging page 9 to 4.",
    "translation": "给出2个正整数 $n,m(1\\le n,m \\le 10^5)$ ，接下去给出 $a_1,a_2,\\cdots a_m(1\\le a_i\\le n)$\r\n\r\n你可以把这个序列里所有值为 $a_i$ 的元素改成 $a_j$ $(1\\le i,j\\le m)$ ，注意 $i$ 可以等于 $j$ ，只可以改一次。\r\n\r\n最小化 $\\sum\\limits_{i=1}^{i\\le m-1} |a_i-a_{i+1}|$\r\n\r\n\r\n"
}