{
    "description": "One day two students, Grisha and Diana, found themselves in the university chemistry lab. In the lab the students found $ n $ test tubes with mercury numbered from $ 1 $ to $ n $ and decided to conduct an experiment.\n\nThe experiment consists of $ q $ steps. On each step, one of the following actions occurs:\n\n1. Diana pours all the contents from tube number $ p_{i} $ and then pours there exactly $ x_{i} $ liters of mercury.\n2. Let's consider all the ways to add $ v_{i} $ liters of water into the tubes; for each way let's count the volume of liquid (water and mercury) in the tube with water with maximum amount of liquid; finally let's find the minimum among counted maximums. That is the number the students want to count. At that, the students don't actually pour the mercury. They perform calculations without changing the contents of the tubes.\n\nUnfortunately, the calculations proved to be too complex and the students asked you to help them. Help them conduct the described experiment.",
    "inputFormat": "The first line contains two integers $ n $ and $ q $ ( $ 1<=n,q<=10^{5} $ ) — the number of tubes ans the number of experiment steps. The next line contains $ n $ space-separated integers: $ h_{1},h_{2},...,h_{n} $ ( $ 0<=h_{i}<=10^{9} $ ), where $ h_{i} $ is the volume of mercury in the $ і $ -th tube at the beginning of the experiment.\n\nThe next $ q $ lines contain the game actions in the following format:\n\n- A line of form \" $ 1 $ $ p_{i} $ $ x_{i} $ \" means an action of the first type ( $ 1<=p_{i}<=n; 0<=x_{i}<=10^{9} $ ).\n- A line of form \" $ 2 $ $ v_{i} $ \" means an action of the second type ( $ 1<=v_{i}<=10^{15} $ ).\n\nIt is guaranteed that there is at least one action of the second type. It is guaranteed that all numbers that describe the experiment are integers.",
    "outputFormat": "For each action of the second type print the calculated value. The answer will be considered correct if its relative or absolute error doesn't exceed $ 10^{-4} $ .",
    "samples": [
        [
            "3 3\n1 2 0\n2 2\n1 2 1\n2 3\n",
            "1.50000\n1.66667\n"
        ],
        [
            "4 5\n1 3 0 1\n2 3\n2 1\n1 3 2\n2 3\n2 4\n",
            "1.66667\n1.00000\n2.33333\n2.66667\n"
        ]
    ],
    "hint": "",
    "translation": "有$n$支试管，每支试管装有$h_i\\ ml$的**水银**。\n\n$q$次操作，操作有两种：\n\n- 1 $p$ $x$：倒掉试管$p$的水银修改为$x\\ ml$。\n- 2 $v$：将$v\\ ml$水任意分配至$n$支试管里，最小化有**水**的试管中最大体积，输出这个最小值，误差不超过$10^{-4}$算作正确。。这个操作只是一次假想，不会真的把水倒进试管里。\n\n$n,q\\le 10^5$，$0\\le h_i,x\\le 10^9$，$1\\le v\\le 10^{15}$"
}