{
    "description": "Iahub isn't well prepared on geometry problems, but he heard that this year there will be a lot of geometry problems on the IOI selection camp. Scared, Iahub locked himself in the basement and started thinking of new problems of this kind. One of them is the following.\n\nIahub wants to draw $ n $ distinct points and $ m $ segments on the $ OX $ axis. He can draw each point with either red or blue. The drawing is good if and only if the following requirement is met: for each segment $ [l_{i},r_{i}] $ consider all the red points belong to it ( $ r_{i} $ points), and all the blue points belong to it ( $ b_{i} $ points); each segment $ i $ should satisfy the inequality $ |r_{i}-b_{i}|<=1 $ .\n\nIahub thinks that point $ x $ belongs to segment $ [l,r] $ , if inequality $ l<=x<=r $ holds.\n\nIahub gives to you all coordinates of points and segments. Please, help him to find any good drawing.",
    "inputFormat": "The first line of input contains two integers: $ n $ ( $ 1<=n<=100 $ ) and $ m $ ( $ 1<=m<=100 $ ). The next line contains $ n $ space-separated integers $ x_{1},x_{2},...,x_{n} $ ( $ 0<=x_{i}<=100 $ ) — the coordinates of the points. The following $ m $ lines contain the descriptions of the $ m $ segments. Each line contains two integers $ l_{i} $ and $ r_{i} $ ( $ 0<=l_{i}<=r_{i}<=100 $ ) — the borders of the $ i $ -th segment.\n\nIt's guaranteed that all the points are distinct.",
    "outputFormat": "If there is no good drawing for a given test, output a single integer -1. Otherwise output $ n $ integers, each integer must be 0 or 1. The $ i $ -th number denotes the color of the $ i $ -th point (0 is red, and 1 is blue).\n\nIf there are multiple good drawings you can output any of them.",
    "samples": [
        [
            "3 3\n3 7 14\n1 5\n6 10\n11 15\n",
            "0 0 0"
        ],
        [
            "3 4\n1 2 3\n1 2\n2 3\n5 6\n2 2\n",
            "1 0 1 "
        ]
    ],
    "hint": "",
    "translation": "一条数轴上放了n个点和m条线段，你要把每一个点染成红色或蓝色，使得每一条线段上（包括首尾）红色点的个数和蓝色点的个数相差不超过1。\r\n\r\n输入：第一行n，m，第二行n个数，为点的位置；接下来m行为选段的首尾。输出：如果可以达成目标，输出任意一种方案；否则输出-1。"
}