{
    "description": "Valera is a collector. Once he wanted to expand his collection with exactly one antique item.\n\nValera knows $ n $ sellers of antiques, the $ i $ -th of them auctioned $ k_{i} $ items. Currently the auction price of the $ j $ -th object of the $ i $ -th seller is $ s_{ij} $ . Valera gets on well with each of the $ n $ sellers. He is perfectly sure that if he outbids the current price of one of the items in the auction (in other words, offers the seller the money that is strictly greater than the current price of the item at the auction), the seller of the object will immediately sign a contract with him.\n\nUnfortunately, Valera has only $ v $ units of money. Help him to determine which of the $ n $ sellers he can make a deal with.",
    "inputFormat": "The first line contains two space-separated integers $ n,v $ $ (1<=n<=50; 10^{4}<=v<=10^{6}) $ — the number of sellers and the units of money the Valera has.\n\nThen $ n $ lines follow. The $ i $ -th line first contains integer $ k_{i} $ $ (1<=k_{i}<=50) $ the number of items of the $ i $ -th seller. Then go $ k_{i} $ space-separated integers $ s_{i1},s_{i2},...,s_{iki} $ $ (10^{4}<=s_{ij}<=10^{6}) $ — the current prices of the items of the $ i $ -th seller.",
    "outputFormat": "In the first line, print integer $ p $ — the number of sellers with who Valera can make a deal.\n\nIn the second line print $ p $ space-separated integers $ q_{1},q_{2},...,q_{p} $ $ (1<=q_{i}<=n) $ — the numbers of the sellers with who Valera can make a deal. Print the numbers of the sellers in the increasing order.",
    "samples": [
        [
            "3 50000\n1 40000\n2 20000 60000\n3 10000 70000 190000\n",
            "3\n1 2 3\n"
        ],
        [
            "3 50000\n1 50000\n3 100000 120000 110000\n3 120000 110000 120000\n",
            "0\n\n"
        ]
    ],
    "hint": "In the first sample Valera can bargain with each of the sellers. He can outbid the following items: a $ 40000 $ item from the first seller, a $ 20000 $ item from the second seller, and a $ 10000 $ item from the third seller.\n\nIn the second sample Valera can not make a deal with any of the sellers, as the prices of all items in the auction too big for him.",
    "translation": "# 题目大意\n有n个古董卖家，第i个卖家有ki个古董要拍卖。当前知道第i个卖家的第j件古董的拍卖价格为sij，一个人和n个卖家的关系都比较好，他非常确定只要他出价高于第i个卖家的古董之一的当前价格，第i个卖家就会和他达成协议。但不幸的是，当前他仅仅只有v单位的钱了。\n\n问：他当前能和几个卖家达成协议，分别是哪几个(卖家按照标号呈上升序列给出)？\n\n#### --Yiyang2006"
}