{
    "description": "There are $ n $ children in Jzzhu's school. Jzzhu is going to give some candies to them. Let's number all the children from $ 1 $ to $ n $ . The $ i $ -th child wants to get at least $ a_{i} $ candies.\n\nJzzhu asks children to line up. Initially, the $ i $ -th child stands at the $ i $ -th place of the line. Then Jzzhu start distribution of the candies. He follows the algorithm:\n\n1. Give $ m $ candies to the first child of the line.\n2. If this child still haven't got enough candies, then the child goes to the end of the line, else the child go home.\n3. Repeat the first two steps while the line is not empty.\n\nConsider all the children in the order they go home. Jzzhu wants to know, which child will be the last in this order?",
    "inputFormat": "The first line contains two integers $ n,m $ $ (1<=n<=100; 1<=m<=100) $ . The second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ $ (1<=a_{i}<=100) $ .",
    "outputFormat": "Output a single integer, representing the number of the last child.",
    "samples": [
        [
            "5 2\n1 3 1 4 2\n",
            "4\n"
        ],
        [
            "6 4\n1 1 2 2 3 3\n",
            "6\n"
        ]
    ],
    "hint": "Let's consider the first sample.\n\nFirstly child 1 gets 2 candies and go home. Then child 2 gets 2 candies and go to the end of the line. Currently the line looks like \\[3, 4, 5, 2\\] (indices of the children in order of the line). Then child 3 gets 2 candies and go home, and then child 4 gets 2 candies and goes to the end of the line. Currently the line looks like \\[5, 2, 4\\]. Then child 5 gets 2 candies and goes home. Then child 2 gets two candies and goes home, and finally child 4 gets 2 candies and goes home.\n\nChild 4 is the last one who goes home.",
    "translation": "题目描述  \n`Jzzhu`给学校里的$n$个孩子发糖果，编号从$1$到$n$排成一队，第$i$个孩子想得到至少$a_i$个糖果。  \n`Jzzhu`的操作如下：\n- 给队首的孩子$m$个糖果\n- 如果这个孩子已经得到满足，他就会回家，否则他会到队尾。\n- 在队列非空时重复上述两个操作  \n\n在满足上述条件的情况下，求出最后回家的孩子的编号  \n\n输入格式  \n第一行两个整数$n,m(1\\leq n,m\\leq100)$，第二行$n$个整数$a_1,a_2,\\cdots,a_n(\\forall a_i\\in[1,100])$  \n\n输出格式  \n输出一个整数表示最后回家的孩子的编号"
}