{
    "description": "You have $ k $ pieces of laundry, each of which you want to wash, dry and fold. You are at a laundromat that has $ n_{1} $ washing machines, $ n_{2} $ drying machines and $ n_{3} $ folding machines. Each machine can process only one piece of laundry at a time. You can't dry a piece of laundry before it is washed, and you can't fold it before it is dried. Moreover, after a piece of laundry is washed, it needs to be immediately moved into a drying machine, and after it is dried, it needs to be immediately moved into a folding machine.\n\nIt takes $ t_{1} $ minutes to wash one piece of laundry in a washing machine, $ t_{2} $ minutes to dry it in a drying machine, and $ t_{3} $ minutes to fold it in a folding machine. Find the smallest number of minutes that is enough to wash, dry and fold all the laundry you have.",
    "inputFormat": "The only line of the input contains seven integers: $ k,n_{1},n_{2},n_{3},t_{1},t_{2},t_{3} $ $ (1<=k<=10^{4}; 1<=n_{1},n_{2},n_{3},t_{1},t_{2},t_{3}<=1000) $ .",
    "outputFormat": "Print one integer — smallest number of minutes to do all your laundry.",
    "samples": [
        [
            "1 1 1 1 5 5 5\n",
            "15\n"
        ],
        [
            "8 4 3 2 10 5 2\n",
            "32\n"
        ]
    ],
    "hint": "In the first example there's one instance of each machine, each taking 5 minutes to complete. You have only one piece of laundry, so it takes 15 minutes to process it.\n\nIn the second example you start washing first two pieces at moment $ 0 $ . If you start the third piece of laundry immediately, then by the time it is dried, there will be no folding machine available, so you have to wait, and start washing third piece at moment $ 2 $ . Similarly, you can't start washing next piece until moment $ 5 $ , since otherwise there will be no dryer available, when it is washed. Start time for each of the eight pieces of laundry is $ 0,0,2,5,10,10,12 $ and $ 15 $ minutes respectively. The last piece of laundry will be ready after $ 15+10+5+2=32 $ minutes.",
    "translation": "你有k件待洗的脏衣服和n1个洗衣机，n2个烘干机和n3个熨斗。每个机器同时只能处理一件衣服，分别花费t1,t2,t3时间。你必须将一件洗好的衣服立即烘干，烘干完毕后立即熨烫，不能颠倒顺序也不能在两阶段中间有间隔。\n\n输入一行7个数为k,n1,n2,n3,t1,t2,t3。输出一个数字，为全部熨烫完衣服的最短时间。\n\n1<=k<=10^4,1<=n,t<=10^3。"
}