{
    "description": "Gargari is jealous that his friend Caisa won the game from the previous problem. He wants to prove that he is a genius.\n\nHe has a $ n×n $ chessboard. Each cell of the chessboard has a number written on it. Gargari wants to place two bishops on the chessboard in such a way that there is no cell that is attacked by both of them. Consider a cell with number $ x $ written on it, if this cell is attacked by one of the bishops Gargari will get $ x $ dollars for it. Tell Gargari, how to place bishops on the chessboard to get maximum amount of money.\n\nWe assume a cell is attacked by a bishop, if the cell is located on the same diagonal with the bishop (the cell, where the bishop is, also considered attacked by it).",
    "inputFormat": "The first line contains a single integer $ n $ $ (2<=n<=2000) $ . Each of the next $ n $ lines contains $ n $ integers $ a_{ij} $ $ (0<=a_{ij}<=10^{9}) $ — description of the chessboard.",
    "outputFormat": "On the first line print the maximal number of dollars Gargari will get. On the next line print four integers: $ x_{1},y_{1},x_{2},y_{2} $ $ (1<=x_{1},y_{1},x_{2},y_{2}<=n) $ , where $ x_{i} $ is the number of the row where the $ i $ -th bishop should be placed, $ y_{i} $ is the number of the column where the $ i $ -th bishop should be placed. Consider rows are numbered from 1 to $ n $ from top to bottom, and columns are numbered from 1 to $ n $ from left to right.\n\nIf there are several optimal solutions, you can print any of them.",
    "samples": [
        [
            "4\n1 1 1 1\n2 1 1 0\n1 1 1 0\n1 0 0 1\n",
            "12\n2 2 3 2\n"
        ]
    ],
    "hint": "",
    "translation": "在一个n∗n的国际象棋的棋盘上放两个象，要求不能有位置同时被两个象攻击到，然后被一个象攻击到的位置上获得得分。（象放的位置也获得该位置得分），求得分的最大值。\r\n"
}