{
    "description": "Our good friend Mole is trying to code a big message. He is typing on an unusual keyboard with characters arranged in following way:\n\n`<br></br>qwertyuiop<br></br>asdfghjkl;<br></br>zxcvbnm,./<br></br>`Unfortunately Mole is blind, so sometimes it is problem for him to put his hands accurately. He accidentally moved both his hands with one position to the left or to the right. That means that now he presses not a button he wants, but one neighboring button (left or right, as specified in input).\n\nWe have a sequence of characters he has typed and we want to find the original message.",
    "inputFormat": "First line of the input contains one letter describing direction of shifting ('L' or 'R' respectively for left or right).\n\nSecond line contains a sequence of characters written by Mole. The size of this sequence will be no more than $ 100 $ . Sequence contains only symbols that appear on Mole's keyboard. It doesn't contain spaces as there is no space on Mole's keyboard.\n\nIt is guaranteed that even though Mole hands are moved, he is still pressing buttons on keyboard and not hitting outside it.",
    "outputFormat": "Print a line that contains the original message.",
    "samples": [
        [
            "R\ns;;upimrrfod;pbr\n",
            "allyouneedislove\n"
        ]
    ],
    "hint": "",
    "translation": "我们的好朋友鼹鼠M想用一个特殊的键盘上键入一条信息 ，键盘上的字符排列顺序如下：\n\nqwertyuiop\n\nasdfghjkl;\n\nzxcvbnm,./\n\n由于M看不见东西，所以有时他的手会向左或向右移动一个位置。我们要根据他键入的字符序列找到原始信息。\n\n输入输出格式\n\n输入格式：\n\n输入的第一行为一个描述移动方向的字母（左，右分别为“L”，“R”）。\n\n第二行包含由M打的一系列字符，长度不会超过100。仅包含出现在M键盘上的符号（不包含空格），保证M的手不会移到键盘外。\n\n输出格式：\n\n输出一行原始消息。\n\nTranslated by @khong "
}