{
    "description": "Polar bears Menshykov and Uslada from the zoo of St. Petersburg and elephant Horace from the zoo of Kiev got hold of lots of wooden cubes somewhere. They started making cube towers by placing the cubes one on top of the other. They defined multiple towers standing in a line as a wall. A wall can consist of towers of different heights.\n\nHorace was the first to finish making his wall. He called his wall an elephant. The wall consists of $ w $ towers. The bears also finished making their wall but they didn't give it a name. Their wall consists of $ n $ towers. Horace looked at the bears' tower and wondered: in how many parts of the wall can he \"see an elephant\"? He can \"see an elephant\" on a segment of $ w $ contiguous towers if the heights of the towers on the segment match as a sequence the heights of the towers in Horace's wall. In order to see as many elephants as possible, Horace can raise and lower his wall. He even can lower the wall below the ground level (see the pictures to the samples for clarification).\n\nYour task is to count the number of segments where Horace can \"see an elephant\".",
    "inputFormat": "The first line contains two integers $n$ and $w$ ( $1\\le n,w \\le 2 \\times 10^5$ ) — the number of towers in the bears' and the elephant's walls correspondingly. The second line contains $n$ integers $a_i$ ($1 \\le a_i \\le 10^9$) — the heights of the towers in the bears' wall. The third line contains $w$ integers $b_i$ ($1 \\le b_i \\le 10^9$) — the heights of the towers in the elephant's wall.",
    "outputFormat": "Print the number of segments in the bears' wall where Horace can \"see an elephant\".",
    "samples": [
        [
            "13 5\n2 4 5 5 4 3 2 2 2 3 3 2 1\n3 4 4 3 2\n",
            "2"
        ]
    ],
    "hint": "The picture to the left shows Horace's wall from the sample, the picture to the right shows the bears' wall. The segments where Horace can \"see an elephant\" are in gray.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF471D/4bab2ce5008bc40c15cf28d8ffc04197c7f77d57.png)",
    "translation": "给两堵墙，问 $a$ 墙中与 $b$ 墙顶部形状相同的区间有多少个。\n\nTranslated by @aface0427"
}