{
    "description": "Vasya tries to break in a safe. He knows that a code consists of $ n $ numbers, and every number is a 0 or a 1. Vasya has made $ m $ attempts to enter the code. After each attempt the system told him in how many position stand the right numbers. It is not said in which positions the wrong numbers stand. Vasya has been so unlucky that he hasn’t entered the code where would be more than 5 correct numbers. Now Vasya is completely bewildered: he thinks there’s a mistake in the system and it is self-contradictory. Help Vasya — calculate how many possible code variants are left that do not contradict the previous system responses.",
    "inputFormat": "The first input line contains two integers $ n $ and $ m $ ( $ 6<=n<=35,1<=m<=10 $ ) which represent the number of numbers in the code and the number of attempts made by Vasya. Then follow $ m $ lines, each containing space-separated $ s_{i} $ and $ c_{i} $ which correspondingly indicate Vasya’s attempt (a line containing $ n $ numbers which are 0 or 1) and the system’s response (an integer from 0 to 5 inclusively).",
    "outputFormat": "Print the single number which indicates how many possible code variants that do not contradict the $ m $ system responses are left.",
    "samples": [
        [
            "6 2\n000000 2\n010100 4\n",
            "6\n"
        ],
        [
            "6 3\n000000 2\n010100 4\n111100 0\n",
            "0\n"
        ],
        [
            "6 3\n000000 2\n010100 4\n111100 2\n",
            "1\n"
        ]
    ],
    "hint": "",
    "translation": "### 题意\n\n给定 $m$ 个串，由 $0$ 或者 $1$ 组成，定义 $num_i$ 表示这个字符串与标准字符串不同的个数。\n\n### 输入格式\n\n第一行两个数 $n$ 和 $m$。\n\n接下来 $m$ 行是一个串和 $num_i$。\n\n### 输出格式\n\n一行 $ans$ 表示最终有多少可能的标准字符串。\n\n### 数据范围\n\n$6 \\le n \\le 35$，$1 \\le m \\le 10$。\n\n保证 $num_i \\le 5$。"
}