{
    "description": " $ n $ participants of the competition were split into $ m $ teams in some manner so that each team has at least one participant. After the competition each pair of participants from the same team became friends.\n\nYour task is to write a program that will find the minimum and the maximum number of pairs of friends that could have formed by the end of the competition.",
    "inputFormat": "The only line of input contains two integers $ n $ and $ m $ , separated by a single space ( $ 1<=m<=n<=10^{9} $ ) — the number of participants and the number of teams respectively.",
    "outputFormat": " $ n $ participants of the competition were split into $ m $ teams in some manner so that each team has at least one participant. After the competition each pair of participants from the same team became friends.\n\nYour task is to write a program that will find the minimum and the maximum number of pairs of friends that could have formed by the end of the competition.",
    "samples": [
        [
            "5 1\n",
            "10 10\n"
        ],
        [
            "3 2\n",
            "1 1\n"
        ],
        [
            "6 3\n",
            "3 6\n"
        ]
    ],
    "hint": "In the first sample all the participants get into one team, so there will be exactly ten pairs of friends.\n\nIn the second sample at any possible arrangement one team will always have two participants and the other team will always have one participant. Thus, the number of pairs of friends will always be equal to one.\n\nIn the third sample minimum number of newly formed friendships can be achieved if participants were split on teams consisting of $ 2 $ people, maximum number can be achieved if participants were split on teams of $ 1 $ , $ 1 $ and $ 4 $ people.",
    "translation": "将N个人分成M组，每组至少一人，在比赛结束时，同一组的人两两之间都会成为朋友，不同分组的分组方案得到的朋友对数不同。你的任务是求出最小和最大的朋友对数。\r\n1≤m≤n≤10^16"
}