{
    "description": "Vasya trains to compose crossword puzzles. He can only compose crosswords of a very simplе type so far. All of them consist of exactly six words; the words can be read only from top to bottom vertically and from the left to the right horizontally. The words are arranged in the form of a rectangular \"eight\" or infinity sign, not necessarily symmetrical.\n\nThe top-left corner of the crossword coincides with the top-left corner of the rectangle. The same thing is correct for the right-bottom corners. The crossword can't degrade, i.e. it always has exactly four blank areas, two of which are surrounded by letters. Look into the output for the samples for clarification.\n\nHelp Vasya — compose a crossword of the described type using the given six words. It is allowed to use the words in any order.",
    "inputFormat": "Six lines contain the given words. Every word consists of no more than 30 and no less than 3 uppercase Latin letters.",
    "outputFormat": "If it is impossible to solve the problem, print Impossible. Otherwise, print the sought crossword. All the empty squares should be marked as dots.\n\nIf there can be several solutions to that problem, print the lexicographically minimum one. I.e. the solution where the first line is less than the first line of other solutions should be printed. If the two lines are equal, compare the second lines and so on. The lexicographical comparison of lines is realized by the < operator in the modern programming languages.",
    "samples": [
        [
            "NOD\nBAA\nYARD\nAIRWAY\nNEWTON\nBURN\n",
            "BAA...\nU.I...\nR.R...\nNEWTON\n..A..O\n..YARD\n"
        ],
        [
            "AAA\nAAA\nAAAAA\nAAA\nAAA\nAAAAA\n",
            "AAA..\nA.A..\nAAAAA\n..A.A\n..AAA\n"
        ],
        [
            "PTC\nJYNYFDSGI\nZGPPC\nIXEJNDOP\nJJFS\nSSXXQOFGJUZ\n",
            "JJFS....\nY..S....\nN..X....\nY..X....\nF..Q....\nD..O....\nS..F....\nG..G....\nIXEJNDOP\n...U...T\n...ZGPPC\n"
        ]
    ],
    "hint": "",
    "translation": "现在有6个字符串，让你把他们摆成一个‘8’字形，使得交叉处相等。输出摆放后的位置。"
}