{
    "description": "Imagine a city with $ n $ horizontal streets crossing $ m $ vertical streets, forming an $ (n-1)×(m-1) $ grid. In order to increase the traffic flow, mayor of the city has decided to make each street one way. This means in each horizontal street, the traffic moves only from west to east or only from east to west. Also, traffic moves only from north to south or only from south to north in each vertical street. It is possible to enter a horizontal street from a vertical street, or vice versa, at their intersection.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF475B/7015745b6e36cd9d1741bb00e67e81a4ab310705.png)The mayor has received some street direction patterns. Your task is to check whether it is possible to reach any junction from any other junction in the proposed street direction pattern.",
    "inputFormat": "The first line of input contains two integers $ n $ and $ m $ , ( $ 2<=n,m<=20 $ ), denoting the number of horizontal streets and the number of vertical streets.\n\nThe second line contains a string of length $ n $ , made of characters '<' and '>', denoting direction of each horizontal street. If the $ i $ -th character is equal to '<', the street is directed from east to west otherwise, the street is directed from west to east. Streets are listed in order from north to south.\n\nThe third line contains a string of length $ m $ , made of characters '^' and 'v', denoting direction of each vertical street. If the $ i $ -th character is equal to '^', the street is directed from south to north, otherwise the street is directed from north to south. Streets are listed in order from west to east.",
    "outputFormat": "If the given pattern meets the mayor's criteria, print a single line containing \"YES\", otherwise print a single line containing \"NO\".",
    "samples": [
        [
            "3 3\n><>\nv^v",
            "NO\n"
        ],
        [
            "4 6\n<><>\nv^v^v^",
            "YES\n"
        ]
    ],
    "hint": "The figure above shows street directions in the second sample test case.",
    "translation": "给定$n$条水平的单向街道和$m$条竖直单向的街道，其交点共有$n$ * $m$个，问这些节点是否都能互相到达。\n\n$2 <= n$, $m <= 20$"
}