{
    "description": "Bizon the Champion has recently finished painting his wood fence. The fence consists of a sequence of $ n $ panels of $ 1 $ meter width and of arbitrary height. The $ i $ -th panel's height is $ h_{i} $ meters. The adjacent planks follow without a gap between them.\n\nAfter Bizon painted the fence he decided to put a \"for sale\" sign on it. The sign will be drawn on a rectangular piece of paper and placed on the fence so that the sides of the sign are parallel to the fence panels and are also aligned with the edges of some panels. Bizon the Champion introduced the following constraints for the sign position:\n\n1. The width of the sign should be exactly $ w $ meters.\n2. The sign must fit into the segment of the fence from the $ l $ -th to the $ r $ -th panels, inclusive (also, it can't exceed the fence's bound in vertical direction).\n\nThe sign will be really pretty, So Bizon the Champion wants the sign's height to be as large as possible.\n\nYou are given the description of the fence and several queries for placing sign. For each query print the maximum possible height of the sign that can be placed on the corresponding segment of the fence with the given fixed width of the sign.\n",
    "inputFormat": "The first line of the input contains integer $n$~--- the number of panels in the fence ($1 \\leq n \\leq 10^{5}$). \n\nThe second line contains $n$ space-separated integers $h_{i}$, --- the heights of the panels ($1 \\leq h_{i} \\leq 10^{9}$). \n\nThe third line contains an integer $m$ --- the number of the queries ($1 \\leq m \\leq 10^{5}$). \n\nThe next $m$ lines contain the descriptions of the queries, each query is represented by three integers $l$, $r$ and $w$ ($1 \\leq l \\leq r \\leq n$, $1 \\leq w \\leq r-l+1$) --- the segment of the fence and the width of the sign respectively.\n",
    "outputFormat": "For each query print the answer on a separate line — the maximum height of the sign that can be put in the corresponding segment of the fence with all the conditions being satisfied.",
    "samples": [
        [
            "5\n1 2 2 3 3\n3\n2 5 3\n2 5 2\n1 5 5\n",
            "2\n3\n1\n"
        ]
    ],
    "hint": "The fence described in the sample looks as follows:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF484E/6257a310d2207c0e1a05992058b31d44d0ead77b.png)The possible positions for the signs for all queries are given below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF484E/4bfca5e8ee81f8d76187af1e0be6e7c7b6bf35e2.png) The optimal position of the sign for the first query.  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF484E/f28ed7253a1a74cdc9e367c2f43ac177854f54b6.png) The optimal position of the sign for the second query.  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF484E/5dde0308a1ff26588bc67b02973df5bc0c317178.png) The optimal position of the sign for the third query.",
    "translation": "给定一个长度为n的数列，有m次询问，询问形如l r k\n\n要你在区间[l,r]内选一个长度为k的区间，求区间最小数的最大值"
}