{
    "description": "Once upon a time in a kingdom far, far away… Okay, let’s start at the point where Ivan the Fool met Gorynych the Dragon. Ivan took out his magic sword and the battle began. First Gorynych had $ h $ heads and $ t $ tails. With each strike of the sword Ivan can either cut off several heads (from $ 1 $ to $ n $ , but not more than Gorynych has at the moment), or several tails (from $ 1 $ to $ m $ , but not more than Gorynych has at the moment). At the same time, horrible though it seems, Gorynych the Dragon can also grow new heads and tails. And the number of growing heads and tails is determined uniquely by the number of heads or tails cut by the current strike. When the total number of heads and tails exceeds $ R $ , Gorynych the Dragon strikes its final blow and destroys Ivan the Fool. That’s why Ivan aims to cut off all the dragon’s heads and tails as quickly as possible and win. The events can also develop in a third way: neither of the opponents can win over the other one and they will continue fighting forever.\n\nThe tale goes like this; easy to say, hard to do. Your task is to write a program that will determine the battle’s outcome. Consider that Ivan strikes consecutively. After each blow Gorynych grows a number of new heads and tails depending on the number of cut ones. Gorynych the Dragon is defeated if after the blow he loses all his heads and tails and can’t grow new ones. Ivan fights in the optimal way (fools are lucky), i.e.\n\n- if Ivan can win, he wins having struck the least number of blows;\n- if it is impossible to defeat Gorynych, but is possible to resist him for an infinitely long period of time, then that’s the strategy Ivan chooses;\n- if Gorynych wins in any case, Ivan aims to resist him for as long as possible.",
    "inputFormat": "The first line contains three integers $ h $ , $ t $ and $ R $ ( $ 0<=h,t,R<=200 $ , $ 0<h+t<=R $ ) which represent the initial numbers of Gorynych’s heads and tails and the largest total number of heads and tails with which Gorynych the Dragon does not yet attack. The next line contains integer $ n $ ( $ 1<=n<=200 $ ). The next $ n $ contain pairs of non-negative numbers \" $ h_{i} $ $ t_{i} $ \" which represent the number of heads and the number of tails correspondingly, that will grow if Gorynych has $ i $ heads ( $ 1<=i<=n $ ) cut. The next line contains an integer $ m $ ( $ 1<=m<=200 $ ) and then — the description of Gorynych’s behavior when his tails are cut off in the format identical to the one described above. All the numbers in the input file do not exceed $ 200 $ .",
    "outputFormat": "Print \"Ivan\" (without quotes) in the first line if Ivan wins, or \"Zmey\" (that means a dragon in Russian) if Gorynych the Dragon wins. In the second line print a single integer which represents the number of blows Ivan makes. If the battle will continue forever, print in the first line \"Draw\".",
    "samples": [
        [
            "2 2 4\n2\n1 0\n0 1\n3\n0 1\n0 1\n0 0\n",
            "Ivan\n2\n"
        ],
        [
            "2 2 4\n1\n0 1\n1\n1 0\n",
            "Draw\n"
        ],
        [
            "2 2 5\n1\n1 1\n1\n3 0\n",
            "Zmey\n2\n"
        ]
    ],
    "hint": "",
    "translation": "青冠龙一开始有 $h$ 个头和 $t$ 条尾巴，愚人伊凡每一次可以砍断 $x\\in [1,n]$ 个头或者 $y\\in [1,m]$ 条尾巴。\n\n如果砍断了 $i$ 个头，龙会长出 $hn_i$ 个头和 $tn_i$ 个尾巴，如果砍断 $j$ 条尾巴，则会长出 $hm_j$ 个头和 $tm_j$ 条尾巴。\n\n如果龙的头和尾巴的数量之和大于 $R$，伊凡失败。如果没有头也没有尾巴，伊凡获胜。\n\n如果伊凡能获胜，输出 $\\text{Ivan}$ 以及最短时间，如果伊凡失败，输出 $\\text{Zmey}$ 以及最长战斗时间。如果会一直战斗下去，输出 $\\text{Draw}$。"
}