{
    "description": "You have decided to watch the best moments of some movie. There are two buttons on your player:\n\n1. Watch the current minute of the movie. By pressing this button, you watch the current minute of the movie and the player automatically proceeds to the next minute of the movie.\n2. Skip exactly $ x $ minutes of the movie ( $ x $ is some fixed positive integer). If the player is now at the $ t $ -th minute of the movie, then as a result of pressing this button, it proceeds to the minute $ (t+x) $ .\n\nInitially the movie is turned on in the player on the first minute, and you want to watch exactly $ n $ best moments of the movie, the $ i $ -th best moment starts at the $ l_{i} $ -th minute and ends at the $ r_{i} $ -th minute (more formally, the $ i $ -th best moment consists of minutes: $ l_{i},l_{i}+1,...,r_{i} $ ).\n\nDetermine, what is the minimum number of minutes of the movie you have to watch if you want to watch all the best moments?",
    "inputFormat": "The first line contains two space-separated integers $ n $ , $ x $ ( $ 1<=n<=50 $ , $ 1<=x<=10^{5} $ ) — the number of the best moments of the movie and the value of $ x $ for the second button.\n\nThe following $ n $ lines contain the descriptions of the best moments of the movie, the $ i $ -th line of the description contains two integers separated by a space $ l_{i} $ , $ r_{i} $ ( $ 1<=l_{i}<=r_{i}<=10^{5} $ ).\n\nIt is guaranteed that for all integers $ i $ from $ 2 $ to $ n $ the following condition holds: $ r_{i-1}&lt;l_{i} $ .",
    "outputFormat": "Output a single number — the answer to the problem.",
    "samples": [
        [
            "2 3\n5 6\n10 12\n",
            "6\n"
        ],
        [
            "1 1\n1 100000\n",
            "100000\n"
        ]
    ],
    "hint": "In the first sample, the player was initially standing on the first minute. As the minutes from the $ 1 $ -st to the $ 4 $ -th one don't contain interesting moments, we press the second button. Now we can not press the second button and skip $ 3 $ more minutes, because some of them contain interesting moments. Therefore, we watch the movie from the $ 4 $ -th to the $ 6 $ -th minute, after that the current time is $ 7 $ . Similarly, we again skip $ 3 $ minutes and then watch from the $ 10 $ -th to the $ 12 $ -th minute of the movie. In total, we watch $ 6 $ minutes of the movie.\n\nIn the second sample, the movie is very interesting, so you'll have to watch all $ 100000 $ minutes of the movie.",
    "translation": "看一部电影，从第一分钟开始看，你每次可以按下快进键，快进x分钟，电影有n个精彩片段，问看到所有精彩片段至少需要看多少分钟电影。（数据保证能看到所有精彩片段）"
}