{
    "description": "There are two polygons on the plane, A and B. Polygon A rotates around point P, and polygon B rotates\naround point Q. Each polygon rotates with the constant rotational speed in the clockwise direction around\nits point, the rotational speed values of the polygons’ rotation are equal.\n\nYour task is to determine if there will be a collision between polygons. A collision is a situation when the\npolygons have at least one common point.\n\nIt is guaranteed that at the moment 0 the polygons A and B do not intersect and no polygon is fully\ncontained inside another one.\n\nNote that:\n - the polygons are not necessarily convex;\n - points P and Q can be located on the border of or outside their polygons.",
    "inputFormat": "The first line contains space-separated coordinates of point P.\n\nThe second line contains a single integer n (3 ≤ n ≤ 1000) — the number of vertices of polygon A.\n\nEach of the next n lines contains two space-separated integers — the coordinates of the corresponding\nvertex of polygon A.\n\nThe next line is empty.\n\nThen follow space-separated coordinates of point Q.\n\nThe next line contains a single integer m (3 ≤ m ≤ 1000) — the number of vertices of polygon B. Next\nm lines contain the coordinates of the vertices of the polygon B.\n\nThe vertices of both polygons are listed in the counterclockwise order. \nCoordinates of all points are\nintegers, their absolute values don’t exceed $10^4$.\n",
    "outputFormat": "Print “YES”, if the collision takes place and “NO” otherwise (don’t print the quotes).\n",
    "samples": [
        [
            "1 0\n4\n0 0\n1 0\n1 5\n0 5\n9 0\n4\n9 0\n9 -5\n10 -5\n10 0",
            "YES"
        ],
        [
            "0 0\n3\n1 0\n2 -1\n2 1\n0 0\n3\n-1 0\n-2 1\n-2 -1\n",
            "NO"
        ]
    ],
    "hint": "A polygon is a closed polyline that doesn’t intersect itself and doesn’t touch itself.\n\nPicture to the first sample:\n\n![](https://cdn.luogu.com.cn/upload/pic/13594.png)",
    "translation": "给出两个多边形A、B和两个点P、Q，使多边形A绕点P旋转，多边形B绕点Q旋转，问两者旋转方向与速度均相同时是否会在旋转过程中有交点\r\n\r\n输入格式：\r\n\r\n第一行两个整数x,y,表示P点的坐标\r\n\r\n接下来一个整数n表示多边形A的点数\r\n\r\n接下来n行，每行两个整数表示每个点的坐标\r\n\r\n接下来两个整数表示Q点的坐标\r\n\r\n接下来一个整数m表示多边形B的点数\r\n\r\n接下来m行，每行两个整数表示每个点的坐标\r\n\r\n输出格式：\r\n\r\n一行一个字符串\"YES\"或\"NO\"表示是否会卡住\r\n\r\n数据范围：\r\n\r\n3<=n,m<=1000\r\n\r\n-10000<=x<=10000"
}