{
    "description": "One day Maria Ivanovna found a Sasha's piece of paper with a message dedicated to Olya. Maria Ivanovna wants to know what is there in a message, but unfortunately the message is ciphered. Maria Ivanovna knows that her students usually cipher their messages by replacing each letter of an original message by some another letter. Replacement works in such way that same letters are always replaced with some fixed letter, and different letters are always replaced by different letters.\n\nMaria Ivanovna supposed that the message contains answers to the final exam (since its length is equal to the number of final exam questions). On the other hand she knows that Sasha's answer are not necessary correct. There are $ K $ possible answers for each questions. Of course, Maria Ivanovna knows correct answers.\n\nMaria Ivanovna decided to decipher message in such way that the number of Sasha's correct answers is maximum possible. She is very busy now, so your task is to help her.",
    "inputFormat": "First line contains length of both strings $ N $ ( $ 1<=N<=2000000 $ ) and an integer $ K $ — number of possible answers for each of the questions ( $ 1<=K<=52 $ ). Answers to the questions are denoted as Latin letters abcde...xyzABCDE...XYZ in the order. For example for $ K=6 $ , possible answers are abcdef and for $ K=30 $ possible answers are abcde...xyzABCD.\n\nSecond line contains a ciphered message string consisting of Latin letters.\n\nThird line contains a correct answers string consisting of Latin letters.",
    "outputFormat": "In the first line output maximum possible number of correct Sasha's answers.\n\nIn the second line output cipher rule as the string of length $ K $ where for each letter from the students' cipher (starting from 'a' as mentioned above) there is specified which answer does it correspond to.\n\nIf there are several ways to produce maximum answer, output any of them.",
    "samples": [
        [
            "10 2\naaabbbaaab\nbbbbabbbbb\n",
            "7\nba\n"
        ],
        [
            "10 2\naaaaaaabbb\nbbbbaaabbb\n",
            "6\nab\n"
        ],
        [
            "9 4\ndacbdacbd\nacbdacbda\n",
            "9\ncdba\n"
        ]
    ],
    "hint": "",
    "translation": "给定两个长度均为 $n$ 的字符串 $s$ 和 $t$，其中的每个字符都属于集合 $\\{a,b,c,\\dots,y,z,A,B,C,\\dots,Y,Z\\}$ 中**前 $k$ 个字符**所构成的子集 $\\mathbb{S}$。\n\n你需要构造一个**一对一**的映射 $f:\\mathbb{S}\\rightarrow\\mathbb{S}$，使得满足 $f(s_i)=t_i$ 的位置 $i$ 最多。\n\n这里的一对一指对于每个 $i\\in\\mathbb S$，$f(i)$ 唯一，且满足 $f(x)=i$ 的 $x$ 也唯一。\n\n输出最多的位置，以及任一种最优的映射方案。"
}