{
    "description": "Polycarpus participates in a competition for hacking into a new secure messenger. He's almost won.\n\nHaving carefully studied the interaction protocol, Polycarpus came to the conclusion that the secret key can be obtained if he properly cuts the public key of the application into two parts. The public key is a long integer which may consist of even a million digits!\n\nPolycarpus needs to find such a way to cut the public key into two nonempty parts, that the first (left) part is divisible by $ a $ as a separate number, and the second (right) part is divisible by $ b $ as a separate number. Both parts should be positive integers that have no leading zeros. Polycarpus knows values $ a $ and $ b $ .\n\nHelp Polycarpus and find any suitable method to cut the public key.",
    "inputFormat": "The first line of the input contains the public key of the messenger — an integer without leading zeroes, its length is in range from $ 1 $ to $ 10^{6} $ digits. The second line contains a pair of space-separated positive integers $ a $ , $ b $ ( $ 1<=a,b<=10^{8} $ ).",
    "outputFormat": "In the first line print \"YES\" (without the quotes), if the method satisfying conditions above exists. In this case, next print two lines — the left and right parts after the cut. These two parts, being concatenated, must be exactly identical to the public key. The left part must be divisible by $ a $ , and the right part must be divisible by $ b $ . The two parts must be positive integers having no leading zeros. If there are several answers, print any of them.\n\nIf there is no answer, print in a single line \"NO\" (without the quotes).",
    "samples": [
        [
            "116401024\n97 1024\n",
            "YES\n11640\n1024\n"
        ],
        [
            "284254589153928171911281811000\n1009 1000\n",
            "YES\n2842545891539\n28171911281811000\n"
        ],
        [
            "120\n12 1\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "Polycarpus 正在参加一场黑客比赛，他离胜利仅差一步之遥，那就是破解密钥。\n\n在仔细研究了交互协议后，Polycarpus 得出结论：如果他将应用程序的公钥 $s$ 适当地分成两部分，就可以获得密钥。然而他突然意识了一个大问题：公钥 $s$ 是一个长整数，甚至可能由 $10^6$ 位数字组成！\n\n对胜利的渴望促使着 Polycarpus 找到密钥。他发现，如果分成的两个部分分别组成了两个**不含前导零**的**正整数**，且左边的部分组成的长整数可以被一个正整数 $a$ 整除，右边的部分组成的长整数可以被一个正整数 $b$ 整除，那么 Polycarpus 可以通过这两个公钥解出密钥。并且值得高兴的是，Polycarpus 在赛前已经通过某些手段获得了 $a,b$ 的具体值。\n\n现在，请你帮助 Polycarpus 以合理的方式将公钥分成两部分，使得 Polycarpus 可以通过这两个部分解出密钥。但首先，你需要判断是否存在一种合理的方案。判断完以后，如果存在多种方案，你只需要告诉 Polycarpus 任意一种方案。\n\n数据范围：\n\n- $1\\leqslant |s|\\leqslant 10^6$。\n- $1\\leqslant a,b\\leqslant 10^8$。\n\nTranslated by Eason_AC  \n2021.12.21"
}