{
    "description": "You are given an $ n×m $ rectangular table consisting of lower case English letters. In one operation you can completely remove one column from the table. The remaining parts are combined forming a new table. For example, after removing the second column from the table\n\n`<br></br>abcd<br></br>edfg<br></br>hijk<br></br>`we obtain the table:\n\n`<br></br>acd<br></br>efg<br></br>hjk<br></br>`A table is called good if its rows are ordered from top to bottom lexicographically, i.e. each row is lexicographically no larger than the following one. Determine the minimum number of operations of removing a column needed to make a given table good.",
    "inputFormat": "The first line contains two integers — $ n $ and $ m $ ( $ 1<=n,m<= $ 100).\n\nNext $ n $ lines contain $ m $ small English letters each — the characters of the table.",
    "outputFormat": "Print a single number — the minimum number of columns that you need to remove in order to make the table good.",
    "samples": [
        [
            "1 10\ncodeforces\n",
            "0\n"
        ],
        [
            "4 4\ncase\ncare\ntest\ncode\n",
            "2\n"
        ],
        [
            "5 4\ncode\nforc\nesco\ndefo\nrces\n",
            "4\n"
        ]
    ],
    "hint": "In the first sample the table is already good.\n\nIn the second sample you may remove the first and third column.\n\nIn the third sample you have to remove all the columns (note that the table where all rows are empty is considered good by definition).\n\nLet strings $ s $ and $ t $ have equal length. Then, $ s $ is lexicographically larger than $ t $ if they are not equal and the character following the largest common prefix of $ s $ and $ t $ (the prefix may be empty) in $ s $ is alphabetically larger than the corresponding character of $ t $ .",
    "translation": "# 题目描述：\r\n\r\n给你一个$n$*$m$的小写字符矩阵，你可以选择删除一些列，使得剩下的字符矩阵的每一行的字符串从上到下的字典序非减。\r\n\r\n求最少删除多少列\r\n\r\n# 输入格式：\r\n\r\n第一行输入两个整数n,m\r\n接下来n行每行输入m个字符\r\n\r\n# 输出格式：\r\n\r\n输出一个整数表示最少删除的列"
}