{
    "description": "Peter decided to wish happy birthday to his friend from Australia and send him a card. To make his present more mysterious, he decided to make a chain. Chain here is such a sequence of envelopes $ A $ = { $ a_{1},a_{2},...,a_{n} $ }, where the width and the height of the $ i $ -th envelope is strictly higher than the width and the height of the $ (i-1) $ -th envelope respectively. Chain size is the number of envelopes in the chain.\n\nPeter wants to make the chain of the maximum size from the envelopes he has, the chain should be such, that he'll be able to put a card into it. The card fits into the chain if its width and height is lower than the width and the height of the smallest envelope in the chain respectively. It's forbidden to turn the card and the envelopes.\n\nPeter has very many envelopes and very little time, this hard task is entrusted to you.",
    "inputFormat": "The first line contains integers $ n $ , $ w $ , $ h $ ( $ 1<=n<=5000 $ , $ 1<=w,h<=10^{6} $ ) — amount of envelopes Peter has, the card width and height respectively. Then there follow $ n $ lines, each of them contains two integer numbers $ w_{i} $ and $ h_{i} $ — width and height of the $ i $ -th envelope ( $ 1<=w_{i},h_{i}<=10^{6} $ ).",
    "outputFormat": "In the first line print the maximum chain size. In the second line print the numbers of the envelopes (separated by space), forming the required chain, starting with the number of the smallest envelope. Remember, please, that the card should fit into the smallest envelope. If the chain of maximum size is not unique, print any of the answers.\n\nIf the card does not fit into any of the envelopes, print number $ 0 $ in the single line.",
    "samples": [
        [
            "2 1 1\n2 2\n2 2\n",
            "1\n1 \n"
        ],
        [
            "3 3 3\n5 4\n12 11\n9 8\n",
            "3\n1 3 2 \n"
        ]
    ],
    "hint": "",
    "translation": "给出一个限制 $(w,h)$ 和 $n$ 个物品的二维信息$(w_i,h_i)$\n\n求物品二维都满足 $w_i>w,h_i>h$ 的前提下的最长二维严格上升子序列以及其长度$(w_i>w_{i-1},h_i > h_{i-1}$ )\n\n如果找不到任何一个物品满足条件 只需输出一行 0"
}