{
    "description": "The commanding officers decided to drop a nuclear bomb on the enemy's forces. You are ordered to determine the power of the warhead that needs to be used.\n\nThe enemy has $ N $ strategically important objects. Their positions are known due to the intelligence service. The aim of the strike is to deactivate at least $ K $ important objects of the enemy. The bombing impact point is already determined and has coordinates of $ [X_{0};\\ Y_{0}] $ .\n\nThe nuclear warhead is marked by the estimated impact radius $ R>=0 $ . All the buildings that are located closer than $ R $ to the bombing epicentre will be destroyed. All the buildings that are located further than $ R $ from the epicentre, can also be deactivated with some degree of probability. Let's assume that $ D $ is the distance between a building and the epicentre. This building's deactivation probability $ P(D,R) $ is calculated according to the following formula:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF50D/711e1c419c06d4e6b9f16e86aeb94f1d25925635.png) We should regard ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF50D/5966d57c740e5c247c71ce7e978aac36c0d9200d.png) as $ e^{a} $ , where $ e≈2.7182818284590452353602874713527 $ If the estimated impact radius of the warhead is equal to zero, then all the buildings located in the impact point will be completely demolished and all the rest of important objects will not be damaged.\n\nThe commanding officers want the probability of failing the task to be no more than $ ε $ . Nuclear warheads are too expensive a luxury, that's why you have to minimise the estimated impact radius of the warhead.",
    "inputFormat": "The first line contains an integer $ N $ which represents the number of the enemy's objects ( $ 1<=N<=100 $ ). The second line contains two integers: $ K $ is the required number of deactivated objects, and $ ε $ is the maximally permitted probability of not completing the task, given in per mils ( $ 1<=K<=N $ , $ 1<=ε<=999 $ ). The third line contains $ X_{0} $ and $ Y_{0} $ which are the coordinates of the strike impact point. The next $ N $ lines contain two numbers $ X_{i} $ and $ Y_{i} $ each which are the coordinates of every strategically important object. All the coordinates are integer, their absolute values do not exceed $ 1000 $ .\n\nLet us remind you that there are a thousand per mils in unity (number one).\n\nThere can be several objects in one point.",
    "outputFormat": "Print the sought estimated impact radius of the warhead. The absolute or relative measure of the inaccuracy of your answer should not exceed $ 10^{-6} $ .",
    "samples": [
        [
            "1\n1 500\n5 5\n1 2\n",
            "3.84257761518762740\n"
        ],
        [
            "5\n3 100\n0 0\n3 4\n60 70\n100 100\n10 10\n5 12\n",
            "13.45126176453737600\n"
        ]
    ],
    "hint": "",
    "translation": "# 标题：轰炸\n时限2s，空限256M\n## 题目：\n现在有n个建筑，知道建筑的坐标。现要求用特定的导弹摧毁k个。导弹固定降落在[x0,y0]点，但是有一个估计影响半径r（>=0）：在[x0,y0]的建筑将被摧毁，其余建筑也会在以下公式上受到波及：\n![](http://codeforces.com/predownloaded/c9/75/c975e17ceaa1aa7adf61fdd561d71b5f7cb03929.png)\n现要求计算出最小的r，使得能摧毁k个目标。\n（注：如果r=0，那么只会摧毁导弹降落点的建筑，其余没有建筑会受到波及。此题中e=2.7182818284590452353602874713527。）\n\n## 输入：\n第一行：一个整数n，n<=100。\n\n第二行：两个整数，分别表示k（1<k<=n）和未完成任务的最大允许概率（在1和999之间）。\n\n第三行：两个整数，x0,y0。\n\n之后n行：xi和yi，表示建筑坐标，保证绝对值不超过1000。\n\n输出：一行一个实数，r的值，要求与答案相差不超过1e-6。"
}