{
    "description": "Amr bought a new video game \"Guess Your Way Out!\". The goal of the game is to find an exit from the maze that looks like a perfect binary tree of height $ h $ . The player is initially standing at the root of the tree and the exit from the tree is located at some leaf node.\n\nLet's index all the leaf nodes from the left to the right from 1 to $ 2^{h} $ . The exit is located at some node $ n $ where $ 1<=n<=2^{h} $ , the player doesn't know where the exit is so he has to guess his way out!\n\nAmr follows simple algorithm to choose the path. Let's consider infinite command string \"LRLRLRLRL...\" (consisting of alternating characters 'L' and 'R'). Amr sequentially executes the characters of the string using following rules:\n\n- Character 'L' means \"go to the left child of the current node\";\n- Character 'R' means \"go to the right child of the current node\";\n- If the destination node is already visited, Amr skips current command, otherwise he moves to the destination node;\n- If Amr skipped two consecutive commands, he goes back to the parent of the current node before executing next command;\n- If he reached a leaf node that is not the exit, he returns to the parent of the current node;\n- If he reaches an exit, the game is finished.\n\nNow Amr wonders, if he follows this algorithm, how many nodes he is going to visit before reaching the exit?",
    "inputFormat": "Input consists of two integers $ h,n $ ( $ 1<=h<=50 $ , $ 1<=n<=2^{h} $ ).",
    "outputFormat": "Output a single integer representing the number of nodes (excluding the exit node) Amr is going to visit before reaching the exit by following this algorithm.",
    "samples": [
        [
            "1 2\n",
            "2"
        ],
        [
            "2 3\n",
            "5"
        ],
        [
            "3 6\n",
            "10"
        ],
        [
            "10 1024\n",
            "2046"
        ]
    ],
    "hint": "A perfect binary tree of height $ h $ is a binary tree consisting of $ h+1 $ levels. Level $ 0 $ consists of a single node called root, level $ h $ consists of $ 2^{h} $ nodes called leaves. Each node that is not a leaf has exactly two children, left and right one.\n\nFollowing picture illustrates the sample test number $ 3 $ . Nodes are labeled according to the order of visit.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF507C/1071268d93324fbfe90557eb5569861c59d6d7a2.png)",
    "translation": "有一个高度为h的满二叉树，从根节点出发，按照\"LRLRLRLR....\"的方式往下走，走到第n个叶子结点结束。如果走到了非n的叶子结点，那么就跳过下一个指令，回溯然后按照指令继续走没有走过的结点。问到达第n个叶子结点之前，有多少个结点被走过。"
}