{
    "description": "Misha hacked the Codeforces site. Then he decided to let all the users change their handles. A user can now change his handle any number of times. But each new handle must not be equal to any handle that is already used or that was used at some point.\n\nMisha has a list of handle change requests. After completing the requests he wants to understand the relation between the original and the new handles of the users. Help him to do that.",
    "inputFormat": "The first line contains integer $ q $ ( $ 1<=q<=1000 $ ), the number of handle change requests.\n\nNext $ q $ lines contain the descriptions of the requests, one per line.\n\nEach query consists of two non-empty strings $ old $ and $ new $ , separated by a space. The strings consist of lowercase and uppercase Latin letters and digits. Strings $ old $ and $ new $ are distinct. The lengths of the strings do not exceed $ 20 $ .\n\nThe requests are given chronologically. In other words, by the moment of a query there is a single person with handle $ old $ , and handle $ new $ is not used and has not been used by anyone.",
    "outputFormat": "In the first line output the integer $ n $ — the number of users that changed their handles at least once.\n\nIn the next $ n $ lines print the mapping between the old and the new handles of the users. Each of them must contain two strings, $ old $ and $ new $ , separated by a space, meaning that before the user had handle $ old $ , and after all the requests are completed, his handle is $ new $ . You may output lines in any order.\n\nEach user who changes the handle must occur exactly once in this description.",
    "samples": [
        [
            "5\nMisha ILoveCodeforces\nVasya Petrov\nPetrov VasyaPetrov123\nILoveCodeforces MikeMirzayanov\nPetya Ivanov\n",
            "3\nPetya Ivanov\nMisha MikeMirzayanov\nVasya VasyaPetrov123\n"
        ]
    ],
    "hint": "",
    "translation": "白面鸮在维护罗德岛的干员数据库。其中有些干员多次改变姓名，白面鸮想知道干员最初的姓名和当前的姓名（干员可多次改名）。请您帮助她。\r\n\r\ninput\r\n一行n，表示有n次修改操作(1<=n<=1000)\r\n接下来n行，每行2个字符串，长度不过20，以空格相隔。\r\n\r\noutput\r\n一行，输出有m个干员（输出顺序任意）\r\n接下来m行，每行2个字符串，表示干员最初姓名和当前姓名。"
}