{
    "description": "Pasha loves his phone and also putting his hair up... But the hair is now irrelevant.\n\nPasha has installed a new game to his phone. The goal of the game is following. There is a rectangular field consisting of $ n $ row with $ m $ pixels in each row. Initially, all the pixels are colored white. In one move, Pasha can choose any pixel and color it black. In particular, he can choose the pixel that is already black, then after the boy's move the pixel does not change, that is, it remains black. Pasha loses the game when a $ 2×2 $ square consisting of black pixels is formed.\n\nPasha has made a plan of $ k $ moves, according to which he will paint pixels. Each turn in his plan is represented as a pair of numbers $ i $ and $ j $ , denoting respectively the row and the column of the pixel to be colored on the current move.\n\nDetermine whether Pasha loses if he acts in accordance with his plan, and if he does, on what move the $ 2×2 $ square consisting of black pixels is formed.",
    "inputFormat": "The first line of the input contains three integers $ n,m,k $ ( $ 1<=n,m<=1000 $ , $ 1<=k<=10^{5} $ ) — the number of rows, the number of columns and the number of moves that Pasha is going to perform.\n\nThe next $ k $ lines contain Pasha's moves in the order he makes them. Each line contains two integers $ i $ and $ j $ ( $ 1<=i<=n $ , $ 1<=j<=m $ ), representing the row number and column number of the pixel that was painted during a move.",
    "outputFormat": "If Pasha loses, print the number of the move when the $ 2×2 $ square consisting of black pixels is formed.\n\nIf Pasha doesn't lose, that is, no $ 2×2 $ square consisting of black pixels is formed during the given $ k $ moves, print $ 0 $ .",
    "samples": [
        [
            "2 2 4\n1 1\n1 2\n2 1\n2 2\n",
            "4\n"
        ],
        [
            "2 3 6\n2 3\n2 2\n1 3\n2 2\n1 2\n1 1\n",
            "5\n"
        ],
        [
            "5 3 7\n2 3\n1 2\n1 1\n4 1\n3 1\n5 3\n3 2\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "现在有一个n*m 的矩阵，一开始全部格子被染成白色。\n接下来有k个操作，每一个操作表示把一个格子染成黑色。\n\n输入n,m和k,接下来k行，每行两个正整数x,y，表示要染成黑色的格子的坐标；\n输出一个正整数，为第一次出现2*2的黑色格子时是第几次操作。"
}