{
    "description": "Notice that the memory limit is non-standard.\n\nRecently Arthur and Sasha have studied correct bracket sequences. Arthur understood this topic perfectly and become so amazed about correct bracket sequences, so he even got himself a favorite correct bracket sequence of length $ 2n $ . Unlike Arthur, Sasha understood the topic very badly, and broke Arthur's favorite correct bracket sequence just to spite him.\n\nAll Arthur remembers about his favorite sequence is for each opening parenthesis ('(') the approximate distance to the corresponding closing one (')'). For the $ i $ -th opening bracket he remembers the segment $ [l_{i},r_{i}] $ , containing the distance to the corresponding closing bracket.\n\nFormally speaking, for the $ i $ -th opening bracket (in order from left to right) we know that the difference of its position and the position of the corresponding closing bracket belongs to the segment $ [l_{i},r_{i}] $ .\n\nHelp Arthur restore his favorite correct bracket sequence!",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=600 $ ), the number of opening brackets in Arthur's favorite correct bracket sequence.\n\nNext $ n $ lines contain numbers $ l_{i} $ and $ r_{i} $ ( $ 1<=l_{i}<=r_{i}&lt;2n $ ), representing the segment where lies the distance from the $ i $ -th opening bracket and the corresponding closing one.\n\nThe descriptions of the segments are given in the order in which the opening brackets occur in Arthur's favorite sequence if we list them from left to right.",
    "outputFormat": "If it is possible to restore the correct bracket sequence by the given data, print any possible choice.\n\nIf Arthur got something wrong, and there are no sequences corresponding to the given information, print a single line \"IMPOSSIBLE\" (without the quotes).",
    "samples": [
        [
            "4\n1 1\n1 1\n1 1\n1 1\n",
            "()()()()\n"
        ],
        [
            "3\n5 5\n3 3\n1 1\n",
            "((()))\n"
        ],
        [
            "3\n5 5\n3 3\n2 2\n",
            "IMPOSSIBLE\n"
        ],
        [
            "3\n2 3\n1 4\n1 4\n",
            "(())()\n"
        ]
    ],
    "hint": "",
    "translation": "一个长为2n的括号序列，左括号和右括号都是n个。\r\n\r\n对于从左到右的第i个左括号，对与其配对的右括号有如下限制：\r\n\r\n与其配对的右括号和这个左括号之间的距离需要在 [ Li , Ri ] 之间。\r\n\r\n输入的第一行给出n（1<=n<=600）。\r\n\r\n之后的n行，给出限制：Li、Ri。\r\n\r\n如果满足限制的括号序列存在，输出任意一个即可。\r\n\r\n否则输出\"IMPOSSIBLE\"（不包含引号）。"
}