{
    "description": "When Darth Vader gets bored, he sits down on the sofa, closes his eyes and thinks of an infinite rooted tree where each node has exactly $ n $ sons, at that for each node, the distance between it an its $ i $ -th left child equals to $ d_{i} $ . The Sith Lord loves counting the number of nodes in the tree that are at a distance at most $ x $ from the root. The distance is the sum of the lengths of edges on the path between nodes.\n\nBut he has got used to this activity and even grew bored of it. 'Why does he do that, then?' — you may ask. It's just that he feels superior knowing that only he can solve this problem.\n\nDo you want to challenge Darth Vader himself? Count the required number of nodes. As the answer can be rather large, find it modulo $ 10^{9}+7 $ .",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ x $ ( $ 1<=n<=10^{5},0<=x<=10^{9} $ ) — the number of children of each node and the distance from the root within the range of which you need to count the nodes.\n\nThe next line contains $ n $ space-separated integers $ d_{i} $ ( $ 1<=d_{i}<=100 $ ) — the length of the edge that connects each node with its $ i $ -th child.",
    "outputFormat": "Print a single number — the number of vertexes in the tree at distance from the root equal to at most $ x $ .",
    "samples": [
        [
            "3 3\n1 2 3\n",
            "8\n"
        ]
    ],
    "hint": "Pictures to the sample (the yellow color marks the nodes the distance to which is at most three)\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF514E/dfa75ce6cc0df1087a16e02cadbd273a08641d03.png)",
    "translation": "有一个无限大的有根树，树上的每一个节点都有 $n$ 个子节点（$1 \\leq n \\leq 10^5$），任意一个节点它的第 $i$ 个子节点之间的距离为 $d_i$（$1 \\leq d_i \\leq 100$）。\n\n给出一个数 $x$（$0 \\leq x \\leq 10^9$），求有多少个节点到根节点的距离小于等于 $x$，输出答案对 $10^9+7$ 取模后的结果。"
}