{
    "description": "Ilya got tired of sports programming, left university and got a job in the subway. He was given the task to determine the escalator load factor.\n\nLet's assume that $ n $ people stand in the queue for the escalator. At each second one of the two following possibilities takes place: either the first person in the queue enters the escalator with probability $ p $ , or the first person in the queue doesn't move with probability $ (1-p) $ , paralyzed by his fear of escalators and making the whole queue wait behind him.\n\nFormally speaking, the $ i $ -th person in the queue cannot enter the escalator until people with indices from $ 1 $ to $ i-1 $ inclusive enter it. In one second only one person can enter the escalator. The escalator is infinite, so if a person enters it, he never leaves it, that is he will be standing on the escalator at any following second. Ilya needs to count the expected value of the number of people standing on the escalator after $ t $ seconds.\n\nYour task is to help him solve this complicated task.",
    "inputFormat": "The first line of the input contains three numbers $ n,p,t $ ( $ 1<=n,t<=2000 $ , $ 0<=p<=1 $ ). Numbers $ n $ and $ t $ are integers, number $ p $ is real, given with exactly two digits after the decimal point.",
    "outputFormat": "Print a single real number — the expected number of people who will be standing on the escalator after $ t $ seconds. The absolute or relative error mustn't exceed $ 10^{-6} $ .",
    "samples": [
        [
            "1 0.50 1\n",
            "0.5\n"
        ],
        [
            "1 0.50 4\n",
            "0.9375\n"
        ],
        [
            "4 0.20 2\n",
            "0.4\n"
        ]
    ],
    "hint": "",
    "translation": "有$n$ 个人排成一列$,$ 每秒中队伍最前面的人$p$ 的概率走上电梯$($ 一旦走上就不会下电梯$),$ 或者有$1-p$ 的概率不动\n\n问你$T$ 秒过后$,$ 在电梯上的人的数量的期望$.$ \n\n感谢@Kelin 提供的翻译"
}