{
    "description": "There are $ n $ Imperial stormtroopers on the field. The battle field is a plane with Cartesian coordinate system. Each stormtrooper is associated with his coordinates $ (x,y) $ on this plane.\n\nHan Solo has the newest duplex lazer gun to fight these stormtroopers. It is situated at the point $ (x_{0},y_{0}) $ . In one shot it can can destroy all the stormtroopers, situated on some line that crosses point $ (x_{0},y_{0}) $ .\n\nYour task is to determine what minimum number of shots Han Solo needs to defeat all the stormtroopers.\n\nThe gun is the newest invention, it shoots very quickly and even after a very large number of shots the stormtroopers don't have enough time to realize what's happening and change their location.",
    "inputFormat": "The first line contains three integers $ n $ , $ x_{0} $ и $ y_{0} $ ( $ 1<=n<=1000 $ , $ -10^{4}<=x_{0},y_{0}<=10^{4} $ ) — the number of stormtroopers on the battle field and the coordinates of your gun.\n\nNext $ n $ lines contain two integers each $ x_{i} $ , $ y_{i} $ ( $ -10^{4}<=x_{i},y_{i}<=10^{4} $ ) — the coordinates of the stormtroopers on the battlefield. It is guaranteed that no stormtrooper stands at the same point with the gun. Multiple stormtroopers can stand at the same point.",
    "outputFormat": "Print a single integer — the minimum number of shots Han Solo needs to destroy all the stormtroopers.",
    "samples": [
        [
            "4 0 0\n1 1\n2 2\n2 0\n-1 -1\n",
            "2\n"
        ],
        [
            "2 1 2\n1 1\n1 0\n",
            "1\n"
        ]
    ],
    "hint": "Explanation to the first and second samples from the statement, respectively:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF514B/e0665254dc28c85d59225f8c53a8542938957367.png)",
    "translation": "# 题目描述\n\n有n个恐怖分子在站在一个平面上，每个恐怖分子都有一个位置坐标位置(x,y) 。现在有一个激光武器要用来消灭这些恐怖分子，这个武器所在的位置是(x0,y0)，激光武器每发射一次，就可以消灭一条直线上的所有恐怖分子。\n\n现在，你的任务是计算最少要动用多少次激光武器，才可以消灭所有的恐怖分子。\n\n# 输入输出数据\n\n## 输入数据\n\n第一行是3个整数n和x0,y0，分别表示恐怖分子的数量和武器所在的位置。(1<=n<=1000,-10000<=x0,y0<=1000)\n\n接下来N行，每行两个整数表示每个恐怖分子的坐标位置Xi和Yi，恐怖分子可能站在相同的位置，但是不可能站在武器的位置上。(-10000<=xi<=10000)\n\n## 输出数据\n\n输出最少需要使用激光武器的次数。\n\n# 说明\n\n样例1和样例2的情况如图所示:\n![](https://cdn.luogu.org/upload/vjudge_pic/CF514B/e0665254dc28c85d59225f8c53a8542938957367.png)"
}