{
    "description": "Drazil and Varda are the earthworm couple. They want to find a good place to bring up their children. They found a good ground containing nature hole. The hole contains many rooms, some pairs of rooms are connected by small tunnels such that earthworm can move between them.\n\nLet's consider rooms and small tunnels as the vertices and edges in a graph. This graph is a tree. In the other words, any pair of vertices has an unique path between them.\n\nEach room that is leaf in the graph is connected with a ground by a vertical tunnel. Here, leaf is a vertex that has only one outgoing edge in the graph.\n\nEach room is large enough only to fit one earthworm living in it. Earthworm can't live in a tunnel.\n\nDrazil and Varda have a plan to educate their children. They want all their children to do morning exercises immediately after getting up!\n\nWhen the morning is coming, all earthworm children get up in the same time, then each of them chooses the farthest path to the ground for gathering with others (these children are lazy, so they all want to do exercises as late as possible).\n\nDrazil and Varda want the difference between the time first earthworm child arrives outside and the time the last earthworm child arrives outside to be not larger than $ l $ (otherwise children will spread around the ground and it will be hard to keep them exercising together).\n\nAlso, The rooms that are occupied by their children should form a connected set. In the other words, for any two rooms that are occupied with earthworm children, all rooms that lie on the path between them should be occupied with earthworm children too.\n\nHow many children Drazil and Varda may have at most in order to satisfy all conditions above? Drazil and Varda want to know the answer for many different choices of $ l $ .\n\n(Drazil and Varda don't live in the hole with their children)",
    "inputFormat": "The first line contains one integer $ n $ denoting how many rooms there are in the hole ( $ 2<=n<=10^{5} $ ).\n\nThen there are $ n-1 $ lines following. Each of these lines contains three integers $ x $ , $ y $ , $ v $ ( $ 1<=x,y<=n $ , $ 1<=v<=10^{6} $ ) denoting there is a small tunnel between room $ x $ and room $ y $ that takes time $ v $ to pass.\n\nSuppose that the time for an earthworm to get out to the ground from any leaf room is the same.\n\nThe next line contains an integer $ q $ ( $ 1<=q<=50 $ ), denoting the number of different value of $ l $ you need to process.\n\nThe last line contains $ q $ numbers, each number denoting a value of $ l $ ( $ 1<=l<=10^{11} $ ).",
    "outputFormat": "You should print $ q $ lines. Each line should contain one integer denoting the answer for a corresponding value of $ l $ .",
    "samples": [
        [
            "5\n1 2 3\n2 3 4\n4 5 3\n3 4 2\n5\n1 2 3 4 5\n",
            "1\n3\n3\n3\n5\n"
        ],
        [
            "12\n5 9 3\n2 1 7\n11 7 2\n6 5 5\n2 5 3\n6 7 2\n1 4 4\n8 5 7\n1 3 8\n11 12 3\n10 8 2\n10\n13 14 14 13 13 4 6 7 2 1\n",
            "10\n10\n10\n10\n10\n3\n3\n5\n2\n1\n"
        ]
    ],
    "hint": "For the first sample the hole looks like the following. Rooms 1 and 5 are leaves, so they contain a vertical tunnel connecting them to the ground. The lengths of farthest path from rooms $ 1–5 $ to the ground are $ 12,9,7,9,12 $ respectively.\n\nIf l = 1, we may only choose any single room.\n\nIf l = 2..4, we may choose rooms 2, 3, and 4 as the answer.\n\nIf l = 5, we may choose all rooms.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF516D/7e38d1221e5eee1b5e202db37a2fe92e264256df.png)",
    "translation": "- 给定一棵 $n$ 个点的树，边有边权。\n- 定义 $f_x = \\max_{i=1}^n \\text{dist}(x,i)$。\n- $q$ 次询问最大的满足 $\\max_{x \\in s} f_x - \\min_{x \\in s} f_x \\le l$ 的连通块 $s$ 包含的点数。\n- $n \\le 10^5$，$q \\le 50$。"
}