{
    "description": "Watto, the owner of a spare parts store, has recently got an order for the mechanism that can process strings in a certain way. Initially the memory of the mechanism is filled with $ n $ strings. Then the mechanism should be able to process queries of the following type: \"Given string $ s $ , determine if the memory of the mechanism contains string $ t $ that consists of the same number of characters as $ s $ and differs from $ s $ in exactly one position\".\n\nWatto has already compiled the mechanism, all that's left is to write a program for it and check it on the data consisting of $ n $ initial lines and $ m $ queries. He decided to entrust this job to you.",
    "inputFormat": "The first line contains two non-negative numbers $ n $ and $ m $ ( $ 0<=n<=3·10^{5} $ , $ 0<=m<=3·10^{5} $ ) — the number of the initial strings and the number of queries, respectively.\n\nNext follow $ n $ non-empty strings that are uploaded to the memory of the mechanism.\n\nNext follow $ m $ non-empty strings that are the queries to the mechanism.\n\nThe total length of lines in the input doesn't exceed $ 6·10^{5} $ . Each line consists only of letters 'a', 'b', 'c'.",
    "outputFormat": "For each query print on a single line \"YES\" (without the quotes), if the memory of the mechanism contains the required string, otherwise print \"NO\" (without the quotes).",
    "samples": [
        [
            "2 3\naaaaa\nacacaca\naabaa\nccacacc\ncaaac\n",
            "YES\nNO\nNO\n"
        ]
    ],
    "hint": "",
    "translation": "给出n个已知字符串，m次询问，每次询问给出一个字符串，问上面n个字符串中是否有一个字符串满足恰好有一个字母不同于询问的字符串。（字符串的字符集为{'a','b','c'}）n,m<=3e5,输入总长度不超过6e5。"
}