{
    "description": "A and B are preparing themselves for programming contests.\n\nTo train their logical thinking and solve problems better, A and B decided to play chess. During the game A wondered whose position is now stronger.\n\nFor each chess piece we know its weight:\n\n- the queen's weight is 9,\n- the rook's weight is 5,\n- the bishop's weight is 3,\n- the knight's weight is 3,\n- the pawn's weight is 1,\n- the king's weight isn't considered in evaluating position.\n\nThe player's weight equals to the sum of weights of all his pieces on the board.\n\nAs A doesn't like counting, he asked you to help him determine which player has the larger position weight.",
    "inputFormat": "The input contains eight lines, eight characters each — the board's description.\n\nThe white pieces on the board are marked with uppercase letters, the black pieces are marked with lowercase letters.\n\nThe white pieces are denoted as follows: the queen is represented is 'Q', the rook — as 'R', the bishop — as'B', the knight — as 'N', the pawn — as 'P', the king — as 'K'.\n\nThe black pieces are denoted as 'q', 'r', 'b', 'n', 'p', 'k', respectively.\n\nAn empty square of the board is marked as '.' (a dot).\n\nIt is not guaranteed that the given chess position can be achieved in a real game. Specifically, there can be an arbitrary (possibly zero) number pieces of each type, the king may be under attack and so on.",
    "outputFormat": "Print \"White\" (without quotes) if the weight of the position of the white pieces is more than the weight of the position of the black pieces, print \"Black\" if the weight of the black pieces is more than the weight of the white pieces and print \"Draw\" if the weights of the white and black pieces are equal.",
    "samples": [
        [
            "...QK...\n........\n........\n........\n........\n........\n........\n...rk...\n",
            "White\n"
        ],
        [
            "rnbqkbnr\npppppppp\n........\n........\n........\n........\nPPPPPPPP\nRNBQKBNR\n",
            "Draw\n"
        ],
        [
            "rppppppr\n...k....\n........\n........\n........\n........\nK...Q...\n........\n",
            "Black\n"
        ]
    ],
    "hint": "In the first test sample the weight of the position of the white pieces equals to 9, the weight of the position of the black pieces equals 5.\n\nIn the second test sample the weights of the positions of the black and the white pieces are equal to 39.\n\nIn the third test sample the weight of the position of the white pieces equals to 9, the weight of the position of the black pieces equals to 16.",
    "translation": "题目描述\n\nA和B正在准备参加编程比赛。\n\n为了锻炼他们的逻辑思维能力从而更好地解决问题，A和B决定来下棋。在游戏期间，A突然想要知道哪位玩家占得了优势。\n\n对于每个棋子我们知道它们的权势值：\n\n皇后的值是9；\n车的值是5；\n象（相）的值是3；\n骑士的值也是3；\n卒（兵）的值是1；\n国王的值不考虑在优势评估中.\n一个玩家的优势值是他在棋盘上所有棋子权势值的总和。\n\n因为A不喜欢算数，所以他请求你告诉他哪位玩家的占有优势？（即优势值更大）\n\n输入格式\n\n输入一共八行，八列，描述这个棋盘。\n\n白方的棋子如要表示均用大写字母，黑方则用的是小写字母。\n\n白方棋子规定如下：皇后用Q表示，车用R表示，象用B表示，骑士用N表示，卒用P表示，国王用K表示。\n\n黑方棋子则相反，用小写字母：q,r,b,n,p,k。\n\n一个空的棋盘格子用\".\"（一个点）表示\n\n无需考虑棋盘上的情况能否在真实的游戏中实现，只需计算出优势总值再比较即可。\n\n输出格式\n\n如果白方的优势总值更大，则输出\"White\",如果黑方的优势总值更大，则输出\"Black\"。如果总值相等，那么请输出\"Draw\"。\n\n说明\n\n对于样例一，白方总值为9，黑方总值为5，所以输出\"White\"。\n\n对于样例二，两方总值均为39，输出\"Draw\"。\n\n对于样例三，白方总值为9，黑方总值为16，输出\"Black\"。\n\nTranslated by @lonelysir "
}