{
    "description": "On a certain meeting of a ruling party \"A\" minister Pavel suggested to improve the sewer system and to create a new pipe in the city.\n\nThe city is an $ n×m $ rectangular squared field. Each square of the field is either empty (then the pipe can go in it), or occupied (the pipe cannot go in such square). Empty squares are denoted by character ' $ . $ ', occupied squares are denoted by character ' $ # $ '.\n\nThe pipe must meet the following criteria:\n\n- the pipe is a polyline of width $ 1 $ ,\n- the pipe goes in empty squares,\n- the pipe starts from the edge of the field, but not from a corner square,\n- the pipe ends at the edge of the field but not in a corner square,\n- the pipe has at most $ 2 $ turns ( $ 90 $ degrees),\n- the border squares of the field must share exactly two squares with the pipe,\n- if the pipe looks like a single segment, then the end points of the pipe must lie on distinct edges of the field,\n- for each non-border square of the pipe there are exacly two side-adjacent squares that also belong to the pipe,\n- for each border square of the pipe there is exactly one side-adjacent cell that also belongs to the pipe.\n\nHere are some samples of allowed piping routes:\n\n`<br></br>           ....#            ....#            .*..#<br></br>           *****            ****.            .***.<br></br>           ..#..            ..#*.            ..#*.<br></br>           #...#            #..*#            #..*#<br></br>           .....            ...*.            ...*.<br></br>`Here are some samples of forbidden piping routes:\n\n`<br></br>           .**.#            *...#            .*.*#<br></br>           .....            ****.            .*.*.<br></br>           ..#..            ..#*.            .*#*.<br></br>           #...#            #..*#            #*.*#<br></br>           .....            ...*.            .***.<br></br>`In these samples the pipes are represented by characters ' $ * $ '.\n\nYou were asked to write a program that calculates the number of distinct ways to make exactly one pipe in the city.\n\nThe two ways to make a pipe are considered distinct if they are distinct in at least one square.",
    "inputFormat": "The first line of the input contains two integers $ n,m $ ( $ 2<=n,m<=2000 $ ) — the height and width of Berland map.\n\nEach of the next $ n $ lines contains $ m $ characters — the map of the city.\n\nIf the square of the map is marked by character ' $ . $ ', then the square is empty and the pipe can through it.\n\nIf the square of the map is marked by character ' $ # $ ', then the square is full and the pipe can't through it.",
    "outputFormat": "In the first line of the output print a single integer — the number of distinct ways to create a pipe.",
    "samples": [
        [
            "3 3\n...\n..#\n...\n",
            "3"
        ],
        [
            "4 2\n..\n..\n..\n..\n",
            "2\n"
        ],
        [
            "4 5\n#...#\n#...#\n###.#\n###.#\n",
            "4"
        ]
    ],
    "hint": "In the first sample there are 3 ways to make a pipe (the squares of the pipe are marked by characters ' $ * $ '):\n\n`<br></br>       .*.        .*.        ...<br></br>       .*#        **#        **#<br></br>       .*.        ...        .*.<br></br>`",
    "translation": "现在要在一个城市中铺设管道。\n\n这个城市是由 n×m 小方格组成的。每一个小方格要么是空的（管道可以铺设在上面），要么是实的（管道不能铺在上面）。空的用’.’表示，实的用’#’表示。\n\n管道铺设的规则如下：\n\n·        整条管道是形状是宽度为1的折线；\n\n·        管道只能铺设在空的格子上面；\n\n·        管道的两个端点只能在边缘上，但是不能在角上；\n\n·        管道最多只能转两个弯（90度）；\n\n·        在管道上的格子有且只能有两个是在边缘上的；\n\n·        如果管道是一条直线，那么他的两个端点必须是落在不同的边上；\n\n·        对于管道上的非边缘格子，每一个格子会有且仅有两个相邻的其它格子在管道上；\n\n·        对于管道上处于边缘的格子，仅有一个相邻的格子处于管道上。\n\n下面有一些合法的管道铺设例子：\n```\n....#           ....#            .*..#\n*****           ****.            .***.\n..#..           ..#*.            ..#*.\n#...#           #..*#            #..*#\n.....           ...*.            ...*.\n ```\n\n\n下面是一些非法铺设的例子：\n```\n.**.#            *...#            .*.*#\n.....            ****.            .*.*.\n..#..            ..#*.            .*#*.\n#...#            #..*#            #*.*#\n.....            ...*.            .***.\n \n```\n这些例子中管道用’*’表示。\n\n现在给定城市的地图，请计算一下有多少种方法铺设管道。\n\n样例解释：\n\n在第一个样例中，有三种方法铺设管道（管道用'*'表示）。\n\n```\n.*.        .*.        ...\n.*#        **#        **#\n.*.        ...        .*.\n```"
}