{
    "description": "Vitaly is a diligent student who never missed a lesson in his five years of studying in the university. He always does his homework on time and passes his exams in time.\n\nDuring the last lesson the teacher has provided two strings $ s $ and $ t $ to Vitaly. The strings have the same length, they consist of lowercase English letters, string $ s $ is lexicographically smaller than string $ t $ . Vitaly wondered if there is such string that is lexicographically larger than string $ s $ and at the same is lexicographically smaller than string $ t $ . This string should also consist of lowercase English letters and have the length equal to the lengths of strings $ s $ and $ t $ .\n\nLet's help Vitaly solve this easy problem!",
    "inputFormat": "The first line contains string $ s $ ( $ 1<=|s|<=100 $ ), consisting of lowercase English letters. Here, $ |s| $ denotes the length of the string.\n\nThe second line contains string $ t $ ( $ |t|=|s| $ ), consisting of lowercase English letters.\n\nIt is guaranteed that the lengths of strings $ s $ and $ t $ are the same and string $ s $ is lexicographically less than string $ t $ .",
    "outputFormat": "If the string that meets the given requirements doesn't exist, print a single string \"No such string\" (without the quotes).\n\nIf such string exists, print it. If there are multiple valid strings, you may print any of them.",
    "samples": [
        [
            "a\nc\n",
            "b\n"
        ],
        [
            "aaa\nzzz\n",
            "kkk\n"
        ],
        [
            "abcdefg\nabcdefh\n",
            "No such string\n"
        ]
    ],
    "hint": "String $ s=s_{1}s_{2}...\\ s_{n} $ is said to be lexicographically smaller than $ t=t_{1}t_{2}...\\ t_{n} $ , if there exists such $ i $ , that $ s_{1}=t_{1},s_{2}=t_{2},...\\ s_{i-1}=t_{i-1},s_{i}<t_{i} $ .",
    "translation": "维塔利是一个勤奋的学生，在大学阶段，他从来没有逃过一堂课。他总是按时做作业，并顺利通过考试。\n\n在上一节课，老师给了他两个字符串s和t。这两个字符串的长度相同，由小写英文字母组成，字符串s的字典序比串t小。维塔利想知道是否有这样的字符串：字典序比字符串s大，同时字典序小于串t。此字符串也应包括小写英文字母和相同的长度。\n\n让我们帮维塔利解决这个简单的问题！\n\n第一行包含字符串s（1≤|s| ≤100），由小写英文字母组成。这里，|s| 表示字符串s的长度。\n\n第二行包含字符串t（|t|=|s| ），由小写英文字母组成。\n\n保证字符串s和t的长度是相同的，字符串s字典顺序小于字符串t。\n\n如果满足要求的字符串不存在，则输出No such string。\n\n如果这样的字符串存在，就输出任何一个满足条件的字符串。( 也只能由小写英文字母a-z组成）\n\nTranslated by @馒头精"
}