{
    "description": "Polycarp loves geometric progressions — he collects them. However, as such progressions occur very rarely, he also loves the sequences of numbers where it is enough to delete a single element to get a geometric progression.\n\nIn this task we shall define geometric progressions as finite sequences of numbers $ a_{1},a_{2},...,a_{k} $ , where $ a_{i}=c·b^{i-1} $ for some real numbers $ c $ and $ b $ . For example, the sequences \\[2, -4, 8\\], \\[0, 0, 0, 0\\], \\[199\\] are geometric progressions and \\[0, 1, 2, 3\\] is not.\n\nRecently Polycarp has found a sequence and he can't classify it. Help him to do it. Determine whether it is a geometric progression. If it is not, check if it can become a geometric progression if an element is deleted from it.",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of elements in the given sequence. The second line contains the given sequence. The numbers are space-separated. All the elements of the given sequence are integers and their absolute value does not exceed $ 10^{4} $ .",
    "outputFormat": "Print 0, if the given sequence is a geometric progression. Otherwise, check if it is possible to make the sequence a geometric progression by deleting a single element. If it is possible, print 1. If it is impossible, print 2.",
    "samples": [
        [
            "4\n3 6 12 24\n",
            "0\n"
        ],
        [
            "4\n-8 -16 24 -32\n",
            "1\n"
        ],
        [
            "4\n0 1 2 3\n",
            "2\n"
        ]
    ],
    "hint": "",
    "translation": "题目描述：\r\n\r\nPolycarp 热爱几何级数以至于他爱好收集它们。但是，由于这类级数很少出现，他也喜欢仅仅删除一个元素就能得到几何级数的数字序列。\r\n\r\n在这个任务中，我们定义满足任意一项ai都能表示为\r\n$ c\\cdot b^{i-1} $\r\n的数列为几何级数的有限序列（b、c为实数）。\r\n\r\n例如，[2, -4, 8]、 [0, 0, 0, 0]、 [199] 为几何级数而 [0, 1, 2, 3] 不是。\r\n\r\n现在请你帮助Polycarp判断他最近找到的一个他不能马上确定是否满足上述条件的序列是否为几何级数的有限序列；如果不是，请你检查该序列是否能在删掉其中的一个元素后满足上述条件。\r\n\r\n输入格式：\r\n\r\n输入共两行，\r\n\r\n第一行：一个数n（序列总元素数）；\r\n\r\n第二行：n个数，$a_{1}$ 到$a_{n}$。\r\n\r\n满足$1\\le n\\le10^{5}$，$1\\le a_{i}\\le10^{4}$\r\n\r\n输出格式：\r\n\r\n输出共一行，\r\n\r\n第一行：一个数（0或1或2）\r\n\r\n如果输入数据构成几何级数，输出0；\r\n\r\n如果该序列能在删掉其中的一个元素后构成几何级数，输出1；\r\n\r\n如果该序列不能在删掉其中的一个元素后构成几何级数，输出2。\r\n"
}