{
    "description": "Spiders are Om Nom's old enemies. They love eating candies as much as he does and that's why they keep trying to keep the monster away from his favorite candies. They came up with an evil plan to trap Om Nom.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF526G/44f27cda6983115148a59558c8bccd72ee3d7aa7.png)Let's consider a rope structure consisting of $ n $ nodes and $ n-1 $ ropes connecting the nodes. The structure is connected, thus, the ropes and the nodes form a tree. Each rope of the formed structure is associated with its length. A candy is tied to node $ x $ of the structure. Om Nom really wants to eat this candy.\n\nThe $ y $ spiders are trying to stop him from doing it. They decided to entangle the candy and some part of the structure into a web, thus attaching the candy to as large as possible part of the rope structure.\n\nEach spider can use his web to cover all ropes on the path between two arbitrary nodes $ a $ and $ b $ . Thus, $ y $ spiders can cover the set of ropes which is a union of $ y $ paths in the given tree. These $ y $ paths can arbitrarily intersect each other. The spiders want the following conditions to be hold:\n\n- the node containing the candy is adjacent to at least one rope covered with a web\n- the ropes covered with the web form a connected structure (what's the idea of covering with a web the ropes that are not connected with the candy?)\n- the total length of the ropes covered with web is as large as possible\n\nThe spiders haven't yet decided to what node of the structure they will tie the candy and how many spiders will cover the structure with web, so they asked you to help them. Help them calculate the optimal plan for multiple values of $ x $ and $ y $ .",
    "inputFormat": "The first line contains numbers $ n $ and $ q $ ( $ 1<=n,q<=10^{5} $ ) — the number of nodes in the structure and the number of questions that the spiders want to ask you.\n\nThe next $ n-1 $ lines determine the rope structure. The $ i $ -th line contains three integers $ u_{i},v_{i},l_{i} $ ( $ 1<=u_{i},v_{i}<=n $ , $ u_{i}≠v_{i} $ , $ 1<=l_{i}<=1000 $ ), showing that there is a rope of length $ l_{i} $ between nodes $ u_{i} $ and $ v_{i} $ .\n\nNext $ q $ lines describe the spiders' questions. As they want you to answer their question online, they encoded their messages in a special manner.\n\nEach of the next $ q $ lines contains two numbers $ x_{i},y_{i} $ . In the first question of the spiders $ x=x_{1},y=y_{1} $ .\n\nTo calculate values $ x $ and $ y $ in the spiders' $ i $ -th ( $ 2<=i<=q $ ) question, you need to use the following formulas:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF526G/adc12a89d6c816fc5807b4763a577cb937b9373b.png)\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF526G/c2bf1635949bb80dc78f815463c3a976bfbbe0d9.png)\n\nwhere $ Ans_{i-1} $ is the total length of the ropes covered by a web in the answer for the $ (i-1) $ -th question.\n\nThe following inequality holds: $ 1<=x_{i},y_{i}<=n $ .",
    "outputFormat": "For each question of the spiders print on a separate line a single integer $ Ans_{i} $ — the total length of the ropes covered with web in the optimal plan.",
    "samples": [
        [
            "6 3\n1 2 2\n2 3 2\n3 4 2\n4 6 1\n3 5 10\n3 1\n2 5\n1 1\n",
            "14\n13\n17\n"
        ]
    ],
    "hint": "",
    "translation": "给定一棵 $n$ 个节点的无根树，每条边有边权。\n\n有 $q$ 次询问，每次询问给出 $x,y$，你需要选择 $y$ 条树上的路径，使这些路径形成一个包含 $x$ 的连通块，且连通块中包含的边权和最大。\n\n$n, q \\le 10^5$，强制在线。"
}