{
    "description": "Leonid wants to become a glass carver (the person who creates beautiful artworks by cutting the glass). He already has a rectangular $ w $ mm $ × $ $ h $ mm sheet of glass, a diamond glass cutter and lots of enthusiasm. What he lacks is understanding of what to carve and how.\n\nIn order not to waste time, he decided to practice the technique of carving. To do this, he makes vertical and horizontal cuts through the entire sheet. This process results in making smaller rectangular fragments of glass. Leonid does not move the newly made glass fragments. In particular, a cut divides each fragment of glass that it goes through into smaller fragments.\n\nAfter each cut Leonid tries to determine what area the largest of the currently available glass fragments has. Since there appear more and more fragments, this question takes him more and more time and distracts him from the fascinating process.\n\nLeonid offers to divide the labor — he will cut glass, and you will calculate the area of the maximum fragment after each cut. Do you agree?",
    "inputFormat": "The first line contains three integers $ w,h,n $ ( $ 2<=w,h<=200000 $ , $ 1<=n<=200000 $ ).\n\nNext $ n $ lines contain the descriptions of the cuts. Each description has the form $ H y $ or $ V x $ . In the first case Leonid makes the horizontal cut at the distance $ y $ millimeters ( $ 1<=y<=h-1 $ ) from the lower edge of the original sheet of glass. In the second case Leonid makes a vertical cut at distance $ x $ ( $ 1<=x<=w-1 $ ) millimeters from the left edge of the original sheet of glass. It is guaranteed that Leonid won't make two identical cuts.",
    "outputFormat": "After each cut print on a single line the area of the maximum available glass fragment in mm $ ^{2} $ .",
    "samples": [
        [
            "4 3 4\nH 2\nV 2\nV 3\nV 1\n",
            "8\n4\n4\n2\n"
        ],
        [
            "7 6 5\nH 4\nV 3\nV 5\nH 2\nV 1\n",
            "28\n16\n12\n6\n4\n"
        ]
    ],
    "hint": "Picture for the first sample test:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF527C/6468d2fd0321178fa316ccb774411f002769e9ee.png) Picture for the second sample test:  ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF527C/40ba2772b27431a21bc874ab308dc348ec8365fd.png)",
    "translation": "有一块w*h的玻璃,每次横着切一刀(H)或者竖着切一刀(V),没有两次相同的切割,求最大的矩形碎片面积。 样例中第一行是w,h(玻璃大小)和n(切割次数),字母后的数字表示距下边缘(H)/左边缘(V)的距离"
}