{
    "description": "After a hard day Vitaly got very hungry and he wants to eat his favorite potato pie. But it's not that simple. Vitaly is in the first room of the house with $ n $ room located in a line and numbered starting from one from left to right. You can go from the first room to the second room, from the second room to the third room and so on — you can go from the ( $ n-1 $ )-th room to the $ n $ -th room. Thus, you can go to room $ x $ only from room $ x-1 $ .\n\nThe potato pie is located in the $ n $ -th room and Vitaly needs to go there.\n\nEach pair of consecutive rooms has a door between them. In order to go to room $ x $ from room $ x-1 $ , you need to open the door between the rooms with the corresponding key.\n\nIn total the house has several types of doors (represented by uppercase Latin letters) and several types of keys (represented by lowercase Latin letters). The key of type $ t $ can open the door of type $ T $ if and only if $ t $ and $ T $ are the same letter, written in different cases. For example, key f can open door F.\n\nEach of the first $ n-1 $ rooms contains exactly one key of some type that Vitaly can use to get to next rooms. Once the door is open with some key, Vitaly won't get the key from the keyhole but he will immediately run into the next room. In other words, each key can open no more than one door.\n\nVitaly realizes that he may end up in some room without the key that opens the door to the next room. Before the start his run for the potato pie Vitaly can buy any number of keys of any type that is guaranteed to get to room $ n $ .\n\nGiven the plan of the house, Vitaly wants to know what is the minimum number of keys he needs to buy to surely get to the room $ n $ , which has a delicious potato pie. Write a program that will help Vitaly find out this number.",
    "inputFormat": "The first line of the input contains a positive integer $ n $ ( $ 2<=n<=10^{5} $ ) — the number of rooms in the house.\n\nThe second line of the input contains string $ s $ of length $ 2·n-2 $ . Let's number the elements of the string from left to right, starting from one.\n\nThe odd positions in the given string $ s $ contain lowercase Latin letters — the types of the keys that lie in the corresponding rooms. Thus, each odd position $ i $ of the given string $ s $ contains a lowercase Latin letter — the type of the key that lies in room number $ (i+1)/2 $ .\n\nThe even positions in the given string contain uppercase Latin letters — the types of doors between the rooms. Thus, each even position $ i $ of the given string $ s $ contains an uppercase letter — the type of the door that leads from room $ i/2 $ to room $ i/2+1 $ .",
    "outputFormat": "Print the only integer — the minimum number of keys that Vitaly needs to buy to surely get from room one to room $ n $ .",
    "samples": [
        [
            "3\naAbB\n",
            "0\n"
        ],
        [
            "4\naBaCaB\n",
            "3\n"
        ],
        [
            "5\nxYyXzZaZ\n",
            "2\n"
        ]
    ],
    "hint": "",
    "translation": "$n$ 个房间排成一行，从左到右编号 $1-n$ 。只能从房间 $x - 1$ 到房间 $x$ 。需要去那里第 $n$ 个房间。每一对连续的房间之间都有一扇门。房间有几种类型的门(用大写字母表示)和几种类型的钥匙(用小写字母表示)。当且仅当门的字母与钥匙的字母相同，大小写不同的情况下，才能打开相应的门。例如，f钥匙可以打开F门。每把钥匙只能打开一扇门。每经过一个房间可以拿到一个钥匙。\n\n求还需要多少把钥匙才能到达房间 $n$。\n\n第一行输入 $n$。\n\n第二行包含长度为$2\\times n - 2$的字符串 $s$。\n\n第 $i$ 个奇数位置都包含一个小写的字母代表房间号 $i$ 中的钥匙的类型。\n\n第 $i$ 个偶数位置都包含一个大写字母代表从房间 $i$ 到房间 $i + 1$ 的门的类型。"
}