{
    "description": "In this problem you will meet the simplified model of game King of Thieves.\n\nIn a new ZeptoLab game called \"King of Thieves\" your aim is to reach a chest with gold by controlling your character, avoiding traps and obstacles on your way.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF526A/527857f6180736c7bf1bfc93b9cfb6aa3a26550b.png)An interesting feature of the game is that you can design your own levels that will be available to other players. Let's consider the following simple design of a level.\n\nA dungeon consists of $ n $ segments located at a same vertical level, each segment is either a platform that character can stand on, or a pit with a trap that makes player lose if he falls into it. All segments have the same length, platforms on the scheme of the level are represented as '\\*' and pits are represented as '.'.\n\nOne of things that affects speedrun characteristics of the level is a possibility to perform a series of consecutive jumps of the same length. More formally, when the character is on the platform number $ i_{1} $ , he can make a sequence of jumps through the platforms $ i_{1}&lt;i_{2}&lt;...&lt;i_{k} $ , if $ i_{2}-i_{1}=i_{3}-i_{2}=...=i_{k}-i_{k-1} $ . Of course, all segments $ i_{1},i_{2},...\\ i_{k} $ should be exactly the platforms, not pits.\n\nLet's call a level to be good if you can perform a sequence of four jumps of the same length or in the other words there must be a sequence $ i_{1},i_{2},...,i_{5} $ , consisting of five platforms so that the intervals between consecutive platforms are of the same length. Given the scheme of the level, check if it is good.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=100 $ ) — the number of segments on the level.\n\nNext line contains the scheme of the level represented as a string of $ n $ characters '\\*' and '.'.",
    "outputFormat": "If the level is good, print the word \"yes\" (without the quotes), otherwise print the word \"no\" (without the quotes).",
    "samples": [
        [
            "16\n.**.*..*.***.**.\n",
            "yes"
        ],
        [
            "11\n.*.*...*.*.\n",
            "no"
        ]
    ],
    "hint": "In the first sample test you may perform a sequence of jumps through platforms $ 2,5,8,11,14 $ .",
    "translation": "给定一段路，其中有陷阱和平台，如果踩到陷阱就算输。在平台上可以跳跃到另一个向前的平台。如果从平台 $i$ 连续跳四次，且每次跳跃长度相等，则称为这是一次好的跳跃。\n\n现在给定一个长度为 $n$ 的字符串 $s$，其中 `.` 表示陷阱，`*` 表示平台，输出 $s$ 有无可能出现一次好的跳跃。"
}