{
    "description": "Finally it is a day when Arthur has enough money for buying an apartment. He found a great option close to the center of the city with a nice price.\n\nPlan of the apartment found by Arthur looks like a rectangle $ n×m $ consisting of squares of size $ 1×1 $ . Each of those squares contains either a wall (such square is denoted by a symbol \"\\*\" on the plan) or a free space (such square is denoted on the plan by a symbol \".\").\n\nRoom in an apartment is a maximal connected area consisting of free squares. Squares are considered adjacent if they share a common side.\n\nThe old Arthur dream is to live in an apartment where all rooms are rectangles. He asks you to calculate minimum number of walls you need to remove in order to achieve this goal. After removing a wall from a square it becomes a free square. While removing the walls it is possible that some rooms unite into a single one.",
    "inputFormat": "The first line of the input contains two integers $ n,m $ ( $ 1<=n,m<=2000 $ ) denoting the size of the Arthur apartments.\n\nFollowing $ n $ lines each contain $ m $ symbols — the plan of the apartment.\n\nIf the cell is denoted by a symbol \"\\*\" then it contains a wall.\n\nIf the cell is denoted by a symbol \".\" then it this cell is free from walls and also this cell is contained in some of the rooms.",
    "outputFormat": "Output $ n $ rows each consisting of $ m $ symbols that show how the Arthur apartment plan should look like after deleting the minimum number of walls in order to make each room (maximum connected area free from walls) be a rectangle.\n\nIf there are several possible answers, output any of them.",
    "samples": [
        [
            "5 5\n.*.*.\n*****\n.*.*.\n*****\n.*.*.\n",
            ".*.*.\n*****\n.*.*.\n*****\n.*.*.\n"
        ],
        [
            "6 7\n***.*.*\n..*.*.*\n*.*.*.*\n*.*.*.*\n..*...*\n*******\n",
            "***...*\n..*...*\n..*...*\n..*...*\n..*...*\n*******\n"
        ],
        [
            "4 5\n.....\n.....\n..***\n..*..\n",
            ".....\n.....\n.....\n.....\n"
        ]
    ],
    "hint": "",
    "translation": "给出一个n\\*m的矩阵，里面有“\\*”和“.”两种符号，要求把最少的“\\*”变成“.”，使得“.”的联通块构成一个矩形。求最少需要变几个“\\*”。"
}