{
    "description": "Analyzing the mistakes people make while typing search queries is a complex and an interesting work. As there is no guaranteed way to determine what the user originally meant by typing some query, we have to use different sorts of heuristics.\n\nPolycarp needed to write a code that could, given two words, check whether they could have been obtained from the same word as a result of typos. Polycarpus suggested that the most common typo is skipping exactly one letter as you type a word.\n\nImplement a program that can, given two distinct words $ S $ and $ T $ of the same length $ n $ determine how many words $ W $ of length $ n+1 $ are there with such property that you can transform $ W $ into both $ S $ , and $ T $ by deleting exactly one character. Words $ S $ and $ T $ consist of lowercase English letters. Word $ W $ also should consist of lowercase English letters.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=100000 $ ) — the length of words $ S $ and $ T $ .\n\nThe second line contains word $ S $ .\n\nThe third line contains word $ T $ .\n\nWords $ S $ and $ T $ consist of lowercase English letters. It is guaranteed that $ S $ and $ T $ are distinct words.",
    "outputFormat": "Print a single integer — the number of distinct words $ W $ that can be transformed to $ S $ and $ T $ due to a typo.",
    "samples": [
        [
            "7\nreading\ntrading\n",
            "1\n"
        ],
        [
            "5\nsweet\nsheep\n",
            "0\n"
        ],
        [
            "3\ntoy\ntry\n",
            "2\n"
        ]
    ],
    "hint": "In the first sample test the two given words could be obtained only from word \"treading\" (the deleted letters are marked in bold).\n\nIn the second sample test the two given words couldn't be obtained from the same word by removing one letter.\n\nIn the third sample test the two given words could be obtained from either word \"tory\" or word \"troy\".",
    "translation": "给你两个长度为 $n$ 的字符串 $S,T$，问是否有一个字符串 $W$ 使得 $S,T$ 均能通过 $W$ 删除一个字符得到。输出有多少个 $W$ 能满足题意。"
}