{
    "description": "Berlanders like to eat cones after a hard day. Misha Square and Sasha Circle are local authorities of Berland. Each of them controls its points of cone trade. Misha has $ n $ points, Sasha — $ m $ . Since their subordinates constantly had conflicts with each other, they decided to build a fence in the form of a circle, so that the points of trade of one businessman are strictly inside a circle, and points of the other one are strictly outside. It doesn't matter which of the two gentlemen will have his trade points inside the circle.\n\nDetermine whether they can build a fence or not.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ $ (1<=n,m<=10000) $ , numbers of Misha's and Sasha's trade points respectively.\n\nThe next $ n $ lines contains pairs of space-separated integers $ M_{x},M_{y} $ ( $ -10^{4}<=M_{x},M_{y}<=10^{4} $ ), coordinates of Misha's trade points.\n\nThe next $ m $ lines contains pairs of space-separated integers $ S_{x},S_{y} $ ( $ -10^{4}<=S_{x},S_{y}<=10^{4} $ ), coordinates of Sasha's trade points.\n\nIt is guaranteed that all $ n+m $ points are distinct.",
    "outputFormat": "The only output line should contain either word \"YES\" without quotes in case it is possible to build a such fence or word \"NO\" in the other case.",
    "samples": [
        [
            "2 2\n-1 0\n1 0\n0 -1\n0 1\n",
            "NO\n"
        ],
        [
            "4 4\n1 0\n0 1\n-1 0\n0 -1\n1 1\n-1 1\n-1 -1\n1 -1\n",
            "YES\n"
        ]
    ],
    "hint": "In the first sample there is no possibility to separate points, because any circle that contains both points $ (-1,0),(1,0) $ also contains at least one point from the set $ (0,-1),(0,1) $ , and vice-versa: any circle that contains both points $ (0,-1),(0,1) $ also contains at least one point from the set $ (-1,0),(1,0) $\n\nIn the second sample one of the possible solution is shown below. Misha's points are marked with red colour and Sasha's are marked with blue. ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF549E/7cc456c6f71deedb773a94ec144bb6683bf4aac0.png)",
    "translation": "- $n+m$ 个整点。\n- 询问是否存在一个圆将前 $n$ 个点和后 $m$ 个点严格分开。\n- $n,|x|,|y| \\le 10^4$。"
}