{
    "description": "You play a computer game. Your character stands on some level of a multilevel ice cave. In order to move on forward, you need to descend one level lower and the only way to do this is to fall through the ice.\n\nThe level of the cave where you are is a rectangular square grid of $ n $ rows and $ m $ columns. Each cell consists either from intact or from cracked ice. From each cell you can move to cells that are side-adjacent with yours (due to some limitations of the game engine you cannot make jumps on the same place, i.e. jump from a cell to itself). If you move to the cell with cracked ice, then your character falls down through it and if you move to the cell with intact ice, then the ice on this cell becomes cracked.\n\nLet's number the rows with integers from $ 1 $ to $ n $ from top to bottom and the columns with integers from $ 1 $ to $ m $ from left to right. Let's denote a cell on the intersection of the $ r $ -th row and the $ c $ -th column as $ (r,c) $ .\n\nYou are staying in the cell $ (r_{1},c_{1}) $ and this cell is cracked because you've just fallen here from a higher level. You need to fall down through the cell $ (r_{2},c_{2}) $ since the exit to the next level is there. Can you do this?",
    "inputFormat": "The first line contains two integers, $ n $ and $ m $ ( $ 1<=n,m<=500 $ ) — the number of rows and columns in the cave description.\n\nEach of the next $ n $ lines describes the initial state of the level of the cave, each line consists of $ m $ characters \".\" (that is, intact ice) and \"X\" (cracked ice).\n\nThe next line contains two integers, $ r_{1} $ and $ c_{1} $ ( $ 1<=r_{1}<=n,1<=c_{1}<=m $ ) — your initial coordinates. It is guaranteed that the description of the cave contains character 'X' in cell $ (r_{1},c_{1}) $ , that is, the ice on the starting cell is initially cracked.\n\nThe next line contains two integers $ r_{2} $ and $ c_{2} $ ( $ 1<=r_{2}<=n,1<=c_{2}<=m $ ) — the coordinates of the cell through which you need to fall. The final cell may coincide with the starting one.",
    "outputFormat": "If you can reach the destination, print 'YES', otherwise print 'NO'.",
    "samples": [
        [
            "4 6\nX...XX\n...XX.\n.X..X.\n......\n1 6\n2 2\n",
            "YES\n"
        ],
        [
            "5 4\n.X..\n...X\nX.X.\n....\n.XX.\n5 3\n1 1\n",
            "NO\n"
        ],
        [
            "4 7\n..X.XX.\n.XX..X.\nX...X..\nX......\n2 2\n1 6\n",
            "YES\n"
        ]
    ],
    "hint": "In the first sample test one possible path is:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540C/04413b66d79b896482294c7b0e49f648ef0d4aba.png)\n\nAfter the first visit of cell $ (2,2) $ the ice on it cracks and when you step there for the second time, your character falls through the ice as intended.",
    "translation": "### 题目描述\n\n你在一个 $n \\times m$ 的网格中，有些格子是完整的冰块，有些是破碎的冰块。如果你走到完整的冰块上，下一秒它会变成碎冰；如果你在碎冰上，你会掉下去。你不能在原地停留。\n\n现在你在 $(r_1,c_1)$ 上，保证该位置是一块碎冰。你要从 $(r_2,c_2)$ 掉下去，问是否可行。\n\n### 输入格式\n\n第一行，共两个整数 $n,m$，分别表示网格的行数和列数。  \n\n第 $2\\sim n+1$ 行，每行 $m$ 个字符，第 $i+1$ 行第 $j$ 个字符表示坐标 $(i,j)$ 的状态。字符 `.` 表示这个位置是完整的冰块，字符 `X` 则表示这个位置是一块碎冰。  \n\n第 $n+2$ 行，共两个整数 $r_1,c_1$，表示起点坐标。\n\n第 $n+3$ 行，共两个整数 $r_2,c_2$，表示终点坐标。\n\n ### 输出格式\n\n输出共一行，包含一个字符串 `YES` 或 `NO`，表示能否从终点掉下去。\n\n### 说明/提示\n\n$1 \\le n,m \\le 500$。  \n\n$1 \\le r_1,r_2 \\le n,1 \\le c_1,c_2 \\le m$。"
}