{
    "description": "Scrooge McDuck keeps his most treasured savings in a home safe with a combination lock. Each time he wants to put there the treasures that he's earned fair and square, he has to open the lock.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540A/bc30440b728dab506bc0137277173502d20b8841.png)The combination lock is represented by $ n $ rotating disks with digits from 0 to 9 written on them. Scrooge McDuck has to turn some disks so that the combination of digits on the disks forms a secret combination. In one move, he can rotate one disk one digit forwards or backwards. In particular, in one move he can go from digit 0 to digit 9 and vice versa. What minimum number of actions does he need for that?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=1000 $ ) — the number of disks on the combination lock.\n\nThe second line contains a string of $ n $ digits — the original state of the disks.\n\nThe third line contains a string of $ n $ digits — Scrooge McDuck's combination that opens the lock.",
    "outputFormat": "Print a single integer — the minimum number of moves Scrooge McDuck needs to open the lock.",
    "samples": [
        [
            "5\n82195\n64723\n",
            "13\n"
        ]
    ],
    "hint": "In the sample he needs 13 moves:\n\n- 1 disk: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540A/74b81554af4ec904c00ba445de691ffae11c433d.png)\n- 2 disk: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540A/f0e93fe15f009d2edfc9576e480c101f5ab03643.png)\n- 3 disk: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540A/21d65ec4d88e83fe36e0cd828b25bd9d0b7477a4.png)\n- 4 disk: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540A/59b1274875f62b1bcafaab3664524521999fe1f0.png)\n- 5 disk: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF540A/c41ce180478887e8a68b9ae3d8650975f2445329.png)",
    "translation": "Scrooge McDuck把他最珍贵的积蓄放在一个带组合锁的保险箱里。每次他想把自己赚来的钱放在那里，他都得打开锁。组合锁由n个旋转磁盘组成，每一个磁盘上可能是数字0到9中的任意一个。Scrooge McDuck必须转动一些磁盘，以便将磁盘上的数字旋转成正确密码。在每一次转动，他可以旋转一个磁盘使磁盘上的数字向前或向后。特别是，在一个动作中，他可以从数字0转到数字9，反之亦然。他需要多少次操作才能打开锁？"
}