{
    "description": "The first algorithm for detecting a face on the image working in realtime was developed by Paul Viola and Michael Jones in 2001. A part of the algorithm is a procedure that computes Haar features. As part of this task, we consider a simplified model of this concept.\n\nLet's consider a rectangular image that is represented with a table of size $ n×m $ . The table elements are integers that specify the brightness of each pixel in the image.\n\nA feature also is a rectangular table of size $ n×m $ . Each cell of a feature is painted black or white.\n\nTo calculate the value of the given feature at the given image, you must perform the following steps. First the table of the feature is put over the table of the image (without rotations or reflections), thus each pixel is entirely covered with either black or white cell. The value of a feature in the image is the value of $ W-B $ , where $ W $ is the total brightness of the pixels in the image, covered with white feature cells, and $ B $ is the total brightness of the pixels covered with black feature cells.\n\nSome examples of the most popular Haar features are given below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF549D/3d348e10da05febca9a35d1c282ccc79140e13d5.png)Your task is to determine the number of operations that are required to calculate the feature by using the so-called prefix rectangles.\n\nA prefix rectangle is any rectangle on the image, the upper left corner of which coincides with the upper left corner of the image.\n\nYou have a variable $ value $ , whose value is initially zero. In one operation you can count the sum of pixel values ​​at any prefix rectangle, multiply it by any integer and add to variable $ value $ .\n\nYou are given a feature. It is necessary to calculate the minimum number of operations required to calculate the values of this attribute at an arbitrary image. For a better understanding of the statement, read the explanation of the first sample.",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ m $ ( $ 1<=n,m<=100 $ ) — the number of rows and columns in the feature.\n\nNext $ n $ lines contain the description of the feature. Each line consists of $ m $ characters, the $ j $ -th character of the $ i $ -th line equals to \"W\", if this element of the feature is white and \"B\" if it is black.",
    "outputFormat": "Print a single number — the minimum number of operations that you need to make to calculate the value of the feature.",
    "samples": [
        [
            "6 8\nBBBBBBBB\nBBBBBBBB\nBBBBBBBB\nWWWWWWWW\nWWWWWWWW\nWWWWWWWW\n",
            "2\n"
        ],
        [
            "3 3\nWBW\nBWW\nWWW\n",
            "4\n"
        ],
        [
            "3 6\nWWBBWW\nWWBBWW\nWWBBWW\n",
            "3\n"
        ],
        [
            "4 4\nBBBB\nBBBB\nBBBB\nBBBW\n",
            "4\n"
        ]
    ],
    "hint": "The first sample corresponds to feature $ B $ , the one shown in the picture. The value of this feature in an image of size $ 6×8 $ equals to the difference of the total brightness of the pixels in the lower and upper half of the image. To calculate its value, perform the following two operations:\n\n1. add the sum of pixels in the prefix rectangle with the lower right corner in the $ 6 $ -th row and $ 8 $ -th column with coefficient $ 1 $ to the variable $ value $ (the rectangle is indicated by a red frame); ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF549D/2a4a67a2e1ced99b2d41037631914ffb613316f1.png)\n2. add the number of pixels in the prefix rectangle with the lower right corner in the $ 3 $ -rd row and $ 8 $ -th column with coefficient $ -2 $ and variable $ value $ . ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF549D/f32eba3b14c07c0be2e93f2b2793934534ce56fc.png)\n\nThus, all the pixels in the lower three rows of the image will be included with factor $ 1 $ , and all pixels in the upper three rows of the image will be included with factor $ 1-2=-1 $ , as required.",
    "translation": "有一个 $n\\times m$ 的矩阵，初始化为0，你可以将 $(1,1)$ 到 $(x,y)$ 的位置加上一个数(前缀矩阵)，要求变成给出的矩阵($B$ 表示-1，$W$ 表示1)（请结合样例食用）"
}