{
    "description": "Little Susie listens to fairy tales before bed every day. Today's fairy tale was about wood cutters and the little girl immediately started imagining the choppers cutting wood. She imagined the situation that is described below.\n\nThere are $ n $ trees located along the road at points with coordinates $ x_{1},x_{2},...,x_{n} $ . Each tree has its height $ h_{i} $ . Woodcutters can cut down a tree and fell it to the left or to the right. After that it occupies one of the segments $ [x_{i}-h_{i},x_{i}] $ or $ [x_{i};x_{i}+h_{i}] $ . The tree that is not cut down occupies a single point with coordinate $ x_{i} $ . Woodcutters can fell a tree if the segment to be occupied by the fallen tree doesn't contain any occupied point. The woodcutters want to process as many trees as possible, so Susie wonders, what is the maximum number of trees to fell.",
    "inputFormat": "The first line contains integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of trees.\n\nNext $ n $ lines contain pairs of integers $ x_{i},h_{i} $ ( $ 1<=x_{i},h_{i}<=10^{9} $ ) — the coordinate and the height of the $ і $ -th tree.\n\nThe pairs are given in the order of ascending $ x_{i} $ . No two trees are located at the point with the same coordinate.",
    "outputFormat": "Print a single number — the maximum number of trees that you can cut down by the given rules.",
    "samples": [
        [
            "5\n1 2\n2 1\n5 10\n10 9\n19 1\n",
            "3\n"
        ],
        [
            "5\n1 2\n2 1\n5 10\n10 9\n20 1\n",
            "4\n"
        ]
    ],
    "hint": "In the first sample you can fell the trees like that:\n\n- fell the $ 1 $ -st tree to the left — now it occupies segment $ [-1;1] $\n- fell the $ 2 $ -nd tree to the right — now it occupies segment $ [2;3] $\n- leave the $ 3 $ -rd tree — it occupies point $ 5 $\n- leave the $ 4 $ -th tree — it occupies point $ 10 $\n- fell the $ 5 $ -th tree to the right — now it occupies segment $ [19;20] $\n\nIn the second sample you can also fell $ 4 $ -th tree to the right, after that it will occupy segment $ [10;19] $ .",
    "translation": "给 $n$ 棵树在一维数轴上的坐标 $x_i$，以及它们的长度 $h_i$。现在要你砍倒这些树，树可以向左倒也可以向右倒，砍倒的树不能重合、当然也不能覆盖其他的树原来的位置，现在求最大可以砍倒的树的数目。\n\n$ 1 \\le n \\le {10}^5$\n\n$ 1 \\le x_i, h_i \\le {10}^9$"
}