{
    "description": "You have multiset of $ n $ strings of the same length, consisting of lowercase English letters. We will say that those strings are easy to remember if for each string there is some position $ i $ and some letter $ c $ of the English alphabet, such that this string is the only string in the multiset that has letter $ c $ in position $ i $ .\n\nFor example, a multiset of strings {\"abc\", \"aba\", \"adc\", \"ada\"} are not easy to remember. And multiset {\"abc\", \"ada\", \"ssa\"} is easy to remember because:\n\n- the first string is the only string that has character $ c $ in position $ 3 $ ;\n- the second string is the only string that has character $ d $ in position $ 2 $ ;\n- the third string is the only string that has character $ s $ in position $ 2 $ .\n\nYou want to change your multiset a little so that it is easy to remember. For $ a_{ij} $ coins, you can change character in the $ j $ -th position of the $ i $ -th string into any other lowercase letter of the English alphabet. Find what is the minimum sum you should pay in order to make the multiset of strings easy to remember.",
    "inputFormat": "The first line contains two integers $ n $ , $ m $ ( $ 1<=n,m<=20 $ ) — the number of strings in the multiset and the length of the strings respectively. Next $ n $ lines contain the strings of the multiset, consisting only of lowercase English letters, each string's length is $ m $ .\n\nNext $ n $ lines contain $ m $ integers each, the $ i $ -th of them contains integers $ a_{i1},a_{i2},...,a_{im} $ ( $ 0<=a_{ij}<=10^{6} $ ).",
    "outputFormat": "Print a single number — the answer to the problem.",
    "samples": [
        [
            "4 5\nabcde\nabcde\nabcde\nabcde\n1 1 1 1 1\n1 1 1 1 1\n1 1 1 1 1\n1 1 1 1 1\n",
            "3\n"
        ],
        [
            "4 3\nabc\naba\nadc\nada\n10 10 10\n10 1 10\n10 10 10\n10 1 10\n",
            "2\n"
        ],
        [
            "3 3\nabc\nada\nssa\n1 1 1\n1 1 1\n1 1 1\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "好记的字符串是n个字符串中，每一个字符串至少有一位是与众不同的。现在给你n个字符串，但是有的字符串不满足与众不同，让你修改某一个或者一些位置的字符串使得满足题意，每一个位置的修改都有对应的花费，问最少的花费是多少。"
}