{
    "description": "Giant chess is quite common in Geraldion. We will not delve into the rules of the game, we'll just say that the game takes place on an $ h×w $ field, and it is painted in two colors, but not like in chess. Almost all cells of the field are white and only some of them are black. Currently Gerald is finishing a game of giant chess against his friend Pollard. Gerald has almost won, and the only thing he needs to win is to bring the pawn from the upper left corner of the board, where it is now standing, to the lower right corner. Gerald is so confident of victory that he became interested, in how many ways can he win?\n\nThe pawn, which Gerald has got left can go in two ways: one cell down or one cell to the right. In addition, it can not go to the black cells, otherwise the Gerald still loses. There are no other pawns or pieces left on the field, so that, according to the rules of giant chess Gerald moves his pawn until the game is over, and Pollard is just watching this process.",
    "inputFormat": "The first line of the input contains three integers: $ h,w,n $ — the sides of the board and the number of black cells ( $ 1<=h,w<=10^{5},1<=n<=2000 $ ).\n\nNext $ n $ lines contain the description of black cells. The $ i $ -th of these lines contains numbers $ r_{i},c_{i} $ ( $ 1<=r_{i}<=h,1<=c_{i}<=w $ ) — the number of the row and column of the $ i $ -th cell.\n\nIt is guaranteed that the upper left and lower right cell are white and all cells in the description are distinct.",
    "outputFormat": "Print a single line — the remainder of the number of ways to move Gerald's pawn from the upper left to the lower right corner modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "3 4 2\n2 2\n2 3\n",
            "2\n"
        ],
        [
            "100 100 3\n15 16\n16 15\n99 88\n",
            "545732279\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个H*W的棋盘，棋盘上只有N个格子是黑色的，其他格子都是白色的。在棋盘左上角有一个卒，每一步可以向右或者向下移动一格，并且不能移动到黑色格子中。求这个卒从左上角移动到右下角，一共有多少种可能的路线。"
}