{
    "description": "Soon a school Olympiad in Informatics will be held in Berland, $ n $ schoolchildren will participate there.\n\nAt a meeting of the jury of the Olympiad it was decided that each of the $ n $ participants, depending on the results, will get a diploma of the first, second or third degree. Thus, each student will receive exactly one diploma.\n\nThey also decided that there must be given at least $ min_{1} $ and at most $ max_{1} $ diplomas of the first degree, at least $ min_{2} $ and at most $ max_{2} $ diplomas of the second degree, and at least $ min_{3} $ and at most $ max_{3} $ diplomas of the third degree.\n\nAfter some discussion it was decided to choose from all the options of distributing diplomas satisfying these limitations the one that maximizes the number of participants who receive diplomas of the first degree. Of all these options they select the one which maximizes the number of the participants who receive diplomas of the second degree. If there are multiple of these options, they select the option that maximizes the number of diplomas of the third degree.\n\nChoosing the best option of distributing certificates was entrusted to Ilya, one of the best programmers of Berland. However, he found more important things to do, so it is your task now to choose the best option of distributing of diplomas, based on the described limitations.\n\nIt is guaranteed that the described limitations are such that there is a way to choose such an option of distributing diplomas that all $ n $ participants of the Olympiad will receive a diploma of some degree.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 3<=n<=3·10^{6} $ ) — the number of schoolchildren who will participate in the Olympiad.\n\nThe next line of the input contains two integers $ min_{1} $ and $ max_{1} $ ( $ 1<=min_{1}<=max_{1}<=10^{6} $ ) — the minimum and maximum limits on the number of diplomas of the first degree that can be distributed.\n\nThe third line of the input contains two integers $ min_{2} $ and $ max_{2} $ ( $ 1<=min_{2}<=max_{2}<=10^{6} $ ) — the minimum and maximum limits on the number of diplomas of the second degree that can be distributed.\n\nThe next line of the input contains two integers $ min_{3} $ and $ max_{3} $ ( $ 1<=min_{3}<=max_{3}<=10^{6} $ ) — the minimum and maximum limits on the number of diplomas of the third degree that can be distributed.\n\nIt is guaranteed that $ min_{1}+min_{2}+min_{3}<=n<=max_{1}+max_{2}+max_{3} $ .",
    "outputFormat": "In the first line of the output print three numbers, showing how many diplomas of the first, second and third degree will be given to students in the optimal variant of distributing diplomas.\n\nThe optimal variant of distributing diplomas is the one that maximizes the number of students who receive diplomas of the first degree. Of all the suitable options, the best one is the one which maximizes the number of participants who receive diplomas of the second degree. If there are several of these options, the best one is the one that maximizes the number of diplomas of the third degree.",
    "samples": [
        [
            "6\n1 5\n2 6\n3 7\n",
            "1 2 3 \n"
        ],
        [
            "10\n1 2\n1 3\n1 5\n",
            "2 3 5 \n"
        ],
        [
            "6\n1 3\n2 2\n2 2\n",
            "2 2 2 \n"
        ]
    ],
    "hint": ""
}