{
    "description": "Amr lives in Lala Land. Lala Land is a very beautiful country that is located on a coordinate line. Lala Land is famous with its apple trees growing everywhere.\n\nLala Land has exactly $ n $ apple trees. Tree number $ i $ is located in a position $ x_{i} $ and has $ a_{i} $ apples growing on it. Amr wants to collect apples from the apple trees. Amr currently stands in $ x=0 $ position. At the beginning, he can choose whether to go right or left. He'll continue in his direction until he meets an apple tree he didn't visit before. He'll take all of its apples and then reverse his direction, continue walking in this direction until he meets another apple tree he didn't visit before and so on. In the other words, Amr reverses his direction when visiting each new apple tree. Amr will stop collecting apples when there are no more trees he didn't visit in the direction he is facing.\n\nWhat is the maximum number of apples he can collect?",
    "inputFormat": "The first line contains one number $ n $ ( $ 1<=n<=100 $ ), the number of apple trees in Lala Land.\n\nThe following $ n $ lines contains two integers each $ x_{i} $ , $ a_{i} $ ( $ -10^{5}<=x_{i}<=10^{5} $ , $ x_{i}≠0 $ , $ 1<=a_{i}<=10^{5} $ ), representing the position of the $ i $ -th tree and number of apples on it.\n\nIt's guaranteed that there is at most one apple tree at each coordinate. It's guaranteed that no tree grows in point $ 0 $ .",
    "outputFormat": "Output the maximum number of apples Amr can collect.",
    "samples": [
        [
            "2\n-1 5\n1 5\n",
            "10"
        ],
        [
            "3\n-2 2\n1 4\n-1 3\n",
            "9"
        ],
        [
            "3\n1 9\n3 5\n7 10\n",
            "9"
        ]
    ],
    "hint": "In the first sample test it doesn't matter if Amr chose at first to go left or right. In both cases he'll get all the apples.\n\nIn the second sample test the optimal solution is to go left to $ x=-1 $ , collect apples from there, then the direction will be reversed, Amr has to go to $ x=1 $ , collect apples from there, then the direction will be reversed and Amr goes to the final tree $ x=-2 $ .\n\nIn the third sample test the optimal solution is to go right to $ x=1 $ , collect apples from there, then the direction will be reversed and Amr will not be able to collect anymore apples because there are no apple trees to his left.",
    "translation": "Amr来到一条苹果道，这条道可以看成一条直线，Amr站在0点位置，他的左边是负方向，右边是正方向。这条线上有很多苹果树，Amr在一开始可以选择一个方向一直向前走，碰到xi位置上的苹果树，然后摘光该树上$ai$个苹果，之后掉头，反方向一直走，一直走到一棵新的苹果树，然后摘光其所有苹果，再反向一直走。。。 直到他走的方向上已经没有新的苹果树为止。\n\n问，Amr最多可以摘到多少苹果？"
}