{
    "description": "Professor GukiZ is concerned about making his way to school, because massive piles of boxes are blocking his way.\n\nIn total there are $ n $ piles of boxes, arranged in a line, from left to right, $ i $ -th pile ( $ 1<=i<=n $ ) containing $ a_{i} $ boxes. Luckily, $ m $ students are willing to help GukiZ by removing all the boxes from his way. Students are working simultaneously. At time $ 0 $ , all students are located left of the first pile. It takes one second for every student to move from this position to the first pile, and after that, every student must start performing sequence of two possible operations, each taking one second to complete. Possible operations are:\n\n1. If $ i≠n $ , move from pile $ i $ to pile $ i+1 $ ;\n2. If pile located at the position of student is not empty, remove one box from it.\n\nGukiZ's students aren't smart at all, so they need you to tell them how to remove boxes before professor comes (he is very impatient man, and doesn't want to wait). They ask you to calculate minumum time $ t $ in seconds for which they can remove all the boxes from GukiZ's way. Note that students can be positioned in any manner after $ t $ seconds, but all the boxes must be removed.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n,m<=10^{5} $ ), the number of piles of boxes and the number of GukiZ's students.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...\\ a_{n} $ ( $ 0<=a_{i}<=10^{9} $ ) where $ a_{i} $ represents the number of boxes on $ i $ -th pile. It's guaranteed that at least one pile of is non-empty.",
    "outputFormat": "In a single line, print one number, minimum time needed to remove all the boxes in seconds.",
    "samples": [
        [
            "2 1\n1 1\n",
            "4\n"
        ],
        [
            "3 2\n1 0 2\n",
            "5\n"
        ],
        [
            "4 100\n3 4 5 4\n",
            "5\n"
        ]
    ],
    "hint": "First sample: Student will first move to the first pile ( $ 1 $ second), then remove box from first pile ( $ 1 $ second), then move to the second pile ( $ 1 $ second) and finally remove the box from second pile ( $ 1 $ second).\n\nSecond sample: One of optimal solutions is to send one student to remove a box from the first pile and a box from the third pile, and send another student to remove a box from the third pile. Overall, $ 5 $ seconds.\n\nThird sample: With a lot of available students, send three of them to remove boxes from the first pile, four of them to remove boxes from the second pile, five of them to remove boxes from the third pile, and four of them to remove boxes from the fourth pile. Process will be over in $ 5 $ seconds, when removing the boxes from the last pile is finished.",
    "translation": "有$n$个位置$(1\\sim n)$，第$i$个位置上有$a_i$个箱子。有$m$个人，开始在$0$位置（即在$1$号位置左边），每一秒钟每个人都可以选择搬走自己位置上的一个箱子或向前走一步（即从位置$i$走到位置$i+1$）。问最少需要多少时间才可以将箱子全部搬完。\r\n\r\n输入第一行两个正整数$n, m(n, m\\le 10^5)$，第二行$n$个整数$a_i(0\\le a_i\\le 10^9)$。\r\n\r\n输出一行表示答案。"
}