{
    "description": "Recently, Vladimir got bad mark in algebra again. To avoid such unpleasant events in future he decided to train his arithmetic skills. He wrote four integer numbers $ a $ , $ b $ , $ c $ , $ d $ on the blackboard. During each of the next three minutes he took two numbers from the blackboard (not necessarily adjacent) and replaced them with their sum or their product. In the end he got one number. Unfortunately, due to the awful memory he forgot that number, but he remembers four original numbers, sequence of the operations and his surprise because of the very small result. Help Vladimir remember the forgotten number: find the smallest number that can be obtained from the original numbers by the given sequence of operations.",
    "inputFormat": "First line contains four integers separated by space: $ 0<=a,b,c,d<=1000 $ — the original numbers. Second line contains three signs ('+' or '\\*' each) separated by space — the sequence of the operations in the order of performing. ('+' stands for addition, '\\*' — multiplication)",
    "outputFormat": "Output one integer number — the minimal result which can be obtained.\n\nPlease, do not use %lld specificator to read or write 64-bit integers in C++. It is preffered to use cin (also you may use %I64d).",
    "samples": [
        [
            "1 1 1 1\n+ + *\n",
            "3\n"
        ],
        [
            "2 2 2 2\n* * +\n",
            "8\n"
        ],
        [
            "1 2 3 4\n* + +\n",
            "9\n"
        ]
    ],
    "hint": "",
    "translation": "现有4个整数(均小于等于1000)，并给出三个运算符(均为+或*)。要求每次取出不一定相邻的两个数，并依次使用给出的运算符对这两个数进行运算，并将结果当做一个新数如此操作，直到只剩下一个数为止。 编程求出最后剩下数的最小值。\n翻译贡献者UID：22930"
}