{
    "description": "An undirected graph is called  $ k $ -regular, if the degrees of all its vertices are equal $ k $ . An edge of a connected graph is called a bridge, if after removing it the graph is being split into two connected components.\n\nBuild a connected undirected $ k $ -regular graph containing at least one bridge, or else state that such graph doesn't exist.",
    "inputFormat": "The single line of the input contains integer $ k $ ( $ 1<=k<=100 $ ) — the required degree of the vertices of the regular graph.",
    "outputFormat": "Print \"NO\" (without quotes), if such graph doesn't exist.\n\nOtherwise, print \"YES\" in the first line and the description of any suitable graph in the next lines.\n\nThe description of the made graph must start with numbers $ n $ and $ m $ — the number of vertices and edges respectively.\n\nEach of the next $ m $ lines must contain two integers, $ a $ and $ b $ ( $ 1<=a,b<=n $ , $ a≠b $ ), that mean that there is an edge connecting the vertices $ a $ and $ b $ . A graph shouldn't contain multiple edges and edges that lead from a vertex to itself. A graph must be connected, the degrees of all vertices of the graph must be equal $ k $ . At least one edge of the graph must be a bridge. You can print the edges of the graph in any order. You can print the ends of each edge in any order.\n\nThe constructed graph must contain at most $ 10^{6} $ vertices and $ 10^{6} $ edges (it is guaranteed that if at least one graph that meets the requirements exists, then there also exists the graph with at most $ 10^{6} $ vertices and at most $ 10^{6} $ edges).",
    "samples": [
        [
            "1\n",
            "YES\n2 1\n1 2\n"
        ]
    ],
    "hint": "In the sample from the statement there is a suitable graph consisting of two vertices, connected by a single edge.",
    "translation": "给出一个$k$，构造一个无向图，使得每个点的度数为$k$，且存在一个桥\n\n$k \\leqslant 100$"
}