{
    "description": "Andrewid the Android is a galaxy-famous detective. In his free time he likes to think about strings containing zeros and ones.\n\nOnce he thought about a string of length $ n $ consisting of zeroes and ones. Consider the following operation: we choose any two adjacent positions in the string, and if one them contains 0, and the other contains 1, then we are allowed to remove these two digits from the string, obtaining a string of length $ n-2 $ as a result.\n\nNow Andreid thinks about what is the minimum length of the string that can remain after applying the described operation several times (possibly, zero)? Help him to calculate this number.",
    "inputFormat": "First line of the input contains a single integer $ n $ ( $ 1<=n<=2·10^{5} $ ), the length of the string that Andreid has.\n\nThe second line contains the string of length $ n $ consisting only from zeros and ones.",
    "outputFormat": "Output the minimum length of the string that may remain after applying the described operations several times.",
    "samples": [
        [
            "4\n1100\n",
            "0\n"
        ],
        [
            "5\n01010\n",
            "1\n"
        ],
        [
            "8\n11101111\n",
            "6\n"
        ]
    ],
    "hint": "In the first sample test it is possible to change the string like the following: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF556A/e043b6ec2c3e4a6d1dc601a796867b6d8b674d68.png).\n\nIn the second sample test it is possible to change the string like the following: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF556A/30be4362dc7c1bb4a027298eec85cb98382f032a.png).\n\nIn the third sample test it is possible to change the string like the following: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF556A/0236dc192d0b4a8b370a137592d21fbb4adabaef.png).",
    "translation": "# 题目描述\n安德鲁德是一位银河著名的侦探。 在空闲时间，他喜欢思考包含零和字符串的字符串。\n\n有一次，他想到了一串由零和一组成的长度为n的字符串。 考虑以下操作：我们在字符串中选择任意两个相邻的位置，如果其中一个包含0，另一个包含1，则允许从字符串中移除这两个数字，从而获得长度为n - 2的字符串，作为 结果。\n\n现在，安德鲁德考虑了多次应用所描述的操作（可能是零）后可以保留的字符串的最小长度是多少？ 帮助他计算这个数字。\n\n# 输入\n输入的第一行包含一个整数n（1≤n≤2.105），即Andreid所具有的字符串的长度。\n\n第二行包含长度为n的字符串，仅由0和1组成。\n\n# 输出\n输出多次应用描述的操作后可能保留的字符串的最小长度。\n\n感谢@HNYLMS_MuQiuFeng 提供的翻译"
}