{
    "description": "Amr loves Chemistry, and specially doing experiments. He is preparing for a new interesting experiment.\n\nAmr has $ n $ different types of chemicals. Each chemical $ i $ has an initial volume of $ a_{i} $ liters. For this experiment, Amr has to mix all the chemicals together, but all the chemicals volumes must be equal first. So his task is to make all the chemicals volumes equal.\n\nTo do this, Amr can do two different kind of operations.\n\n- Choose some chemical $ i $ and double its current volume so the new volume will be $ 2a_{i} $\n- Choose some chemical $ i $ and divide its volume by two (integer division) so the new volume will be ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF558C/2af906789c62f9845274f856d2f941f2357aa169.png)\n\nSuppose that each chemical is contained in a vessel of infinite volume. Now Amr wonders what is the minimum number of operations required to make all the chemicals volumes equal?",
    "inputFormat": "The first line contains one number $ n $ ( $ 1<=n<=10^{5} $ ), the number of chemicals.\n\nThe second line contains $ n $ space separated integers $ a_{i} $ ( $ 1<=a_{i}<=10^{5} $ ), representing the initial volume of the $ i $ -th chemical in liters.",
    "outputFormat": "Output one integer the minimum number of operations required to make all the chemicals volumes equal.",
    "samples": [
        [
            "3\n4 8 2\n",
            "2"
        ],
        [
            "3\n3 5 6\n",
            "5"
        ]
    ],
    "hint": "In the first sample test, the optimal solution is to divide the second chemical volume by two, and multiply the third chemical volume by two to make all the volumes equal $ 4 $ .\n\nIn the second sample test, the optimal solution is to divide the first chemical volume by two, and divide the second and the third chemical volumes by two twice to make all the volumes equal $ 1 $ .",
    "translation": "有n个数，你可以对每个数进行两种操作： \r\n1. 将一个数乘以2\r\n2. 将一个数变为其二分之一并向下取整\r\n\r\n问最少通过多少次操作可以将这些数的值变为全部相同。"
}