{
    "description": "Andrewid the Android is a galaxy-known detective. Now he is preparing a defense against a possible attack by hackers on a major computer network.\n\nIn this network are $ n $ vertices, some pairs of vertices are connected by $ m $ undirected channels. It is planned to transfer $ q $ important messages via this network, the $ i $ -th of which must be sent from vertex $ s_{i} $ to vertex $ d_{i} $ via one or more channels, perhaps through some intermediate vertices.\n\nTo protect against attacks a special algorithm was developed. Unfortunately it can be applied only to the network containing directed channels. Therefore, as new channels can't be created, it was decided for each of the existing undirected channels to enable them to transmit data only in one of the two directions.\n\nYour task is to determine whether it is possible so to choose the direction for each channel so that each of the $ q $ messages could be successfully transmitted.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ q $ ( $ 1<=n,m,q<=2·10^{5} $ ) — the number of nodes, channels and important messages.\n\nNext $ m $ lines contain two integers each, $ v_{i} $ and $ u_{i} $ ( $ 1<=v_{i},u_{i}<=n $ , $ v_{i}≠u_{i} $ ), that means that between nodes $ v_{i} $ and $ u_{i} $ is a channel. Between a pair of nodes can exist more than one channel.\n\nNext $ q $ lines contain two integers $ s_{i} $ and $ d_{i} $ ( $ 1<=s_{i},d_{i}<=n $ , $ s_{i}≠d_{i} $ ) — the numbers of the nodes of the source and destination of the corresponding message.\n\nIt is not guaranteed that in it initially possible to transmit all the messages.",
    "outputFormat": "If a solution exists, print on a single line \"Yes\" (without the quotes). Otherwise, print \"No\" (without the quotes).",
    "samples": [
        [
            "4 4 2\n1 2\n1 3\n2 3\n3 4\n1 3\n4 2\n",
            "Yes\n"
        ],
        [
            "3 2 2\n1 2\n3 2\n1 3\n2 1\n",
            "No\n"
        ],
        [
            "3 3 2\n1 2\n1 2\n3 2\n1 3\n2 1\n",
            "Yes\n"
        ]
    ],
    "hint": "In the first sample test you can assign directions, for example, as follows: $ 1→2 $ , $ 1→3 $ , $ 3→2 $ , $ 4→3 $ . Then the path for for the first message will be $ 1→3 $ , and for the second one — $ 4→3→2 $ .\n\nIn the third sample test you can assign directions, for example, as follows: $ 1→2 $ , $ 2→1 $ , $ 2→3 $ . Then the path for the first message will be $ 1→2→3 $ , and for the second one — $ 2→1 $ .",
    "translation": "- 给定一张 $n$ 个点 $m$ 条边的无向图。\n- 给定 $q$ 组有向点对 $(s, t)$。\n- 询问是否存在**使得所有 $s$ 都能到达 $t$** 的无向图中每条边的定向方案。\n- $n,m,q \\le 2 \\times 10^5$。"
}