{
    "description": "Andrewid the Android is a galaxy-famous detective. Now he is busy with a top secret case, the details of which are not subject to disclosure.\n\nHowever, he needs help conducting one of the investigative experiment. There are $ n $ pegs put on a plane, they are numbered from $ 1 $ to $ n $ , the coordinates of the $ i $ -th of them are $ (x_{i},0) $ . Then, we tie to the bottom of one of the pegs a weight on a tight rope of length $ l $ (thus, its coordinates will be equal to $ (x_{i},-l) $ , where $ i $ is the number of the used peg). Then the weight is pushed to the right, so that it starts to rotate counterclockwise. At the same time, if the weight during rotation touches some of the other pegs, it then begins to rotate around that peg. Suppose that each peg itself is very thin and does not affect the rope length while weight is rotating around it.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF555D/50cbc8df4ef0d8a7dfa4d90dd754748b19292d39.png)More formally, if at some moment the segment of the rope contains one or more pegs in addition to the peg around which the weight is rotating, the weight will then rotate around the farthermost one of them on a shorter segment of a rope. In particular, if the segment of the rope touches some peg by its endpoint, it is considered that the weight starts to rotate around that peg on a segment of the rope of length $ 0 $ .\n\nAt some moment the weight will begin to rotate around some peg, without affecting the rest of the pegs. Andrewid interested in determining the number of this peg.\n\nAndrewid prepared $ m $ queries containing initial conditions for pushing the weight, help him to determine for each of them, around what peg the weight will eventually rotate.",
    "inputFormat": "The first line contains integers $ n $ and $ m $ ( $ 1<=n,m<=2·10^{5} $ ) — the number of pegs and queries.\n\nThe next line contains $ n $ integers $ x_{1},x_{2},...,x_{n} $ ( $ -10^{9}<=x_{i}<=10^{9} $ ) — the coordinates of the pegs. It is guaranteed that the coordinates of all the pegs are distinct integers.\n\nNext $ m $ lines contain the descriptions of the queries of pushing the weight, each consists of two integers $ a_{i} $ ( $ 1<=a_{i}<=n $ ) and $ l_{i} $ ( $ 1<=l_{i}<=10^{9} $ ) — the number of the starting peg and the length of the rope.",
    "outputFormat": "Print $ m $ lines, the $ i $ -th line should contain the number of the peg around which the weight will eventually rotate after the $ i $ -th push.",
    "samples": [
        [
            "3 2\n0 3 5\n2 3\n1 8\n",
            "3\n2\n"
        ],
        [
            "4 4\n1 5 7 15\n1 4\n2 15\n3 16\n1 28\n",
            "2\n4\n3\n1\n"
        ]
    ],
    "hint": "Picture to the first sample test:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF555D/76d6d270b038aea45c4fa95d1689f4ace10c0785.png)\n\nPicture to the second sample test:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF555D/cb61b3785a110832a080aa98bd2a703e52e7cac4.png)\n\nNote that in the last query weight starts to rotate around the peg 1 attached to a rope segment of length 0."
}