{
    "description": "You have $ n $ problems. You have estimated the difficulty of the $ i $ -th one as integer $ c_{i} $ . Now you want to prepare a problemset for a contest, using some of the problems you've made.\n\nA problemset for the contest must consist of at least two problems. You think that the total difficulty of the problems of the contest must be at least $ l $ and at most $ r $ . Also, you think that the difference between difficulties of the easiest and the hardest of the chosen problems must be at least $ x $ .\n\nFind the number of ways to choose a problemset for the contest.",
    "inputFormat": "The first line contains four integers $ n $ , $ l $ , $ r $ , $ x $ ( $ 1<=n<=15 $ , $ 1<=l<=r<=10^{9} $ , $ 1<=x<=10^{6} $ ) — the number of problems you have, the minimum and maximum value of total difficulty of the problemset and the minimum difference in difficulty between the hardest problem in the pack and the easiest one, respectively.\n\nThe second line contains $ n $ integers $ c_{1},c_{2},...,c_{n} $ ( $ 1<=c_{i}<=10^{6} $ ) — the difficulty of each problem.",
    "outputFormat": "Print the number of ways to choose a suitable problemset for the contest.",
    "samples": [
        [
            "3 5 6 1\n1 2 3\n",
            "2\n"
        ],
        [
            "4 40 50 10\n10 20 30 25\n",
            "2\n"
        ],
        [
            "5 25 35 10\n10 10 20 10 20\n",
            "6\n"
        ]
    ],
    "hint": "In the first example two sets are suitable, one consisting of the second and third problem, another one consisting of all three problems.\n\nIn the second example, two sets of problems are suitable — the set of problems with difficulties 10 and 30 as well as the set of problems with difficulties 20 and 30.\n\nIn the third example any set consisting of one problem of difficulty 10 and one problem of difficulty 20 is suitable.",
    "translation": "有 $n$ 道题目，每道题目有一个难度值 $c_i$。\n\n你可以任意挑选其中的几道题，使得这几道题难度的总和大于等于 $l$ 且小于等于 $r$，并使最难的题的难度值与最简单的题的难度值之差的绝对值大于等于 $x$。\n\n请求出共有多少种选题的方法。"
}