{
    "description": "Living in Byteland was good enough to begin with, but the good king decided to please his subjects and to introduce a national language. He gathered the best of wise men, and sent an expedition to faraway countries, so that they would find out all about how a language should be designed.\n\nAfter some time, the wise men returned from the trip even wiser. They locked up for six months in the dining room, after which they said to the king: \"there are a lot of different languages, but almost all of them have letters that are divided into vowels and consonants; in a word, vowels and consonants must be combined correctly.\"\n\nThere are very many rules, all of them have exceptions, but our language will be deprived of such defects! We propose to introduce a set of formal rules of combining vowels and consonants, and include in the language all the words that satisfy them.\n\nThe rules of composing words are:\n\n- The letters are divided into vowels and consonants in some certain way;\n- All words have a length of exactly $ n $ ;\n- There are $ m $ rules of the form ( $ pos_{1},t_{1},pos_{2},t_{2} $ ). Each rule is: if the position $ pos_{1} $ has a letter of type $ t_{1} $ , then the position $ pos_{2} $ has a letter of type $ t_{2} $ .\n\nYou are given some string $ s $ of length $ n $ , it is not necessarily a correct word of the new language. Among all the words of the language that lexicographically not smaller than the string $ s $ , find the minimal one in lexicographic order.",
    "inputFormat": "The first line contains a single line consisting of letters 'V' (Vowel) and 'C' (Consonant), determining which letters are vowels and which letters are consonants. The length of this string $ l $ is the size of the alphabet of the new language ( $ 1<=l<=26 $ ). The first $ l $ letters of the English alphabet are used as the letters of the alphabet of the new language. If the $ i $ -th character of the string equals to 'V', then the corresponding letter is a vowel, otherwise it is a consonant.\n\nThe second line contains two integers $ n $ , $ m $ ( $ 1<=n<=200 $ , $ 0<=m<=4n(n-1) $ ) — the number of letters in a single word and the number of rules, correspondingly.\n\nNext $ m $ lines describe $ m $ rules of the language in the following format: $ pos_{1},t_{1},pos_{2},t_{2} $ ( $ 1<=pos_{1},pos_{2}<=n $ , $ pos_{1}≠pos_{2} $ , $t_1,t_2 \\in \\{V,C\\} $ ).\n\nThe last line contains string $ s $ of length $ n $ , consisting of the first $ l $ small letters of the English alphabet.\n\nIt is guaranteed that no two rules are the same.",
    "outputFormat": "Print a smallest word of a language that is lexicographically not smaller than $ s $ . If such words does not exist (for example, if the language has no words at all), print \"-1\" (without the quotes).",
    "samples": [
        [
            "VC\n2 1\n1 V 2 C\naa\n",
            "ab\n"
        ],
        [
            "VC\n2 1\n1 C 2 V\nbb\n",
            "-1\n"
        ],
        [
            "VCC\n4 3\n1 C 2 V\n2 C 3 V\n3 V 4 V\nabac\n",
            "acaa\n"
        ]
    ],
    "hint": "In the first test word \"aa\" is not a word of the language, but word \"ab\" is.\n\nIn the second test out of all four possibilities only word \"bb\" is not a word of a language, but all other words are lexicographically less, so there is no answer.\n\nIn the third test, due to the last rule, \"abac\" doesn't belong to the language (\"a\" is a vowel, \"c\" is a consonant). The only word with prefix \"ab\" that meets the given rules is \"abaa\". But it is less than \"abac\", so the answer will be \"acaa\"",
    "translation": "- 将 $\\texttt{a} \\sim \\texttt{a} + l - 1$ 这 $l$ 个字符分成 $\\texttt{V,C}$ 两个集合。\n- 你需要构造一个**长度为 $n$** 且**满足 $m$ 个限制**且**不小于另一个长度为 $n$ 的字符串 $s$** 的**最小**字符串。\n- 每一个限制为**若字符串的第 $p_1$ 个位置上的字符 $\\in t_1$，则第 $p_2$ 个位置上的字符 $\\in t_2$**。\n- $l \\le 26$，$n \\le 200$，$m \\le 4n(n-1)$。"
}