{
    "description": "Alice and Bob love playing one-dimensional battle ships. They play on the field in the form of a line consisting of $ n $ square cells (that is, on a $ 1×n $ table).\n\nAt the beginning of the game Alice puts $ k $ ships on the field without telling their positions to Bob. Each ship looks as a $ 1×a $ rectangle (that is, it occupies a sequence of $ a $ consecutive squares of the field). The ships cannot intersect and even touch each other.\n\nAfter that Bob makes a sequence of \"shots\". He names cells of the field and Alice either says that the cell is empty (\"miss\"), or that the cell belongs to some ship (\"hit\").\n\nBut here's the problem! Alice like to cheat. May be that is why she responds to each Bob's move with a \"miss\".\n\nHelp Bob catch Alice cheating — find Bob's first move, such that after it you can be sure that Alice cheated.",
    "inputFormat": "The first line of the input contains three integers: $ n $ , $ k $ and $ a $ ( $ 1<=n,k,a<=2·10^{5} $ ) — the size of the field, the number of the ships and the size of each ship. It is guaranteed that the $ n $ , $ k $ and $ a $ are such that you can put $ k $ ships of size $ a $ on the field, so that no two ships intersect or touch each other.\n\nThe second line contains integer $ m $ ( $ 1<=m<=n $ ) — the number of Bob's moves.\n\nThe third line contains $ m $ distinct integers $ x_{1},x_{2},...,x_{m} $ , where $ x_{i} $ is the number of the cell where Bob made the $ i $ -th shot. The cells are numbered from left to right from $ 1 $ to $ n $ .",
    "outputFormat": "Print a single integer — the number of such Bob's first move, after which you can be sure that Alice lied. Bob's moves are numbered from $ 1 $ to $ m $ in the order the were made. If the sought move doesn't exist, then print \"-1\".",
    "samples": [
        [
            "11 3 3\n5\n4 8 6 1 11\n",
            "3\n"
        ],
        [
            "5 1 3\n2\n1 5\n",
            "-1\n"
        ],
        [
            "5 1 3\n1\n3\n",
            "1\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\r\nAlice和Bob喜欢在$1\\times n$的表格中玩战舰游戏。游戏开始时，Alice有$k$艘战舰，每艘战舰长度为$a$，她需要把这些战舰不重叠且不相邻地放在格子中（不允许有两艘战舰的格子存在公共边）。但她并不会告诉Bob她放的位置。\r\n\r\n接下来，Bob会用$m$颗炮弹尝试打中Alice的战舰，每颗炮弹会选择一个格子打击。但由于Alice喜欢作弊，所以她不会告诉Bob什么时候击中了战舰。请你帮助Bob判断，在第几次发射炮弹后，Alice一定会有一艘战舰被击中。\r\n## 输入输出格式\r\n### 输入格式：\r\n第一行三个整数$n,k,a$，分别表示表格长度，Alice的战舰数，和每艘战舰的长度。\r\n\r\n接下来一行输入一个整数$m$，表示Bob的炮弹数量。\r\n\r\n后面$m$行，每行一个整数$x_i$，表示第$i$次选择打击的格子。\r\n\r\n### 输出格式：\r\n一行一个整数$ans$，表示在第$ans$次打击过后，Alice一定会受到打击。如果不存在这样的$ans$，则输出$-1$。\r\n\r\n## 数据范围\r\n$1 \\leq n,k,a \\leq 2 \\cdot 10^5$\r\n\r\n$m,x_i \\leq n$\r\n"
}