{
    "description": "Archaeologists found some information about an ancient land of Treeland. We know for sure that the Treeland consisted of $ n $ cities connected by the $ n-1 $ road, such that you can get from each city to any other one along the roads. However, the information about the specific design of roads in Treeland has been lost. The only thing that the archaeologists can use is the preserved information about near cities.\n\nTwo cities of Treeland were called near, if it were possible to move from one city to the other one by moving through at most two roads. Also, a city is considered near to itself. During the recent excavations archaeologists found a set of $ n $ notes, each of them represents a list of cities, near to some of the $ n $ cities of the country. However, unfortunately, none of the found records lets you understand in what order the cities go in the list and for which city in the list the near to it cities were listed.\n\nHelp the archaeologists and restore any variant of the map of Treeland that meets the found information.",
    "inputFormat": "The first line contains integer $ n $ ( $ 2<=n<=1000 $ ) — the number of cities in the country.\n\nNext $ n $ lines describe the found lists of near cities. Each list starts from number $ k $ ( $ 1<=k<=n $ ), representing the number of cities in the list followed by $ k $ city numbers. All numbers in each list are distinct.\n\nIt is guaranteed that the given information determines at least one possible road map.",
    "outputFormat": "Print $ n-1 $ pairs of numbers representing the roads of the country. The $ i $ -th line must contain two integers $ a_{i},b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ , $ a_{i}≠b_{i} $ ), showing that there is a road between cities $ a_{i} $ and $ b_{i} $ .\n\nThe answer you print must satisfy the description of close cities from the input. You may print the roads of the countries in any order. The cities that are connected by a road may also be printed in any order.\n\nIf there are multiple good answers, you may print any of them.",
    "samples": [
        [
            "5\n4 3 2 4 1\n5 5 3 2 4 1\n5 4 2 1 5 3\n4 2 1 4 3\n3 1 4 5\n",
            "1 4\n1 2\n1 3\n4 5\n"
        ],
        [
            "6\n5 6 1 3 4 2\n5 2 1 3 4 6\n6 3 6 2 5 4 1\n6 6 1 2 5 3 4\n3 5 2 4\n5 3 1 2 4 6\n",
            "2 4\n1 2\n2 3\n2 6\n4 5\n"
        ]
    ],
    "hint": "",
    "translation": "有一棵 $n$ 个点的树，你不知道这棵树的边是怎么连的。\n\n你得到了 $n$ 条关于每个点信息，每条信息记录了距离某一个点 $\\le 2$ 的所有点。\n\n但你不知道每条信息具体是哪个点的。\n\n你需要构造一棵满足这些信息的树。\n\n$n \\le 10^3$。"
}