{
    "description": "It’s riot time on football stadium Ramacana! Raging fans have entered the field and the police find themselves in a difficult situation. The field can be represented as a square in the coordinate system defined by two diagonal vertices in (0,0) and ( $ 10^{5} $ , $ 10^{5} $ ). The sides of that square are also considered to be inside the field, everything else is outside.\n\nIn the beginning, there are $ N $ fans on the field. For each fan we are given his speed, an integer $ v_{i} $ as well as his integer coordinates ( $ x_{i} $ , $ y_{i} $ ). A fan with those coordinates might move and after one second he might be at any point ( $ x_{i}+p $ , $ y_{i}+q $ ) where $ 0<=|p|+|q|<=v_{i} $ . $ p $ , $ q $ are both integers.\n\nPoints that go outside of the square that represents the field are excluded and all others have equal probability of being the location of that specific fan after one second.\n\nAndrej, a young and promising police officer, has sent a flying drone to take a photo of the riot from above. The drone’s camera works like this:\n\n1. It selects three points with integer coordinates such that there is a chance of a fan appearing there after one second. They must not be collinear or the camera won’t work. It is guaranteed that not all of the initial positions of fans will be on the same line.\n2. Camera focuses those points and creates a circle that passes through those three points. A photo is taken after one second (one second after the initial state).\n3. Everything that is on the circle or inside it at the moment of taking the photo (one second after focusing the points) will be on the photo.\n\nYour goal is to select those three points so that the expected number of fans seen on the photo is maximized. If there are more such selections, select those three points that give the circle with largest radius among them. If there are still more suitable selections, any one of them will be accepted. If your answer follows conditions above and radius of circle you return is smaller then the optimal one by 0.01, your output will be considered as correct.\n\nNo test will have optimal radius bigger than $ 10^{10} $ .",
    "inputFormat": "The first line contains the number of fans on the field, $ N $ . The next $ N $ lines contain three integers: $ x_{i} $ , $ y_{i} $ , $ v_{i} $ . They are the $ x $ -coordinate, $ y $ -coordinate and speed of fan $ i $ at the beginning of the one second interval considered in the task.\n\n- $ 3<=N<=10^{5} $\n- $ 0<=x_{i},y_{i}<=10^{5} $\n- $ 0<=v_{i}<=1000 $\n- All numbers are integers",
    "outputFormat": "You need to output the three points that camera needs to select. Print them in three lines, with every line containing the $ x $ -coordinate, then $ y $ -coordinate, separated by a single space. The order of points does not matter.",
    "samples": [
        [
            "3\n1 1 1\n1 1 1\n1 2 1\n",
            "2 2\n2 1\n1 0\n"
        ]
    ],
    "hint": "",
    "translation": "- 给定整点集 $\\mathcal S = \\{(x,y)|x,y \\in [0,10^5]\\}$。\n- 给定另外 $n$ 个整点集 $\\mathcal P_{1\\dots n}$，对于 $i \\in [1,n]$，给定 $x_i,y_i,v_i$，$\\mathcal P_i = \\mathcal S \\cap \\{(x,y)||x-x_i|+|y-y_i| \\in [0,v_i]\\}$。\n- 有 $n$ 个整点 $p_{1\\dots n}$，对于 $i \\in [1,n]$，$p_i$ 在 $\\mathcal P_i$ 中等概率随机。\n- 你需要从点集 $\\bigcup_{i=1}^n \\mathcal P_i$ 中选择三个不共线的点，使这三个点的外接圆期望所覆盖（包括圆周上）的 $p$ 点最多。如果有多种方案，则要求这个外接圆的半径最大。如果还有多种方案，任何一种都可以。\n- 你求出的半径与答案的误差应 $\\le 0.01$，答案的半径 $\\le 10^{10}$。\n- $n \\le 10^5$，$(x_i,y_i) \\in \\mathcal S$ 且不全都共线，$v_i \\le 10^3$。"
}