{
    "description": "Do you know a story about the three musketeers? Anyway, you will learn about its origins now.\n\nRichelimakieu is a cardinal in the city of Bearis. He is tired of dealing with crime by himself. He needs three brave warriors to help him to fight against bad guys.\n\nThere are $ n $ warriors. Richelimakieu wants to choose three of them to become musketeers but it's not that easy. The most important condition is that musketeers must know each other to cooperate efficiently. And they shouldn't be too well known because they could be betrayed by old friends. For each musketeer his recognition is the number of warriors he knows, excluding other two musketeers.\n\nHelp Richelimakieu! Find if it is possible to choose three musketeers knowing each other, and what is minimum possible sum of their recognitions.",
    "inputFormat": "The first line contains two space-separated integers, $ n $ and $ m $ ( $ 3<=n<=4000 $ , $ 0<=m<=4000 $ ) — respectively number of warriors and number of pairs of warriors knowing each other.\n\n $ i $ -th of the following $ m $ lines contains two space-separated integers $ a_{i} $ and $ b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ , $ a_{i}≠b_{i} $ ). Warriors $ a_{i} $ and $ b_{i} $ know each other. Each pair of warriors will be listed at most once.",
    "outputFormat": "If Richelimakieu can choose three musketeers, print the minimum possible sum of their recognitions. Otherwise, print \"-1\" (without the quotes).",
    "samples": [
        [
            "5 6\n1 2\n1 3\n2 3\n2 4\n3 4\n4 5\n",
            "2\n"
        ],
        [
            "7 4\n2 1\n3 6\n5 1\n1 7\n",
            "-1\n"
        ]
    ],
    "hint": "In the first sample Richelimakieu should choose a triple $ 1 $ , $ 2 $ , $ 3 $ . The first musketeer doesn't know anyone except other two musketeers so his recognition is $ 0 $ . The second musketeer has recognition $ 1 $ because he knows warrior number $ 4 $ . The third musketeer also has recognition $ 1 $ because he knows warrior $ 4 $ . Sum of recognitions is $ 0+1+1=2 $ .\n\nThe other possible triple is $ 2,3,4 $ but it has greater sum of recognitions, equal to $ 1+1+1=3 $ .\n\nIn the second sample there is no triple of warriors knowing each other.",
    "translation": "给你一张n点m边的无向图，要求你找出三个点，要求:\r\n\r\n1. 它们组成了一个环\r\n\r\n2. **除了其他两个点**，每个点的邻居个数总和要求最少\r\n\r\n如果你能找出这三个点，输出这3个点的邻居（**除了其他两个点**）之和\r\n\r\n如果你一个点也没找着，输出-1\r\n\r\n(3<=n<=4000,0<=m<=4000) （1<=ai,bi<=n）"
}