{
    "description": "There is a programing contest named SnakeUp, $ 2n $ people want to compete for it. In order to attend this contest, people need to form teams of exactly two people. You are given the strength of each possible combination of two people. All the values of the strengths are distinct.\n\nEvery contestant hopes that he can find a teammate so that their team’s strength is as high as possible. That is, a contestant will form a team with highest strength possible by choosing a teammate from ones who are willing to be a teammate with him/her. More formally, two people $ A $ and $ B $ may form a team if each of them is the best possible teammate (among the contestants that remain unpaired) for the other one.\n\nCan you determine who will be each person’s teammate?",
    "inputFormat": "There are $ 2n $ lines in the input.\n\nThe first line contains an integer $ n $ ( $ 1<=n<=400 $ ) — the number of teams to be formed.\n\nThe $ i $ -th line ( $ i&gt;1 $ ) contains $ i-1 $ numbers $ a_{i1} $ , $ a_{i2} $ , ... , $ a_{i(i-1)} $ . Here $ a_{ij} $ ( $ 1<=a_{ij}<=10^{6} $ , all $ a_{ij} $ are distinct) denotes the strength of a team consisting of person $ i $ and person $ j $ (people are numbered starting from $ 1 $ .)",
    "outputFormat": "Output a line containing $ 2n $ numbers. The $ i $ -th number should represent the number of teammate of $ i $ -th person.",
    "samples": [
        [
            "2\n6\n1 2\n3 4 5\n",
            "2 1 4 3\n"
        ],
        [
            "3\n487060\n3831 161856\n845957 794650 976977\n83847 50566 691206 498447\n698377 156232 59015 382455 626960\n",
            "6 5 4 3 2 1\n"
        ]
    ],
    "hint": "In the first sample, contestant $ 1 $ and $ 2 $ will be teammates and so do contestant $ 3 $ and $ 4 $ , so the teammate of contestant $ 1 $ , $ 2 $ , $ 3 $ , $ 4 $ will be $ 2 $ , $ 1 $ , $ 4 $ , $ 3 $ respectively.",
    "translation": "**有一个程序竞赛，名为snakeup，2n2n人想竞争它。为了参加这次比赛，人们需要组成两个人的队伍。你被赋予了两个人每一个可能组合的力量。优势的所有价值观都是不同的。\r\n\r\n每个参赛者都希望他能找到一个队友，这样他们的队伍的力量就越大。也就是说，参赛者将从愿意与他/她一起成为队友的人中选择一个尽可能强大的队友，组成一个团队。更正式地说，两个人A和B可以组成一个团队，如果他们每个人都是另一个人最好的队友（在没有比赛的参赛者中）。\r\n\r\n你能确定谁是每个人的队友吗？**"
}