{
    "description": "People in BubbleLand like to drink beer. Little do you know, beer here is so good and strong that every time you drink it your speed goes 10 times slower than before you drank it.\n\nBirko lives in city Beergrade, but wants to go to city Beerburg. You are given a road map of BubbleLand and you need to find the fastest way for him. When he starts his journey in Beergrade his speed is 1. When he comes to a new city he always tries a glass of local beer, which divides his speed by 10.\n\nThe question here is what the minimal time for him to reach Beerburg is. If there are several paths with the same minimal time, pick the one that has least roads on it. If there is still more than one path, pick any.\n\nIt is guaranteed that there will be at least one path from Beergrade to Beerburg.",
    "inputFormat": "The first line of input contains integer $ N $ — the number of cities in Bubbleland and integer $ M $ — the number of roads in this country. Cities are enumerated from 0 to $ N-1 $ , with city 0 being Beergrade, and city $ N-1 $ being Beerburg. Each of the following $ M $ lines contains three integers $ a $ , $ b $ ( $ a≠b $ ) and $ len $ . These numbers indicate that there is a bidirectional road between cities $ a $ and $ b $ with length $ len $ .\n\n- $ 2<=N<=10^{5} $\n- $ 1<=M<=10^{5} $\n- $ 0<=len<=9 $\n- There is at most one road between two cities",
    "outputFormat": "The first line of output should contain minimal time needed to go from Beergrade to Beerburg.\n\nThe second line of the output should contain the number of cities on the path from Beergrade to Beerburg that takes minimal time.\n\nThe third line of output should contain the numbers of cities on this path in the order they are visited, separated by spaces.",
    "samples": [
        [
            "8 10\n0 1 1\n1 2 5\n2 7 6\n0 3 2\n3 7 3\n0 4 0\n4 5 0\n5 7 2\n0 6 0\n6 7 7\n",
            "32\n3\n0 3 7\n"
        ]
    ],
    "hint": "",
    "translation": "现在有 $n$ 个点，$m$ 条无向边组成的无向图，每条边有一个权值 $len$。节点编号从 $0\\cdots n-1$。\n\n已知初始速度为 $1$，每到一个点速度会变为原来的十分之一。求最少要花多少时间从 $0$ 号点到 $n-1$ 号点。\n\n输出第一行最少时间，第二行经过的结点数，第三行输出路径。在最小化时间前提下最小化路径长度，多条最短路径任意选取。"
}