{
    "description": "Alena has successfully passed the entrance exams to the university and is now looking forward to start studying.\n\nOne two-hour lesson at the Russian university is traditionally called a pair, it lasts for two academic hours (an academic hour is equal to 45 minutes).\n\nThe University works in such a way that every day it holds exactly $ n $ lessons. Depending on the schedule of a particular group of students, on a given day, some pairs may actually contain classes, but some may be empty (such pairs are called breaks).\n\nThe official website of the university has already published the schedule for tomorrow for Alena's group. Thus, for each of the $ n $ pairs she knows if there will be a class at that time or not.\n\nAlena's House is far from the university, so if there are breaks, she doesn't always go home. Alena has time to go home only if the break consists of at least two free pairs in a row, otherwise she waits for the next pair at the university.\n\nOf course, Alena does not want to be sleepy during pairs, so she will sleep as long as possible, and will only come to the first pair that is presented in her schedule. Similarly, if there are no more pairs, then Alena immediately goes home.\n\nAlena appreciates the time spent at home, so she always goes home when it is possible, and returns to the university only at the beginning of the next pair. Help Alena determine for how many pairs she will stay at the university. Note that during some pairs Alena may be at the university waiting for the upcoming pair.",
    "inputFormat": "The first line of the input contains a positive integer $ n $ ( $ 1<=n<=100 $ ) — the number of lessons at the university.\n\nThe second line contains $ n $ numbers $ a_{i} $ ( $ 0<=a_{i}<=1 $ ). Number $ a_{i} $ equals $ 0 $ , if Alena doesn't have the $ i $ -th pairs, otherwise it is equal to $ 1 $ . Numbers $ a_{1},a_{2},...,a_{n} $ are separated by spaces.",
    "outputFormat": "Print a single number — the number of pairs during which Alena stays at the university.",
    "samples": [
        [
            "5\n0 1 0 1 1\n",
            "4\n"
        ],
        [
            "7\n1 0 1 0 0 1 0\n",
            "4\n"
        ],
        [
            "1\n0\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample Alena stays at the university from the second to the fifth pair, inclusive, during the third pair she will be it the university waiting for the next pair.\n\nIn the last sample Alena doesn't have a single pair, so she spends all the time at home.",
    "translation": "给你一个长度为$n$的用空格分开的$01$串，问其中$1$的个数和被夹在两个$1$之间的$0$的个数的总和。"
}