{
    "description": "A gourmet came into the banquet hall, where the cooks suggested $ n $ dishes for guests. The gourmet knows the schedule: when each of the dishes will be served.\n\nFor $ i $ -th of the dishes he knows two integer moments in time $ a_{i} $ and $ b_{i} $ (in seconds from the beginning of the banquet) — when the cooks will bring the $ i $ -th dish into the hall and when they will carry it out ( $ a_{i}&lt;b_{i} $ ). For example, if $ a_{i}=10 $ and $ b_{i}=11 $ , then the $ i $ -th dish is available for eating during one second.\n\nThe dishes come in very large quantities, so it is guaranteed that as long as the dish is available for eating (i. e. while it is in the hall) it cannot run out.\n\nThe gourmet wants to try each of the $ n $ dishes and not to offend any of the cooks. Because of that the gourmet wants to eat each of the dishes for the same amount of time. During eating the gourmet can instantly switch between the dishes. Switching between dishes is allowed for him only at integer moments in time. The gourmet can eat no more than one dish simultaneously. It is allowed to return to a dish after eating any other dishes.\n\nThe gourmet wants to eat as long as possible on the banquet without violating any conditions described above. Can you help him and find out the maximum total time he can eat the dishes on the banquet?",
    "inputFormat": "The first line of input contains an integer $ n $ $ (1<=n<=100) $ — the number of dishes on the banquet.\n\nThe following $ n $ lines contain information about availability of the dishes. The $ i $ -th line contains two integers $ a_{i} $ and $ b_{i} $ $ (0<=a_{i}&lt;b_{i}<=10000) $ — the moments in time when the $ i $ -th dish becomes available for eating and when the $ i $ -th dish is taken away from the hall.",
    "outputFormat": "Output should contain the only integer — the maximum total time the gourmet can eat the dishes on the banquet.\n\nThe gourmet can instantly switch between the dishes but only at integer moments in time. It is allowed to return to a dish after eating any other dishes. Also in every moment in time he can eat no more than one dish.",
    "samples": [
        [
            "3\n2 4\n1 5\n6 9\n",
            "6\n"
        ],
        [
            "3\n1 2\n1 2\n1 2\n",
            "0\n"
        ]
    ],
    "hint": "In the first example the gourmet eats the second dish for one second (from the moment in time 1 to the moment in time 2), then he eats the first dish for two seconds (from 2 to 4), then he returns to the second dish for one second (from 4 to 5). After that he eats the third dish for two seconds (from 6 to 8).\n\nIn the second example the gourmet cannot eat each dish for at least one second because there are three dishes but they are available for only one second (from 1 to 2).",
    "translation": "A君受邀参加了一场宴会。宴会前他看起了菜单。\r\n\r\nA君得知宴会上共有n道菜，第i道菜将会在时刻ai端上餐桌，在时刻bi撤下。在[ai,bi）这段时间内的整时刻，A君都可以吃到这道菜。\r\n\r\nA君不想得罪任何一位厨师，因此他决定在宴会上，每一道菜都吃一样的分量。\r\n\r\n更具体的，每一个整时刻，A君都可以选择吃恰好一道菜或不吃任何菜，若吃菜则他可以选择任意一道当前在餐桌上的菜并吃恰好一份。最后需要满足所有上过的菜A君都会吃一样的份数。\r\n\r\n请你告诉A君在满足条件的情况下他最多能吃到多少份菜。"
}