{
    "description": "Inspired by success of Joanne Rowling and her fantasy series of Harry Potter, Polycarp decided to create his own masterpiece. He has already picked a name for his future bestseller — string $ s $ .\n\nPolycarp faced a number of difficulties while he was working on the main story of his book so he decided to become Malevich in a literature and create his own \"Black Square\".\n\nChapters of his masterpiece were written by Polycarp in $ n $ days. He started from writing down the string $ s $ . Every day (during the following $ n $ days) he did the following procedure: on the $ i $ -th day he added to the right of current text $ t $ its $ k_{i} $ -th circular shift. It means that every day content of his masterpiece doubled in size.\n\nCircular shift of a string $ r $ is defined as a string resulted after movement of the last character of $ r $ to the first position in the string. As an example: circular shift of «masterpiece» is «emasterpiec». The $ i $ -th circular shift of a string $ r $ is defined as a string resulted after applying $ i $ subsequent circular shifts of the string $ r $ (e.g., the third circular shift of «masterpiece» is «ecemasterpi»).\n\nAfter $ n $ days of tedious work Polycarp managed to write a very long text deserving the efforts made. However, text of his masterpiece was so long that it was nearly impossible to do any analysis of its content.\n\nHelp Polycarp to answer $ m $ requests about his masterpiece: for the $ j $ -th request you will need to find how many times a letter $ c_{j} $ is contained in a substring of his masterpiece starting from position $ l_{j} $ and ending at $ r_{j} $ inclusively.",
    "inputFormat": "The first line contains a name of the masterpiece — string $ s $ . The string $ s $ contains only lowercase latin letters and its length is between 1 and 100 inclusively.\n\nThe second line contains a pair of integer numbers $ n $ and $ m $ $ (1<=n<=10^{5},1<=m<=10^{5}) $ — a number of days Polycarp worked on his masterpiece and a number of requests you need to answer for the text respectively.\n\nThe next line consists of $ n $ integer numbers $ k_{i} $ $ (0<=k_{i}<=100) $ — circular shifts used during $ n $ days of work.\n\nFollowing $ m $ lines contains two integer numbers $ l_{j},r_{j} $ and a lowercase latin letter $ c_{j} $ each — requests description. For each request you need to count number of times letter $ c_{j} $ is contained in a substring of the masterpiece from position $ l_{j} $ to $ r_{j} $ inclusively. Positions are numerated starting from $ 1 $ . It is guaranteed that $ 1<=l_{j}<=r_{j}<=10^{18} $ and both $ l_{j} $ and $ r_{j} $ do not exceed length of the masterpiece.",
    "outputFormat": "Output should contain $ m $ lines, where the $ j $ -th line contains the answer on the $ j $ -th request.",
    "samples": [
        [
            "masterpiece\n1 3\n3\n1 22 m\n9 14 e\n8 15 p\n",
            "2\n4\n0\n"
        ],
        [
            "polycarp\n1 2\n0\n2 15 p\n1 16 p\n",
            "2\n4\n"
        ]
    ],
    "hint": ""
}