{
    "description": "One day Kefa the parrot was walking down the street as he was on the way home from the restaurant when he saw something glittering by the road. As he came nearer he understood that it was a watch. He decided to take it to the pawnbroker to earn some money.\n\nThe pawnbroker said that each watch contains a serial number represented by a string of digits from $ 0 $ to $ 9 $ , and the more quality checks this number passes, the higher is the value of the watch. The check is defined by three positive integers $ l $ , $ r $ and $ d $ . The watches pass a check if a substring of the serial number from $ l $ to $ r $ has period $ d $ . Sometimes the pawnbroker gets distracted and Kefa changes in some substring of the serial number all digits to $ c $ in order to increase profit from the watch.\n\nThe seller has a lot of things to do to begin with and with Kefa messing about, he gave you a task: to write a program that determines the value of the watch.\n\nLet us remind you that number $ x $ is called a period of string $ s $ ( $ 1<=x<=|s| $ ), if $ s_{i}=s_{i+x} $ for all $ i $ from 1 to $ |s|-x $ .",
    "inputFormat": "The first line of the input contains three positive integers $ n $ , $ m $ and $ k $ ( $ 1<=n<=10^{5} $ , $ 1<=m+k<=10^{5} $ ) — the length of the serial number, the number of change made by Kefa and the number of quality checks.\n\nThe second line contains a serial number consisting of $ n $ digits.\n\nThen $ m+k $ lines follow, containing either checks or changes.\n\nThe changes are given as 1 $ l $ $ r $ $ c $ ( $ 1<=l<=r<=n $ , $ 0<=c<=9 $ ). That means that Kefa changed all the digits from the $ l $ -th to the $ r $ -th to be $ c $ .\n\nThe checks are given as 2 $ l $ $ r $ $ d $ ( $ 1<=l<=r<=n $ , $ 1<=d<=r-l+1 $ ).",
    "outputFormat": "For each check on a single line print \"YES\" if the watch passed it, otherwise print \"NO\".",
    "samples": [
        [
            "3 1 2\n112\n2 2 3 1\n1 1 3 8\n2 1 2 1\n",
            "NO\nYES\n"
        ],
        [
            "6 2 3\n334934\n2 2 5 2\n1 4 4 3\n2 1 6 3\n1 2 3 8\n2 3 6 1\n",
            "NO\nYES\nNO\n"
        ]
    ],
    "hint": "In the first sample test two checks will be made. In the first one substring \"12\" is checked on whether or not it has period 1, so the answer is \"NO\". In the second one substring \"88\", is checked on whether or not it has period 1, and it has this period, so the answer is \"YES\".\n\nIn the second statement test three checks will be made. The first check processes substring \"3493\", which doesn't have period 2. Before the second check the string looks as \"334334\", so the answer to it is \"YES\". And finally, the third check processes substring \"8334\", which does not have period 1.",
    "translation": "长度为 $n$ 的字符串，每个字符是 $\\mathtt{0} \\sim \\mathtt{9}$ 的数位，$m + k$ 种操作：\n\n1. 格式为 `1 l r c`，表示将 $l \\sim r$ 赋值为 $c$，保证 $0 \\le c \\le 9$。这种修改操作恰好 $m$ 个。\n\n2. 格式为 `2 l r d`，表示询问 $l \\sim r$ 是否有长度为 $d$ 的循环节。这种询问操作恰好 $k$ 个。\n\n数据范围：$n \\leqslant 10^5$，$m + k \\leqslant 10^5$，$0 \\leqslant c \\leqslant 10$，$1 \\leqslant d \\leqslant r - l + 1$。\n\nTranslated by @attack "
}