{
    "description": "You have a rectangular chocolate bar consisting of $ n×m $ single squares. You want to eat exactly $ k $ squares, so you may need to break the chocolate bar.\n\nIn one move you can break any single rectangular piece of chocolate in two rectangular pieces. You can break only by lines between squares: horizontally or vertically. The cost of breaking is equal to square of the break length.\n\nFor example, if you have a chocolate bar consisting of $ 2×3 $ unit squares then you can break it horizontally and get two $ 1×3 $ pieces (the cost of such breaking is $ 3^{2}=9 $ ), or you can break it vertically in two ways and get two pieces: $ 2×1 $ and $ 2×2 $ (the cost of such breaking is $ 2^{2}=4 $ ).\n\nFor several given values $ n $ , $ m $ and $ k $ find the minimum total cost of breaking. You can eat exactly $ k $ squares of chocolate if after all operations of breaking there is a set of rectangular pieces of chocolate with the total size equal to $ k $ squares. The remaining $ n·m-k $ squares are not necessarily form a single rectangular piece.",
    "inputFormat": "The first line of the input contains a single integer $ t $ ( $ 1<=t<=40910 $ ) — the number of values $ n $ , $ m $ and $ k $ to process.\n\nEach of the next $ t $ lines contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=30,1<=k<=min(n·m,50) $ ) — the dimensions of the chocolate bar and the number of squares you want to eat respectively.",
    "outputFormat": "For each $ n $ , $ m $ and $ k $ print the minimum total cost needed to break the chocolate bar, in order to make it possible to eat exactly $ k $ squares.",
    "samples": [
        [
            "4\n2 2 1\n2 2 3\n2 2 2\n2 2 4\n",
            "5\n5\n4\n0\n"
        ]
    ],
    "hint": "In the first query of the sample one needs to perform two breaks:\n\n- to split $ 2×2 $ bar into two pieces of $ 2×1 $ (cost is $ 2^{2}=4 $ ),\n- to split the resulting $ 2×1 $ into two $ 1×1 $ pieces (cost is $ 1^{2}=1 $ ).\n\nIn the second query of the sample one wants to eat $ 3 $ unit squares. One can use exactly the same strategy as in the first query of the sample.",
    "translation": "你有一块长方形的巧克力，这块巧克力共有n*m小块。你想吃k小块巧克力，因此你也许需要掰开这块巧克力。\n\n在每一次操作中你可以把任意一块矩形形状的巧克力掰成两块矩形形状的巧克力。你只能沿着巧克力小块之间的分割线掰开巧克力——可以沿着水平方向或是竖直方向掰开。掰开巧克力的花费等于分割线长度的平方。\n\n例如，如果你有一块2*3的巧克力，那么你可以沿着水平方向掰从而得到两块1*3的巧克力，这次操作的花费即为3^2=9。或者你也可以沿着竖直方向掰从而得到一块2*1的巧克力和一块2*2的巧克力，这次操作的花费即为2^2=4。\n\n对于每一个给出的n，m和k，计算出最小花费。你可以用多块巧克力凑出k小块巧克力。剩余的巧克力可以不是完整的一块。\n\n输入格式：\n\n输入数据的第一行包括1个整数t(1<=t<=40910)，表示数据组数。\n\n接下来的t行每一行都包含3个整数n，m和k(1<=n,m<=30,1<=k<=min(n*m,50))，其意义见上文。\n\n输出格式：\n\n输出t行，分别表示每一组数据的最小花费。\n\n说明：\n\n在样例一的第1行这组数据情况下一共需要进行2次操作：\n1.把2*2的巧克力掰成两块2*1的巧克力，花费为2^2=4；\n2.把2*1的巧克力掰成两块1*1的巧克力，花费为1^2=1。\n\n在样例一的第2行这组数据情况下操作步骤同上。\n\nTranslated by @radish布団 "
}