{
    "description": "Kevin and Nicky Sun have invented a new game called Lieges of Legendre. In this game, two players take turns modifying the game state with Kevin moving first. Initially, the game is set up so that there are $ n $ piles of cows, with the $ i $ -th pile containing $ a_{i} $ cows. During each player's turn, that player calls upon the power of Sunlight, and uses it to either:\n\n1. Remove a single cow from a chosen non-empty pile.\n2. Choose a pile of cows with even size $ 2·x $ ( $ x&gt;0 $ ), and replace it with $ k $ piles of $ x $ cows each.\n\nThe player who removes the last cow wins. Given $ n $ , $ k $ , and a sequence $ a_{1},a_{2},...,a_{n} $ , help Kevin and Nicky find the winner, given that both sides play in optimal way.",
    "inputFormat": "The first line of the input contains two space-separated integers $ n $ and $ k $ ( $ 1<=n<=100000,1<=k<=10^{9} $ ).\n\nThe second line contains $ n $ integers, $ a_{1},a_{2},...\\ a_{n} $ ( $ 1<=a_{i}<=10^{9} $ ) describing the initial state of the game.",
    "outputFormat": "Output the name of the winning player, either \"Kevin\" or \"Nicky\" (without quotes).",
    "samples": [
        [
            "2 1\n3 4\n",
            "Kevin\n"
        ],
        [
            "1 2\n3\n",
            "Nicky\n"
        ]
    ],
    "hint": "In the second sample, Nicky can win in the following way: Kevin moves first and is forced to remove a cow, so the pile contains two cows after his move. Next, Nicky replaces this pile of size 2 with two piles of size 1. So the game state is now two piles of size 1. Kevin then removes one of the remaining cows and Nicky wins by removing the other.",
    "translation": "有两个人做游戏，游戏规则如下： \r\n\r\n有n堆石子，每次可以对一堆石子进行操作，如果当前石子是偶数，那么可以选择将这2*x个石子分成k堆石子数为x的石子堆，还有一种没有前提的操作是取走当前堆的一个石子，问先手赢还是后手赢，先手和后手都足够聪明的情况下。\r\n\r\n先手赢输出Kevin，后手赢输出Nicky\r\n\r\n输入：\r\n\r\n第一行两个整数n,k\r\n\r\n第二行n个整数，为每堆石子的数量\r\n\r\n输出：Kevin或者Nicky"
}