{
    "description": "Kevin Sun has just finished competing in Codeforces Round #334! The round was 120 minutes long and featured five problems with maximum point values of 500, 1000, 1500, 2000, and 2500, respectively. Despite the challenging tasks, Kevin was uncowed and bulldozed through all of them, distinguishing himself from the herd as the best cowmputer scientist in all of Bovinia. Kevin knows his submission time for each problem, the number of wrong submissions that he made on each problem, and his total numbers of successful and unsuccessful hacks. Because Codeforces scoring is complicated, Kevin wants you to write a program to compute his final score.\n\nCodeforces scores are computed as follows: If the maximum point value of a problem is $ x $ , and Kevin submitted correctly at minute $ m $ but made $ w $ wrong submissions, then his score on that problem is ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF604A/3fb27769d723e1978a19f6c6254058e35687ad16.png). His total score is equal to the sum of his scores for each problem. In addition, Kevin's total score gets increased by $ 100 $ points for each successful hack, but gets decreased by $ 50 $ points for each unsuccessful hack.\n\nAll arithmetic operations are performed with absolute precision and no rounding. It is guaranteed that Kevin's final score is an integer.",
    "inputFormat": "The first line of the input contains five space-separated integers $ m_{1} $ , $ m_{2} $ , $ m_{3} $ , $ m_{4} $ , $ m_{5} $ , where $ m_{i} $ ( $ 0<=m_{i}<=119 $ ) is the time of Kevin's last submission for problem $ i $ . His last submission is always correct and gets accepted.\n\nThe second line contains five space-separated integers $ w_{1} $ , $ w_{2} $ , $ w_{3} $ , $ w_{4} $ , $ w_{5} $ , where $ w_{i} $ ( $ 0<=w_{i}<=10 $ ) is Kevin's number of wrong submissions on problem $ i $ .\n\nThe last line contains two space-separated integers $ h_{s} $ and $ h_{u} $ ( $ 0<=h_{s},h_{u}<=20 $ ), denoting the Kevin's numbers of successful and unsuccessful hacks, respectively.",
    "outputFormat": "Print a single integer, the value of Kevin's final score.",
    "samples": [
        [
            "20 40 60 80 100\n0 1 2 3 4\n1 0\n",
            "4900\n"
        ],
        [
            "119 119 119 119 119\n0 0 0 0 0\n10 0\n",
            "4930\n"
        ]
    ],
    "hint": "In the second sample, Kevin takes $ 119 $ minutes on all of the problems. Therefore, he gets ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF604A/3922f1fe31f3952d16c813d363361bda7880bba4.png) of the points on each problem. So his score from solving problems is ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF604A/e360e9e378d7745c80c33f68932ba8c77627d97e.png). Adding in $ 10·100=1000 $ points from hacks, his total score becomes $ 3930+1000=4930 $ .",
    "translation": "## **题目描述**\n\n凯文刚刚完成了 CF 的比赛。测试时间为 120 分钟，有 5 个题目。题目 1~5 的满分分别是: 500、1000、1500、2000  和 2500。他作答了所有的题。\n\n他知道自己每个问题的提交时间、每个问题上他提交错误的次数，以及它提交正确和错误的总数。\n\n但 CF 评分的机制很复杂， 凯文想知道他的最终得分。\n\n评分机制：设一个问题的最高分是 x ,提交者在第 m 分钟时提交正确，提交者错误提交了 w 此。那么，他的每道题的得分是： \n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF604A/3fb27769d723e1978a19f6c6254058e35687ad16.png)\n\n他的总成绩是他每道题成绩的和。此外，凯文每通过一道题，他的总分数将增加 100 ；反之，他每错误一次，他的总分数将减少 50 分。\n\n所有运算都是觉得准确的，没有四舍五入。凯文的得分绝对是整数。\n\n## 输入格式\n第一行分别是：m1 , m2 , m3 , m4 , m5 。\n\n第二行分别是：w1 , w2 , w3 , w4 , w5。\n\n第三行有两个数：凯文的正确总数和错误总数。\n## 输出格式\n打印一个整数，既凯文的最终得分。"
}