{
    "description": "You are playing a board card game. In this game the player has two characteristics, $ x $ and $ y $ — the white magic skill and the black magic skill, respectively. There are $ n $ spell cards lying on the table, each of them has four characteristics, $ a_{i} $ , $ b_{i} $ , $ c_{i} $ and $ d_{i} $ . In one move a player can pick one of the cards and cast the spell written on it, but only if first two of it's characteristics meet the requirement $ a_{i}<=x $ and $ b_{i}<=y $ , i.e. if the player has enough magic skill to cast this spell. However, after casting the spell the characteristics of a player change and become equal to $ x=c_{i} $ and $ y=d_{i} $ .\n\nAt the beginning of the game both characteristics of a player are equal to zero. The goal of the game is to cast the $ n $ -th spell. Your task is to make it in as few moves as possible. You are allowed to use spell in any order and any number of times (for example, you may not use some spells at all).",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of cards on the table.\n\nEach of the next $ n $ lines contains four integers $ a_{i} $ , $ b_{i} $ , $ c_{i} $ , $ d_{i} $ ( $ 0<=a_{i},b_{i},c_{i},d_{i}<=10^{9} $ ) — the characteristics of the corresponding card.",
    "outputFormat": "In the first line print a single integer $ k $ — the minimum number of moves needed to cast the $ n $ -th spell and in the second line print $ k $ numbers — the indices of the cards in the order in which you should cast them. In case there are multiple possible solutions, print any of them.\n\nIf it is impossible to cast the $ n $ -th spell, print $ -1 $ .",
    "samples": [
        [
            "4\n0 0 3 4\n2 2 5 3\n4 1 1 7\n5 3 8 8\n",
            "3\n1 2 4\n"
        ],
        [
            "2\n0 0 4 6\n5 1 1000000000 1000000000\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "给定十万个卡片，卡片上写着起点$(a,b)$ 终点$(c,d)$\r\n\r\n当前坐标$(x,y)$, 开始时是$（0,0）$\r\n\r\n如果 $x >= a$ 且 $y >= b$  则，下一步可以选择使用这个卡片，使用过后，当前坐标变成$(c,d)$"
}