{
    "description": "In the land of Bovinia there are $ n $ pastures, but no paths connecting the pastures. Of course, this is a terrible situation, so Kevin Sun is planning to rectify it by constructing $ m $ undirected paths connecting pairs of distinct pastures. To make transportation more efficient, he also plans to pave some of these new paths.\n\nKevin is very particular about certain aspects of path-paving. Since he loves odd numbers, he wants each pasture to have an odd number of paved paths connected to it. Thus we call a paving sunny if each pasture is incident to an odd number of paved paths. He also enjoys short paths more than long paths, so he would like the longest paved path to be as short as possible. After adding each path, Kevin wants to know if a sunny paving exists for the paths of Bovinia, and if at least one does, the minimum possible length of the longest path in such a paving. Note that \"longest path\" here means maximum-weight edge.",
    "inputFormat": "The first line contains two integers $ n $ ( $ 2<=n<=100000 $ ) and $ m $ ( $ 1<=m<=300000 $ ), denoting the number of pastures and paths, respectively. The next $ m $ lines each contain three integers $ a_{i} $ , $ b_{i} $ and $ l_{i} $ , describing the $ i $ -th path. The $ i $ -th path connects pastures $ a_{i} $ and $ b_{i} $ ( $ 1<=a_{i},b_{i}<=n $ ; $ a_{i}≠b_{i} $ ) and has length $ l_{i} $ ( $ 1<=l_{i}<=10^{9} $ ). Paths are given in the order in which they are constructed.",
    "outputFormat": "Output $ m $ lines. The $ i $ -th line should contain a single integer denoting the minimum possible length of the longest path (maximum-weight edge) in a sunny paving using only the first $ i $ paths. If Kevin cannot pave a set of paths so that each pasture is incident to an odd number of paved paths, output $ -1 $ .\n\nNote that the paving is only hypothetical—your answer after adding the $ i $ -th path should not be affected by any of your previous answers.",
    "samples": [
        [
            "4 4\n1 3 4\n2 4 8\n1 2 2\n3 4 3\n",
            "-1\n8\n8\n3\n"
        ],
        [
            "3 2\n1 2 3\n2 3 4\n",
            "-1\n-1\n"
        ],
        [
            "4 10\n2 1 987\n3 2 829\n4 1 768\n4 2 608\n3 4 593\n3 2 488\n4 2 334\n2 1 204\n1 3 114\n1 4 39\n",
            "-1\n-1\n829\n829\n768\n768\n768\n488\n334\n204\n"
        ]
    ],
    "hint": "For the first sample, these are the paths that Kevin should pave after building the $ i $ -th path:\n\n1. No set of paths works.\n2. Paths 1 (length $ 4 $ ) and 2 (length $ 8 $ ).\n3. Paths 1 (length $ 4 $ ) and 2 (length $ 8 $ ).\n4. Paths 3 (length $ 2 $ ) and 4 (length $ 3 $ ).\n\nIn the second sample, there never exists a paving that makes Kevin happy.",
    "translation": "给定一张 $n$ 个点的无向图，初始没有边。\n\n依次加入 $m$ 条带权的边，每次加入后询问是否存在一个边集，满足每个点的度数均为奇数。\n\n若存在，则还需要最小化边集中的最大边权。\n\n$n \\le 10^5$，$m \\le 3 \\times 10^5$。"
}