{
    "description": "A tree is a connected undirected graph with $ n-1 $ edges, where $ n $ denotes the number of vertices. Vertices are numbered $ 1 $ through $ n $ .\n\nLimak is a little polar bear. His bear family prepares a New Year tree every year. One year ago their tree was more awesome than usually. Thus, they decided to prepare the same tree in the next year. Limak was responsible for remembering that tree.\n\nIt would be hard to remember a whole tree. Limak decided to describe it in his notebook instead. He took a pen and wrote $ n-1 $ lines, each with two integers — indices of two vertices connected by an edge.\n\nNow, the New Year is just around the corner and Limak is asked to reconstruct that tree. Of course, there is a problem. He was a very little bear a year ago, and he didn't know digits and the alphabet, so he just replaced each digit with a question mark — the only character he knew. That means, for any vertex index in his notes he knows only the number of digits in it. At least he knows there were no leading zeroes.\n\nLimak doesn't want to disappoint everyone. Please, take his notes and reconstruct a New Year tree. Find any tree matching Limak's records and print its edges in any order. It's also possible that Limak made a mistake and there is no suitable tree – in this case print \"-1\" (without the quotes).",
    "inputFormat": "The first line contains a single integer $n$ ( $ 2 \\le n \\le 200000 $ ) — the number of vertices.\n\nEach of the next $ n-1 $ lines contains two space-separated non-empty strings, both consisting of questions marks only. No string has more characters than the number of digits in $ n $ .",
    "outputFormat": "If there is no tree matching Limak's records, print the only line with \"-1\" (without the quotes).\n\nOtherwise, describe any tree matching Limak's notes. Print $ n-1 $ lines, each with two space-separated integers – indices of vertices connected by an edge. You can print edges in any order.",
    "samples": [
        [
            "12\n? ?\n? ?\n? ?\n? ??\n?? ?\n?? ??\n? ??\n? ?\n? ?\n? ?\n? ?\n",
            "3 1\n1 6\n9 1\n2 10\n1 7\n8 1\n1 4\n1 10\n5 1\n10 11\n12 1\n"
        ],
        [
            "12\n?? ??\n? ?\n? ?\n? ??\n?? ?\n?? ??\n? ??\n? ?\n? ?\n?? ??\n? ?\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "有一棵 $n$ 个节点的树，节点编号为 $1 \\sim n$。\n\n记录这棵树的方式是记录下每条边连接的两点的编号。\n\n现在，你不知道这些编号具体是多少，你只知道它们在十进制下的位数。\n\n请你构造出一棵满足要求的树，或判断没有满足要求的树。\n\n$n \\le 2 \\times 10^5$。"
}