{
    "description": "Today is Wednesday, the third day of the week. What's more interesting is that tomorrow is the last day of the year 2015.\n\nLimak is a little polar bear. He enjoyed this year a lot. Now, he is so eager to the coming year 2016.\n\nLimak wants to prove how responsible a bear he is. He is going to regularly save candies for the entire year 2016! He considers various saving plans. He can save one candy either on some fixed day of the week or on some fixed day of the month.\n\nLimak chose one particular plan. He isn't sure how many candies he will save in the 2016 with his plan. Please, calculate it and tell him.",
    "inputFormat": "The only line of the input is in one of the following two formats:\n\n- \" $ x $ of week\" where $ x $ ( $ 1<=x<=7 $ ) denotes the day of the week. The 1-st day is Monday and the 7-th one is Sunday.\n- \" $ x $ of month\" where $ x $ ( $ 1<=x<=31 $ ) denotes the day of the month.",
    "outputFormat": "Print one integer — the number of candies Limak will save in the year 2016.",
    "samples": [
        [
            "4 of week\n",
            "52\n"
        ],
        [
            "30 of month\n",
            "11\n"
        ]
    ],
    "hint": "Polar bears use the Gregorian calendar. It is the most common calendar and you likely use it too. You can read about it on Wikipedia if you want to – [https://en.wikipedia.org/wiki/Gregorian\\_calendar](https://en.wikipedia.org/wiki/Gregorian_calendar). The week starts with Monday.\n\nIn the first sample Limak wants to save one candy on each Thursday (the 4-th day of the week). There are $ 52 $ Thursdays in the 2016. Thus, he will save $ 52 $ candies in total.\n\nIn the second sample Limak wants to save one candy on the 30-th day of each month. There is the 30-th day in exactly $ 11 $ months in the 2016 — all months but February. It means that Limak will save $ 11 $ candies in total.",
    "translation": "今天是周三，一周中的第三天。更有趣的是，明天是2015年的最后一天。\n\nLimak是一只可爱的小北极熊，在过去的一年中，他很享受。现在，他太期待2016辣！\n\nLimak想要证明他是一只多么有责任感的熊。他要为整个2016年规律地收集糖果。他现在想出了几个收集方案。他能在一周中特定的日子中每天收集一颗糖，或在一个月中特定的日子。\n\nLimak选择了一种方案，但他不确定在这种方案下他能收集多少糖。请你帮他计算并告诉他。\n\n感谢@cellur925 提供翻译"
}