{
    "description": "You are given a circular array with $ n $ elements. The elements are numbered from some element with values from $ 1 $ to $ n $ in clockwise order. The $ i $ -th cell contains the value $ a_{i} $ . The robot Simba is in cell $ s $ .\n\nEach moment of time the robot is in some of the $ n $ cells (at the begin he is in $ s $ ). In one turn the robot can write out the number written in current cell or move to the adjacent cell in clockwise or counterclockwise direction. To write out the number from the cell Simba doesn't spend any time, but to move to adjacent cell Simba spends one unit of time.\n\nSimba wants to write the number from each cell one time, so the numbers will be written in a non decreasing order. Find the least number of time units to write out all numbers.",
    "inputFormat": "The first line contains two integers $ n $ and $ s $ ( $ 1<=s<=n<=2000 $ ) — the number of cells in the circular array and the starting position of Simba.\n\nThe second line contains $ n $ integers $ a_{i} $ ( $ -10^{9}<=a_{i}<=10^{9} $ ) — the number written in the $ i $ -th cell. The numbers are given for cells in order from $ 1 $ to $ n $ . Some of numbers $ a_{i} $ can be equal.",
    "outputFormat": "In the first line print the number $ t $ — the least number of time units.\n\nEach of the next $ n $ lines should contain the direction of robot movement and the number of cells to move in that direction. After that movement the robot writes out the number from the cell in which it turns out. The direction and the number of cells should be printed in the form of +x in case of clockwise movement and -x in case of counterclockwise movement to $ x $ cells ( $ 0<=x<=n-1 $ ).\n\nNote that the sum of absolute values of $ x $ should be equal to $ t $ .",
    "samples": [
        [
            "9 1\n0 1 2 2 2 1 0 1 1\n",
            "12\n+0\n-3\n-1\n+2\n+1\n+2\n+1\n+1\n+1\n"
        ],
        [
            "8 1\n0 1 0 1 0 1 0 1\n",
            "13\n+0\n+2\n+2\n+2\n-1\n+2\n+2\n+2\n"
        ],
        [
            "8 1\n1 2 3 4 5 6 7 8\n",
            "7\n+0\n+1\n+1\n+1\n+1\n+1\n+1\n+1\n"
        ],
        [
            "8 1\n0 0 0 0 0 0 0 0\n",
            "7\n+0\n+1\n+1\n+1\n+1\n+1\n+1\n+1\n"
        ]
    ],
    "hint": "",
    "translation": "#### 题目描述\n\n环形的数组上有若干个编号为1-n的n个数字， 每个数字大小为$a_i$ ($ -10^9 \\le a_i \\le 10^9$), 现在机器人辛巴从编号为s的位置出发， 可以朝着顺时针方向或逆时针方向行走， 但是行走需要是不降的序列（也就是下一个位置的数字不小于上一次位置对应的数字）， 并且所有的数字都要被选到， 假设一次行走移动会耗费1的单位时间， 请问辛巴怎么行走移动所花费的时间最少，输出最少时间和行走移动的操作。\n\n#### 输入格式\n\n第一行，两个整数n和s分别表示环上数字个数和初始位置， ($ 1 \\leq s, n \\leq 2000$)\n\n#### 输出格式\n第一行为最少花费的时间，之后每一行为具体的行走操作方式， +x为顺时针移动x步， -x为逆时针移动x步（$0 \\leq x \\leq n-1$）。"
}