{
    "description": "Bob loves everything sweet. His favorite chocolate bar consists of pieces, each piece may contain a nut. Bob wants to break the bar of chocolate into multiple pieces so that each part would contain exactly one nut and any break line goes between two adjacent pieces.\n\nYou are asked to calculate the number of ways he can do it. Two ways to break chocolate are considered distinct if one of them contains a break between some two adjacent pieces and the other one doesn't.\n\nPlease note, that if Bob doesn't make any breaks, all the bar will form one piece and it still has to have exactly one nut.",
    "inputFormat": "The first line of the input contains integer $ n $ ( $ 1<=n<=100 $ ) — the number of pieces in the chocolate bar.\n\nThe second line contains $ n $ integers $ a_{i} $ ( $ 0<=a_{i}<=1 $ ), where $ 0 $ represents a piece without the nut and $ 1 $ stands for a piece with the nut.",
    "outputFormat": "Print the number of ways to break the chocolate into multiple parts so that each part would contain exactly one nut.",
    "samples": [
        [
            "3\n0 1 0\n",
            "1\n"
        ],
        [
            "5\n1 0 1 0 1\n",
            "4\n"
        ]
    ],
    "hint": "In the first sample there is exactly one nut, so the number of ways equals $ 1 $ — Bob shouldn't make any breaks.\n\nIn the second sample you can break the bar in four ways:\n\n10|10|1\n\n1|010|1\n\n10|1|01\n\n1|01|01",
    "translation": "## 分割序列\n\n#### 题目描述：\n给一个01序列，将之分割成若干段，要求每段恰好只含有1个1，计算分解方案的总数。\n\n#### 输入格式：\n第一行为正整数n(≤100)，第二行为用空格分隔的n个0或1。\n\n#### 输出格式：\n输出分解方案总数。\n\n#### 输入 #1\n\n3\n\n0 1 0\n\n#### 输出 #1\n\n1\n\n#### 输入 #2\n\n5\n\n1 0 1 0 1\n\n#### 输出 #2\n\n4"
}