{
    "description": "Your friend recently gave you some slimes for your birthday. You have $ n $ slimes all initially with value $ 1 $ .\n\nYou are going to play a game with these slimes. Initially, you put a single slime by itself in a row. Then, you will add the other $ n-1 $ slimes one by one. When you add a slime, you place it at the right of all already placed slimes. Then, while the last two slimes in the row have the same value $ v $ , you combine them together to create a slime with value $ v+1 $ .\n\nYou would like to see what the final state of the row is after you've added all $ n $ slimes. Please print the values of the slimes in the row from left to right.",
    "inputFormat": "The first line of the input will contain a single integer, $ n $ ( $ 1<=n<=100000 $ ).",
    "outputFormat": "Output a single line with $ k $ integers, where $ k $ is the number of slimes in the row after you've finished the procedure described in the problem statement. The $ i $ -th of these numbers should be the value of the $ i $ -th slime from the left.",
    "samples": [
        [
            "1\n",
            "1\n"
        ],
        [
            "2\n",
            "2\n"
        ],
        [
            "3\n",
            "2 1\n"
        ],
        [
            "8\n",
            "4\n"
        ]
    ],
    "hint": "In the first sample, we only have a single slime with value $ 1 $ . The final state of the board is just a single slime with value $ 1 $ .\n\nIn the second sample, we perform the following steps:\n\nInitially we place a single slime in a row by itself. Thus, row is initially 1.\n\nThen, we will add another slime. The row is now 1 1. Since two rightmost slimes have the same values, we should replace these slimes with one with value $ 2 $ . Thus, the final state of the board is 2.\n\nIn the third sample, after adding the first two slimes, our row is 2. After adding one more slime, the row becomes 2 1.\n\nIn the last sample, the steps look as follows:\n\n1. 1\n2. 2\n3. 2 1\n4. 3\n5. 3 1\n6. 3 2\n7. 3 2 1\n8. 4",
    "translation": "朋友在你生日的时候送了你n只史莱姆。现在你跟史莱姆玩♂游♂戏：每只史莱姆有初始值1，首先放一只史莱姆，然后在它的右边放剩下的史莱姆，两个值都为n的史莱姆可以合并成一个值为n+1的史莱姆。输入n，输出最后史莱姆的排布情况。"
}