{
    "description": "Vika has $ n $ jars with paints of distinct colors. All the jars are numbered from $ 1 $ to $ n $ and the $ i $ -th jar contains $ a_{i} $ liters of paint of color $ i $ .\n\nVika also has an infinitely long rectangular piece of paper of width $ 1 $ , consisting of squares of size $ 1×1 $ . Squares are numbered $ 1 $ , $ 2 $ , $ 3 $ and so on. Vika decided that she will start painting squares one by one from left to right, starting from the square number $ 1 $ and some arbitrary color. If the square was painted in color $ x $ , then the next square will be painted in color $ x+1 $ . In case of $ x=n $ , next square is painted in color $ 1 $ . If there is no more paint of the color Vika wants to use now, then she stops.\n\nSquare is always painted in only one color, and it takes exactly $ 1 $ liter of paint. Your task is to calculate the maximum number of squares that might be painted, if Vika chooses right color to paint the first square.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=200000 $ ) — the number of jars with colors Vika has.\n\nThe second line of the input contains a sequence of integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{9} $ ), where $ a_{i} $ is equal to the number of liters of paint in the $ i $ -th jar, i.e. the number of liters of color $ i $ that Vika has.",
    "outputFormat": "The only line of the output should contain a single integer — the maximum number of squares that Vika can paint if she follows the rules described above.",
    "samples": [
        [
            "5\n2 4 2 3 3\n",
            "12\n"
        ],
        [
            "3\n5 5 5\n",
            "15\n"
        ],
        [
            "6\n10 10 10 1 10 10\n",
            "11\n"
        ]
    ],
    "hint": "In the first sample the best strategy is to start painting using color $ 4 $ . Then the squares will be painted in the following colors (from left to right): 4, 5, 1, 2, 3, 4, 5, 1, 2, 3, 4, 5.\n\nIn the second sample Vika can start to paint using any color.\n\nIn the third sample Vika should start painting using color number $ 5 $ .",
    "translation": "Vika 有 $n$ 桶油漆，第 $i$ 桶有 $a_i$ 升油漆。\n\nVika 有一张无限长的长方形纸条，她将长方形纸条分成了无限个正方形，她将按照以下规则对正方形涂色。\n\n- 涂一个正方形需要 $1$ 升油漆。\n- 第一个正方形可以用第任意第 $i$ 桶油漆。\n- 若第 $k$ 个正方形用了第 $x$ 桶油漆，则第 $k+1$ 个正方形将用第 $x+1$ 桶油漆，若 $x=n$，则第 $k+1$ 个正方形将用第 $1$ 桶油漆。若 $a_x = 0$ 则停止涂色。\n\n求 Vika 最多可以涂多少个正方形。\n\n# 输入格式：\n\n两行\n\n第 $1$ 行，一个整数 $n$。\n\n第 $2$ 行，$n$ 个整数 $a_i$ 。\n\n# 输出格式：\n\n一行，Vika 最多可涂的正方形数量。\n\ntranslate by @sqh_let_it_be"
}