{
    "description": "Cat Noku has obtained a map of the night sky. On this map, he found a constellation with $ n $ stars numbered from $ 1 $ to $ n $ . For each $ i $ , the $ i $ -th star is located at coordinates $ (x_{i},y_{i}) $ . No two stars are located at the same position.\n\nIn the evening Noku is going to take a look at the night sky. He would like to find three distinct stars and form a triangle. The triangle must have positive area. In addition, all other stars must lie strictly outside of this triangle. He is having trouble finding the answer and would like your help. Your job is to find the indices of three stars that would form a triangle that satisfies all the conditions.\n\nIt is guaranteed that there is no line such that all stars lie on that line. It can be proven that if the previous condition is satisfied, there exists a solution to this problem.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 3<=n<=100000 $ ).\n\nEach of the next $ n $ lines contains two integers $ x_{i} $ and $ y_{i} $ ( $ -10^{9}<=x_{i},y_{i}<=10^{9} $ ).\n\nIt is guaranteed that no two stars lie at the same point, and there does not exist a line such that all stars lie on that line.",
    "outputFormat": "Print three distinct integers on a single line — the indices of the three points that form a triangle that satisfies the conditions stated in the problem.\n\nIf there are multiple possible answers, you may print any of them.",
    "samples": [
        [
            "3\n0 1\n1 0\n1 1\n",
            "1 2 3\n"
        ],
        [
            "5\n0 0\n0 2\n2 0\n2 2\n1 1\n",
            "1 3 5\n"
        ]
    ],
    "hint": "In the first sample, we can print the three indices in any order.\n\nIn the second sample, we have the following picture.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF618C/221daa860cc5914a84b65151dd3afba0407aed90.png)Note that the triangle formed by starts $ 1 $ , $ 4 $ and $ 3 $ doesn't satisfy the conditions stated in the problem, as point $ 5 $ is not strictly outside of this triangle (it lies on it's border).",
    "translation": "Cat Noku获得了一张夜空图。 在这张图上，他发现了一个由n颗星组成的星座，编号从1到n。对于每个星星i，都有一个固定的坐标（xi，yi）。 没有两颗星位于同一位置。\n\n晚上，Noku看看夜空。 他想找到三颗不同的星星，这三颗星形成一个三角形。 三角形必须有正面积，且其他星星必须在这个三角形之外。 他无法找到答案，并希望得到你的帮助。\n\n保证星星不在一条直线上，且没有任何星星的坐标相同。（只要求输出一组解da☆ze~）\n\nTranslated by @fxjrnh "
}