{
    "description": "It's the year 4527 and the tanks game that we all know and love still exists. There also exists Great Gena's code, written in 2016. The problem this code solves is: given the number of tanks that go into the battle from each country, find their product. If it is turns to be too large, then the servers might have not enough time to assign tanks into teams and the whole game will collapse!\n\nThere are exactly $ n $ distinct countries in the world and the $ i $ -th country added $ a_{i} $ tanks to the game. As the developers of the game are perfectionists, the number of tanks from each country is beautiful. A beautiful number, according to the developers, is such number that its decimal representation consists only of digits '1' and '0', moreover it contains at most one digit '1'. However, due to complaints from players, some number of tanks of one country was removed from the game, hence the number of tanks of this country may not remain beautiful.\n\nYour task is to write the program that solves exactly the same problem in order to verify Gena's code correctness. Just in case.",
    "inputFormat": "The first line of the input contains the number of countries $ n $ ( $ 1<=n<=100000 $ ). The second line contains $ n $ non-negative integers $ a_{i} $ without leading zeroes — the number of tanks of the $ i $ -th country.\n\nIt is guaranteed that the second line contains at least $ n-1 $ beautiful numbers and the total length of all these number's representations doesn't exceed $ 100000 $ .",
    "outputFormat": "Print a single number without leading zeroes — the product of the number of tanks presented by each country.",
    "samples": [
        [
            "3\n5 10 1\n",
            "50"
        ],
        [
            "4\n1 1 10 11\n",
            "110"
        ],
        [
            "5\n0 3 1 100 1\n",
            "0"
        ]
    ],
    "hint": "In sample 1 numbers 10 and 1 are beautiful, number 5 is not not.\n\nIn sample 2 number 11 is not beautiful (contains two '1's), all others are beautiful.\n\nIn sample 3 number 3 is not beautiful, all others are beautiful.",
    "translation": "#### 题目描述\n\n给定 $n$ 个整数 $a_1, a_2, a_3,..., a_n$，求它们的乘积（保证有且仅有一个数 $a_i$ 满足 $\\log_{10}a_i$ 不为整数）。\n\n#### 输入格式\n\n第一行输入一个整数 $n(1\\le n\\le 100000)$。第二行输入 $n$ 个非负整数 $a_1, a_2, a_3,..., a_n$（保证 $a_i$ 的位数不超过 $10^5$ 位）。\n\n#### 输出格式\n\n输出一个没有前导零的整数，表示 $a_1\\times a_2\\times a_3\\times ...\\times a_n$ 的结果。\n\n#### 说明\n\n第一个样例中，$5\\times 10\\times 1 = 50$。\n\n第二个样例中，$1\\times 1\\times 10\\times 11 = 110$。\n\n第三个样例中，由于 $0$ 的出现，乘积为 $0$。"
}