{
    "description": "You are given a rectangular field of $ n×m $ cells. Each cell is either empty or impassable (contains an obstacle). Empty cells are marked with '.', impassable cells are marked with '\\*'. Let's call two empty cells adjacent if they share a side.\n\nLet's call a connected component any non-extendible set of cells such that any two of them are connected by the path of adjacent cells. It is a typical well-known definition of a connected component.\n\nFor each impassable cell $ (x,y) $ imagine that it is an empty cell (all other cells remain unchanged) and find the size (the number of cells) of the connected component which contains $ (x,y) $ . You should do it for each impassable cell independently.\n\nThe answer should be printed as a matrix with $ n $ rows and $ m $ columns. The $ j $ -th symbol of the $ i $ -th row should be \".\" if the cell is empty at the start. Otherwise the $ j $ -th symbol of the $ i $ -th row should contain the only digit —- the answer modulo $ 10 $ . The matrix should be printed without any spaces.\n\nTo make your output faster it is recommended to build the output as an array of $ n $ strings having length $ m $ and print it as a sequence of lines. It will be much faster than writing character-by-character.\n\nAs input/output can reach huge size it is recommended to use fast input/output methods: for example, prefer to use scanf/printf instead of cin/cout in C++, prefer to use BufferedReader/PrintWriter instead of Scanner/System.out in Java.",
    "inputFormat": "The first line contains two integers $ n,m $ ( $ 1<=n,m<=1000 $ ) — the number of rows and columns in the field.\n\nEach of the next $ n $ lines contains $ m $ symbols: \".\" for empty cells, \"\\*\" for impassable cells.",
    "outputFormat": "Print the answer as a matrix as described above. See the examples to precise the format of the output.",
    "samples": [
        [
            "3 3\n*.*\n.*.\n*.*\n",
            "3.3\n.5.\n3.3\n"
        ],
        [
            "4 5\n**..*\n..***\n.*.*.\n*.*.*\n",
            "46..3\n..732\n.6.4.\n5.4.3\n"
        ]
    ],
    "hint": "In first example, if we imagine that the central cell is empty then it will be included to component of size $ 5 $ (cross). If any of the corner cell will be empty then it will be included to component of size $ 3 $ (corner).",
    "translation": "给你一张图，‘*’表示墙，‘.’表示空地，问每个'*'周围的联通快中‘.’的数量和 mod 10，属于同一个联通快的只计算一次。"
}