{
    "description": "Limak is a little polar bear. According to some old traditions, his bear family prepared a New Year cake. And Limak likes cakes.\n\nAs you may know, a New Year cake is a strictly convex polygon with $ n $ vertices.\n\nParents won't allow Limak to eat more than half of a cake because he would get sick. After some thinking they decided to cut a cake along one of $ n·(n-3)/2 $ diagonals. Then Limak will get a non-greater piece.\n\nLimak understands rules but he won't be happy if the second piece happens to be much bigger. Limak's disappointment will be equal to the difference between pieces' areas, multiplied by two. It can be proved that it will be integer for the given constraints.\n\nThere are $ n·(n-3)/2 $ possible scenarios. Consider them all and find the sum of values of Limak's disappointment, modulo $ 10^{9}+7 $ .",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 4<=n<=500000 $ ) — the number of vertices in the polygon denoting the cake.\n\nEach of the next $ n $ lines contains two integers $ x_{i} $ and $ y_{i} $ ( $ |x_{i}|,|y_{i}|<=10^{9} $ ) — coordinates of the $ i $ -th point.\n\nIt's guaranteed that all points are distinct, polygon is strictly convex and points are given in the clockwise order.",
    "outputFormat": "Print the sum of values of Limak's disappointment over all possible scenarios modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "5\n2 4\n2 7\n5 7\n5 4\n3 -2\n",
            "90\n"
        ],
        [
            "4\n-1000000000 -5000000\n0 1234567\n1 1\n-5 -100000000\n",
            "525185196\n"
        ],
        [
            "8\n-10 0\n-6 6\n0 10\n6 6\n10 0\n6 -6\n0 -10\n-6 -6\n",
            "5216\n"
        ]
    ],
    "hint": "In the first sample possible values of Limak's disappointment are $ 0,18,18,24,30 $ .",
    "translation": "- 给定一个 $n$ 个顶点的严格凸多边形。\n- 要求 $\\frac{n(n-3)}2$ 个**由对角线将多边形割成两个部分的面积差 $\\times 2$** 之和。\n- $n \\le 5 \\times 10^5$，答案对 $10^9+7$ 取模。"
}