{
    "description": "Lesha plays the recently published new version of the legendary game hacknet. In this version character skill mechanism was introduced. Now, each player character has exactly $ n $ skills. Each skill is represented by a non-negative integer $ a_{i} $ — the current skill level. All skills have the same maximum level $ A $ .\n\nAlong with the skills, global ranking of all players was added. Players are ranked according to the so-called Force. The Force of a player is the sum of the following values:\n\n- The number of skills that a character has perfected (i.e., such that $ a_{i}=A $ ), multiplied by coefficient $ c_{f} $ .\n- The minimum skill level among all skills ( $ min\\ a_{i} $ ), multiplied by coefficient $ c_{m} $ .\n\nNow Lesha has $ m $ hacknetian currency units, which he is willing to spend. Each currency unit can increase the current level of any skill by $ 1 $ (if it's not equal to $ A $ yet). Help him spend his money in order to achieve the maximum possible value of the Force.",
    "inputFormat": "The first line of the input contains five space-separated integers $ n $ , $ A $ , $ c_{f} $ , $ c_{m} $ and $ m $ ( $ 1<=n<=100000 $ , $ 1<=A<=10^{9} $ , $ 0<=c_{f},c_{m}<=1000 $ , $ 0<=m<=10^{15} $ ).\n\nThe second line contains exactly $ n $ integers $ a_{i} $ ( $ 0<=a_{i}<=A $ ), separated by spaces, — the current levels of skills.",
    "outputFormat": "On the first line print the maximum value of the Force that the character can achieve using no more than $ m $ currency units.\n\nOn the second line print $ n $ integers $ a'_{i} $ ( $ a_{i}<=a'_{i}<=A $ ), skill levels which one must achieve in order to reach the specified value of the Force, while using no more than $ m $ currency units. Numbers should be separated by spaces.",
    "samples": [
        [
            "3 5 10 1 5\n1 3 1\n",
            "12\n2 5 2 \n"
        ],
        [
            "3 5 10 1 339\n1 3 1\n",
            "35\n5 5 5 \n"
        ]
    ],
    "hint": "In the first test the optimal strategy is to increase the second skill to its maximum, and increase the two others by 1.\n\nIn the second test one should increase all skills to maximum.",
    "translation": "L在玩一个游戏。每个人有 $n$ 个技能，每个技能都有一个等级，满级都是 $A$ ，每个人的初始技能等级为非负整数 $a_i$ 。\n\n玩家的排名是由一个能力值决定的。这个能力值是以下2种值的和：\n\n1.满级技能的个数（即 $a_i=A$）乘上一个系数 $cf$ \n\n2.所有技能中最低的等级（即 $min$ $a_i$）乘上一个系数 $cm$\n\n现在L愿意花 $m$ 单位钱币（可以不用完），每一单位钱币可以使一种技能升一级。现在请你帮他操作，使他的能力值在操作后最大，并输出操作后每种能力的等级。注意每种能力最多升到 $A$ 级。\n\n "
}