{
    "description": "Oleg Petrov loves crossword puzzles and every Thursday he buys his favorite magazine with crosswords and other word puzzles. In the last magazine Oleg found a curious puzzle, and the magazine promised a valuable prize for it's solution. We give a formal description of the problem below.\n\nThe puzzle field consists of two rows, each row contains $ n $ cells. Each cell contains exactly one small English letter. You also are given a word $ w $ , which consists of $ k $ small English letters. A solution of the puzzle is a sequence of field cells $ c_{1} $ , $ ... $ , $ c_{k} $ , such that:\n\n- For all $ i $ from $ 1 $ to $ k $ the letter written in the cell $ c_{i} $ matches the letter $ w_{i} $ ;\n- All the cells in the sequence are pairwise distinct;\n- For all $ i $ from $ 1 $ to $ k-1 $ cells $ c_{i} $ and $ c_{i+1} $ have a common side.\n\nOleg Petrov quickly found a solution for the puzzle. Now he wonders, how many distinct solutions are there for this puzzle. Oleg Petrov doesn't like too large numbers, so calculate the answer modulo $ 10^{9}+7 $ .\n\nTwo solutions $ c_{i} $ and $ c'_{i} $ are considered distinct if the sequences of cells do not match in at least one position, that is there is such $ j $ in range from $ 1 $ to $ k $ , such that $ c_{j}≠c'_{j} $ .",
    "inputFormat": "The first two lines contain the state of the field for the puzzle. Each of these non-empty lines contains exactly $ n $ small English letters.\n\nThe next line is left empty.\n\nThe next line is non-empty and contains word $ w $ , consisting of small English letters.\n\nThe length of each line doesn't exceed $ 2000 $ .",
    "outputFormat": "Print a single integer — the number of distinct solutions for the puzzle modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "code\nedoc\n\ncode\n",
            "4\n"
        ],
        [
            "aaa\naaa\n\naa\n",
            "14\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个 $2 \\times n$ 的矩阵，每个位置上有一个小写字母。\n\n有一个长度为 $k$ 的小写字符串 $w$，询问矩阵中有多少条有向路径满足以下条件：\n  - 路径上的字母连起来恰好为 $w$。\n  - 不多次经过同一个位置。\n  - 只能向上下左右四个方向走。\n  \n$n,k \\le 2 \\times 10^3$，答案对 $10^9+7$ 取模。"
}