{
    "description": "Andrew and Jerry are playing a game with Harry as the scorekeeper. The game consists of three rounds. In each round, Andrew and Jerry draw randomly without replacement from a jar containing $ n $ balls, each labeled with a distinct positive integer. Without looking, they hand their balls to Harry, who awards the point to the player with the larger number and returns the balls to the jar. The winner of the game is the one who wins at least two of the three rounds.\n\nAndrew wins rounds 1 and 2 while Jerry wins round 3, so Andrew wins the game. However, Jerry is unhappy with this system, claiming that he will often lose the match despite having the higher overall total. What is the probability that the sum of the three balls Jerry drew is strictly higher than the sum of the three balls Andrew drew?",
    "inputFormat": "The first line of input contains a single integer $ n $ ( $ 2<=n<=2000 $ ) — the number of balls in the jar.\n\nThe second line contains $ n $ integers $ a_{i} $ ( $ 1<=a_{i}<=5000 $ ) — the number written on the $ i $ th ball. It is guaranteed that no two balls have the same number.",
    "outputFormat": "Print a single real value — the probability that Jerry has a higher total, given that Andrew wins the first two rounds and Jerry wins the third. Your answer will be considered correct if its absolute or relative error does not exceed $ 10^{-6} $ .\n\nNamely: let's assume that your answer is $ a $ , and the answer of the jury is $ b $ . The checker program will consider your answer correct, if ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF626D/259203790d90e969d73ec841bd0673c1e8e7d69a.png).",
    "samples": [
        [
            "2\n1 2\n",
            "0.0000000000\n"
        ],
        [
            "3\n1 2 10\n",
            "0.0740740741\n"
        ]
    ],
    "hint": "In the first case, there are only two balls. In the first two rounds, Andrew must have drawn the $ 2 $ and Jerry must have drawn the $ 1 $ , and vice versa in the final round. Thus, Andrew's sum is $ 5 $ and Jerry's sum is $ 4 $ , so Jerry never has a higher total.\n\nIn the second case, each game could've had three outcomes — $ 10-2 $ , $ 10-1 $ , or $ 2-1 $ . Jerry has a higher total if and only if Andrew won $ 2-1 $ in both of the first two rounds, and Jerry drew the $ 10 $ in the last round. This has probability ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF626D/278aa205373ddbc5533818ea01281d6e5a703b92.png).",
    "translation": "两个人在做游戏，一个袋子里有$n$个球，球上的数字大小都不相同。\r\n\r\n共进行三回合，每一回合两个人同时各自从袋子里拿出一个球。\r\n\r\n求前两个回合A拿出的球的数字大于B，但是三个回合加起来的数字的和B大于A的概率。"
}