{
    "description": "Door's family is going celebrate Famil Doors's birthday party. They love Famil Door so they are planning to make his birthday cake weird!\n\nThe cake is a $ n×n $ square consisting of equal squares with side length $ 1 $ . Each square is either empty or consists of a single chocolate. They bought the cake and randomly started to put the chocolates on the cake. The value of Famil Door's happiness will be equal to the number of pairs of cells with chocolates that are in the same row or in the same column of the cake. Famil Doors's family is wondering what is the amount of happiness of Famil going to be?\n\nPlease, note that any pair can be counted no more than once, as two different cells can't share both the same row and the same column.",
    "inputFormat": "In the first line of the input, you are given a single integer $ n $ ( $ 1<=n<=100 $ ) — the length of the side of the cake.\n\nThen follow $ n $ lines, each containing $ n $ characters. Empty cells are denoted with '.', while cells that contain chocolates are denoted by 'C'.",
    "outputFormat": "Print the value of Famil Door's happiness, i.e. the number of pairs of chocolate pieces that share the same row or the same column.",
    "samples": [
        [
            "3\n.CC\nC..\nC.C\n",
            "4\n"
        ],
        [
            "4\nCC..\nC..C\n.CC.\n.CC.\n",
            "9\n"
        ]
    ],
    "hint": "If we number rows from top to bottom and columns from left to right, then, pieces that share the same row in the first sample are:\n\n1. $ (1,2) $ and $ (1,3) $\n2. $ (3,1) $ and $ (3,3) $\n\n Pieces that share the same column are: 1. $ (2,1) $ and $ (3,1) $\n2. $ (1,3) $ and $ (3,3) $",
    "translation": "题目描述\n\n多尔的家人正在庆祝多尔的生日派对。他们爱多尔，所以他们计划让他的生日蛋糕变得不可思议的！\n\n蛋糕是一个由n×n的等边正方形组成的形状，长度为1。每个方块要么是空的，要么是由一个巧克力组成的。他们买了蛋糕，便开始把巧克力放在蛋糕上。“家庭之门”的幸福值等于蛋糕中同一行或同一列中装有巧克力的一对细胞的数量。多尔的家人想知道他们的幸福程度是多少？\n\n输入输出格式\n\n输入格式：\n\n第一行输入一个整数n（1<=n<=100)，表示蛋糕边的长度。然后输入n行数，每行有n个字符。空的细胞用'.'表示，而含有巧克力的细胞用“C”表示。\n\n输出格式：\n\n输出“家庭之门”幸福感的价值，即同一行或同一列的一对巧克力片的数量。"
}