{
    "description": "Programmer Sasha is a student at MIPT (Moscow Institute of Physics and Technology) and he needs to make a laboratory work to pass his finals.\n\nA laboratory unit is a plane with standard coordinate axes marked on it. Physicists from Moscow Institute of Physics and Technology charged the axes by large electric charges: axis $ X $ is positive and axis $ Y $ is negative.\n\nExperienced laboratory worker marked $ n $ points with integer coordinates $ (x_{i},y_{i}) $ on the plane and stopped the time. Sasha should use \"atomic tweezers\" to place elementary particles in these points. He has an unlimited number of electrons (negatively charged elementary particles) and protons (positively charged elementary particles). He can put either an electron or a proton at each marked point. As soon as all marked points are filled with particles, laboratory worker will turn on the time again and the particles will come in motion and after some time they will stabilize in equilibrium. The objective of the laboratory work is to arrange the particles in such a way, that the diameter of the resulting state (the maximum distance between the pairs of points of the set) is as small as possible.\n\nSince Sasha is a programmer, he naively thinks that all the particles will simply \"fall\" into their projections on the corresponding axes: electrons will fall on axis $ X $ , while protons will fall on axis $ Y $ . As we are programmers too, we will consider the same model as Sasha. That is, a particle gets from point $ (x,y) $ to point $ (x,0) $ if it is an electron and to point $ (0,y) $ if it is a proton.\n\nAs the laboratory has high background radiation and Sasha takes care of his laptop, he did not take it with him, and now he can't write a program that computes the minimum possible diameter of the resulting set. Therefore, you will have to do it for him.\n\nPrint a square of the minimum possible diameter of the set.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of points marked on the plane.\n\nEach of the next $ n $ lines contains two integers $ x_{i} $ and $ y_{i} $ ( $ -10^{8}<=x_{i},y_{i}<=10^{8} $ ) — the coordinates of the $ i $ -th point. It is guaranteed that no two points coincide.",
    "outputFormat": "Print a single integer — the square of the minimum possible diameter of the set.",
    "samples": [
        [
            "3\n1 10\n1 20\n1 30\n",
            "0\n"
        ],
        [
            "2\n1 10\n10 1\n",
            "2\n"
        ]
    ],
    "hint": "In the first sample Sasha puts electrons at all points, all particles eventually fall at a single point $ (1,0) $ .\n\nIn the second sample Sasha puts an electron at point $ (1,10) $ , and a proton at point $ (10,1) $ . The result is a set of two points $ (1,0) $ and $ (0,1) $ , which has a diameter of ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF623C/2826342a15affce70e459206e8466cd2b66552a3.png).",
    "translation": "平面上 $n$ 个点 $(x, y)$ ，你需要把每个点拍到坐标轴上，也即坐标为 $(x,0)$ 或 $(0,y)$，最小化操作后任意两点距离最大值的平方。"
}