{
    "description": "A tennis tournament with $ n $ participants is running. The participants are playing by an olympic system, so the winners move on and the losers drop out.\n\nThe tournament takes place in the following way (below, $ m $ is the number of the participants of the current round):\n\n- let $ k $ be the maximal power of the number $ 2 $ such that $ k<=m $ ,\n- $ k $ participants compete in the current round and a half of them passes to the next round, the other $ m-k $ participants pass to the next round directly,\n- when only one participant remains, the tournament finishes.\n\nEach match requires $ b $ bottles of water for each participant and one bottle for the judge. Besides $ p $ towels are given to each participant for the whole tournament.\n\nFind the number of bottles and towels needed for the tournament.\n\nNote that it's a tennis tournament so in each match two participants compete (one of them will win and the other will lose).",
    "inputFormat": "The only line contains three integers $ n,b,p $ ( $ 1<=n,b,p<=500 $ ) — the number of participants and the parameters described in the problem statement.",
    "outputFormat": "Print two integers $ x $ and $ y $ — the number of bottles and towels need for the tournament.",
    "samples": [
        [
            "5 2 3\n",
            "20 15\n"
        ],
        [
            "8 2 4\n",
            "35 32\n"
        ]
    ],
    "hint": "In the first example will be three rounds:\n\n1. in the first round will be two matches and for each match $ 5 $ bottles of water are needed (two for each of the participants and one for the judge),\n2. in the second round will be only one match, so we need another $ 5 $ bottles of water,\n3. in the third round will also be only one match, so we need another $ 5 $ bottles of water.\n\nSo in total we need $ 20 $ bottles of water.\n\nIn the second example no participant will move on to some round directly.",
    "translation": "$n$ 个选手进行若干场比赛（每场比赛为两人，胜者晋级，败者淘汰）\n\n1.每场比赛每位选手需要 $b$ 瓶水，裁判需要$1$ 瓶水；\n\n2.每位选手每次比赛需要 $p$ 块毛巾.\n\n询问一共需要多少瓶水，多少块毛巾?"
}