{
    "description": "There are $ n $ students in a class working on group projects. The students will divide into groups (some students may be in groups alone), work on their independent pieces, and then discuss the results together. It takes the $ i $ -th student $ a_{i} $ minutes to finish his/her independent piece.\n\nIf students work at different paces, it can be frustrating for the faster students and stressful for the slower ones. In particular, the imbalance of a group is defined as the maximum $ a_{i} $ in the group minus the minimum $ a_{i} $ in the group. Note that a group containing a single student has an imbalance of $ 0 $ . How many ways are there for the students to divide into groups so that the total imbalance of all groups is at most $ k $ ?\n\nTwo divisions are considered distinct if there exists a pair of students who work in the same group in one division but different groups in the other.",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ k $ ( $ 1<=n<=200 $ , $ 0<=k<=1000 $ ) — the number of students and the maximum total imbalance allowed, respectively.\n\nThe second line contains $ n $ space-separated integers $ a_{i} $ ( $ 1<=a_{i}<=500 $ ) — the time it takes the $ i $ -th student to complete his/her independent piece of work.",
    "outputFormat": "Print a single integer, the number of ways the students can form groups. As the answer may be large, print its value modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "3 2\n2 4 5\n",
            "3\n"
        ],
        [
            "4 3\n7 8 9 10\n",
            "13\n"
        ],
        [
            "4 0\n5 10 20 21\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample, we have three options:\n\n- The first and second students form a group, and the third student forms a group. Total imbalance is $ 2+0=2 $ .\n- The first student forms a group, and the second and third students form a group. Total imbalance is $ 0+1=1 $ .\n- All three students form their own groups. Total imbalance is $ 0 $ .\n\nIn the third sample, the total imbalance must be $ 0 $ , so each student must work individually.",
    "translation": "有 $n$ 个学生，每个学生有一个能力值 $a_i$。现在要把这些学生分成一些(任意数量的)组，每一组的“不和谐度”是该组能力值最大的学生与能力值最小的学生的能力值的差。求所有不和谐度之和不超过 $k$ 的分组方案总数。\n\nTranslated by @feng_chengjie  "
}