{
    "description": "People do many crazy things to stand out in a crowd. Some of them dance, some learn by heart rules of Russian language, some try to become an outstanding competitive programmers, while others collect funny math objects.\n\nAlis is among these collectors. Right now she wants to get one of $ k $ -special tables. In case you forget, the table $ n×n $ is called $ k $ -special if the following three conditions are satisfied:\n\n- every integer from $ 1 $ to $ n^{2} $ appears in the table exactly once;\n- in each row numbers are situated in increasing order;\n- the sum of numbers in the $ k $ -th column is maximum possible.\n\nYour goal is to help Alice and find at least one $ k $ -special table of size $ n×n $ . Both rows and columns are numbered from $ 1 $ to $ n $ , with rows numbered from top to bottom and columns numbered from left to right.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 1<=n<=500,1<=k<=n $ ) — the size of the table Alice is looking for and the column that should have maximum possible sum.",
    "outputFormat": "First print the sum of the integers in the $ k $ -th column of the required table.\n\nNext $ n $ lines should contain the description of the table itself: first line should contains $ n $ elements of the first row, second line should contain $ n $ elements of the second row and so on.\n\nIf there are multiple suitable table, you are allowed to print any.",
    "samples": [
        [
            "4 1\n",
            "28\n1 2 3 4\n5 6 7 8\n9 10 11 12\n13 14 15 16\n"
        ],
        [
            "5 3\n",
            "85\n5 6 17 18 19\n9 10 23 24 25\n7 8 20 21 22\n3 4 14 15 16\n1 2 11 12 13\n\n"
        ]
    ],
    "hint": "",
    "translation": "称一个$n\\times n$的矩阵是$\\ k-\\text{特殊的}$，需要满足以下三条规则。\r\n\r\n- $n\\times n$矩阵中的每个数是$\\ 1\\ $到$\\ n^2\\ $，且每个数出现一次。\r\n- 每一行是**单调递增**的。\r\n- 在满足以上两条规则的所有矩阵中，第$k$列的和最大\r\n\r\n输入$n,k\\ \\ (1\\le k\\le n\\le 500)\\ $\r\n\r\n第一行输出第$k$列的值。下面$n$行输出$n\\times n$的矩阵。\r\n\r\n如果$\\ k-\\text{特殊的}$矩阵不止一个，输出任意一个即可。"
}