{
    "description": "Kolya Gerasimov loves kefir very much. He lives in year 1984 and knows all the details of buying this delicious drink. One day, as you probably know, he found himself in year 2084, and buying kefir there is much more complicated.\n\nKolya is hungry, so he went to the nearest milk shop. In 2084 you may buy kefir in a plastic liter bottle, that costs $ a $ rubles, or in glass liter bottle, that costs $ b $ rubles. Also, you may return empty glass bottle and get $ c $ ( $ c&lt;b $ ) rubles back, but you cannot return plastic bottles.\n\nKolya has $ n $ rubles and he is really hungry, so he wants to drink as much kefir as possible. There were no plastic bottles in his 1984, so Kolya doesn't know how to act optimally and asks for your help.",
    "inputFormat": "First line of the input contains a single integer $ n $ ( $ 1<=n<=10^{18} $ ) — the number of rubles Kolya has at the beginning.\n\nThen follow three lines containing integers $ a $ , $ b $ and $ c $ ( $ 1<=a<=10^{18} $ , $ 1<=c&lt;b<=10^{18} $ ) — the cost of one plastic liter bottle, the cost of one glass liter bottle and the money one can get back by returning an empty glass bottle, respectively.",
    "outputFormat": "Print the only integer — maximum number of liters of kefir, that Kolya can drink.",
    "samples": [
        [
            "10\n11\n9\n8\n",
            "2\n"
        ],
        [
            "10\n5\n6\n1\n",
            "2\n"
        ]
    ],
    "hint": "In the first sample, Kolya can buy one glass bottle, then return it and buy one more glass bottle. Thus he will drink $ 2 $ liters of kefir.\n\nIn the second sample, Kolya can buy two plastic bottle and get two liters of kefir, or he can buy one liter glass bottle, then return it and buy one plastic bottle. In both cases he will drink two liters of kefir.",
    "translation": "你有$n$块钱，有两种买饮料的方法，第一种花费$a$元，第二种花费$b$元但返还$c$元。求你最多能买几瓶饮料。"
}