{
    "description": "As a result of Pinky and Brain's mysterious experiments in the Large Hadron Collider some portals or black holes opened to the parallel dimension. And the World Evil has crept to the veil between their world and ours. Brain quickly evaluated the situation and he understood that the more evil tentacles creep out and become free, the higher is the possibility that Brain will rule the world.\n\nThe collider's constriction is a rectangular grid rolled into a cylinder and consisting of $ n $ rows and $ m $ columns such as is shown in the picture below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF62E/da353d4ab03d1db9b5705495271eeba00d802297.png)In this example $ n=4 $ , $ m=5 $ . Dotted lines are corridores that close each column to a ring, i. e. connect the $ n $ -th and the $ 1 $ -th rows of the grid.\n\nIn the leftmost column of the grid the portals are situated and the tentacles of the World Evil are ready to creep out from there. In the rightmost column the exit doors are located. The tentacles can only get out through those doors. The segments joining the nodes of the grid are corridors.\n\nBrain would be glad to let all the tentacles out but he faces a problem: the infinite number of tentacles can creep out of the portals, every tentacle possesses infinite length and some width and the volume of the corridors are, unfortunately, quite limited. Brain could approximately evaluate the maximal number of tentacles that will be able to crawl through every corridor.\n\nNow help the mice to determine the maximal number of tentacles of the World Evil that will crawl out of the Large Hadron Collider.",
    "inputFormat": "The first line of the input file contains two integers $ n $ and $ m $ ( $ 2<=n<=5 $ , $ 2<=m<=10^{5} $ ). They are the sizes of the Large Hadron Collider grid. The next $ m-1 $ lines contain $ n $ numbers each. They are the horizontal corridors' capacities. The next $ m $ lines contain $ n $ numbers each. They are the vertical corridors' capacities. Corridors are described from left to right and from top to bottom. Every $ n $ -th vertical corridor connects nodes of the $ n $ -th and $ 1 $ -th rows. A corridor's capacity is a non-negative integer that does not exceed $ 10^{9} $ .",
    "outputFormat": "Print a single number, the number of the World Evil tentacles Pinky and Brain will command.\n\nPlease, do not use %lld specificator to read or write 64-bit integers in C++. It is preffered to use cout (also you may use %I64d).",
    "samples": [
        [
            "3 4\n4 4 4\n1 1 5\n5 5 3\n4 1 2\n1 3 1\n3 5 4\n1 4 3\n",
            "7\n"
        ],
        [
            "2 2\n9 2\n2 3\n6 1\n",
            "11\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个m*n的矩阵。矩阵中每个点与之相邻点有边相连（这里规定矩阵第1行与第n行相邻），每条边有一个容量。\n\n将第一列的点设为源，第m列的点设为汇，求这个网络的最大流。"
}