{
    "description": "Because of budget cuts one IT company established new non-financial reward system instead of bonuses.\n\nTwo kinds of actions are rewarded: fixing critical bugs and suggesting new interesting features. A man who fixed a critical bug gets \"I fixed a critical bug\" pennant on his table. A man who suggested a new interesting feature gets \"I suggested a new feature\" pennant on his table.\n\nBecause of the limited budget of the new reward system only $ 5 $ \"I fixed a critical bug\" pennants and $ 3 $ \"I suggested a new feature\" pennants were bought.\n\nIn order to use these pennants for a long time they were made challenge ones. When a man fixes a new critical bug one of the earlier awarded \"I fixed a critical bug\" pennants is passed on to his table. When a man suggests a new interesting feature one of the earlier awarded \"I suggested a new feature\" pennants is passed on to his table.\n\nOne man can have several pennants of one type and of course he can have pennants of both types on his table. There are $ n $ tables in the IT company. Find the number of ways to place the pennants on these tables given that each pennant is situated on one of the tables and each table is big enough to contain any number of pennants.",
    "inputFormat": "The only line of the input contains one integer $ n $ ( $ 1<=n<=500 $ ) — the number of tables in the IT company.",
    "outputFormat": "Output one integer — the amount of ways to place the pennants on $ n $ tables.",
    "samples": [
        [
            "2\n",
            "24"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\r\n你有3面相同的蓝旗和5面相同的红旗，这里有n张不同的桌子\r\n\r\n问将这8面旗放在这n张桌子上有多少种方法\r\n\r\n要求：旗必须放完，每张桌子可容纳无数张旗\r\n\r\n注意：当所有的旗分配完后，在某一张桌子上红旗，蓝旗，红旗与红旗，红旗，蓝旗这样类似的不记为不同种\r\n\r\n## 输入\r\n一个n(1<=n<=500)\r\n## 输出\r\n一个整数表示答案\r\n\r\n## 输入输出样例\r\n\r\n输入样例#1：\r\n```cpp\r\n2\r\n```\r\n输出样例#1： \r\n```cpp\r\n24\r\n```"
}