{
    "description": "Grandma Laura came to the market to sell some apples. During the day she sold all the apples she had. But grandma is old, so she forgot how many apples she had brought to the market.\n\nShe precisely remembers she had $ n $ buyers and each of them bought exactly half of the apples she had at the moment of the purchase and also she gave a half of an apple to some of them as a gift (if the number of apples at the moment of purchase was odd), until she sold all the apples she had.\n\nSo each buyer took some integral positive number of apples, but maybe he didn't pay for a half of an apple (if the number of apples at the moment of the purchase was odd).\n\nFor each buyer grandma remembers if she gave a half of an apple as a gift or not. The cost of an apple is $ p $ (the number $ p $ is even).\n\nPrint the total money grandma should have at the end of the day to check if some buyers cheated her.",
    "inputFormat": "The first line contains two integers $ n $ and $ p $ ( $ 1<=n<=40,2<=p<=1000 $ ) — the number of the buyers and the cost of one apple. It is guaranteed that the number $ p $ is even.\n\nThe next $ n $ lines contains the description of buyers. Each buyer is described with the string half if he simply bought half of the apples and with the string halfplus if grandma also gave him a half of an apple as a gift.\n\nIt is guaranteed that grandma has at least one apple at the start of the day and she has no apples at the end of the day.",
    "outputFormat": "Print the only integer $ a $ — the total money grandma should have at the end of the day.\n\nNote that the answer can be too large, so you should use $ 64 $ -bit integer type to store it. In C++ you can use the long long integer type and in Java you can use long integer type.",
    "samples": [
        [
            "2 10\nhalf\nhalfplus\n",
            "15\n"
        ],
        [
            "3 10\nhalfplus\nhalfplus\nhalfplus\n",
            "55\n"
        ]
    ],
    "hint": "In the first sample at the start of the day the grandma had two apples. First she sold one apple and then she sold a half of the second apple and gave a half of the second apple as a present to the second buyer.",
    "translation": "题意:有$n$个顾客买老太太的苹果，单价$p$，每个顾客买老太太所拥有苹果的一半，老太太会对某些顾客优惠即送半个苹果，最后苹果都卖光了，求总共卖了多少钱。\n\n$half$表示不送苹果，$halfplus$即对顾客赠送半个苹果。"
}