{
    "description": "IT City company developing computer games decided to upgrade its way to reward its employees. Now it looks the following way. After a new game release users start buying it actively, and the company tracks the number of sales with precision to each transaction. Every time when the next number of sales is not divisible by any number from $ 2 $ to $ 10 $ every developer of this game gets a small bonus.\n\nA game designer Petya knows that the company is just about to release a new game that was partly developed by him. On the basis of his experience he predicts that $ n $ people will buy the game during the first month. Now Petya wants to determine how many times he will get the bonus. Help him to know it.",
    "inputFormat": "The only line of the input contains one integer $ n $ ( $ 1<=n<=10^{18} $ ) — the prediction on the number of people who will buy the game.",
    "outputFormat": "Output one integer showing how many numbers from $ 1 $ to $ n $ are not divisible by any number from $ 2 $ to $ 10 $ .",
    "samples": [
        [
            "12\n",
            "2"
        ]
    ],
    "hint": "",
    "translation": "题目描述\n\n开发电脑游戏的IT City公司，准备改善员工奖励机制。奖励机制是这样的，当游戏的注册用户开始花钱购买产品时，公司会精确的跟踪每笔交易。每次当交易次数不能被2~10之间的任何数字整除时，这个游戏的每个开发者都会得到一个小奖励。\n\n游戏设计师Petya知道公司即将发布一款由他开发的新游戏。根据他的经验，他预测第一个月将会有n个人购买这个游戏。现在Petya想知道他能够获得多少次奖励？\n\n输入格式\n\n一行，一个整数n（1≤n≤10^18）,表示购买游戏的人的个数\n\n输出格式\n\n一行，表示1~n中不能被2~10中任意一个数整除的数的数量\n\n感谢@zhangyuhan 提供翻译"
}