{
    "description": "Blake is the boss of Kris, however, this doesn't spoil their friendship. They often gather at the bar to talk about intriguing problems about maximising some values. This time the problem is really special.\n\nYou are given an array $ a $ of length $ n $ . The characteristic of this array is the value ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF631E/f9f9212a1bebb0fbce8ba2d824331c1a92339433.png) — the sum of the products of the values $ a_{i} $ by $ i $ . One may perform the following operation exactly once: pick some element of the array and move to any position. In particular, it's allowed to move the element to the beginning or to the end of the array. Also, it's allowed to put it back to the initial position. The goal is to get the array with the maximum possible value of characteristic.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF631E/049cb598e69743a02ede74b1bc47f78beebad342.png)",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 2<=n<=200000 $ ) — the size of the array $ a $ .\n\nThe second line contains $ n $ integers $ a_{i} $ ( $ 1<=i<=n $ , $ |a_{i}|<=1000000 $ ) — the elements of the array $ a $ .",
    "outputFormat": "Print a single integer — the maximum possible value of characteristic of $ a $ that can be obtained by performing no more than one move.",
    "samples": [
        [
            "4\n4 3 2 5\n",
            "39"
        ],
        [
            "5\n1 1 2 7 1\n",
            "49"
        ],
        [
            "3\n1 1 2\n",
            "9"
        ]
    ],
    "hint": "In the first sample, one may pick the first element and place it before the third (before $ 5 $ ). Thus, the answer will be $ 3·1+2·2+4·3+5·4=39 $ .\n\nIn the second sample, one may pick the fifth element of the array and place it before the third. The answer will be $ 1·1+1·2+1·3+2·4+7·5=49 $ .",
    "translation": "有一个长为 $n$ 的序列 $A_{i}$​，定义这个序列的价值为$\\sum_{i=1}^n i*A_{i}$。\n\n------------\n现在对这个序列进行一次操作：\n将序列中的某个数移到序列中的某一个位置，例如 $1,2,3,4$ 将 $4$ 移到 $1$ 位置上，序列就变成了 $4,1,2,3$。\n\n现要进行一次操作，使得这个序列的价值最大\n\n------------\n\n输入格式：\n\n\n------------\n\n两行。第一行一个整数 $n$，表示这个序列长度；第二行 $n$ 个整数，表示序列 $A$\n\n------------\n\n输出格式：\n\n一个整数，表示这个序列的最大价值\n\n------------\n说明：\n$2 \\leq n \\leq 2*10^{5}$  $|A_{i}| \\leq 10^{6}$"
}