{
    "description": "Kris works in a large company \"Blake Technologies\". As a best engineer of the company he was assigned a task to develop a printer that will be able to print horizontal and vertical strips. First prototype is already built and Kris wants to tests it. He wants you to implement the program that checks the result of the printing.\n\nPrinter works with a rectangular sheet of paper of size $ n×m $ . Consider the list as a table consisting of $ n $ rows and $ m $ columns. Rows are numbered from top to bottom with integers from $ 1 $ to $ n $ , while columns are numbered from left to right with integers from $ 1 $ to $ m $ . Initially, all cells are painted in color $ 0 $ .\n\nYour program has to support two operations:\n\n1. Paint all cells in row $ r_{i} $ in color $ a_{i} $ ;\n2. Paint all cells in column $ c_{i} $ in color $ a_{i} $ .\n\nIf during some operation $ i $ there is a cell that have already been painted, the color of this cell also changes to $ a_{i} $ .\n\nYour program has to print the resulting table after $ k $ operation.",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=5000 $ , $ n·m<=100000 $ , $ 1<=k<=100000 $ ) — the dimensions of the sheet and the number of operations, respectively.\n\nEach of the next $ k $ lines contains the description of exactly one query:\n\n- $ 1 r_{i} a_{i} $ ( $ 1<=r_{i}<=n $ , $ 1<=a_{i}<=10^{9} $ ), means that row $ r_{i} $ is painted in color $ a_{i} $ ;\n- $ 2 c_{i} a_{i} $ ( $ 1<=c_{i}<=m $ , $ 1<=a_{i}<=10^{9} $ ), means that column $ c_{i} $ is painted in color $ a_{i} $ .",
    "outputFormat": "Print $ n $ lines containing $ m $ integers each — the resulting table after all operations are applied.",
    "samples": [
        [
            "3 3 3\n1 1 3\n2 2 1\n1 2 2\n",
            "3 1 3 \n2 2 2 \n0 1 0 \n"
        ],
        [
            "5 3 5\n1 1 1\n1 3 1\n1 5 1\n2 1 1\n2 3 1\n",
            "1 1 1 \n1 0 1 \n1 1 1 \n1 0 1 \n1 1 1 \n"
        ]
    ],
    "hint": "The figure below shows all three operations for the first sample step by step. The cells that were painted on the corresponding step are marked gray.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF631B/e5646b5f7ff12084cd8f801de0cdbf511ed88aab.png)",
    "translation": "【题目描述】   \r\n小澳最近迷上了考古，他发现秦始皇的兵马俑布局十分有特点，热爱钻研的小澳打算在电脑上还原这个伟大的布局。\r\n他努力钻研，发现秦始皇布置兵马俑是有一定规律的。兵马俑阵总共有n行m列，秦始皇在布置的时候每次会指定一行或一列，然后指定一个兵种，使得这一行或者这一列上全部放上这一个兵种。如果这一行上以前放过其它的兵种，那么他会拔掉以前的兵种改成现在他命令的兵种。\r\n小澳从秦朝的文献中找到了布置这个方阵的操作顺序，他希望你能告诉他布局完成后整个兵马俑阵是什么样子的。  \r\n【输入格式】\r\n输入文件为matrix.in。\r\n输入文件共q+1行。\r\n输入文件第1行包括三个正整数n，m，q，分别表示兵马俑阵的行数和列数以及秦始皇总的操作数。\r\n接下来q行，每行三个正整数，x,y,z，x表示操作种类，若x=1表示给第y行(y<=n)全部放上z这个兵种，若x=2，则表示给第y列(y<=m)全部放上z这个兵种，数据保证z<=2^31-1。   \r\n【输出格式】\r\n输出文件名为matrix.out。\r\n输出文件共n行，每行m个整数，分别用空格隔开。表示最后方阵上每个位置放的兵种，如果某个位置没有被操作过输出0。"
}