{
    "description": "Little Artem found a grasshopper. He brought it to his house and constructed a jumping area for him.\n\nThe area looks like a strip of cells $ 1×n $ . Each cell contains the direction for the next jump and the length of that jump. Grasshopper starts in the first cell and follows the instructions written on the cells. Grasshopper stops immediately if it jumps out of the strip. Now Artem wants to find out if this will ever happen.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — length of the strip.\n\nNext line contains a string of length $ n $ which consists of characters \"<\" and \">\" only, that provide the direction of the jump from the corresponding cell. Next line contains $ n $ integers $ d_{i} $ ( $ 1<=d_{i}<=10^{9} $ ) — the length of the jump from the $ i $ -th cell.",
    "outputFormat": "Print \"INFINITE\" (without quotes) if grasshopper will continue his jumps forever. Otherwise print \"FINITE\" (without quotes).",
    "samples": [
        [
            "2\n&gt;&lt;\n1 2\n",
            "FINITE\n"
        ],
        [
            "3\n&gt;&gt;&lt;\n2 1 1\n",
            "INFINITE"
        ]
    ],
    "hint": "In the first sample grasshopper starts from the first cell and jumps to the right on the next cell. When he is in the second cell he needs to jump two cells left so he will jump out of the strip.\n\nSecond sample grasshopper path is $ 1 $ - $ 3 $ - $ 2 $ - $ 3 $ - $ 2 $ - $ 3 $ and so on. The path is infinite.",
    "translation": "## 题目描述                        \r\n有一只蚱蜢和一个有着$n$个格子的条子，蚱蜢刚开始在第$1$个格子上。每个格子上都标有下次跳的方向以及距离。当蚱蜢跳出边界时就会停止。请问蚱蜢是否会一直跳下去？              \r\n\r\n## 输入输出格式\r\n\r\n### 输入格式：                                \r\n第一行，一个正整数$n$($1$<=$n$<=$100000$)，表示条子长度。                    \r\n第二行，$n$个字符，第$i$个字符表示第$i$个格子上表示方向的标识，`<`表示往左跳，`>`表示往右跳。（样例中的`&lt;`即为`<`，`&gt;`即为`>`。中间没有空格）            \r\n第三行，$n$个数字，第$i$个数字表示第$i$个格子上表示距离的标识。 （空格隔开）\r\n\r\n### 输出格式：                    \r\n如果蚱蜢会永远跳下去，输出`INFINITE`，否则输出`FINITE`。   \r\n\r\n\r\n$Translate$ $by$ $U144044$                      \r\n$\\color{white}\\texttt{蚱蜢永远跳下去不会累死吗}$     "
}