{
    "description": "In an attempt to make peace with the Mischievious Mess Makers, Bessie and Farmer John are planning to plant some flower gardens to complement the lush, grassy fields of Bovinia. As any good horticulturist knows, each garden they plant must have the exact same arrangement of flowers. Initially, Farmer John has $ n $ different species of flowers he can plant, with $ a_{i} $ flowers of the $ i $ -th species.\n\nOn each of the next $ q $ days, Farmer John will receive a batch of flowers of a new species. On day $ j $ , he will receive $ c_{j} $ flowers of the same species, but of a different species from those Farmer John already has.\n\nFarmer John, knowing the right balance between extravagance and minimalism, wants exactly $ k $ species of flowers to be used. Furthermore, to reduce waste, each flower of the $ k $ species Farmer John chooses must be planted in some garden. And each of the gardens must be identical; that is to say that each of the $ k $ chosen species should have an equal number of flowers in each garden. As Farmer John is a proponent of national equality, he would like to create the greatest number of gardens possible.\n\nAfter receiving flowers on each of these $ q $ days, Farmer John would like to know the sum, over all possible choices of $ k $ species, of the maximum number of gardens he could create. Since this could be a large number, you should output your result modulo $ 10^{9}+7 $ .",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ k $ and $ q $ ( $ 1<=k<=n<=100000 $ , $ 1<=q<=100000 $ ).\n\nThe $ i $ -th ( $ 1<=i<=n $ ) of the next $ n $ lines of the input contains an integer $ a_{i} $ ( $ 1<=a_{i}<=1000000 $ ), the number of flowers of species $ i $ Farmer John has initially.\n\nThe $ j $ -th ( $ 1<=j<=q $ ) of the next $ q $ lines of the input contains an integer $ c_{j} $ ( $ 1<=c_{j}<=1000000 $ ), the number of flowers of a new species Farmer John receives on day $ j $ .",
    "outputFormat": "After each of the $ q $ days, output the sum of the maximum possible number of gardens, where the sum is taken over all possible choices of $ k $ species, modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "3 3 2\n4\n6\n9\n8\n6\n",
            "5\n16\n"
        ],
        [
            "4 1 2\n6\n5\n4\n3\n2\n1\n",
            "20\n21\n"
        ]
    ],
    "hint": "In the first sample case, after the first day Farmer John has $ (4,6,9,8) $ of each type of flower, and $ k=3 $ .\n\nChoosing $ (4,6,8) $ lets him make $ 2 $ gardens, each with $ (2,3,4) $ of each flower, respectively. Choosing $ (4,6,9) $ , $ (4,9,8) $ and $ (6,9,8) $ each only let him make one garden, since there is no number of gardens that each species can be evenly split into. So the sum over all choices of $ k=3 $ flowers is $ 2+1+1+1=5 $ .\n\nAfter the second day, Farmer John has $ (4,6,9,8,6) $ of each flower. The sum over all choices is $ 1+2+2+1+1+2+2+3+1+1=16 $ .\n\nIn the second sample case, $ k=1 $ . With $ x $ flowers Farmer John can make $ x $ gardens. So the answers to the queries are $ 6+5+4+3+2=20 $ and $ 6+5+4+3+2+1=21 $ .",
    "translation": "### 题意翻译\n\n给出 $n$ 个数 $a_i$ 和 $q$ 次询问，每次插入一个数 $b_i$。\n\n每次插入后，求序列 $a$ 和 $b_1,b_2,\\cdots, b_i$ 组成的可重集合 $S$ 中所有 $k$ 元组的 $\\gcd$ 值之和，对 $10^9+7$ 取模。\n\n### 样例 #1 解释\n\n添加完 $8$ 后，集合 $S =\\{4,6,9,8\\}$，可以取出 $4$ 个三元组，其中只有 $\\{4,6,8\\}$ 的 $\\gcd$ 为 $2$，其余均为 $1$，故答案为 $5$。"
}