{
    "description": "There are some websites that are accessible through several different addresses. For example, for a long time Codeforces was accessible with two hostnames codeforces.com and codeforces.ru.\n\nYou are given a list of page addresses being queried. For simplicity we consider all addresses to have the form http://<hostname>\\[/<path>\\], where:\n\n- <hostname> — server name (consists of words and maybe some dots separating them),\n- /<path> — optional part, where <path> consists of words separated by slashes.\n\nWe consider two <hostname> to correspond to one website if for each query to the first <hostname> there will be exactly the same query to the second one and vice versa — for each query to the second <hostname> there will be the same query to the first one. Take a look at the samples for further clarifications.\n\nYour goal is to determine the groups of server names that correspond to one website. Ignore groups consisting of the only server name.\n\nPlease note, that according to the above definition queries http://<hostname> and http://<hostname>/ are different.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of page queries. Then follow $ n $ lines each containing exactly one address. Each address is of the form http://<hostname>\\[/<path>\\], where:\n\n- <hostname> consists of lowercase English letters and dots, there are no two consecutive dots, <hostname> doesn't start or finish with a dot. The length of <hostname> is positive and doesn't exceed $ 20 $ .\n- <path> consists of lowercase English letters, dots and slashes. There are no two consecutive slashes, <path> doesn't start with a slash and its length doesn't exceed $ 20 $ .\n\nAddresses are not guaranteed to be distinct.",
    "outputFormat": "First print $ k $ — the number of groups of server names that correspond to one website. You should count only groups of size greater than one.\n\nNext $ k $ lines should contain the description of groups, one group per line. For each group print all server names separated by a single space. You are allowed to print both groups and names inside any group in arbitrary order.",
    "samples": [
        [
            "10\nhttp://abacaba.ru/test\nhttp://abacaba.ru/\nhttp://abacaba.com\nhttp://abacaba.com/test\nhttp://abacaba.de/\nhttp://abacaba.ru/test\nhttp://abacaba.de/test\nhttp://abacaba.com/\nhttp://abacaba.com/t\nhttp://abacaba.com/test\n",
            "1\nhttp://abacaba.de http://abacaba.ru \n"
        ],
        [
            "14\nhttp://c\nhttp://ccc.bbbb/aba..b\nhttp://cba.com\nhttp://a.c/aba..b/a\nhttp://abc/\nhttp://a.c/\nhttp://ccc.bbbb\nhttp://ab.ac.bc.aa/\nhttp://a.a.a/\nhttp://ccc.bbbb/\nhttp://cba.com/\nhttp://cba.com/aba..b\nhttp://a.a.a/aba..b/a\nhttp://abc/aba..b/a\n",
            "2\nhttp://cba.com http://ccc.bbbb \nhttp://a.a.a http://a.c http://abc \n"
        ]
    ],
    "hint": ""
}