{
    "description": "One social network developer recently suggested a new algorithm of choosing ads for users.\n\nThere are $ n $ slots which advertisers can buy. It is possible to buy a segment of consecutive slots at once. The more slots you own, the bigger are the chances your ad will be shown to users.\n\nEvery time it is needed to choose ads to show, some segment of slots is picked by a secret algorithm. Then some advertisers are chosen. The only restriction is that it should be guaranteed for advertisers which own at least $ p $ % of slots composing this segment that their ad will be shown.\n\nFrom the other side, users don't like ads. So it was decided to show no more than ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF643G/456b11767914a81261a6157d843e2701d3225d77.png) ads at once. You are asked to develop a system to sell segments of slots and choose ads in accordance with the rules described above.",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ and $ p $ ( $ 1<=n,m<=150000,20<=p<=100 $ ) — the number of slots, the number of queries to your system and threshold for which display of the ad is guaranteed.\n\nNext line contains $ n $ integers $ a_{i} $ ( $ 1<=a_{i}<=150000) $ , where the $ i $ -th number means id of advertiser who currently owns the $ i $ -th slot.\n\nNext $ m $ lines contain queries descriptions. Each description is of one of the following forms:\n\n- 1 l r id ( $ 1<=l<=r<=n,1<=id<=150\\ 000 $ ) — advertiser $ id $ bought all slots in a range from $ l $ to $ r $ inclusive;\n- 2 l r ( $ 1<=l<=r $ ) — you need to choose advertisers for segment $ [l,r] $ .",
    "outputFormat": "For each query of the second type answer should be printed in a separate line. First integer of the answer should be the number of advertisements that will be shown ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF643G/0638c9255fe07c0491debc183669501a3949704b.png). Next $ cnt $ integers should be advertisers' ids.\n\nIt is allowed to print one advertiser more than once, but each advertiser that owns at least ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF643G/cc607ac4e237e52e433a34e2968492c5c30f7d80.png) slots of the segment from $ l $ to $ r $ should be in your answer.",
    "samples": [
        [
            "5 9 33\n1 2 1 3 3\n2 1 5\n2 1 5\n2 1 3\n2 3 3\n1 2 4 5\n2 1 5\n2 3 5\n1 4 5 1\n2 1 5\n",
            "3 1 2 3\n2 1 3\n2 2 1\n3 1 1000 1000\n1 5\n2 5 3\n2 1 5"
        ]
    ],
    "hint": "Samples demonstrate that you actually have quite a lot of freedom in choosing advertisers.",
    "translation": "- 给定一个长度为 $n$ 的序列和一个整数 $p$。\n- 有 $m$ 个操作，操作要么是区间赋值，要么是询问区间内出现次数至少占 $p\\%$ 的数。\n- 输出询问的答案时，可以包含错的数，也可以重复输出，但对的数一定要在答案中，且输出的数的个数不超过 $\\lfloor \\frac{100}{p} \\rfloor$。\n- $n,m \\le 1.5 \\times 10^5$，$20 \\le p \\le 100$。"
}