{
    "description": "The farmer Polycarp has a warehouse with hay, which can be represented as an $ n×m $ rectangular table, where $ n $ is the number of rows, and $ m $ is the number of columns in the table. Each cell of the table contains a haystack. The height in meters of the hay located in the $ i $ -th row and the $ j $ -th column is equal to an integer $ a_{i,j} $ and coincides with the number of cubic meters of hay in the haystack, because all cells have the size of the base $ 1×1 $ . Polycarp has decided to tidy up in the warehouse by removing an arbitrary integer amount of cubic meters of hay from the top of each stack. You can take different amounts of hay from different haystacks. Besides, it is allowed not to touch a stack at all, or, on the contrary, to remove it completely. If a stack is completely removed, the corresponding cell becomes empty and no longer contains the stack.\n\nPolycarp wants the following requirements to hold after the reorganization:\n\n- the total amount of hay remaining in the warehouse must be equal to $ k $ ,\n- the heights of all stacks (i.e., cells containing a non-zero amount of hay) should be the same,\n- the height of at least one stack must remain the same as it was,\n- for the stability of the remaining structure all the stacks should form one connected region.\n\nThe two stacks are considered adjacent if they share a side in the table. The area is called connected if from any of the stack in the area you can get to any other stack in this area, moving only to adjacent stacks. In this case two adjacent stacks necessarily belong to the same area.\n\nHelp Polycarp complete this challenging task or inform that it is impossible.",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ ( $ 1<=n,m<=1000 $ ) and $ k $ ( $ 1<=k<=10^{18} $ ) — the number of rows and columns of the rectangular table where heaps of hay are lain and the required total number cubic meters of hay after the reorganization.\n\nThen $ n $ lines follow, each containing $ m $ positive integers $ a_{i,j} $ ( $ 1<=a_{i,j}<=10^{9} $ ), where $ a_{i,j} $ is equal to the number of cubic meters of hay making the hay stack on the $ i $ -th row and $ j $ -th column of the table.",
    "outputFormat": "In the first line print \"YES\" (without quotes), if Polycarpus can perform the reorganisation and \"NO\" (without quotes) otherwise. If the answer is \"YES\" (without quotes), then in next $ n $ lines print $ m $ numbers — the heights of the remaining hay stacks. All the remaining non-zero values should be equal, represent a connected area and at least one of these values shouldn't be altered.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "2 3 35\n10 4 9\n9 9 7\n",
            "YES\n7 0 7 \n7 7 7 \n"
        ],
        [
            "4 4 50\n5 9 1 1\n5 1 1 5\n5 1 5 5\n5 5 7 1\n",
            "YES\n5 5 0 0 \n5 0 0 5 \n5 0 5 5 \n5 5 5 0 \n"
        ],
        [
            "2 4 12\n1 1 3 1\n1 6 2 4\n",
            "NO\n"
        ]
    ],
    "hint": "In the first sample non-zero values make up a connected area, their values do not exceed the initial heights of hay stacks. All the non-zero values equal $ 7 $ , and their number is $ 5 $ , so the total volume of the remaining hay equals the required value $ k=7·5=35 $ . At that the stack that is on the second line and third row remained unaltered.",
    "translation": "Polycarp 有一个仓库。\n\n仓库是一个 $n$ 行 $m$ 列的矩阵，第 $i$ 行第 $j$ 列的网格上有一个正整数。\n\n你可以对每个 $a_{ij}$ 减掉一个不同的正整数 $b_{ij}$，但是要保证 $0\\le b_{ij}\\le a_{ij}$。\n\n你要使得最终状态下：\n\n+ 所有 $a_{ij}>0$ 的格子形成一个连通块\n\n+ 这些格子的 $a_{ij}$ 值相同\n\n+ 你还需要保证所有格子的值的和 $=k$\n\n+ 至少有一个 $a_{ij}>0$ 的格子没有改变。\n\nPolycarp 问是否能做到。如果可以，请你输出最终状态。\n\n$1\\le n,m\\le 1000,1\\le k\\le 10^{18},1\\le a_{ij}\\le 10^9$"
}