{
    "description": "Friends are going to play console. They have two joysticks and only one charger for them. Initially first joystick is charged at $ a_{1} $ percent and second one is charged at $ a_{2} $ percent. You can connect charger to a joystick only at the beginning of each minute. In one minute joystick either discharges by 2 percent (if not connected to a charger) or charges by 1 percent (if connected to a charger).\n\nGame continues while both joysticks have a positive charge. Hence, if at the beginning of minute some joystick is charged by 1 percent, it has to be connected to a charger, otherwise the game stops. If some joystick completely discharges (its charge turns to 0), the game also stops.\n\nDetermine the maximum number of minutes that game can last. It is prohibited to pause the game, i. e. at each moment both joysticks should be enabled. It is allowed for joystick to be charged by more than $ 100 $ percent.",
    "inputFormat": "The first line of the input contains two positive integers $ a_{1} $ and $ a_{2} $ ( $ 1<=a_{1},a_{2}<=100 $ ), the initial charge level of first and second joystick respectively.",
    "outputFormat": "Output the only integer, the maximum number of minutes that the game can last. Game continues until some joystick is discharged.",
    "samples": [
        [
            "3 5\n",
            "6\n"
        ],
        [
            "4 4\n",
            "5\n"
        ]
    ],
    "hint": "In the first sample game lasts for 6 minute by using the following algorithm:\n\n- at the beginning of the first minute connect first joystick to the charger, by the end of this minute first joystick is at 4%, second is at 3%;\n- continue the game without changing charger, by the end of the second minute the first joystick is at 5%, second is at 1%;\n- at the beginning of the third minute connect second joystick to the charger, after this minute the first joystick is at 3%, the second one is at 2%;\n- continue the game without changing charger, by the end of the fourth minute first joystick is at 1%, second one is at 3%;\n- at the beginning of the fifth minute connect first joystick to the charger, after this minute the first joystick is at 2%, the second one is at 1%;\n- at the beginning of the sixth minute connect second joystick to the charger, after this minute the first joystick is at 0%, the second one is at 2%.\n\nAfter that the first joystick is completely discharged and the game is stopped.",
    "translation": "【题目描述】\n朋友们正要去玩游戏机。他们有两个游戏机，却只有一个充电器。最开始第一个游戏机有a1%的电，第二个游戏机有a2%的电。你只能在每分钟的最开始将一个游戏机接上充电器。每一分钟每个游戏机会消耗2%的电（如果没有接上充电器）或者充上1%的电（如果接上了充电器）。\n\n当两个游戏机都有电时游戏才能继续。因此，如果在某一分钟的开始某个游戏机只有1%的电，它必须接上充电器，否则游戏会停止。如果某个游戏机完全没电（它的电量变为0），游戏也会停下。\n\n试确定该游戏能够持续的最长时间。禁止暂停游戏，即在每一分钟两个游戏机都应该在使用。允许将游戏机充电到超过100%的电量。\n\n【输入格式】\n输入的第一行包括两个正整数a1、a2（1 <= a1、a2 <= 100），分别表示第一个游戏机和第二个游戏机的初始电量。\n\n【输出格式】\n输出一个整数，游戏能够持续的最长时间。在某一个游戏机没电之前游戏继续。\n\n感谢@蒟蒻的PSJ 提供的翻译"
}