{
    "description": "Alex was programming while Valentina (his toddler daughter) got there and started asking many questions about the round brackets (or parenthesis) in the code. He explained her a bit and when she got it he gave her a task in order to finish his code on time.\n\nFor the purpose of this problem we consider only strings consisting of opening and closing round brackets, that is characters '(' and ')'.\n\nThe sequence of brackets is called correct if:\n\n1. it's empty;\n2. it's a correct sequence of brackets, enclosed in a pair of opening and closing brackets;\n3. it's a concatenation of two correct sequences of brackets.\n\nFor example, the sequences \"()()\" and \"((()))(())\" are correct, while \")(()\", \"(((((\" and \"())\" are not.\n\nAlex took a piece of paper, wrote a string $ s $ consisting of brackets and asked Valentina to count the number of distinct non-empty substrings of $ s $ that are correct sequences of brackets. In other words, her task is to count the number of non-empty correct sequences of brackets that occur in a string $ s $ as a substring (don't mix up with subsequences).\n\nWhen Valentina finished the task, Alex noticed he doesn't know the answer. Help him don't loose face in front of Valentina and solve the problem!",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 1<=n<=500000 $ ) — the length of the string $ s $ .\n\nThe second line contains a string $ s $ of length $ n $ consisting of only '(' and ')'.",
    "outputFormat": "Print the number of distinct non-empty correct sequences that occur in $ s $ as substring.",
    "samples": [
        [
            "10\n()()()()()\n",
            "5\n"
        ],
        [
            "7\n)(())()\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample, there are $ 5 $ distinct substrings we should count: \"()\", \"()()\", \"()()()\", \"()()()()\" and \"()()()()()\".\n\nIn the second sample, there are $ 3 $ distinct substrings we should count: \"()\", \"(())\" and \"(())()\".",
    "translation": "给定一个长度为$n$的括号串，问有多少种不同的合法括号子串。\n$n\\leq 5\\times 10^5$"
}