{
    "description": "Maria participates in a bicycle race.\n\nThe speedway takes place on the shores of Lake Lucerne, just repeating its contour. As you know, the lake shore consists only of straight sections, directed to the north, south, east or west.\n\nLet's introduce a system of coordinates, directing the $ Ox $ axis from west to east, and the $ Oy $ axis from south to north. As a starting position of the race the southernmost point of the track is selected (and if there are several such points, the most western among them). The participants start the race, moving to the north. At all straight sections of the track, the participants travel in one of the four directions (north, south, east or west) and change the direction of movement only in bends between the straight sections. The participants, of course, never turn back, that is, they do not change the direction of movement from north to south or from east to west (or vice versa).\n\nMaria is still young, so she does not feel confident at some turns. Namely, Maria feels insecure if at a failed or untimely turn, she gets into the water. In other words, Maria considers the turn dangerous if she immediately gets into the water if it is ignored.\n\nHelp Maria get ready for the competition — determine the number of dangerous turns on the track.",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 4<=n<=1000 $ ) — the number of straight sections of the track.\n\nThe following $ (n+1) $ -th line contains pairs of integers $ (x_{i},y_{i}) $ ( $ -10000<=x_{i},y_{i}<=10000 $ ). The first of these points is the starting position. The $ i $ -th straight section of the track begins at the point $ (x_{i},y_{i}) $ and ends at the point $ (x_{i+1},y_{i+1}) $ .\n\nIt is guaranteed that:\n\n- the first straight section is directed to the north;\n- the southernmost (and if there are several, then the most western of among them) point of the track is the first point;\n- the last point coincides with the first one (i.e., the start position);\n- any pair of straight sections of the track has no shared points (except for the neighboring ones, they share exactly one point);\n- no pair of points (except for the first and last one) is the same;\n- no two adjacent straight sections are directed in the same direction or in opposite directions.",
    "outputFormat": "Print a single integer — the number of dangerous turns on the track.",
    "samples": [
        [
            "6\n0 0\n0 1\n1 1\n1 2\n2 2\n2 0\n0 0\n",
            "1\n"
        ],
        [
            "16\n1 1\n1 5\n3 5\n3 7\n2 7\n2 9\n6 9\n6 7\n5 7\n5 3\n4 3\n4 4\n3 4\n3 2\n5 2\n5 1\n1 1\n",
            "6\n"
        ]
    ],
    "hint": "The first sample corresponds to the picture:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF659D/d384618c4de83253addcd24088af2096098ca28a.png)The picture shows that you can get in the water under unfortunate circumstances only at turn at the point $ (1,1) $ . Thus, the answer is $ 1 $ .",
    "translation": "一个人围着一个湖骑车，湖的角都是90°或270°，给定角的个数和每个角的坐标，求有多少个点不转弯会掉进湖里。\n\nTranslated by @Little_Jian"
}