{
    "description": "My name is James diGriz, I'm the most clever robber and treasure hunter in the whole galaxy. There are books written about my adventures and songs about my operations, though you were able to catch me up in a pretty awkward moment.\n\nI was able to hide from cameras, outsmart all the guards and pass numerous traps, but when I finally reached the treasure box and opened it, I have accidentally started the clockwork bomb! Luckily, I have met such kind of bombs before and I know that the clockwork mechanism can be stopped by connecting contacts with wires on the control panel of the bomb in a certain manner.\n\nI see $ n $ contacts connected by $ n-1 $ wires. Contacts are numbered with integers from $ 1 $ to $ n $ . Bomb has a security mechanism that ensures the following condition: if there exist $ k>=2 $ contacts $ c_{1},c_{2},...,c_{k} $ forming a circuit, i. e. there exist $ k $ distinct wires between contacts $ c_{1} $ and $ c_{2} $ , $ c_{2} $ and $ c_{3} $ , $ ... $ , $ c_{k} $ and $ c_{1} $ , then the bomb immediately explodes and my story ends here. In particular, if two contacts are connected by more than one wire they form a circuit of length $ 2 $ . It is also prohibited to connect a contact with itself.\n\nOn the other hand, if I disconnect more than one wire (i. e. at some moment there will be no more than $ n-2 $ wires in the scheme) then the other security check fails and the bomb also explodes. So, the only thing I can do is to unplug some wire and plug it into a new place ensuring the fact that no circuits appear.\n\nI know how I should put the wires in order to stop the clockwork. But my time is running out! Help me get out of this alive: find the sequence of operations each of which consists of unplugging some wire and putting it into another place so that the bomb is defused.",
    "inputFormat": "The first line of the input contains $ n $ ( $ 2<=n<=500000 $ ), the number of contacts.\n\nEach of the following $ n-1 $ lines contains two of integers $ x_{i} $ and $ y_{i} $ ( $ 1<=x_{i},y_{i}<=n $ , $ x_{i}≠y_{i} $ ) denoting the contacts currently connected by the $ i $ -th wire.\n\nThe remaining $ n-1 $ lines contain the description of the sought scheme in the same format.\n\nIt is guaranteed that the starting and the ending schemes are correct (i. e. do not contain cicuits nor wires connecting contact with itself).",
    "outputFormat": "The first line should contain $ k $ ( $ k>=0 $ ) — the minimum number of moves of unplugging and plugging back some wire required to defuse the bomb.\n\nIn each of the following $ k $ lines output four integers $ a_{i} $ , $ b_{i} $ , $ c_{i} $ , $ d_{i} $ meaning that on the $ i $ -th step it is neccesary to unplug the wire connecting the contacts $ a_{i} $ and $ b_{i} $ and plug it to the contacts $ c_{i} $ and $ d_{i} $ . Of course the wire connecting contacts $ a_{i} $ and $ b_{i} $ should be present in the scheme.\n\nIf there is no correct sequence transforming the existing scheme into the sought one, output -1.",
    "samples": [
        [
            "3\n1 2\n2 3\n1 3\n3 2\n",
            "1\n1 2 1 3\n"
        ],
        [
            "4\n1 2\n2 3\n3 4\n2 4\n4 1\n1 3\n",
            "3\n1 2 1 3\n4 3 4 1\n2 3 2 4\n"
        ]
    ],
    "hint": "Picture with the clarification for the sample tests:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF650E/30f5b033e4475bbc88fc85d3b241085ea07d2b6f.png)",
    "translation": "给出两棵 $n$ 个节点的树，每次操作可以把第一棵树的一条边删掉然后连另外两个点，且必须满足每次操作完之后仍是一棵树。\n\n问最少需要多少步操作才能把第一棵树变成第二棵树（是完全相同，并不是同构），并输出方案。\n\n$n \\leq 5\\times 10^5$。"
}