{
    "description": "The famous sculptor Cicasso is a Reberlandian spy!\n\nThese is breaking news in Berlandian papers today. And now the sculptor is hiding. This time you give the shelter to the maestro. You have a protected bunker and you provide it to your friend. You set the security system in such way that only you can open the bunker. To open it one should solve the problem which is hard for others but is simple for you.\n\nEvery day the bunker generates a codeword $ s $ . Every time someone wants to enter the bunker, integer $ n $ appears on the screen. As the answer one should enter another integer — the residue modulo $ 10^{9}+7 $ of the number of strings of length $ n $ that consist only of lowercase English letters and contain the string $ s $ as the subsequence.\n\nThe subsequence of string $ a $ is a string $ b $ that can be derived from the string $ a $ by removing some symbols from it (maybe none or all of them). In particular any string is the subsequence of itself. For example, the string \"cfo\" is the subsequence of the string \"codeforces\".\n\nYou haven't implemented the algorithm that calculates the correct answers yet and you should do that ASAP.",
    "inputFormat": "The first line contains integer $ m $ ( $ 1<=m<=10^{5} $ ) — the number of the events in the test case.\n\nThe second line contains nonempty string $ s $ — the string generated by the bunker for the current day.\n\nThe next $ m $ lines contain the description of the events. The description starts from integer $ t $ — the type of the event.\n\nIf $ t=1 $ consider a new day has come and now a new string $ s $ is used. In that case the same line contains a new value of the string $ s $ .\n\nIf $ t=2 $ integer $ n $ is given $ (1<=n<=10^{5} $ ). This event means that it's needed to find the answer for the current string $ s $ and the value $ n $ .\n\nThe sum of lengths of all generated strings doesn't exceed $ 10^{5} $ . All of the given strings consist only of lowercase English letters.",
    "outputFormat": "For each query of the type $ 2 $ print the answer modulo $ 10^{9}+7 $ on the separate line.",
    "samples": [
        [
            "3\na\n2 2\n1 bc\n2 5\n",
            "51\n162626\n"
        ]
    ],
    "hint": "In the first event words of the form \"a?\" and \"?a\" are counted, where ? is an arbitrary symbol. There are $ 26 $ words of each of these types, but the word \"aa\" satisfies both patterns, so the answer is $ 51 $ .",
    "translation": "题目大意：多组询问, 每次询问给定一个串 s 和一个长度 L, 问有多少个长\n度为 L 的只包含小写字母的串, 有至少一个子序列等于 s. (询问\n组数不超过 10^5\n, 总串长不超过 10^5\n)"
}