{
    "description": "The country of Reberland is the archenemy of Berland. Recently the authorities of Berland arrested a Reberlandian spy who tried to bring the leaflets intended for agitational propaganda to Berland illegally . The most leaflets contain substrings of the Absolutely Inadmissible Swearword and maybe even the whole word.\n\nBerland legal system uses the difficult algorithm in order to determine the guilt of the spy. The main part of this algorithm is the following procedure.\n\nAll the $ m $ leaflets that are brought by the spy are numbered from $ 1 $ to $ m $ . After that it's needed to get the answer to $ q $ queries of the following kind: \"In which leaflet in the segment of numbers $ [l,r] $ the substring of the Absolutely Inadmissible Swearword $ [p_{l},p_{r}] $ occurs more often?\".\n\nThe expert wants you to automate that procedure because this time texts of leaflets are too long. Help him!",
    "inputFormat": "The first line contains the string $ s $ ( $ 1<=|s|<=5·10^{5} $ ) — the Absolutely Inadmissible Swearword. The string $ s $ consists of only lowercase English letters.\n\nThe second line contains the only integer $ m $ ( $ 1<=m<=5·10^{4} $ ) — the number of texts of leaflets for expertise.\n\nEach of the next $ m $ lines contains the only string $ t_{i} $ — the text of the $ i $ -th leaflet. The sum of lengths of all leaflet texts doesn't exceed $ 5·10^{4} $ . The text of the leaflets consists of only lowercase English letters.\n\nThe next line contains integer $ q $ ( $ 1<=q<=5·10^{5} $ ) — the number of queries for expertise.\n\nFinally, each of the last $ q $ lines contains four integers $ l $ , $ r $ , $ p_{l} $ , $ p_{r} $ ( $ 1<=l<=r<=m,1<=p_{l}<=p_{r}<=|s| $ ), where $ |s| $ is the length of the Absolutely Inadmissible Swearword.",
    "outputFormat": "Print $ q $ lines. The $ i $ -th of them should contain two integers — the number of the text with the most occurences and the number of occurences of the substring $ [p_{l},p_{r}] $ of the string $ s $ . If there are several text numbers print the smallest one.",
    "samples": [
        [
            "suffixtree\n3\nsuffixtreesareawesome\ncartesiantreeisworsethansegmenttree\nnyeeheeheee\n2\n1 2 1 10\n1 3 9 10\n",
            "1 1\n3 4\n"
        ]
    ],
    "hint": "",
    "translation": "给你一个串 $S$ 以及一个字符串数组 $T_{1\\ldots m}$，$q$ 次询问，每次问 $S$ 的子串 $S[p_l\\ldots p_r]$ 在 $T_{l\\ldots r}$ 中的哪个串里的出现次数最多，并输出出现次数。\n\n如有多解输出最靠前的那一个。"
}