{
    "description": "A lot of people in Berland hates rain, but you do not. Rain pacifies, puts your thoughts in order. By these years you have developed a good tradition — when it rains, you go on the street and stay silent for a moment, contemplate all around you, enjoy freshness, think about big deeds you have to do.\n\nToday everything had changed quietly. You went on the street with a cup contained water, your favorite drink. In a moment when you were drinking a water you noticed that the process became quite long: the cup still contained water because of rain. You decided to make a formal model of what was happening and to find if it was possible to drink all water in that situation.\n\nThus, your cup is a cylinder with diameter equals $ d $ centimeters. Initial level of water in cup equals $ h $ centimeters from the bottom.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF667A/679254875ccc966f7b2d0a3100f2b1471739a385.png)You drink a water with a speed equals $ v $ milliliters per second. But rain goes with such speed that if you do not drink a water from the cup, the level of water increases on $ e $ centimeters per second. The process of drinking water from the cup and the addition of rain to the cup goes evenly and continuously.\n\nFind the time needed to make the cup empty or find that it will never happen. It is guaranteed that if it is possible to drink all water, it will happen not later than after $ 10^{4} $ seconds.\n\nNote one milliliter equals to one cubic centimeter.",
    "inputFormat": "The only line of the input contains four integer numbers $ d,h,v,e $ ( $ 1<=d,h,v,e<=10^{4} $ ), where:\n\n- $ d $ — the diameter of your cylindrical cup,\n- $ h $ — the initial level of water in the cup,\n- $ v $ — the speed of drinking process from the cup in milliliters per second,\n- $ e $ — the growth of water because of rain if you do not drink from the cup.",
    "outputFormat": "If it is impossible to make the cup empty, print \"NO\" (without quotes).\n\nOtherwise print \"YES\" (without quotes) in the first line. In the second line print a real number — time in seconds needed the cup will be empty. The answer will be considered correct if its relative or absolute error doesn't exceed $ 10^{-4} $ . It is guaranteed that if the answer exists, it doesn't exceed $ 10^{4} $ .",
    "samples": [
        [
            "1 2 3 100\n",
            "NO\n"
        ],
        [
            "1 1 1 1\n",
            "YES\n3.659792366325\n"
        ]
    ],
    "hint": "In the first example the water fills the cup faster than you can drink from it.\n\nIn the second example area of the cup's bottom equals to ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF667A/506f4185894e124cfe58ffcf17b4313e000f33cd.png), thus we can conclude that you decrease the level of water by ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF667A/579d2432e4049c40694278bdc86f2d43bba8e53d.png) centimeters per second. At the same time water level increases by $ 1 $ centimeter per second due to rain. Thus, cup will be empty in ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF667A/382da3ace88e5a3c5ce7f6802c7bb69b4823da44.png) seconds.",
    "translation": "## 题目描述\n\n有一个直径为 $d$ **厘米**的水桶。\n\n原先桶里水深度为 $h$ **厘米**。\n\n你在喝桶里的水，喝水的速度是 $v$ **毫升每秒**。\n\n不喝水时桶内水面上升速度为 $e$ **厘米每秒**。\n\n现在一边下雨，你一边喝桶里的水。\n\n如果你喝的速度赶不上降水速度，输出\"NO\"，否则输出\"YES\"和你需要几秒喝光水。\n\n## 输入格式\n\n四个整数 $d,h,v,e$。\n\n## 输出格式\n\n\"NO\"(不带引号)或者\"YES\"和喝光水需要的时间（一个实数）。"
}