{
    "description": "Theseus has just arrived to Crete to fight Minotaur. He found a labyrinth that has a form of a rectangular field of size $ n×m $ and consists of blocks of size $ 1×1 $ .\n\nEach block of the labyrinth has a button that rotates all blocks $ 90 $ degrees clockwise. Each block rotates around its center and doesn't change its position in the labyrinth. Also, each block has some number of doors (possibly none). In one minute, Theseus can either push the button in order to rotate all the blocks $ 90 $ degrees clockwise or pass to the neighbouring block. Theseus can go from block $ A $ to some neighbouring block $ B $ only if block $ A $ has a door that leads to block $ B $ and block $ B $ has a door that leads to block $ A $ .\n\nTheseus found an entrance to labyrinth and is now located in block $ (x_{T},y_{T}) $ — the block in the row $ x_{T} $ and column $ y_{T} $ . Theseus know that the Minotaur is hiding in block $ (x_{M},y_{M}) $ and wants to know the minimum number of minutes required to get there.\n\nTheseus is a hero, not a programmer, so he asks you to help him.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1<=n,m<=1000 $ ) — the number of rows and the number of columns in labyrinth, respectively.\n\nEach of the following $ n $ lines contains $ m $ characters, describing the blocks of the labyrinth. The possible characters are:\n\n- «+» means this block has $ 4 $ doors (one door to each neighbouring block);\n- «-» means this block has $ 2 $ doors — to the left and to the right neighbours;\n- «|» means this block has $ 2 $ doors — to the top and to the bottom neighbours;\n- «^» means this block has $ 1 $ door — to the top neighbour;\n- «>» means this block has $ 1 $ door — to the right neighbour;\n- «<» means this block has $ 1 $ door — to the left neighbour;\n- «v» means this block has $ 1 $ door — to the bottom neighbour;\n- «L» means this block has $ 3 $ doors — to all neighbours except left one;\n- «R» means this block has $ 3 $ doors — to all neighbours except right one;\n- «U» means this block has $ 3 $ doors — to all neighbours except top one;\n- «D» means this block has $ 3 $ doors — to all neighbours except bottom one;\n- «\\*» means this block is a wall and has no doors.\n\nLeft, right, top and bottom are defined from representing labyrinth as a table, where rows are numbered from $ 1 $ to $ n $ from top to bottom and columns are numbered from $ 1 $ to $ m $ from left to right.\n\nNext line contains two integers — coordinates of the block $ (x_{T},y_{T}) $ ( $ 1<=x_{T}<=n $ , $ 1<=y_{T}<=m $ ), where Theseus is initially located.\n\nLast line contains two integers — coordinates of the block $ (x_{M},y_{M}) $ ( $ 1<=x_{M}<=n $ , $ 1<=y_{M}<=m $ ), where Minotaur hides.\n\nIt's guaranteed that both the block where Theseus starts and the block where Minotaur is hiding have at least one door. Theseus and Minotaur may be initially located at the same block.",
    "outputFormat": "If Theseus is not able to get to Minotaur, then print -1 in the only line of the output. Otherwise, print the minimum number of minutes required to get to the block where Minotaur is hiding.",
    "samples": [
        [
            "2 2\n+*\n*U\n1 1\n2 2\n",
            "-1"
        ],
        [
            "2 3\n&lt;&gt;&lt;\n&gt;&lt;&gt;\n1 1\n2 1\n",
            "4"
        ]
    ],
    "hint": "Assume that Theseus starts at the block $ (x_{T},y_{T}) $ at the moment $ 0 $ .",
    "translation": "#### 题目描述\n\n给定 $n (1≤n≤100)$ 个数,从中找出尽可能多的数使得他们能够组成一个最长的等差数列。输出该最长等差数列的长度。\n\n注意：当 $n=1$ 时，构成长度为 $1$ 的等差数列。\n\n#### 输入格式\n\n第 $1$ 行：一个整数 $T (1≤T≤10)$ 为测试数据组数。\n\n每组测试数据按如下格式输入：\n\n第 $1$ 行：一个自然数 $n(1≤n≤100)$，表示数据的个数。\n\n第 $2$ 行到 $n+1$：每行输入一个自然数。\n\n#### 输出格式\n\n对于每个问题，输出一行问题的编号（$0$ 开始编号，格式：$\\texttt{case \\#0: }$ 等），然后在一行中输出按要求找到的最长等差数列的长度。"
}