{
    "description": "Kekoland is a country with $ n $ beautiful cities numbered from left to right and connected by $ n-1 $ roads. The $ i $ -th road connects cities $ i $ and $ i+1 $ and length of this road is $ w_{i} $ kilometers.\n\nWhen you drive in Kekoland, each time you arrive in city $ i $ by car you immediately receive $ g_{i} $ liters of gas. There is no other way to get gas in Kekoland.\n\nYou were hired by the Kekoland president Keko to organize the most beautiful race Kekoland has ever seen. Let race be between cities $ l $ and $ r $ ( $ l<=r $ ). Race will consist of two stages. On the first stage cars will go from city $ l $ to city $ r $ . After completing first stage, next day second stage will be held, now racers will go from $ r $ to $ l $ with their cars. Of course, as it is a race, racers drive directly from start city to finish city. It means that at the first stage they will go only right, and at the second stage they go only left. Beauty of the race between $ l $ and $ r $ is equal to $ r-l+1 $ since racers will see $ r-l+1 $ beautiful cities of Kekoland. Cars have infinite tank so racers will take all the gas given to them.\n\nAt the beginning of each stage racers start the race with empty tank ( $ 0 $ liters of gasoline). They will immediately take their gasoline in start cities ( $ l $ for the first stage and $ r $ for the second stage) right after the race starts.\n\nIt may not be possible to organize a race between $ l $ and $ r $ if cars will run out of gas before they reach finish.\n\nYou have $ k $ presents. Each time you give a present to city $ i $ its value $ g_{i} $ increases by $ 1 $ . You may distribute presents among cities in any way (also give many presents to one city, each time increasing $ g_{i} $ by $ 1 $ ). What is the most beautiful race you can organize?\n\nEach car consumes $ 1 $ liter of gas per one kilometer.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 2<=n<=100000 $ , $ 0<=k<=10^{9} $ ) — the number of cities in Kekoland and the number of presents you have, respectively.\n\nNext line contains $ n-1 $ integers. The $ i $ -th of them is $ w_{i} $ ( $ 1<=w_{i}<=10^{9} $ ) — the length of the road between city $ i $ and $ i+1 $ .\n\nNext line contains $ n $ integers. The $ i $ -th of them is $ g_{i} $ ( $ 0<=g_{i}<=10^{9} $ ) — the amount of gas you receive every time you enter city $ i $ .",
    "outputFormat": "Print a single line — the beauty of the most beautiful race you can organize.",
    "samples": [
        [
            "4 4\n2 2 2\n1 1 1 1\n",
            "4\n"
        ],
        [
            "8 5\n2 2 2 3 7 3 1\n1 3 1 5 4 0 2 5\n",
            "7\n"
        ]
    ],
    "hint": "In first sample if you give one present to each city then it will be possible to make a race between city $ 1 $ and city $ 4 $ .\n\nIn second sample you should add $ 1 $ to $ g_{5} $ and $ 4 $ to $ g_{6} $ , then it will be possible to make a race between cities $ 2 $ and $ 8 $ .",
    "translation": "有 $n$ 个点依次排成一列，第 $i$ 个点与第 $i + 1$ 个点之间的距离为 $w_i$ 个单位。\n\n第 $i$ 个点有一个加油站，可以给你的车加能跑 $g_i$ 个单位的油。\n\n你需要在 $l, r$ 之间往返（$l \\le r$），也就是说，要满足一辆没有油的车能从 $l$ 一路向右开到 $r$，也能从 $r$ 一路向左开到 $l$。\n\n车会在起点加好油，你可以在中途加油，但是方向是不能改变的。你可以假设车的油箱是无限大的。\n\n你还没选好 $l, r$ 的具体取值，不过你希望让你经过的点数尽量多，也就是让 $r - l + 1$ 尽量大。\n\n你现在有 $k$ 个机会，每个机会可以将任意一个 $g_i$ 增加 $1$。\n\n问：使用 $k$ 次机会后，能得到的最大的 $r - l + 1$ 是多少？"
}