{
    "description": "Recently Polycarp started to develop a text editor that works only with correct bracket sequences (abbreviated as CBS).\n\nNote that a bracket sequence is correct if it is possible to get a correct mathematical expression by adding \"+\"-s and \"1\"-s to it. For example, sequences \"(())()\", \"()\" and \"(()(()))\" are correct, while \")(\", \"(()\" and \"(()))(\" are not. Each bracket in CBS has a pair. For example, in \"(()(()))\":\n\n- 1st bracket is paired with 8th,\n- 2d bracket is paired with 3d,\n- 3d bracket is paired with 2d,\n- 4th bracket is paired with 7th,\n- 5th bracket is paired with 6th,\n- 6th bracket is paired with 5th,\n- 7th bracket is paired with 4th,\n- 8th bracket is paired with 1st.\n\nPolycarp's editor currently supports only three operations during the use of CBS. The cursor in the editor takes the whole position of one of the brackets (not the position between the brackets!). There are three operations being supported:\n\n- «L» — move the cursor one position to the left,\n- «R» — move the cursor one position to the right,\n- «D» — delete the bracket in which the cursor is located, delete the bracket it's paired to and all brackets between them (that is, delete a substring between the bracket in which the cursor is located and the one it's paired to).\n\nAfter the operation \"D\" the cursor moves to the nearest bracket to the right (of course, among the non-deleted). If there is no such bracket (that is, the suffix of the CBS was deleted), then the cursor moves to the nearest bracket to the left (of course, among the non-deleted).\n\nThere are pictures illustrated several usages of operation \"D\" below.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF670E/08b0f9032003921a97680a954e716fd13a3de759.png)All incorrect operations (shift cursor over the end of CBS, delete the whole CBS, etc.) are not supported by Polycarp's editor.\n\nPolycarp is very proud of his development, can you implement the functionality of his editor?",
    "inputFormat": "The first line contains three positive integers $ n $ , $ m $ and $ p $ ( $ 2<=n<=500000 $ , $ 1<=m<=500000 $ , $ 1<=p<=n $ ) — the number of brackets in the correct bracket sequence, the number of operations and the initial position of cursor. Positions in the sequence are numbered from left to right, starting from one. It is guaranteed that $ n $ is even.\n\nIt is followed by the string of $ n $ characters \"(\" and \")\" forming the correct bracket sequence.\n\nThen follow a string of $ m $ characters \"L\", \"R\" and \"D\" — a sequence of the operations. Operations are carried out one by one from the first to the last. It is guaranteed that the given operations never move the cursor outside the bracket sequence, as well as the fact that after all operations a bracket sequence will be non-empty.",
    "outputFormat": "Print the correct bracket sequence, obtained as a result of applying all operations to the initial sequence.",
    "samples": [
        [
            "8 4 5\n(())()()\nRDLD\n",
            "()\n"
        ],
        [
            "12 5 3\n((()())(()))\nRRDLD\n",
            "(()(()))\n"
        ],
        [
            "8 8 8\n(())()()\nLLLLLLDD\n",
            "()()\n"
        ]
    ],
    "hint": "In the first sample the cursor is initially at position $ 5 $ . Consider actions of the editor:\n\n1. command \"R\" — the cursor moves to the position $ 6 $ on the right;\n2. command \"D\" — the deletion of brackets from the position $ 5 $ to the position $ 6 $ . After that CBS takes the form (())(), the cursor is at the position $ 5 $ ;\n3. command \"L\" — the cursor moves to the position $ 4 $ on the left;\n4. command \"D\" — the deletion of brackets from the position $ 1 $ to the position $ 4 $ . After that CBS takes the form (), the cursor is at the position $ 1 $ .\n\nThus, the answer is equal to ().",
    "translation": "### 题目描述\n\n`Polycarp`有一个长度为 $n$ 的括号串。\n\n我们设 $pre_i$ 为字符串中第 $1$ 位到第 $i$ 位的左括号数量减去右括号数量，那么当每个 $1\\leqslant i\\leqslant n$ ， $pre_i\\geqslant0$ 。同时 $pre_n=0$ 时，我们认为这个括号串合法。\n\n现在`Polycarp`为合法括号串设计了一种编辑器，这个编辑器支持如下操作:\n\n1. `L`，将光标左移一格\n2. `R`，将光标右移一格\n3. `D`，删除这个括号到与它对应的括号之间的所有字符，在删除之后，光标会跳到它右边的没有被删除的最左边的括号处，如果没有这样的括号了，那么光标会跳到它左边的没有被删除的最右边的括号处。\n\n举个例子:\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF670E/08b0f9032003921a97680a954e716fd13a3de759.png)\n\n上图中，在第一排左边的串使用`D`，使得 $[2,3]$ 全部被删掉了。\n\n第二排中，使用`D`，删除了 $[4,7]$ ，因为第 $7$ 个括号的配对括号在 $4$ 处。\n\n第三排也是一样。\n\n`Polycarp`的编辑器不支持错误的操作，例如删掉整个字符串。\n\n`Polycarp`对他的设计感到自豪，但是他不会实现这个编辑器，所以他想请你来帮他实现，你能帮他实现编辑器的功能吗？\n\n### 输入格式\n\n输入共三行。\n\n第一行，三个整数 $n,m,p$ ，分别表示括号串长度，操作数量和光标的初始位置。\n\n第二行，一个长度为 $n$ 的括号串。\n\n第三行，一个长度为 $m$ 的字符串，表示操作序列。\n\n### 输出格式\n\n输出共一行。\n\n第一行，一个括号串。表示原括号串进行了 $m$ 个操作过后的括号串。\n\n### 数据范围\n\n$1\\leqslant p\\leqslant n\\leqslant 5\\times 10^5,1\\leqslant m\\leqslant 5\\times 10^5$"
}