{
    "description": "In late autumn evening $ n $ robots gathered in the cheerful company of friends. Each robot has a unique identifier — an integer from $ 1 $ to $ 10^{9} $ .\n\nAt some moment, robots decided to play the game \"Snowball\". Below there are the rules of this game. First, all robots stand in a row. Then the first robot says his identifier. After that the second robot says the identifier of the first robot and then says his own identifier. Then the third robot says the identifier of the first robot, then says the identifier of the second robot and after that says his own. This process continues from left to right until the $ n $ -th robot says his identifier.\n\nYour task is to determine the $ k $ -th identifier to be pronounced.",
    "inputFormat": "The first line contains two positive integers $ n $ and $ k $ ( $ 1<=n<=100000 $ , $ 1<=k<=min(2·10^{9},n·(n+1)/2 $ ).\n\nThe second line contains the sequence $ id_{1},id_{2},...,id_{n} $ ( $ 1<=id_{i}<=10^{9} $ ) — identifiers of roborts. It is guaranteed that all identifiers are different.",
    "outputFormat": "Print the $ k $ -th pronounced identifier (assume that the numeration starts from $ 1 $ ).",
    "samples": [
        [
            "2 2\n1 2\n",
            "1\n"
        ],
        [
            "4 5\n10 4 18 3\n",
            "4\n"
        ]
    ],
    "hint": "In the first sample identifiers of robots will be pronounced in the following order: $ 1 $ , $ 1 $ , $ 2 $ . As $ k=2 $ , the answer equals to $ 1 $ .\n\nIn the second test case identifiers of robots will be pronounced in the following order: $ 10 $ , $ 10 $ , $ 4 $ , $ 10 $ , $ 4 $ , $ 18 $ , $ 10 $ , $ 4 $ , $ 18 $ , $ 3 $ . As $ k=5 $ , the answer equals to $ 4 $ .",
    "translation": "## 题目描述\n有$n(n\\leq100000)$个机器人，每个机器人都有一个唯一的整数序号，该序号在$1$到$10^9$之间。他们在做一个叫“滚雪球”的游戏，即第一个机器人说出第一个机器人的序号，第二个机器人说出第一到第二个机器人的序号，第三个机器人说出第一到第三个机器人的序号……以此类推。求第$k(k\\leq min(2\\cdot10^9,n\\cdot(n+1)/2)$个被说出的序号。\n## 输入格式\n第一行包含两个整数$n$和$k$（范围如上所述）。\n\n第二行包含$n$个整数，第$i$个整数代表第$i$个机器人的序号。\n## 输出格式\n一行，包含第$k$个被说出的序号\n"
}