{
    "description": "Vanya smashes potato in a vertical food processor. At each moment of time the height of the potato in the processor doesn't exceed $ h $ and the processor smashes $ k $ centimeters of potato each second. If there are less than $ k $ centimeters remaining, than during this second processor smashes all the remaining potato.\n\nVanya has $ n $ pieces of potato, the height of the $ i $ -th piece is equal to $ a_{i} $ . He puts them in the food processor one by one starting from the piece number $ 1 $ and finishing with piece number $ n $ . Formally, each second the following happens:\n\n1. If there is at least one piece of potato remaining, Vanya puts them in the processor one by one, until there is not enough space for the next piece.\n2. Processor smashes $ k $ centimeters of potato (or just everything that is inside).\n\nProvided the information about the parameter of the food processor and the size of each potato in a row, compute how long will it take for all the potato to become smashed.",
    "inputFormat": "The first line of the input contains integers $ n $ , $ h $ and $ k $ ( $ 1<=n<=100000,1<=k<=h<=10^{9} $ ) — the number of pieces of potato, the height of the food processor and the amount of potato being smashed each second, respectively.\n\nThe second line contains $ n $ integers $ a_{i} $ ( $ 1<=a_{i}<=h $ ) — the heights of the pieces.",
    "outputFormat": "Print a single integer — the number of seconds required to smash all the potatoes following the process described in the problem statement.",
    "samples": [
        [
            "5 6 3\n5 4 3 2 1\n",
            "5\n"
        ],
        [
            "5 6 3\n5 5 5 5 5\n",
            "10\n"
        ],
        [
            "5 6 3\n1 2 1 1 1\n",
            "2\n"
        ]
    ],
    "hint": "Consider the first sample.\n\n1. First Vanya puts the piece of potato of height $ 5 $ into processor. At the end of the second there is only amount of height $ 2 $ remaining inside.\n2. Now Vanya puts the piece of potato of height $ 4 $ . At the end of the second there is amount of height $ 3 $ remaining.\n3. Vanya puts the piece of height $ 3 $ inside and again there are only $ 3 $ centimeters remaining at the end of this second.\n4. Vanya finally puts the pieces of height $ 2 $ and $ 1 $ inside. At the end of the second the height of potato in the processor is equal to $ 3 $ .\n5. During this second processor finally smashes all the remaining potato and the process finishes.\n\nIn the second sample, Vanya puts the piece of height $ 5 $ inside and waits for $ 2 $ seconds while it is completely smashed. Then he repeats the same process for $ 4 $ other pieces. The total time is equal to $ 2·5=10 $ seconds.\n\nIn the third sample, Vanya simply puts all the potato inside the processor and waits $ 2 $ seconds.",
    "translation": "瓦尼亚在一个垂直的食品处理器中粉碎土豆。  \r\n你可以把它想象成一个圆柱体，从上面塞入，从下面粉碎后吐出。    \r\n每个土豆可以视为条状。\r\n\r\n处理器中的土豆高度不超过$h$(否则会满出来)，处理器每秒粉碎$k$厘米的土豆。如果处理器里剩不到$k$厘米土豆，则粉碎所有剩余的土豆。\r\n\r\n\r\n\r\n瓦尼亚有$n$条土豆，第$i$块的长度等于$a_i$。他把它们按顺序从$1$号到$n$号放进食品处理器，从$1$号开始，到$n$号结束。\r\n\r\n每秒会发生如下事件：\r\n\r\n1.如果还有至少一条土豆没放进去，瓦尼亚将它们逐一放入处理器，直到没有足够的空间放置下一片，即塞到塞不进为止。\r\n\r\n2.处理器粉碎了$k$厘米或剩下全部的土豆。\r\n\r\n\r\n## 输入输出格式\r\n\r\n### 输入格式：\r\n\r\n输入的第一行包含整数$n$、$h$和$k$  \r\n（$1≤n≤100 000,1≤k≤h≤109$），含义如上。\r\n\r\n\r\n\r\n第二行包含$n$个整数$a_i$（1≤a_i≤h），即土豆长度。\r\n\r\n\r\n\r\n### 输出格式：\r\n\r\n最短需要粉碎所有土豆的时间。"
}