{
    "description": "This problem is given in two versions that differ only by constraints. If you can solve this problem in large constraints, then you can just write a single solution to the both versions. If you find the problem too difficult in large constraints, you can write solution to the simplified version only.\n\nWaking up in the morning, Apollinaria decided to bake cookies. To bake one cookie, she needs $ n $ ingredients, and for each ingredient she knows the value $ a_{i} $ — how many grams of this ingredient one needs to bake a cookie. To prepare one cookie Apollinaria needs to use all $ n $ ingredients.\n\nApollinaria has $ b_{i} $ gram of the $ i $ -th ingredient. Also she has $ k $ grams of a magic powder. Each gram of magic powder can be turned to exactly $ 1 $ gram of any of the $ n $ ingredients and can be used for baking cookies.\n\nYour task is to determine the maximum number of cookies, which Apollinaria is able to bake using the ingredients that she has and the magic powder.",
    "inputFormat": "The first line of the input contains two positive integers $ n $ and $ k $ ( $ 1<=n,k<=1000 $ ) — the number of ingredients and the number of grams of the magic powder.\n\nThe second line contains the sequence $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=1000 $ ), where the $ i $ -th number is equal to the number of grams of the $ i $ -th ingredient, needed to bake one cookie.\n\nThe third line contains the sequence $ b_{1},b_{2},...,b_{n} $ ( $ 1<=b_{i}<=1000 $ ), where the $ i $ -th number is equal to the number of grams of the $ i $ -th ingredient, which Apollinaria has.",
    "outputFormat": "Print the maximum number of cookies, which Apollinaria will be able to bake using the ingredients that she has and the magic powder.",
    "samples": [
        [
            "3 1\n2 1 4\n11 3 16\n",
            "4\n"
        ],
        [
            "4 3\n4 3 5 6\n11 12 14 20\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample it is profitably for Apollinaria to make the existing $ 1 $ gram of her magic powder to ingredient with the index $ 2 $ , then Apollinaria will be able to bake $ 4 $ cookies.\n\nIn the second sample Apollinaria should turn $ 1 $ gram of magic powder to ingredient with the index $ 1 $ and $ 1 $ gram of magic powder to ingredient with the index $ 3 $ . Then Apollinaria will be able to bake $ 3 $ cookies. The remaining $ 1 $ gram of the magic powder can be left, because it can't be used to increase the answer.",
    "translation": "### 题目描述\r\n**注意**：本题有两个不同的版本，分别对应两个不同的难度。\r\n\r\n早晨醒来，Apollinaria决定烘焙曲奇。烘焙一块曲奇需要 $n$ 种食材，她知道对于每一种食材需要在曲奇中放入 $a_i$ 克。为了准备一块曲奇，Apollinaria需要准备所有 $n$ 种食材。\r\n\r\n对于第 $i$ 种食材，Apollinaria有 $b_i$ 克。她拥有 $k$ 克魔法能量。每 $1$ 克魔法能量都能恰好转换成为任意 $n$ 中食材中的一种。\r\n\r\n请你帮助Apollinaria计算她使用已有的食材和她的魔法能量最多可以烘焙出多少曲奇。\r\n\r\n### 输入格式\r\n第一行包含两个正整数 $n,k$ $(1 \\leq n,k \\leq 1000)$，分别代表食材的数量和魔法能量的数量。\r\n\r\n第二行包括一个长度为 $n$ 的序列 $a_1,a_2,\\dots,a_n$ $(1 \\leq a_i \\leq 1000)$，第 $i$ 个食材的值代表第 $i$ 个食材在烘焙一块曲奇中所需要的量。\r\n\r\n第三行包括一个长度为 $n$ 的序列 $b_1,b_2,\\dots,b_n$ $(1 \\leq b_i \\leq 1000)$，第 $i$ 个食材的值代表Apollinaria所拥有的第 $i$ 个食材的数量。\r\n\r\n### 输出格式\r\n输出Apollinaria使用原有食材和魔法能量可以烘焙出的最多的曲奇数量。\r\n\r\n### 说明/提示\r\n样例一说明：将 $1$ 个魔法能量转换成第 $2$ 个食材，这样可以制作出 $4$ 块曲奇。\r\n\r\n样例二说明：将 $2$ 个魔法能量转换成第 $1,3$ 个食材，这样可以制作出 $3$ 块曲奇。剩下的 $1$ 个魔法能量可以不使用，因为这不会使得最终答案增加。"
}