{
    "description": "Mary has just graduated from one well-known University and is now attending celebration party. Students like to dream of a beautiful life, so they used champagne glasses to construct a small pyramid. The height of the pyramid is $ n $ . The top level consists of only $ 1 $ glass, that stands on $ 2 $ glasses on the second level (counting from the top), then $ 3 $ glasses on the third level and so on.The bottom level consists of $ n $ glasses.\n\nVlad has seen in the movies many times how the champagne beautifully flows from top levels to bottom ones, filling all the glasses simultaneously. So he took a bottle and started to pour it in the glass located at the top of the pyramid.\n\nEach second, Vlad pours to the top glass the amount of champagne equal to the size of exactly one glass. If the glass is already full, but there is some champagne flowing in it, then it pours over the edge of the glass and is equally distributed over two glasses standing under. If the overflowed glass is at the bottom level, then the champagne pours on the table. For the purpose of this problem we consider that champagne is distributed among pyramid glasses immediately. Vlad is interested in the number of completely full glasses if he stops pouring champagne in $ t $ seconds.\n\nPictures below illustrate the pyramid consisting of three levels.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF676B/ed339075e4609507dba05c150b7d4a59f8205147.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF676B/26451ba18b38a1279a26b3d7ab7f9bf63116bb12.png)",
    "inputFormat": "The only line of the input contains two integers $ n $ and $ t $ ( $ 1<=n<=10,0<=t<=10000 $ ) — the height of the pyramid and the number of seconds Vlad will be pouring champagne from the bottle.",
    "outputFormat": "Print the single integer — the number of completely full glasses after $ t $ seconds.",
    "samples": [
        [
            "3 5\n",
            "4\n"
        ],
        [
            "4 8\n",
            "6\n"
        ]
    ],
    "hint": "In the first sample, the glasses full after $ 5 $ seconds are: the top glass, both glasses on the second level and the middle glass at the bottom level. Left and right glasses of the bottom level will be half-empty.",
    "translation": "有一个n层高的酒杯金字塔（就像一个三角形，第n-1层比第n层少一个），一个人从最上面的酒杯开始匀速倒酒，每秒倒正好一杯的酒，如果这个杯子满了同时又有酒从上面倒下来的话，这个杯子会往它两侧了杯子按（1/2）的速度向下倒酒，如果下面没有杯子了酒就会倒在桌上 ~~（太浪费了！~~\r\n\r\n输入仅一行：n(酒杯金字塔的高度)和t(秒数)\r\n\r\n输出也是一行：ans(已满的酒杯数量 ~~漏桌上的不算~~ )"
}