{
    "description": "A wise man told Kerem \"Different is good\" once, so Kerem wants all things in his life to be different.\n\nKerem recently got a string $ s $ consisting of lowercase English letters. Since Kerem likes it when things are different, he wants all substrings of his string $ s $ to be distinct. Substring is a string formed by some number of consecutive characters of the string. For example, string \"aba\" has substrings \"\" (empty substring), \"a\", \"b\", \"a\", \"ab\", \"ba\", \"aba\".\n\nIf string $ s $ has at least two equal substrings then Kerem will change characters at some positions to some other lowercase English letters. Changing characters is a very tiring job, so Kerem want to perform as few changes as possible.\n\nYour task is to find the minimum number of changes needed to make all the substrings of the given string distinct, or determine that it is impossible.",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 1<=n<=100000 $ ) — the length of the string $ s $ .\n\nThe second line contains the string $ s $ of length $ n $ consisting of only lowercase English letters.",
    "outputFormat": "If it's impossible to change the string $ s $ such that all its substring are distinct print -1. Otherwise print the minimum required number of changes.",
    "samples": [
        [
            "2\naa\n",
            "1\n"
        ],
        [
            "4\nkoko\n",
            "2\n"
        ],
        [
            "5\nmurat\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample one of the possible solutions is to change the first character to 'b'.\n\nIn the second sample, one may change the first character to 'a' and second character to 'b', so the string becomes \"abko\".",
    "translation": "给你一个N位字符串(全是字母)(1<=N<=100000)。让你求至少要多少次，才能让字符串中的字母都不相同(只能改变成字母)。 如果改变不了，输出-1。\n\n感谢@Zealot 提供的翻译"
}