{
    "description": "Gerda is travelling to the palace of the Snow Queen.\n\nThe road network consists of $ n $ intersections and $ m $ bidirectional roads. Roads are numbered from $ 1 $ to $ m $ . Snow Queen put a powerful spell on the roads to change the weather conditions there. Now, if Gerda steps on the road $ i $ at the moment of time less or equal to $ i $ , she will leave the road exactly at the moment $ i $ . In case she steps on the road $ i $ at the moment of time greater than $ i $ , she stays there forever.\n\nGerda starts at the moment of time $ l $ at the intersection number $ s $ and goes to the palace of the Snow Queen, located at the intersection number $ t $ . Moreover, she has to be there at the moment $ r $ (or earlier), before the arrival of the Queen.\n\nGiven the description of the road network, determine for $ q $ queries $ l_{i} $ , $ r_{i} $ , $ s_{i} $ and $ t_{i} $ if it's possible for Gerda to get to the palace on time.",
    "inputFormat": "The first line of the input contains integers $ n $ , $ m $ and $ q $ ( $ 2<=n<=1000 $ , $ 1<=m,q<=200000 $ ) — the number of intersections in the road network of Snow Queen's Kingdom, the number of roads and the number of queries you have to answer.\n\nThe $ i $ -th of the following $ m $ lines contains the description of the road number $ i $ . The description consists of two integers $ v_{i} $ and $ u_{i} $ ( $ 1<=v_{i},u_{i}<=n $ , $ v_{i}≠u_{i} $ ) — the indices of the intersections connected by the $ i $ -th road. It's possible to get both from $ v_{i} $ to $ u_{i} $ and from $ u_{i} $ to $ v_{i} $ using only this road. Each pair of intersection may appear several times, meaning there are several roads connecting this pair.\n\nLast $ q $ lines contain the queries descriptions. Each of them consists of four integers $ l_{i} $ , $ r_{i} $ , $ s_{i} $ and $ t_{i} $ ( $ 1<=l_{i}<=r_{i}<=m $ , $ 1<=s_{i},t_{i}<=n $ , $ s_{i}≠t_{i} $ ) — the moment of time Gerda starts her journey, the last moment of time she is allowed to arrive to the palace, the index of the starting intersection and the index of the intersection where palace is located.",
    "outputFormat": "For each query print \"Yes\" (without quotes) if Gerda can be at the Snow Queen palace on time (not later than $ r_{i} $ ) or \"No\" (without quotes) otherwise.",
    "samples": [
        [
            "5 4 6\n1 2\n2 3\n3 4\n3 5\n1 3 1 4\n1 3 2 4\n1 4 4 5\n1 4 4 1\n2 3 1 4\n2 2 2 3\n",
            "Yes\nYes\nYes\nNo\nNo\nYes\n"
        ]
    ],
    "hint": "",
    "translation": "给你一张图，每一条边都有一个编号 $i$ ，经过每条边的时间为 $1$ ，如果当你到达这条边的时间小于 $i$ 的话，就必须等到i才能走出这条边，如果大于 $i$ ，就走不出去了，也就是不通了。然后给你一些询问 $l$ , $r$ , $s$ , $t$ ，问你是否可以从 $s$ 出发，时间为 $l$，在 $r$ 时间之前到达 $t$ 。"
}