{
    "description": "Someone gave Alyona an array containing $ n $ positive integers $ a_{1},a_{2},...,a_{n} $ . In one operation, Alyona can choose any element of the array and decrease it, i.e. replace with any positive integer that is smaller than the current one. Alyona can repeat this operation as many times as she wants. In particular, she may not apply any operation to the array at all.\n\nFormally, after applying some operations Alyona will get an array of $ n $ positive integers $ b_{1},b_{2},...,b_{n} $ such that $ 1<=b_{i}<=a_{i} $ for every $ 1<=i<=n $ . Your task is to determine the maximum possible value of mex of this array.\n\nMex of an array in this problem is the minimum positive integer that doesn't appear in this array. For example, mex of the array containing $ 1 $ , $ 3 $ and $ 4 $ is equal to $ 2 $ , while mex of the array containing $ 2 $ , $ 3 $ and $ 2 $ is equal to $ 1 $ .",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of elements in the Alyona's array.\n\nThe second line of the input contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{9} $ ) — the elements of the array.",
    "outputFormat": "Print one positive integer — the maximum possible value of mex of the array after Alyona applies some (possibly none) operations.",
    "samples": [
        [
            "5\n1 3 3 3 6\n",
            "5\n"
        ],
        [
            "2\n2 1\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample case if one will decrease the second element value to $ 2 $ and the fifth element value to $ 4 $ then the mex value of resulting array $ 1 $ $ 2 $ $ 3 $ $ 3 $ $ 4 $ will be equal to $ 5 $ .\n\nTo reach the answer to the second sample case one must not decrease any of the array elements.",
    "translation": "给一个序列，所有的数都可以变成比他小的数。\n\n最大化这个序列第一个没有出现的正整数值，并输出这个值。"
}