{
    "description": "After their adventure with the magic mirror Kay and Gerda have returned home and sometimes give free ice cream to kids in the summer.\n\nAt the start of the day they have $ x $ ice cream packs. Since the ice cream is free, people start standing in the queue before Kay and Gerda's house even in the night. Each person in the queue wants either to take several ice cream packs for himself and his friends or to give several ice cream packs to Kay and Gerda (carriers that bring ice cream have to stand in the same queue).\n\nIf a carrier with $ d $ ice cream packs comes to the house, then Kay and Gerda take all his packs. If a child who wants to take $ d $ ice cream packs comes to the house, then Kay and Gerda will give him $ d $ packs if they have enough ice cream, otherwise the child will get no ice cream at all and will leave in distress.\n\nKay wants to find the amount of ice cream they will have after all people will leave from the queue, and Gerda wants to find the number of distressed kids.",
    "inputFormat": "The first line contains two space-separated integers $ n $ and $ x $ ( $ 1<=n<=1000 $ , $ 0<=x<=10^{9} $ ).\n\nEach of the next $ n $ lines contains a character '+' or '-', and an integer $ d_{i} $ , separated by a space ( $ 1<=d_{i}<=10^{9} $ ). Record \"+  $ d_{i} $ \" in $ i $ -th line means that a carrier with $ d_{i} $ ice cream packs occupies $ i $ -th place from the start of the queue, and record \"-  $ d_{i} $ \" means that a child who wants to take $ d_{i} $ packs stands in $ i $ -th place.",
    "outputFormat": "Print two space-separated integers — number of ice cream packs left after all operations, and number of kids that left the house in distress.",
    "samples": [
        [
            "5 7\n+ 5\n- 10\n- 20\n+ 40\n- 20\n",
            "22 1\n"
        ],
        [
            "5 17\n- 16\n- 2\n- 98\n+ 100\n- 98\n",
            "3 2\n"
        ]
    ],
    "hint": "Consider the first sample.\n\n1. Initially Kay and Gerda have $ 7 $ packs of ice cream.\n2. Carrier brings $ 5 $ more, so now they have $ 12 $ packs.\n3. A kid asks for $ 10 $ packs and receives them. There are only $ 2 $ packs remaining.\n4. Another kid asks for $ 20 $ packs. Kay and Gerda do not have them, so the kid goes away distressed.\n5. Carrier bring $ 40 $ packs, now Kay and Gerda have $ 42 $ packs.\n6. Kid asks for $ 20 $ packs and receives them. There are $ 22 $ packs remaining.",
    "translation": "## 题目描述\n凯和格尔达开了个冰淇凌店。他们最开始有x个冰淇淋。冰淇淋是免费的。人们可以给他们提供d个冰淇淋，也可以从他们这里要d个冰淇淋。若他们的冰淇淋不够给要冰淇淋的人，要冰淇淋的人会失落，他们的冰淇淋不会减少。他们想知道收摊以后，他们还剩多少冰淇淋和有多少失落的人。\n## 输入输出格式\n### 输入格式\n输入n,x（1<=n<=1000,0<=x<=10^9）,表示有n个人，最开始有x个冰淇淋\n接下来每行输入‘+’或‘-’和d，“+ d”表示有人给了d个冰淇淋，“- d”表示有人想要d个冰淇淋\n### 输出格式\n输出两个数，剩的冰淇淋数和失落的人数"
}