{
    "description": "Vasya has $ n $ days of vacations! So he decided to improve his IT skills and do sport. Vasya knows the following information about each of this $ n $ days: whether that gym opened and whether a contest was carried out in the Internet on that day. For the $ i $ -th day there are four options:\n\n1. on this day the gym is closed and the contest is not carried out;\n2. on this day the gym is closed and the contest is carried out;\n3. on this day the gym is open and the contest is not carried out;\n4. on this day the gym is open and the contest is carried out.\n\nOn each of days Vasya can either have a rest or write the contest (if it is carried out on this day), or do sport (if the gym is open on this day).\n\nFind the minimum number of days on which Vasya will have a rest (it means, he will not do sport and write the contest at the same time). The only limitation that Vasya has — he does not want to do the same activity on two consecutive days: it means, he will not do sport on two consecutive days, and write the contest on two consecutive days.",
    "inputFormat": "The first line contains a positive integer $ n $ ( $ 1<=n<=100 $ ) — the number of days of Vasya's vacations.\n\nThe second line contains the sequence of integers $ a_{1},a_{2},...,a_{n} $ ( $ 0<=a_{i}<=3 $ ) separated by space, where:\n\n- $ a_{i} $ equals 0, if on the $ i $ -th day of vacations the gym is closed and the contest is not carried out;\n- $ a_{i} $ equals 1, if on the $ i $ -th day of vacations the gym is closed, but the contest is carried out;\n- $ a_{i} $ equals 2, if on the $ i $ -th day of vacations the gym is open and the contest is not carried out;\n- $ a_{i} $ equals 3, if on the $ i $ -th day of vacations the gym is open and the contest is carried out.",
    "outputFormat": "Print the minimum possible number of days on which Vasya will have a rest. Remember that Vasya refuses:\n\n- to do sport on any two consecutive days,\n- to write the contest on any two consecutive days.",
    "samples": [
        [
            "4\n1 3 2 0\n",
            "2\n"
        ],
        [
            "7\n1 3 3 2 1 2 3\n",
            "0\n"
        ],
        [
            "2\n2 2\n",
            "1\n"
        ]
    ],
    "hint": "In the first test Vasya can write the contest on the day number 1 and do sport on the day number 3. Thus, he will have a rest for only 2 days.\n\nIn the second test Vasya should write contests on days number 1, 3, 5 and 7, in other days do sport. Thus, he will not have a rest for a single day.\n\nIn the third test Vasya can do sport either on a day number 1 or number 2. He can not do sport in two days, because it will be contrary to the his limitation. Thus, he will have a rest for only one day.",
    "translation": "Vasya 有 $n$ 天的假期，每天有四种选择：\n\n+ 在这一天，健身房关闭，比赛不进行，表示为 $0$；\n\n+ 在这一天，健身房关闭，比赛进行，表示为 $1$；\n\n+ 在这一天，健身房是开放的，比赛不进行，表示为 $2$；\n\n+ 在这一天，健身房是开放的，比赛是进行的，表示为 $3$。\n\n在每一天，Vasya 可以休息、比赛 (如果在这一天进行)，或者做运动 (如果健身房在这一天是开放的)。\n\n但 Vasya 不想连续两天做同样的活动，这意味着，他不会连续两天做运动，也不会在连续两天写比赛。\n\n找出 Vasya 休息的最少天数。\n\n$1\\le n\\le 100$，$0\\le a_i\\le 3$。"
}