{
    "description": "Zombies have found out about the Zombie Contamination level checker and managed to damage it! Now detecting the shape of their main compound will be a real challenge for Heidi. As before, a lair can be represented as a strictly convex polygon on a lattice. Each vertex of the polygon occupies a point on the lattice. However, the damaged Zombie Contamination level checker can only tell, for each cell, whether the level of Zombie Contamination for that cell is in the set $ {1,2,3} $ . In other words, Heidi knows all the cells of the lattice for which the Contamination level is not $ 0 $ and not $ 4 $ .\n\nGiven this information, Heidi still wants to know the exact shape of the lair to rain destruction on the zombies. Help her!",
    "inputFormat": "The input contains multiple test cases.\n\nThe first line of each test case contains two space-separated integers $ N $ and $ M $ , where $ N $ is the size of the lattice grid ( $ 5<=N<=100000 $ ) and $ M $ is the number of lattice points for which the Zombie Contamination level is 1, 2, or 3 ( $ 8<=M<=200000 $ ).\n\nThe second line of each test case contains $ M $ pairs of integers $ x_{1},y_{1},...,x_{M},y_{M} $ – coordinates of the cells with Zombie Contamination level not equal to 0 nor 4. It is guaranteed that $ 1<=x_{i},y_{i}<=N $ . All pairs $ x_{i},y_{i} $ are different.\n\nCells are enumerated based on the coordinates of their upper right corner. This means that the bottommost leftmost cell that touches the origin has coordinates $ (1,1) $ , and the uppermost leftmost cell is identified as $ (1,N) $ .\n\nThe last line of the file contains two zeroes. This line should not be treated as a test case. The sum of the $ M $ values for all tests in one file will not exceed $ 200000 $ .",
    "outputFormat": "For each test case, the following output is expected:\n\nThe first line of the output should contain one integer $ V $ , the number of vertices of the polygon that is the secret lair. The next $ V $ lines each should contain two integers, denoting the vertices of the polygon in the clockwise order, starting from the lexicographically smallest vertex.",
    "samples": [
        [
            "8 19\n2 3 2 4 2 5 3 3 3 5 4 3 4 5 4 6 5 2 5 3 5 6 6 2 6 3 6 4 6 5 6 6 6 7 7 6 7 7\n5 8\n2 2 2 3 2 4 3 2 3 4 4 2 4 3 4 4\n0 0\n",
            "4\n2 3\n2 4\n6 6\n5 2\n4\n2 2\n2 3\n3 3\n3 2\n"
        ]
    ],
    "hint": "It is guaranteed that the solution always exists and is unique. It is guaranteed that in the correct solution the coordinates of the polygon vertices are between $ 1 $ and $ N-1 $ . A vertex $ (x_{1},y_{1}) $ is lexicographically smaller than vertex $ (x_{2},y_{2}) $ if $ x_{1}<x_{2} $ or ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF690B3/d2bfbe49d551bf0cc9cbeba8f0c1469bad61d202.png)."
}