{
    "description": "Barney was hanging out with Nora for a while and now he thinks he may have feelings for her. Barney wants to send her a cheesy text message and wants to make her as happy as possible.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF696D/5ab3ea47563ae6400cc578e63bb9e0de4cf3a082.png)Initially, happiness level of Nora is $ 0 $ . Nora loves some pickup lines like \"I'm falling for you\" and stuff. Totally, she knows $ n $ pickup lines, each consisting only of lowercase English letters, also some of them may be equal (in writing, but different in pronouncing or meaning though). Every time Nora sees $ i $ -th pickup line as a consecutive subsequence of Barney's text message her happiness level increases by $ a_{i} $ . These substrings may overlap, for example, Nora will see the pickup line aa twice and the pickup line ab once in text message aaab.\n\nDue to texting app limits, Barney's text may have up to $ l $ characters.\n\nBarney asked you to help him make Nora as much happy as possible, it's gonna be legen...",
    "inputFormat": "The first line of input contains two integers $ n $ and $ l $ ( $ 1<=n<=200,1<=l<=10^{14} $ ) — the number of pickup lines and the maximum length of Barney's text.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=100 $ ), meaning that Nora's happiness level increases by $ a_{i} $ after every time seeing $ i $ -th pickup line.\n\nThe next $ n $ lines contain the pickup lines. $ i $ -th of them contains a single string $ s_{i} $ consisting of only English lowercase letter. Summary length of all pickup lines does not exceed $ 200 $ .\n\nAll strings are not empty.",
    "outputFormat": "Print the only integer — the maximum possible value of Nora's happiness level after reading Barney's text.",
    "samples": [
        [
            "3 6\n3 2 1\nheart\nearth\nart\n",
            "6\n"
        ],
        [
            "3 6\n3 2 8\nheart\nearth\nart\n",
            "16\n"
        ]
    ],
    "hint": "An optimal answer for the first sample case is hearth containing each pickup line exactly once.\n\nAn optimal answer for the second sample case is artart.",
    "translation": "\n\nBarney与Nora一起玩的时候，觉得自己喜欢上Nora了。他想给她发一段信息让她开心。\n\nNora的初始快乐值是0 。Nora喜欢“我深深地爱上你了”这样的情话。她一共知道n句情话，每句仅包含小写英文字母，其中的一些可能相同（写法相同，但读音或意思是不同的）。每次Nora在Barney的信息中看到第i句情话，她的快乐值就会增加$a_i$ 。这些情话在信息中可能重叠。例如，在aaab 中，Nora会看到aa 两次，看到ab 一次。\n\n因为短信的长度限制，Barney的短信最长含有lll 个字符。Barney想让你帮他让Nora尽可能开心。\n"
}