{
    "description": "Now that Heidi has made sure her Zombie Contamination level checker works, it's time to strike! This time, the zombie lair is a strictly convex polygon on the lattice. Each vertex of the polygon occupies a point on the lattice. For each cell of the lattice, Heidi knows the level of Zombie Contamination – the number of corners of the cell that are inside or on the border of the lair.\n\nGiven this information, Heidi wants to know the exact shape of the lair to rain destruction on the zombies. Help her!\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF690B2/2c935730d8a3e2a07073e9f21e778227fe9ea585.png)",
    "inputFormat": "The input contains multiple test cases.\n\nThe first line of each test case contains one integer $ N $ , the size of the lattice grid ( $ 5<=N<=500 $ ). The next $ N $ lines each contain $ N $ characters, describing the level of Zombie Contamination of each cell in the lattice. Every character of every line is a digit between 0 and 4.\n\nCells are given in the same order as they are shown in the picture above: rows go in the decreasing value of $ y $ coordinate, and in one row cells go in the order of increasing $ x $ coordinate. This means that the first row corresponds to cells with coordinates $ (1,N),...,(N,N) $ and the last row corresponds to cells with coordinates $ (1,1),...,(N,1) $ .\n\nThe last line of the file contains a zero. This line should not be treated as a test case. The sum of the $ N $ values for all tests in one file will not exceed $ 5000 $ .",
    "outputFormat": "For each test case, give the following output:\n\nThe first line of the output should contain one integer $ V $ , the number of vertices of the polygon that is the secret lair. The next $ V $ lines each should contain two integers, denoting the vertices of the polygon in the clockwise order, starting from the lexicographically smallest vertex.",
    "samples": [
        [
            "8\n00000000\n00000110\n00012210\n01234200\n02444200\n01223200\n00001100\n00000000\n5\n00000\n01210\n02420\n01210\n00000\n7\n0000000\n0122100\n0134200\n0013200\n0002200\n0001100\n0000000\n0\n",
            "4\n2 3\n2 4\n6 6\n5 2\n4\n2 2\n2 3\n3 3\n3 2\n3\n2 5\n4 5\n4 2\n"
        ]
    ],
    "hint": "It is guaranteed that the solution always exists and is unique. It is guaranteed that in the correct solution the coordinates of the polygon vertices are between $ 2 $ and $ N-2 $ . A vertex $ (x_{1},y_{1}) $ is lexicographically smaller than vertex $ (x_{2},y_{2}) $ if $ x_{1}<x_{2} $ or ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF690B2/d2bfbe49d551bf0cc9cbeba8f0c1469bad61d202.png).",
    "translation": "有一个顶点都在格点上的凸多边形。现在只知道每个格子有多少个顶点在这个多边形内（包括在多边形边上的点），求这个多边形"
}