{
    "description": "There will be a launch of a new, powerful and unusual collider very soon, which located along a straight line. $ n $ particles will be launched inside it. All of them are located in a straight line and there can not be two or more particles located in the same point. The coordinates of the particles coincide with the distance in meters from the center of the collider, $ x_{i} $ is the coordinate of the $ i $ -th particle and its position in the collider at the same time. All coordinates of particle positions are even integers.\n\nYou know the direction of each particle movement — it will move to the right or to the left after the collider's launch start. All particles begin to move simultaneously at the time of the collider's launch start. Each particle will move straight to the left or straight to the right with the constant speed of $ 1 $ meter per microsecond. The collider is big enough so particles can not leave it in the foreseeable time.\n\nWrite the program which finds the moment of the first collision of any two particles of the collider. In other words, find the number of microseconds before the first moment when any two particles are at the same point.",
    "inputFormat": "The first line contains the positive integer $ n $ ( $ 1<=n<=200000 $ ) — the number of particles.\n\nThe second line contains $ n $ symbols \"L\" and \"R\". If the $ i $ -th symbol equals \"L\", then the $ i $ -th particle will move to the left, otherwise the $ i $ -th symbol equals \"R\" and the $ i $ -th particle will move to the right.\n\nThe third line contains the sequence of pairwise distinct even integers $ x_{1},x_{2},...,x_{n} $ ( $ 0<=x_{i}<=10^{9} $ ) — the coordinates of particles in the order from the left to the right. It is guaranteed that the coordinates of particles are given in the increasing order.",
    "outputFormat": "In the first line print the only integer — the first moment (in microseconds) when two particles are at the same point and there will be an explosion.\n\nPrint the only integer -1, if the collision of particles doesn't happen.",
    "samples": [
        [
            "4\nRLRL\n2 4 6 10\n",
            "1\n"
        ],
        [
            "3\nLLR\n40 50 60\n",
            "-1\n"
        ]
    ],
    "hint": "In the first sample case the first explosion will happen in $ 1 $ microsecond because the particles number $ 1 $ and $ 2 $ will simultaneously be at the same point with the coordinate $ 3 $ .\n\nIn the second sample case there will be no explosion because there are no particles which will simultaneously be at the same point.",
    "translation": "有一些玩意（？，它们在一条线上，以每毫秒1米的匀速向一个方向奔去（或左或右）问几毫秒后，某两个玩意会相撞（假设这条线无限长）如果无法相撞，输出-1\n\n输入一共三行，第一行表示有几个玩意 第二行表示它们的方向L(left左)R(right右) 第三行表示它们在线上的位置"
}