{
    "description": "In Chelyabinsk lives a much respected businessman Nikita with a strange nickname \"Boss\". Once Nikita decided to go with his friend Alex to the Summer Biathlon World Cup. Nikita, as a very important person, received a token which allows to place bets on each section no more than on one competitor.\n\nTo begin with friends learned the rules: in the race there are $ n $ sections of equal length and $ m $ participants. The participants numbered from $ 1 $ to $ m $ . About each participant the following is known:\n\n- $ l_{i} $ — the number of the starting section,\n- $ r_{i} $ — the number of the finishing section ( $ l_{i}<=r_{i} $ ),\n- $ t_{i} $ — the time a biathlete needs to complete an section of the path,\n- $ c_{i} $ — the profit in roubles. If the $ i $ -th sportsman wins on one of the sections, the profit will be given to the man who had placed a bet on that sportsman.\n\nThe $ i $ -th biathlete passes the sections from $ l_{i} $ to $ r_{i} $ inclusive. The competitor runs the whole way in $ (r_{i}-l_{i}+1)·t_{i} $ time units. It takes him exactly $ t_{i} $ time units to pass each section. In case of the athlete's victory on $ k $ sections the man who has betted on him receives $ k·c_{i} $ roubles.\n\nIn each section the winner is determined independently as follows: if there is at least one biathlete running this in this section, then among all of them the winner is the one who has ran this section in minimum time (spent minimum time passing this section). In case of equality of times the athlete with the smaller index number wins. If there are no participants in this section, then the winner in this section in not determined. We have to say that in the summer biathlon all the participants are moving at a constant speed.\n\nWe should also add that Nikita can bet on each section and on any contestant running in this section.\n\nHelp the friends find the maximum possible profit.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n,m<=100 $ ). Then follow $ m $ lines, each containing 4 integers $ l_{i} $ , $ r_{i} $ , $ t_{i} $ , $ c_{i} $ ( $ 1<=l_{i}<=r_{i}<=n $ , $ 1<=t_{i},c_{i}<=1000 $ ).",
    "outputFormat": "Print a single integer, the maximal profit in roubles that the friends can get. In each of $ n $ sections it is not allowed to place bets on more than one sportsman.",
    "samples": [
        [
            "4 4\n1 4 20 5\n1 3 21 10\n3 3 4 30\n3 4 4 20\n",
            "60"
        ],
        [
            "8 4\n1 5 24 10\n2 4 6 15\n4 6 30 50\n6 7 4 20\n",
            "105"
        ]
    ],
    "hint": "In the first test the optimal bet is: in the 1-2 sections on biathlete 1, in section 3 on biathlete 3, in section 4 on biathlete 4. Total: profit of 5 rubles for 1 section, the profit of 5 rubles for 2 section, profit of 30 rubles for a 3 section, profit of 20 rubles for 4 section. Total profit 60 rubles.\n\nIn the second test the optimal bet is: on 1 and 5 sections on biathlete 1, in the 2-4 sections on biathlete 2, in the 6-7 sections on athlete 4. There is no winner in the 8 section. Total: profit of 10 rubles for 1 section, the profit of 15 rubles for 2,3,4 section, profit of 10 rubles for a 5 section, profit of 20 rubles for 6, 7 section. Total profit 105 rubles.",
    "translation": "**题目描述**\n\n在chelyabinsk这个地方住着一个厉害的商人，他叫nikita。人人都叫他boss (老板的意思)。\n\n有一天nikita跟朋友alex一起去一个叫做summer biathlon world cup (夏日滑雪世界杯？。)的比赛。\n\nnikita因为是一个厉害的人，所以他拿到了一个神奇奖券。这个奖券可以让他赌谁赢，每个赛道不能赌超过一个选手。\n\n\n\n------------\n\n\n------------\n\n\n这个比赛的规则是这样的：\n\n有n个相等长度的赛道以及m个参赛者（编号1到m）。对于每个参赛者有以下信息：\n\n- Li：始发赛道号码\n\n- Ri：结束赛道号码（Li<=Ri）\n\n- Ti：这个选手完成一个赛道的时间\n\n- Ci：利润。。。单位是卢布（俄罗斯货币单位）。如果这个选手赢了，那么赌这个人会赢的人可以获得这么多钱。\n\n\n第i个选手穿过从Li到Ri的赛道（包括Li和Ri），时间为(Ri-Li+1)·Ti个单位时间。每个赛道都需要Ti个单位时间。若这个选手在k个赛道中获得胜利，那么赌他会赢的人可以拿到k·Ci卢布。\n\n\n在每个赛道中，每个独立的获胜者符合：\n\n\n- 如果至少有一个选手在这个赛道中比赛，那么获胜者为花时间最少的人。花时间最少指仅在这个赛道上的花时间最少的人。\n\n\n- 如果有多个选手用相同的时间，那么序号小的选手获胜。\n\n- 如果这个赛道上没有选手，那么就没有获胜者。\n\n注意：每个人的速度始终不变。\n\n\nnikita可以在每个赛道上分别赌任何一个选手会赢。\n\n\n帮助nikita和alex找到最大的利润。\n\n\n\n------------\n\n\n------------\n\n**输入格式**\n\n第一行两个整数n和m(1<=n,m<=100)。接着的m行每行四个整数Li, Ri, Ti, Ci (1<=Li<=Ri<=n, 1<=Ti, Ci<=1000)。\n\n\n\n------------\n\n\n------------\n\n**输出格式**\n\n一行，最大的利润值。\n\nagain:每个赛道不能赌超过一个选手。\n\n\n\n------------\n\n\n------------\n\n**说明提示**\n\n**第一个测试数据**\n\n第1-2个赛道赌选手1。\n\n第3个赛道赌选手3。\n\n第4个赛道赌选手4。\n\n利润为5（赛道1）+5（赛道2）+30（赛道3）+20（赛道4）=60卢布。\n\n**第二个测试数据**\n\n第1，5个赛道赌选手1。\n\n第2-4个赛道赌选手2。\n\n第6-7个赛道赌选手4。\n\n第八个赛道没有获胜者。\n\n利润为10（赛道1）+15（赛道2-4）+10（赛道5）+20（赛道6，7）=105卢布。"
}