{
    "description": "President of Berland has a very vast office-room, where, apart from him, work his subordinates. Each subordinate, as well as President himself, has his own desk of a unique colour. Each desk is rectangular, and its sides are parallel to the office walls. One day President decided to establish an assembly, of which all his deputies will be members. Unfortunately, he does not remember the exact amount of his deputies, but he remembers that the desk of each his deputy is adjacent to his own desk, that is to say, the two desks (President's and each deputy's) have a common side of a positive length.\n\nThe office-room plan can be viewed as a matrix with $ n $ rows and $ m $ columns. Each cell of this matrix is either empty, or contains a part of a desk. An uppercase Latin letter stands for each desk colour. The «period» character («.») stands for an empty cell.",
    "inputFormat": "The first line contains two separated by a space integer numbers $ n $ , $ m $ ( $ 1<=n,m<=100 $ ) — the length and the width of the office-room, and $ c $ character — the President's desk colour. The following $ n $ lines contain $ m $ characters each — the office-room description. It is guaranteed that the colour of each desk is unique, and each desk represents a continuous subrectangle of the given matrix. All colours are marked by uppercase Latin letters.",
    "outputFormat": "Print the only number — the amount of President's deputies.",
    "samples": [
        [
            "3 4 R\nG.B.\n.RR.\nTTT.\n",
            "2\n"
        ],
        [
            "3 3 Z\n...\n.H.\n..Z\n",
            "0\n"
        ]
    ],
    "hint": "",
    "translation": "输入格式：\n\n第一行：\n\n房间长n,宽m,总统办公桌代表的字符串\n\n接下来2 ~ n+1行,每行输入m列:\n\n房间内的办公桌的颜色（大写字母）。\".\"为空单元格。\n输出格式：\n\n一行一个变量：\n\n求出在总统桌四周相邻的办公桌数量\n样例1 解释：\n\n3 4 R\n\nG . B .\n\n. R R .\n\nT T T .\n\n此办公室的总统桌在二排的第二，三列（连起来的并且颜色相同算一个办公桌，此样例总统桌面积为1*2）\n\n那么四周则有办公桌：\n\nTTT（TTT面积为1*3）\n\nB\n\n因此输出2\nTranslated by @s5_gan"
}