{
    "description": "Like all children, Alesha loves New Year celebration. During the celebration he and his whole family dress up the fir-tree. Like all children, Alesha likes to play with garlands — chains consisting of a lightbulbs.\n\nAlesha uses a grid field sized $ n×m $ for playing. The rows of the field are numbered from $ 1 $ to $ n $ from the top to the bottom and columns are numbered from $ 1 $ to $ m $ from the left to the right.\n\nAlesha has $ k $ garlands which he places at the field. He does so in the way such that each lightbulb of each garland lies in the center of some cell in the field, and each cell contains at most one lightbulb. Of course lightbulbs, which are neighbours in some garland, appears in cells neighbouring by a side.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF707E/3d944d29acd479b81853444b6813c350313a6711.png)\n\nThe example of garland placing.\n\nEach garland is turned off or turned on at any moment. If some garland is turned on then each of its lightbulbs is turned on, the same applies for garland turned off. Each lightbulb in the whole garland set is unique, and thus, being turned on, brings Alesha some pleasure, described by an integer value. Turned off lightbulbs don't bring Alesha any pleasure.\n\nAlesha can turn garlands on and off and wants to know the sum of pleasure value which the lightbulbs, placed in the centers of the cells in some rectangular part of the field, bring him. Initially all the garlands are turned on.\n\nAlesha is still very little and can't add big numbers. He extremely asks you to help him.",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m,k<=2000 $ ) — the number of field rows, the number of field columns and the number of garlands placed at the field respectively.\n\nNext lines contains garlands set description in the following format:\n\nThe first line of a single garland description contains a single integer $ len $ ( $ 1<=len<=2000 $ ) — the number of lightbulbs in the garland.\n\nEach of the next $ len $ lines contains three integers $ i $ , $ j $ and $ w $ ( $ 1<=i<=n $ , $ 1<=j<=m $ , $ 1<=w<=10^{9} $ ) — the coordinates of the cell containing a lightbullb and pleasure value Alesha gets from it if it is turned on. The lightbulbs are given in the order they are forming a chain in the garland. It is guaranteed that neighbouring lightbulbs are placed in the cells neighbouring by a side.\n\nThe next line contains single integer $ q $ ( $ 1<=q<=10^{6} $ ) — the number of events in Alesha's game. The next $ q $ lines describes events in chronological order. The $ i $ -th of them describes the $ i $ -th event in the one of the following formats:\n\n- SWITCH $ i $ — Alesha turns off $ i $ -th garland if it is turned on, or turns it on if it is turned off. It is guaranteed that $ 1<=i<=k $ .\n- ASK $ x_{1} $ $ y_{1} $ $ x_{2} $ $ y_{2} $ — Alesha wants to know the sum of pleasure values the lightbulbs, placed in a rectangular part of the field. Top-left cell of a part has coordinates $ (x_{1},y_{1}) $ and right-bottom cell has coordinates $ (x_{2},y_{2}) $ . It is guaranteed that $ 1<=x_{1}<=x_{2}<=n $ and $ 1<=y_{1}<=y_{2}<=m $ . There is no more than $ 2000 $  events of this type in the input.\n\nAll the numbers in the input are integers.\n\nPlease note that the input is quite large, so be careful while using some input ways. In particular, it's not recommended to use cin in codes on C++ and class Scanner in codes on Java.",
    "outputFormat": "For each ASK operation print the sum Alesha wants to know in a separate line. Print the answers in chronological order.",
    "samples": [
        [
            "4 4 3\n5\n1 1 2\n1 2 3\n2 2 1\n2 1 4\n3 1 7\n4\n1 3 1\n2 3 3\n2 4 3\n1 4 1\n7\n4 1 1\n4 2 9\n3 2 8\n3 3 3\n4 3 4\n4 4 1\n3 4 1\n2\nASK 2 2 3 3\nASK 1 1 4 4\n",
            "15\n52\n"
        ],
        [
            "4 4 1\n8\n4 1 1\n3 1 2\n2 1 1\n1 1 7\n1 2 5\n2 2 4\n2 3 1\n1 3 1\n3\nASK 1 1 3 2\nSWITCH 1\nASK 1 1 3 2\n",
            "19\n0\n"
        ]
    ],
    "hint": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF707E/59774fd8bd70ea840f4a3c4bb4b95e2f490588f0.png)\n\nThis image illustrates the first sample case.",
    "translation": "### 题目大意\n\nAlesha 喜欢玩灯条，灯条指由若干个灯泡组成的链。\nAlesha 使用由 n × m 个单元格组成的网格来玩灯条，网格的行从上到下从 1 到 n 编号，列从左到右从 1 到 m 编号。\nAlesha 有 k 根灯条，这些灯条都被放在了网格上，同一根灯条内，相邻的两个灯泡在网格中都是相邻的。网格的每个单元格中最多只有一个灯泡。每个灯泡亮着的时候都有一个快乐值，熄灭的灯泡都没有快乐值。\n最开始，所有灯泡都是亮着的。Alesha 进行若干次以下两种操作：\n\n1. 选择一个灯条，如果这个灯条上的灯泡是亮着的，把灯条上的所有灯泡都熄灭；如果这个灯条上的灯泡是熄灭的，把灯条上的所有灯泡都点亮\n2. 选择网格的一个子矩阵，求这个子矩阵中的所有亮着的灯泡的快乐值之和。"
}