{
    "description": "Kolya is going to make fresh orange juice. He has $ n $ oranges of sizes $ a_{1},a_{2},...,a_{n} $ . Kolya will put them in the juicer in the fixed order, starting with orange of size $ a_{1} $ , then orange of size $ a_{2} $ and so on. To be put in the juicer the orange must have size not exceeding $ b $ , so if Kolya sees an orange that is strictly greater he throws it away and continues with the next one.\n\nThe juicer has a special section to collect waste. It overflows if Kolya squeezes oranges of the total size strictly greater than $ d $ . When it happens Kolya empties the waste section (even if there are no more oranges) and continues to squeeze the juice. How many times will he have to empty the waste section?",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ b $ and $ d $ ( $ 1<=n<=100000 $ , $ 1<=b<=d<=1000000 $ ) — the number of oranges, the maximum size of the orange that fits in the juicer and the value $ d $ , which determines the condition when the waste section should be emptied.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=1000000 $ ) — sizes of the oranges listed in the order Kolya is going to try to put them in the juicer.",
    "outputFormat": "Print one integer — the number of times Kolya will have to empty the waste section.",
    "samples": [
        [
            "2 7 10\n5 6\n",
            "1\n"
        ],
        [
            "1 5 10\n7\n",
            "0\n"
        ],
        [
            "3 10 10\n5 7 7\n",
            "1\n"
        ],
        [
            "1 1 1\n1\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample, Kolya will squeeze the juice from two oranges and empty the waste section afterwards.\n\nIn the second sample, the orange won't fit in the juicer so Kolya will have no juice at all.",
    "translation": "### 题目大意\n已知一条流水线有 $n$ 个货物要装载，需要装载货物的容量分别是 $a_1$，$a_2$，$\\dots$，$a_n$，如果某件货物容量超过 $b$，为不合格货物，不装载，丢弃。  \n　  \n装载货物的箱子容量为 $d$，可以一直装载流水线过来的合格货物，直到超过容量 $d$ 时，做一次特殊的压缩处理，然后封装，之后换新的箱子继续如此安装。  \n　  \n### 数据输入\n\n第一行，输入三个整数 $n$，$b$，$d$  \n第二行，输入 $n$ 个整数 $a_i$\n\n### 数据输出  \n\n一行，输出压缩处理的次数 $cnt$\n\n### 样例解释\n\n样例 $2$：此样例没有合格产品  \n  　   \n样例 $3$：$5$ 和 $7$ 特殊压缩一次  \n　  \n样例 $4$：容量只有 $1$，没有超过 $1$，不需要特殊压缩\n\n### 数据规模\n\n$1\\leq n\\leq 100000$  \n$1\\leq b\\leq d\\leq 1000000$  \n$1\\leq a_i\\leq 1000000$  "
}