{
    "description": "Fangy the little walrus, as all the modern walruses, loves to communicate via text messaging. One day he faced the following problem: When he sends large texts, they are split into parts each containing $ n $ characters (which is the size of one text message). Thus, whole sentences and words get split!\n\nFangy did not like it, so he faced the task of breaking the text into minimal messages on his own so that no sentence were broken into pieces when it is sent and the number of text messages to be sent would be minimal. If two consecutive sentences are in different messages, the space between them can be ignored (Fangy does not write this space).\n\nThe little walrus's text looks in the following manner:\n\n```\nTEXT ::= SENTENCE | SENTENCE SPACE TEXT\nSENTENCE ::= WORD SPACE SENTENCE | WORD END\nEND ::= {'.', '?', '!'}\nWORD ::= LETTER | LETTER WORD\nLETTER ::= {'a'..'z', 'A'..'Z'}\nSPACE ::= ' '\n```\n\nSPACE stands for the symbol of a space.\n\nSo, how many messages did Fangy send?",
    "inputFormat": "The first line contains an integer $ n $ , which is the size of one message ( $ 2<=n<=255 $ ). The second line contains the text. The length of the text does not exceed $ 10^{4} $ characters. It is guaranteed that the text satisfies the above described format. Specifically, this implies that the text is not empty.",
    "outputFormat": "On the first and only line print the number of text messages Fangy will need. If it is impossible to split the text, print \"Impossible\" without the quotes.",
    "samples": [
        [
            "25\nHello. I am a little walrus.\n",
            "2\n"
        ],
        [
            "2\nHow are you?\n",
            "Impossible\n"
        ],
        [
            "19\nHello! Do you like fish? Why?\n",
            "3\n"
        ]
    ],
    "hint": "Let's take a look at the third sample. The text will be split into three messages: \"Hello!\", \"Do you like fish?\" and \"Why?\".",
    "translation": "给你每句话的最大容量 $n$ 和一个字符串 $s$，现在有个人要发短信，在这个字符串中每出现 `.`、`!` 或 `?` 就代表一句话的末尾，问你最少要发几条短信。若不可能，输出 `Impossible`（注：忽略每两句话之间的空格）"
}