{
    "description": "Vasiliy likes to rest after a hard work, so you may often meet him in some bar nearby. As all programmers do, he loves the famous drink \"Beecola\", which can be bought in $ n $ different shops in the city. It's known that the price of one bottle in the shop $ i $ is equal to $ x_{i} $ coins.\n\nVasiliy plans to buy his favorite drink for $ q $ consecutive days. He knows, that on the $ i $ -th day he will be able to spent $ m_{i} $ coins. Now, for each of the days he want to know in how many different shops he can buy a bottle of \"Beecola\".",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of shops in the city that sell Vasiliy's favourite drink.\n\nThe second line contains $ n $ integers $ x_{i} $ ( $ 1<=x_{i}<=100000 $ ) — prices of the bottles of the drink in the $ i $ -th shop.\n\nThe third line contains a single integer $ q $ ( $ 1<=q<=100000 $ ) — the number of days Vasiliy plans to buy the drink.\n\nThen follow $ q $ lines each containing one integer $ m_{i} $ ( $ 1<=m_{i}<=10^{9} $ ) — the number of coins Vasiliy can spent on the $ i $ -th day.",
    "outputFormat": "Print $ q $ integers. The $ i $ -th of them should be equal to the number of shops where Vasiliy will be able to buy a bottle of the drink on the $ i $ -th day.",
    "samples": [
        [
            "5\n3 10 8 6 11\n4\n1\n10\n3\n11\n",
            "0\n4\n1\n5\n"
        ]
    ],
    "hint": "On the first day, Vasiliy won't be able to buy a drink in any of the shops.\n\nOn the second day, Vasiliy can buy a drink in the shops $ 1 $ , $ 2 $ , $ 3 $ and $ 4 $ .\n\nOn the third day, Vasiliy can buy a drink only in the shop number $ 1 $ .\n\nFinally, on the last day Vasiliy can buy a drink in any shop.",
    "translation": "瓦西里喜欢喝\"Beecola\"饮料。\n卖这种饮料的商铺有x家。每家的价格是x[i]元。\n现在瓦西里 要买这种饮料n次，每次他最多能花n[i]元，\n求他每次能在几个商铺买到至少一瓶饮料。\n\n简短版：给出一个长度为x的数组，有n次询问，\n输出 第n次询问的数大于等于几个x数组里的元素。\n\n \n\n输入：第一行一个正整数x，表示商铺的数量。\n\n第二行x个正整数，x[i]，表示每家商铺中饮料的价格\n\n第三行一个正整数n，表示询问的次数。\n\n之后n行，每行一个正整数n[i],表示最多能花多少钱\n\n输出：n行，每行一个正整数，表示每次能去几家商铺买到饮料"
}