{
    "description": "Mishka is a little polar bear. As known, little bears loves spending their free time playing dice for chocolates. Once in a wonderful sunny morning, walking around blocks of ice, Mishka met her friend Chris, and they started playing the game.\n\nRules of the game are very simple: at first number of rounds $ n $ is defined. In every round each of the players throws a cubical dice with distinct numbers from $ 1 $ to $ 6 $ written on its faces. Player, whose value after throwing the dice is greater, wins the round. In case if player dice values are equal, no one of them is a winner.\n\nIn average, player, who won most of the rounds, is the winner of the game. In case if two players won the same number of rounds, the result of the game is draw.\n\nMishka is still very little and can't count wins and losses, so she asked you to watch their game and determine its result. Please help her!",
    "inputFormat": "The first line of the input contains single integer $ n $ $ n $ ( $ 1<=n<=100 $ ) — the number of game rounds.\n\nThe next $ n $ lines contains rounds description. $ i $ -th of them contains pair of integers $ m_{i} $ and $ c_{i} $ ( $ 1<=m_{i},c_{i}<=6 $ ) — values on dice upper face after Mishka's and Chris' throws in $ i $ -th round respectively.",
    "outputFormat": "If Mishka is the winner of the game, print \"Mishka\" (without quotes) in the only line.\n\nIf Chris is the winner of the game, print \"Chris\" (without quotes) in the only line.\n\nIf the result of the game is draw, print \"Friendship is magic!^^\" (without quotes) in the only line.",
    "samples": [
        [
            "3\n3 5\n2 1\n4 2\n",
            "Mishka"
        ],
        [
            "2\n6 1\n1 6\n",
            "Friendship is magic!^^"
        ],
        [
            "3\n1 5\n3 3\n2 2\n",
            "Chris"
        ]
    ],
    "hint": "In the first sample case Mishka loses the first round, but wins second and third rounds and thus she is the winner of the game.\n\nIn the second sample case Mishka wins the first round, Chris wins the second round, and the game ends with draw with score 1:1.\n\nIn the third sample case Chris wins the first round, but there is no winner of the next two rounds. The winner of the game is Chris.",
    "translation": "## 题目描述\n\nMishka是一只小北极熊。正如所知的，小熊喜欢在他们的空闲时间为了巧克力玩骰子。在一个美妙的早上，她正走在冰块上时，Mishka遇见了她的朋友Chris，她们就开始玩这个游戏了。\n\n这个游戏的规则十分简单：首先定义一个回合数$n$ 。\n在每一回合，每个玩家扔一个在它的表面写着$1$ 到$6$ 的立方体骰子。扔出较大的数的那个玩家获得这一回合的胜利。如果两名玩家扔出的数一样，则没有胜者。\n\n一般来说，赢得较多回合的玩家将获得这个游戏的胜利。如果两个玩家赢得的回合数相同，这场游戏的结果是平局。\n\nMishka仍然非常的小以至于不能算胜负场，所以她要求你观看这场比赛并确定结果。请帮帮她吧！\n\n### 输入格式：\n\n第一行输入一个整数$n$ （$1\\leq n\\leq 100$ ） — 游戏的回合数。\n\n下$n$ 行描述了这些回合。其中的第$i$ 行包含一对数 $m_i$ 和$c_i$ （$1\\leq m_i,c_i \\leq 6$ ） — 在第$i$ 回合Mishka扔出的数和Chris扔出的数。\n\n### 输出格式：\n\n如果Mishka是这场游戏的胜利者，仅输出一行\"Mishka\"（不含引号）。\n\n如果Chris是这场游戏的胜利者，仅输出一行\"Chris\"（不含引号）。\n\n如果这场游戏是平局，仅输出一行\"Friendship is magic!^^\"（不含引号）。\n\n### 说明\n\n在第一个样例中，Mishka在第一回合输了，但在第二回合和第三回合赢了，因此她是游戏的获胜者。\n\n在第二个样例中，Mishka在第一回合赢了，Chris在第二回合赢了，游戏结束时以比分1:1战平。\n\n在第三个样例中，Chris在第一回合赢了，但是后面两个回合没有胜利者。游戏的获胜者是Chris。\n\nby @Khassar "
}