{
    "description": "Small, but very brave, mouse Brain was not accepted to summer school of young villains. He was upset and decided to postpone his plans of taking over the world, but to become a photographer instead.\n\nAs you may know, the coolest photos are on the film (because you can specify the hashtag #film for such).\n\nBrain took a lot of colourful pictures on colored and black-and-white film. Then he developed and translated it into a digital form. But now, color and black-and-white photos are in one folder, and to sort them, one needs to spend more than one hour!\n\nAs soon as Brain is a photographer not programmer now, he asks you to help him determine for a single photo whether it is colored or black-and-white.\n\nPhoto can be represented as a matrix sized $ n×m $ , and each element of the matrix stores a symbol indicating corresponding pixel color. There are only $ 6 $ colors:\n\n- 'C' (cyan)\n- 'M' (magenta)\n- 'Y' (yellow)\n- 'W' (white)\n- 'G' (grey)\n- 'B' (black)\n\nThe photo is considered black-and-white if it has only white, black and grey pixels in it. If there are any of cyan, magenta or yellow pixels in the photo then it is considered colored.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1<=n,m<=100 $ ) — the number of photo pixel matrix rows and columns respectively.\n\nThen $ n $ lines describing matrix rows follow. Each of them contains $ m $ space-separated characters describing colors of pixels in a row. Each character in the line is one of the 'C', 'M', 'Y', 'W', 'G' or 'B'.",
    "outputFormat": "Print the \"#Black&White\" (without quotes), if the photo is black-and-white and \"#Color\" (without quotes), if it is colored, in the only line.",
    "samples": [
        [
            "2 2\nC M\nY Y\n",
            "#Color"
        ],
        [
            "3 2\nW W\nW W\nB B\n",
            "#Black&amp;White"
        ],
        [
            "1 1\nW\n",
            "#Black&amp;White"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\nBrain，一位想要统治世界的邪恶老鼠，因为品行不端正被拒绝上洛谷的暑假课程！这令他十分伤心。\n\nBrain在沮丧中只能决定先当一名摄影师凑合着度度日子。\n\nBrain现在在电影摄影棚里工作，电影有时候拍黑白的电影，有时候拍彩色的电影。\n\nBrain已经拍了许多张照片了。\n\n由于他没有上洛谷的暑假课程，现在他只能另请高明——您来编程帮他完成一项艰巨的任务：\n\n## 输入输出格式\n### 输入格式:\n每次Brain会给你一张照片。照片就是一个矩阵。\n\n第一行是照片的大小 $n$、 $m$ 代表每列每行分别有多少像素。($1 \\leqslant n, \\ m   \\leqslant 100$)\n\n接下来的 $n$ 行是照片的内容，由这几个字母组成：\n- C (青色)\n- M (橘红色)\n- Y (黄色)\n- W (白色)\n- G (灰色)\n- B (黑色)\n\n### 输出格式\n如果该照片含有除了黑白灰以外的任意颜色，则输出：#Color\n\n如果该照片只含有黑白灰或其中的任意颜色，则输出：#Black&White\n\n\n## 提示\n样例的最后两个有问题，应该都输出#Black&White\n"
}