{
    "description": "The big consignment of t-shirts goes on sale in the shop before the beginning of the spring. In all $ n $ types of t-shirts go on sale. The t-shirt of the $ i $ -th type has two integer parameters — $ c_{i} $ and $ q_{i} $ , where $ c_{i} $ — is the price of the $ i $ -th type t-shirt, $ q_{i} $ — is the quality of the $ i $ -th type t-shirt. It should be assumed that the unlimited number of t-shirts of each type goes on sale in the shop, but in general the quality is not concerned with the price.\n\nAs predicted, $ k $ customers will come to the shop within the next month, the $ j $ -th customer will get ready to spend up to $ b_{j} $ on buying t-shirts.\n\nAll customers have the same strategy. First of all, the customer wants to buy the maximum possible number of the highest quality t-shirts, then to buy the maximum possible number of the highest quality t-shirts from residuary t-shirts and so on. At the same time among several same quality t-shirts the customer will buy one that is cheaper. The customers don't like the same t-shirts, so each customer will not buy more than one t-shirt of one type.\n\nDetermine the number of t-shirts which each customer will buy, if they use the described strategy. All customers act independently from each other, and the purchase of one does not affect the purchase of another.",
    "inputFormat": "The first line contains the positive integer $ n $ ( $ 1<=n<=2·10^{5} $ ) — the number of t-shirt types.\n\nEach of the following $ n $ lines contains two integers $ c_{i} $ and $ q_{i} $ ( $ 1<=c_{i},q_{i}<=10^{9} $ ) — the price and the quality of the $ i $ -th type t-shirt.\n\nThe next line contains the positive integer $ k $ ( $ 1<=k<=2·10^{5} $ ) — the number of the customers.\n\nThe next line contains $ k $ positive integers $ b_{1},b_{2},...,b_{k} $ ( $ 1<=b_{j}<=10^{9} $ ), where the $ j $ -th number is equal to the sum, which the $ j $ -th customer gets ready to spend on t-shirts.",
    "outputFormat": "The first line of the input data should contain the sequence of $ k $ integers, where the $ i $ -th number should be equal to the number of t-shirts, which the $ i $ -th customer will buy.",
    "samples": [
        [
            "3\n7 5\n3 5\n4 3\n2\n13 14\n",
            "2 3 \n"
        ],
        [
            "2\n100 500\n50 499\n4\n50 200 150 100\n",
            "1 2 2 1 \n"
        ]
    ],
    "hint": "In the first example the first customer will buy the t-shirt of the second type, then the t-shirt of the first type. He will spend 10 and will not be able to buy the t-shirt of the third type because it costs 4, and the customer will owe only 3. The second customer will buy all three t-shirts (at first, the t-shirt of the second type, then the t-shirt of the first type, and then the t-shirt of the third type). He will spend all money on it.",
    "translation": "有 $n$ 种 T 恤，每种有价格 $c_i$ 和品质 $q_i$。\n\n有 $m$ 个人要买 T 恤，第 $i$ 个人有 $v_i$ 元，每人每次都会买一件能买得起的 $q_i$ 最大的 T 恤。一个人只能买一种 T 恤一件，所有人之间都是独立的。\n\n问最后每个人买了多少件 T 恤？如果有多个 $q_i$ 最大的 T 恤，会从价格低的开始买。\n\ntranslated by Rainy_chen。"
}