{
    "description": "Again, there are hard times in Berland! Many towns have such tensions that even civil war is possible.\n\nThere are $ n $ towns in Reberland, some pairs of which connected by two-way roads. It is not guaranteed that it is possible to reach one town from any other town using these roads.\n\nTowns $ s $ and $ t $ announce the final break of any relationship and intend to rule out the possibility of moving between them by the roads. Now possibly it is needed to close several roads so that moving from $ s $ to $ t $ using roads becomes impossible. Each town agrees to spend money on closing no more than one road, therefore, the total number of closed roads will be no more than two.\n\nHelp them find set of no more than two roads such that there will be no way between $ s $ and $ t $ after closing these roads. For each road the budget required for its closure was estimated. Among all sets find such that the total budget for the closure of a set of roads is minimum.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 2<=n<=1000 $ , $ 0<=m<=30000 $ ) — the number of towns in Berland and the number of roads.\n\nThe second line contains integers $ s $ and $ t $ ( $ 1<=s,t<=n $ , $ s≠t $ ) — indices of towns which break up the relationships.\n\nThen follow $ m $ lines, each of them contains three integers $ x_{i} $ , $ y_{i} $ and $ w_{i} $ ( $ 1<=x_{i},y_{i}<=n $ , $ 1<=w_{i}<=10^{9} $ ) — indices of towns connected by the $ i $ -th road, and the budget on its closure.\n\nAll roads are bidirectional. It is allowed that the pair of towns is connected by more than one road. Roads that connect the city to itself are allowed.",
    "outputFormat": "In the first line print the minimum budget required to break up the relations between $ s $ and $ t $ , if it is allowed to close no more than two roads.\n\nIn the second line print the value $ c $ ( $ 0<=c<=2 $ ) — the number of roads to be closed in the found solution.\n\nIn the third line print in any order $ c $ diverse integers from $ 1 $ to $ m $ — indices of closed roads. Consider that the roads are numbered from $ 1 $ to $ m $ in the order they appear in the input.\n\nIf it is impossible to make towns $ s $ and $ t $ disconnected by removing no more than $ 2 $ roads, the output should contain a single line -1.\n\nIf there are several possible answers, you may print any of them.",
    "samples": [
        [
            "6 7\n1 6\n2 1 6\n2 3 5\n3 4 9\n4 6 4\n4 6 5\n4 5 1\n3 1 3\n",
            "8\n2\n2 7\n"
        ],
        [
            "6 7\n1 6\n2 3 1\n1 2 2\n1 3 3\n4 5 4\n3 6 5\n4 6 6\n1 5 7\n",
            "9\n2\n4 5\n"
        ],
        [
            "5 4\n1 5\n2 1 3\n3 2 1\n3 4 4\n4 5 2\n",
            "1\n1\n2\n"
        ],
        [
            "2 3\n1 2\n1 2 734458840\n1 2 817380027\n1 2 304764803\n",
            "-1\n"
        ]
    ],
    "hint": "",
    "translation": "# 分裂\r\n给你一个n个点m条边的无向图，边有权值，要求你删去最多两条边，使得s与t不连通，且删去的边权值和最小"
}