{
    "description": "Vasya has the square chessboard of size $ n×n $ and $ m $ rooks. Initially the chessboard is empty. Vasya will consequently put the rooks on the board one after another.\n\nThe cell of the field is under rook's attack, if there is at least one rook located in the same row or in the same column with this cell. If there is a rook located in the cell, this cell is also under attack.\n\nYou are given the positions of the board where Vasya will put rooks. For each rook you have to determine the number of cells which are not under attack after Vasya puts it on the board.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1<=n<=100000 $ , $ 1<=m<=min(100000,n^{2}) $ ) — the size of the board and the number of rooks.\n\nEach of the next $ m $ lines contains integers $ x_{i} $ and $ y_{i} $ ( $ 1<=x_{i},y_{i}<=n $ ) — the number of the row and the number of the column where Vasya will put the $ i $ -th rook. Vasya puts rooks on the board in the order they appear in the input. It is guaranteed that any cell will contain no more than one rook.",
    "outputFormat": "Print $ m $ integer, the $ i $ -th of them should be equal to the number of cells that are not under attack after first $ i $ rooks are put.",
    "samples": [
        [
            "3 3\n1 1\n3 1\n2 2\n",
            "4 2 0 \n"
        ],
        [
            "5 2\n1 5\n5 1\n",
            "16 9 \n"
        ],
        [
            "100000 1\n300 400\n",
            "9999800001 \n"
        ]
    ],
    "hint": "On the picture below show the state of the board after put each of the three rooks. The cells which painted with grey color is not under the attack.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF701B/428dcb8b9bcb24c035678e606e34e08943f7e5f6.png)",
    "translation": "题目描述：\n\n给定一个 $n \\times n$ 的棋盘和 $m$ 个车以及这 $m$ 个车的坐标，问在放下第 $i$ 个车的时候，有多少个格子不会被已放下的车攻击到。\n\n输入格式：\n\n第 $1$ 行输入两个数 $n$ 和 $m$；  \n第 $2$ 行到第 $m-1$ 行，输入第 $i$ 个车的坐标 $x_{i}$ 和 $y_{i}$ 。\n\n输出格式：\n\n输出 $m$ 个数字，第 $i$ 个数字表示放置 $i$ 个车后不会被攻击到的格子数量。"
}