{
    "description": "Recently in school Alina has learned what are the persistent data structures: they are data structures that always preserves the previous version of itself and access to it when it is modified.\n\nAfter reaching home Alina decided to invent her own persistent data structure. Inventing didn't take long: there is a bookcase right behind her bed. Alina thinks that the bookcase is a good choice for a persistent data structure. Initially the bookcase is empty, thus there is no book at any position at any shelf.\n\nThe bookcase consists of $ n $ shelves, and each shelf has exactly $ m $ positions for books at it. Alina enumerates shelves by integers from $ 1 $ to $ n $ and positions at shelves — from $ 1 $ to $ m $ . Initially the bookcase is empty, thus there is no book at any position at any shelf in it.\n\nAlina wrote down $ q $ operations, which will be consecutively applied to the bookcase. Each of the operations has one of four types:\n\n- $ 1 $ $ i $ $ j $ — Place a book at position $ j $ at shelf $ i $ if there is no book at it.\n- $ 2 $ $ i $ $ j $ — Remove the book from position $ j $ at shelf $ i $ if there is a book at it.\n- $ 3 $ $ i $ — Invert book placing at shelf $ i $ . This means that from every position at shelf $ i $ which has a book at it, the book should be removed, and at every position at shelf $ i $ which has not book at it, a book should be placed.\n- $ 4 $ $ k $ — Return the books in the bookcase in a state they were after applying $ k $ -th operation. In particular, $ k=0 $ means that the bookcase should be in initial state, thus every book in the bookcase should be removed from its position.\n\nAfter applying each of operation Alina is interested in the number of books in the bookcase. Alina got 'A' in the school and had no problem finding this values. Will you do so?",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ and $ q $ ( $ 1<=n,m<=10^{3} $ , $ 1<=q<=10^{5} $ ) — the bookcase dimensions and the number of operations respectively.\n\nThe next $ q $ lines describes operations in chronological order — $ i $ -th of them describes $ i $ -th operation in one of the four formats described in the statement.\n\nIt is guaranteed that shelf indices and position indices are correct, and in each of fourth-type operation the number $ k $ corresponds to some operation before it or equals to $ 0 $ .",
    "outputFormat": "For each operation, print the number of books in the bookcase after applying it in a separate line. The answers should be printed in chronological order.",
    "samples": [
        [
            "2 3 3\n1 1 1\n3 2\n4 0\n",
            "1\n4\n0\n"
        ],
        [
            "4 2 6\n3 2\n2 2 2\n3 3\n3 2\n2 2 2\n3 2\n",
            "2\n1\n3\n3\n2\n4\n"
        ],
        [
            "2 2 2\n3 2\n2 2 1\n",
            "2\n1\n"
        ]
    ],
    "hint": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF707D/43cb8952ee4fc8994bedde8168b22c25f3bba0de.png)This image illustrates the second sample case.",
    "translation": "### 题目大意\n\n维护一个二维零一矩阵（$n,m \\le 1000$），支持四种操作（不超过 $10^5$ 次）:\n\n- 将 $(i,j)$ 置一\n- 将 $(i,j)$ 置零\n- 将第 $i$ 行零一反转\n- 回到第 $K$ 次操作后的状态\n- 每次操作后输出全局一共有多少个一"
}