{
    "description": "Owl Sonya gave a huge lake puzzle of size $ n×m $ to hedgehog Filya as a birthday present. Friends immediately started to assemble the puzzle, but some parts of it turned out to be empty — there was no picture on them. Parts with picture on it are denoted by $ 1 $ , while empty parts are denoted by $ 0 $ . Rows of the puzzle are numbered from top to bottom with integers from $ 1 $ to $ n $ , while columns are numbered from left to right with integers from $ 1 $ to $ m $ .\n\nAnimals decided to complete the picture and play with it, as it might be even more fun! Owl and hedgehog ask each other some queries. Each query is provided by four integers $ x_{1} $ , $ y_{1} $ , $ x_{2} $ , $ y_{2} $ which define the rectangle, where $ (x_{1},y_{1}) $ stands for the coordinates of the up left cell of the rectangle, while $ (x_{2},y_{2}) $ stands for the coordinates of the bottom right cell. The answer to the query is the size of the maximum square consisting of picture parts only (only parts denoted by $ 1 $ ) and located fully inside the query rectangle.\n\nHelp Sonya and Filya answer $ t $ queries.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1<=n,m<=1000 $ ) — sizes of the puzzle.\n\nEach of the following $ n $ lines contains $ m $ integers $ a_{ij} $ . Each of them is equal to $ 1 $ if the corresponding cell contains a picture and $ 0 $ if it's empty.\n\nNext line contains an integer $ t $ ( $ 1<=t<=1000000 $ ) — the number of queries.\n\nThen follow $ t $ lines with queries' descriptions. Each of them contains four integers $ x_{1} $ , $ y_{1} $ , $ x_{2} $ , $ y_{2} $ ( $ 1<=x_{1}<=x_{2}<=n $ , $ 1<=y_{1}<=y_{2}<=m $ ) — coordinates of the up left and bottom right cells of the query rectangle.",
    "outputFormat": "Print $ t $ lines. The $ i $ -th of them should contain the maximum size of the square consisting of $ 1 $ -s and lying fully inside the query rectangle.",
    "samples": [
        [
            "3 4\n1 1 0 1\n0 1 1 0\n0 1 1 0\n5\n1 1 2 3\n2 1 3 2\n3 2 3 4\n1 1 3 4\n1 2 3 4\n",
            "1\n1\n1\n2\n2\n"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\n猫头鹰Sonya将一个$n\\times m$ 的湖拼图给刺猬Filya，当做~~它~~他的生日礼物。小伙伴们当即去组装这个拼图，然鹅有一些部分是空的——在那上面没有图片。  \n令有图片部分的贡献为1，没有的为0。并对这个拼图编号，行号从上到下为$1\\sim n$ ，列号从左到右为$1\\sim m$ 。  \n动物决定继续~~玩弄~~完成这个拼图，因为它可能更有趣。猫头鹰和刺猬会做出几组询问，每次给出四个整数$x_1,y_1,x_2,y_2$ ，询问以$(x_1,y_1)$ 为左上角，$(x_2,y_2)$ 为右下角的区域内，全为1的最长正方形边长。 \n## 输入输出格式\n### 输入格式\n第一行包含两个整数$n,m$   \n接下来$n$ 行，每行$m$ 个整数$(1or0)$ ，1表示有图片，0表示没有图片  \n再一行一个整数$t$ ，表示$t$ 组询问  \n最后$t$ 行，每行四个整数分别表示$x_1,y_1,x_2,y_2$    \n### 输出格式  \n共$t$ 行，每行1个整数，表示区域内最长的全1正方形边长\n\n感谢@Fheiwn  提供的翻译"
}