{
    "description": "Owl Sonya decided to become a partymaker. To train for this role she gather all her owl friends in the country house. There are $ m $ chairs located in a circle and consequently numbered with integers from $ 1 $ to $ m $ . Thus, chairs $ i $ and $ i+1 $ are neighbouring for all $ i $ from $ 1 $ to $ m-1 $ . Chairs $ 1 $ and $ m $ are also neighbouring. Some chairs are occupied by her friends. There are $ n $ friends in total. No two friends occupy the same chair. Rules are the following:\n\n1. Each participant removes from the game the chair he is currently sitting on.\n2. Each of the participants choose a direction that she will follow: clockwise (indices increase, from $ m $ goes to $ 1 $ ) and counter-clockwise (indices decrease, from $ 1 $ goes to $ m $ ). This direction may coincide or be different for any pair of owls.\n3. Each turn all guests move one step in the chosen directions. If some guest move to the position with a chair there, he removes this chair from the game.\n4. Game ends if there are no more chairs left in the game.\n\nOwls are very busy and want to get rid of the game as soon as possible. They cooperate to pick the direction. Your goal is to find the minimum number o moves required to finish the game.",
    "inputFormat": "The first line of the input contains a single integer $ m $ ( $ 1<=m<=10^{9} $ ) — the length of the circle.\n\nThe second line contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of friends.\n\nLast line contains an increasing sequence of $ n $ integers $ a_{i} $ ( $ 1<=a_{i}<=m $ ) — initial positions of all owls.",
    "outputFormat": "Print the minimum number of move required to finish the game. Note, that $ 0 $ also may be an answer.",
    "samples": [
        [
            "6\n3\n1 3 5\n",
            "1\n"
        ],
        [
            "6\n2\n1 6\n",
            "2\n"
        ],
        [
            "406\n6\n1 2 3 204 205 206\n",
            "100\n"
        ]
    ],
    "hint": "In the first sample, it's possible if all owls will move clockwise, i.e. in the direction of increasing indices.\n\nIn the sample, first owl has to move clockwise, while the second — counterclockwise.\n\nIn the third sample, the first and the fourth owls should move counterclockwise, while the third and the sixth — clockwise. The second and the firth may move in any direction.",
    "translation": "一个长度为 $m$ 的环，最初有 $n$ 个点上有人。\n\n每秒可以让所有人都走一步（可以选择每个人的方向，但中途不能变换方向）。\n\n问使所有点都被走到的最短时间。\n\n$n \\leq 10^5$，$m \\leq 10^9$。"
}