{
    "description": "Anatoly lives in the university dorm as many other students do. As you know, cockroaches are also living there together with students. Cockroaches might be of two colors: black and red. There are $ n $ cockroaches living in Anatoly's room.\n\nAnatoly just made all his cockroaches to form a single line. As he is a perfectionist, he would like the colors of cockroaches in the line to alternate. He has a can of black paint and a can of red paint. In one turn he can either swap any two cockroaches, or take any single cockroach and change it's color.\n\nHelp Anatoly find out the minimum number of turns he needs to make the colors of cockroaches in the line alternate.",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=100000 $ ) — the number of cockroaches.\n\nThe second line contains a string of length $ n $ , consisting of characters 'b' and 'r' that denote black cockroach and red cockroach respectively.",
    "outputFormat": "Print one integer — the minimum number of moves Anatoly has to perform in order to make the colors of cockroaches in the line to alternate.",
    "samples": [
        [
            "5\nrbbrr\n",
            "1\n"
        ],
        [
            "5\nbbbbb\n",
            "2\n"
        ],
        [
            "3\nrbr\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample, Anatoly has to swap third and fourth cockroaches. He needs $ 1 $ turn to do this.\n\nIn the second sample, the optimum answer is to paint the second and the fourth cockroaches red. This requires $ 2 $ turns.\n\nIn the third sample, the colors of cockroaches in the line are alternating already, thus the answer is $ 0 $ .",
    "translation": "题目描述\n\nzyk有一串仅有”r”, “b”构成的字符串，他想通过一些操作，使得字符串变成波浪序列，比如rbrbrbr… 或者 brbrbrbrb… ，也就是rb间隔出现。\n\n有两种操作：1. 将r变b或者b变r; 2. 选择任意位置上的r和b交换\n\n问最少多少次操作可以将字符串变成波浪序列？\n\n\n输入\n\n第一行输入n\n\n第二行输入长度为n的字符串，仅有”r”, “b”构成\n\n\n输出\n\n输出次数\n\n\n样例输入\n\n5\nrbbrr\n\n样例输出\n\n1\n\n提示\n\n将第3个b和第4个r交换一次即可\n\n样例输入2：\n\n5\n\nbbbbb\n\n样例输出2：\n\n2\n\n说明：可以将第2和第4个b改成r\n\n样例输入3：\n\n3\n\nrbr\n\n样例输出3：\n\n0\n\n【数据规模和约定】\n\n1<=n<=100000\n\n"
}