{
    "description": "Today is Matvey's birthday. He never knows what to ask as a present so friends gave him a string $ s $ of length $ n $ . This string consists of only first eight English letters: 'a', 'b', $ ... $ , 'h'.\n\nFirst question that comes to mind is: who might ever need some string? Matvey is a special boy so he instantly found what to do with this string. He used it to build an undirected graph where vertices correspond to position in the string and there is an edge between distinct positions $ a $ and $ b $ ( $ 1<=a,b<=n $ ) if at least one of the following conditions hold:\n\n1. $ a $ and $ b $ are neighbouring, i.e. $ |a-b|=1 $ .\n2. Positions $ a $ and $ b $ contain equal characters, i.e. $ s_{a}=s_{b} $ .\n\nThen Matvey decided to find the diameter of this graph. Diameter is a maximum distance (length of the shortest path) among all pairs of vertices. Also, Matvey wants to find the number of pairs of vertices such that the distance between them is equal to the diameter of the graph. As he is very cool and experienced programmer he managed to solve this problem very fast. Will you do the same?",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 2<=n<=100000 $ ) — the length of the string.\n\nThe second line contains the string $ s $ itself. It's guaranteed that $ s $ consists of only first eight letters of English alphabet.",
    "outputFormat": "Print two integers — the diameter of the graph and the number of pairs of positions with the distance equal to the diameter.",
    "samples": [
        [
            "3\nabc\n",
            "2 1\n"
        ],
        [
            "7\naaabaaa\n",
            "2 4\n"
        ]
    ],
    "hint": "Consider the second sample.\n\nThe maximum distance is $ 2 $ . It's obtained for pairs $ (1,4) $ , $ (2,4) $ , $ (4,6) $ and $ (4,7) $ .",
    "translation": "给定一个仅包含 `a`~`h` 的字符串。\n\n有一个 $n$ 个结点的无向图，编号为 $0$ 到 $n−1$。结点 $i$ 与结点 $j$ 间有边相连当且仅当 $|i-j|=1$ 或 $S_i=S_j$。\n\n\n求这个无向图的直径和有多少对点间的最短距离与直径相同。"
}