{
    "description": "Welcome to the world of Pokermon, yellow little mouse-like creatures, who absolutely love playing poker!\n\nYeah, right…\n\nIn the ensuing Pokermon League, there are $ n $ registered Pokermon trainers, and $ t $ existing trainer teams each of which belongs to one of two conferences. Since there is a lot of jealousy between trainers, there are $ e $ pairs of trainers who hate each other. Their hate is mutual, there are no identical pairs among these, and no trainer hates himself (the world of Pokermon is a joyful place!). Each trainer has a wish-list of length $ l_{i} $ of teams he’d like to join.\n\nYour task is to divide players into teams and the teams into two conferences, so that:\n\n- each trainer belongs to exactly one team;\n- no team is in both conferences;\n- total hate between conferences is at least $ e/2 $ ;\n- every trainer is in a team from his wish-list.\n\nTotal hate between conferences is calculated as the number of pairs of trainers from teams from different conferences who hate each other.",
    "inputFormat": "The first line of the input contains two integer $ n $ ( $ 4<=n<=50000 $ ) and $ e $ ( $ 2<=e<=100000 $ ) — the total number of Pokermon trainers and the number of pairs of trainers who hate each other.\n\nPokermon trainers are numbered from $ 1 $ to $ n $ . Next $ e $ lines contain two integers $ a $ and $ b $ ( $ 1<=a,b<=n $ ) indicating that Pokermon trainers $ a $ and $ b $ hate each other. Next $ 2n $ lines are in a following format. Starting with Pokermon trainer $ 1 $ , for each trainer in consecutive order: first number $ l_{i} $ ( $ 16<=l_{i}<=20 $ ) — a size of Pokermon trainers wish list, then $ l_{i} $ positive integers $ t_{i,j} $ ( $ 1<=t_{i,j}<=T $ ), providing the teams the $ i $ -th trainer would like to be on.\n\nEach trainers wish list will contain each team no more than once. Teams on the wish lists are numbered in such a way that the set of all teams that appear on at least $ 1 $ wish list is set of consecutive positive integers $ {1,2,3,…,T} $ . Here $ T $ might be up to $ 1000000 $ .",
    "outputFormat": "Print two lines. The first line should contain $ n $ numbers, specifying for each trainer the team he is in.\n\nThe second line should contain $ T $ numbers, specifying the conference for each team ( $ 1 $ or $ 2 $ ).",
    "samples": [
        [
            "4 3\n1 2\n2 3\n4 1\n16\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 16 15\n16\n2 3 4 5 6 7 8 9 10 11 12 13 14 15 17 18\n16\n2 3 4 5 6 7 8 9 10 11 12 13 14 15 18 19\n16\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 16 19\n",
            "16 15 19 14 \n2 2 2 1 1 1 2 1 1 2 1 1 1 2 2 1 1 1 1 "
        ]
    ],
    "hint": ""
}