{
    "description": "The Prodiggers are quite a cool band and for this reason, they have been the surprise guest at the ENTER festival for the past 80 years. At the beginning of their careers, they weren’t so successful, so they had to spend time digging channels to earn money; hence the name. Anyway, they like to tour a lot and have surprising amounts of energy to do extremely long tours. However, they hate spending two consecutive days without having a concert, so they would like to avoid it.\n\nA tour is defined by a sequence of concerts and days-off. You need to count in how many ways The Prodiggers can select $ k $ different tours of the same length between $ l $ and $ r $ .\n\nFor example if $ k=2 $ , $ l=1 $ and $ r=2 $ , if we define concert day as {1} and day-off as {0}, here are all possible tours: {0}, {1}, {00}, {01}, {10}, {11}. But tour 00 can not be selected because it has $ 2 $ days-off in a row. Now, we need to count in how many ways we can select $ k=2 $ tours of the same length in range $ [1;2] $ . Here they are: {0,1}; {01,10}; {01,11}; {10,11}.\n\nSince their schedule is quite busy, they want you to tell them in how many ways can do that, modulo $ 1000000007 $ ( $ 10^{9}+7 $ ).",
    "inputFormat": "The first line of the input contains three integers $ k $ , $ l $ and $ r $ ( $ 1<=k<=200 $ , $ 1<=l<=r<=10^{18} $ ).",
    "outputFormat": "Output a single number: the number of ways to select $ k $ different tours of the same length, modulo $ 1000000007 $ .",
    "samples": [
        [
            "1 1 2\n",
            "5\n"
        ]
    ],
    "hint": "",
    "translation": "一个合法的串定义为：长度在 $[l,r]$ 之间，且只含 `0`,`1`，并且不存在连续 $2$ 个或更多的 $0$。\n\n现在要选出 $k$ 个长度相同的合法的串，问有几种选法，答案模 $10^9+7$。"
}