{
    "description": "ZS the Coder has drawn an undirected graph of $ n $ vertices numbered from $ 0 $ to $ n-1 $ and $ m $ edges between them. Each edge of the graph is weighted, each weight is a positive integer.\n\nThe next day, ZS the Coder realized that some of the weights were erased! So he wants to reassign positive integer weight to each of the edges which weights were erased, so that the length of the shortest path between vertices $ s $ and $ t $ in the resulting graph is exactly $ L $ . Can you help him?",
    "inputFormat": "The first line contains five integers $ n,m,L,s,t $ ( $ 2<=n<=1000,1<=m<=10000,1<=L<=10^{9},0<=s,t<=n-1,s≠t $ ) — the number of vertices, number of edges, the desired length of shortest path, starting vertex and ending vertex respectively.\n\nThen, $ m $ lines describing the edges of the graph follow. $ i $ -th of them contains three integers, $ u_{i},v_{i},w_{i} $ ( $ 0<=u_{i},v_{i}<=n-1,u_{i}≠v_{i},0<=w_{i}<=10^{9} $ ). $ u_{i} $ and $ v_{i} $ denote the endpoints of the edge and $ w_{i} $ denotes its weight. If $ w_{i} $ is equal to $ 0 $ then the weight of the corresponding edge was erased.\n\nIt is guaranteed that there is at most one edge between any pair of vertices.",
    "outputFormat": "Print \"NO\" (without quotes) in the only line if it's not possible to assign the weights in a required way.\n\nOtherwise, print \"YES\" in the first line. Next $ m $ lines should contain the edges of the resulting graph, with weights assigned to edges which weights were erased. $ i $ -th of them should contain three integers $ u_{i} $ , $ v_{i} $ and $ w_{i} $ , denoting an edge between vertices $ u_{i} $ and $ v_{i} $ of weight $ w_{i} $ . The edges of the new graph must coincide with the ones in the graph from the input. The weights that were not erased must remain unchanged whereas the new weights can be any positive integer not exceeding $ 10^{18} $ .\n\nThe order of the edges in the output doesn't matter. The length of the shortest path between $ s $ and $ t $ must be equal to $ L $ .\n\nIf there are multiple solutions, print any of them.",
    "samples": [
        [
            "5 5 13 0 4\n0 1 5\n2 1 2\n3 2 3\n1 4 0\n4 3 4\n",
            "YES\n0 1 5\n2 1 2\n3 2 3\n1 4 8\n4 3 4\n"
        ],
        [
            "2 1 123456789 0 1\n0 1 0\n",
            "YES\n0 1 123456789\n"
        ],
        [
            "2 1 999999999 1 0\n0 1 1000000000\n",
            "NO\n"
        ]
    ],
    "hint": "Here's how the graph in the first sample case looks like :\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF715B/c442fd279761bfa74ef367b518cede1e1fa97983.png)In the first sample case, there is only one missing edge weight. Placing the weight of $ 8 $ gives a shortest path from $ 0 $ to $ 4 $ of length $ 13 $ .\n\nIn the second sample case, there is only a single edge. Clearly, the only way is to replace the missing weight with $ 123456789 $ .\n\nIn the last sample case, there is no weights to assign but the length of the shortest path doesn't match the required value, so the answer is \"NO\".",
    "translation": "给n点m边，L，s，t \n修改m条边中边为0的边， \n使满足s,t的最短路长度是L，且输出答案的时候边为0的边的权值必须在[1,1e18]内\n\n感谢@AKIOIAKIOI 提供的翻译"
}