{
    "description": "Polycarp is a music editor at the radio station. He received a playlist for tomorrow, that can be represented as a sequence $ a_{1},a_{2},...,a_{n} $ , where $ a_{i} $ is a band, which performs the $ i $ -th song. Polycarp likes bands with the numbers from $ 1 $ to $ m $ , but he doesn't really like others.\n\nWe define as $ b_{j} $ the number of songs the group $ j $ is going to perform tomorrow. Polycarp wants to change the playlist in such a way that the minimum among the numbers $ b_{1},b_{2},...,b_{m} $ will be as large as possible.\n\nFind this maximum possible value of the minimum among the $ b_{j} $ ( $ 1<=j<=m $ ), and the minimum number of changes in the playlist Polycarp needs to make to achieve it. One change in the playlist is a replacement of the performer of the $ i $ -th song with any other group.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1<=m<=n<=2000 $ ).\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{9} $ ), where $ a_{i} $ is the performer of the $ i $ -th song.",
    "outputFormat": "In the first line print two integers: the maximum possible value of the minimum among the $ b_{j} $ ( $ 1<=j<=m $ ), where $ b_{j} $ is the number of songs in the changed playlist performed by the $ j $ -th band, and the minimum number of changes in the playlist Polycarp needs to make.\n\nIn the second line print the changed playlist.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "4 2\n1 2 3 2\n",
            "2 1\n1 2 1 2 \n"
        ],
        [
            "7 3\n1 3 2 2 2 2 1\n",
            "2 1\n1 3 3 2 2 2 1 \n"
        ],
        [
            "4 4\n1000000000 100 7 1000000000\n",
            "1 4\n1 2 3 4 \n"
        ]
    ],
    "hint": "In the first sample, after Polycarp's changes the first band performs two songs ( $ b_{1}=2 $ ), and the second band also performs two songs ( $ b_{2}=2 $ ). Thus, the minimum of these values equals to $ 2 $ . It is impossible to achieve a higher minimum value by any changes in the playlist.\n\nIn the second sample, after Polycarp's changes the first band performs two songs ( $ b_{1}=2 $ ), the second band performs three songs ( $ b_{2}=3 $ ), and the third band also performs two songs ( $ b_{3}=2 $ ). Thus, the best minimum value is $ 2 $ .",
    "translation": "有n个数，用最少的次数来改变数字，使得1到m出现的次数的最小值最大。输出最小值和改变次数以及改变后的数组。"
}