{
    "description": "This is an interactive problem. You should use flush operation after each printed line. For example, in C++ you should use fflush(stdout), in Java you should use System.out.flush(), and in Pascal — flush(output).\n\nIn this problem you should guess an array $ a $ which is unknown for you. The only information you have initially is the length $ n $ of the array $ a $ .\n\nThe only allowed action is to ask the sum of two elements by their indices. Formally, you can print two indices $ i $ and $ j $ (the indices should be distinct). Then your program should read the response: the single integer equals to $ a_{i}+a_{j} $ .\n\nIt is easy to prove that it is always possible to guess the array using at most $ n $ requests.\n\nWrite a program that will guess the array $ a $ by making at most $ n $ requests.",
    "inputFormat": "",
    "outputFormat": "In each test your program should guess a single array.\n\nThe input starts with a line containing integer $ n $ ( $ 3<=n<=5000 $ ) — the length of the array. Your program should read it at first.\n\nAfter that your program should print to the standard output the requests about the sum of two elements or inform that the array is guessed.\n\n- In case your program is making a request to ask the sum of two elements, it should print line in the format \"? i j\" ( $ i $ and $ j $ are distinct integers between $ 1 $ and $ n $ ), where $ i $ and $ j $ are indices in the array $ a $ .\n- In case your program informs that the array is guessed, it should print line in the format \" $ ! a_{1} a_{2} ... a_{n} $ \" (it is guaranteed that all $ a_{i} $ are positive integers not exceeding $ 10^{5} $ ), where $ a_{i} $ is the $ i $ -th element of the array $ a $ .\n\nThe response on a request is a single integer equal to $ a_{i}+a_{j} $ , printed on a separate line.\n\nYour program can do at most $ n $ requests. Note that the final line « $ ! a_{1} a_{2} ... a_{n} $ » is not counted as a request.\n\nDo not forget about flush operation after each printed line.\n\nAfter you program prints the guessed array, it should terminate normally.",
    "samples": [
        [
            "5\n \n9\n \n7\n \n9\n \n11\n \n6\n ",
            " \n? 1 5\n \n? 2 3\n \n? 4 1\n \n? 5 2\n \n? 3 4\n \n! 4 6 1 5 5"
        ]
    ],
    "hint": "The format of a test to make a hack is:\n\n- The first line contains an integer number $ n $ ( $ 3<=n<=5000 $ ) — the length of the array.\n- The second line contains $ n $ numbers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{5} $ ) — the elements of the array to guess.",
    "translation": "这是一道交互题。\n你有一个长度为n的数组a,你可以向交互库询问任意两个数的和，你至多可以询问n次，你的目标是根据询问结果算出数组里的每个数。\n询问格式如下：\n1.你输出 ? x y\n2.交互库将会告诉你a[x]与a[y]的和\n交互库将会将你查询的结果输出到你程序的标准输入中，你询问完直接读入即可。\n每做出一次询问，你需要使用flush，具体用法参见CF679A的翻译\n当你计算出结果后，需要先输出一个\"! \"，接下来输出a[1],a[2],a[3]...a[n]，每输出一个数空一格。\n具体格式可参考样例理解。\n\n感谢U20158 Ebola 提供的翻译"
}