{
    "description": "Polycarp has interviewed Oleg and has written the interview down without punctuation marks and spaces to save time. Thus, the interview is now a string $ s $ consisting of $ n $ lowercase English letters.\n\nThere is a filler word ogo in Oleg's speech. All words that can be obtained from ogo by adding go several times to the end of it are also considered to be fillers. For example, the words ogo, ogogo, ogogogo are fillers, but the words go, og, ogog, ogogog and oggo are not fillers.\n\nThe fillers have maximal size, for example, for ogogoo speech we can't consider ogo a filler and goo as a normal phrase. We should consider ogogo as a filler here.\n\nTo print the interview, Polycarp has to replace each of the fillers with three asterisks. Note that a filler word is replaced with exactly three asterisks regardless of its length.\n\nPolycarp has dealt with this problem in no time. Can you do the same? The clock is ticking!",
    "inputFormat": "The first line contains a positive integer $ n $ ( $ 1<=n<=100 $ ) — the length of the interview.\n\nThe second line contains the string $ s $ of length $ n $ , consisting of lowercase English letters.",
    "outputFormat": "Print the interview text after the replacement of each of the fillers with \"\\*\\*\\*\". It is allowed for the substring \"\\*\\*\\*\" to have several consecutive occurences.",
    "samples": [
        [
            "7\naogogob\n",
            "a***b\n"
        ],
        [
            "13\nogogmgogogogo\n",
            "***gmg***\n"
        ],
        [
            "9\nogoogoogo\n",
            "*********\n"
        ]
    ],
    "hint": "The first sample contains one filler word ogogo, so the interview for printing is \"a\\*\\*\\*b\".\n\nThe second sample contains two fillers ogo and ogogogo. Thus, the interview is transformed to \"\\*\\*\\*gmg\\*\\*\\*\".",
    "translation": "给定一个长度为n的字符串s\n\n将s中所有以\"ogo\"开头，后接任意个\"go\"的子串替换为\"***\"\n\n输出替换之后的s"
}