{
    "description": "You are given a broken clock. You know, that it is supposed to show time in 12- or 24-hours HH:MM format. In 12-hours format hours change from $ 1 $ to $ 12 $ , while in 24-hours it changes from $ 0 $ to $ 23 $ . In both formats minutes change from $ 0 $ to $ 59 $ .\n\nYou are given a time in format HH:MM that is currently displayed on the broken clock. Your goal is to change minimum number of digits in order to make clocks display the correct time in the given format.\n\nFor example, if 00:99 is displayed, it is enough to replace the second 9 with 3 in order to get 00:39 that is a correct time in 24-hours format. However, to make 00:99 correct in 12-hours format, one has to change at least two digits. Additionally to the first change one can replace the second 0 with 1 and obtain 01:39.",
    "inputFormat": "The first line of the input contains one integer $ 12 $ or $ 24 $ , that denote 12-hours or 24-hours format respectively.\n\nThe second line contains the time in format HH:MM, that is currently displayed on the clock. First two characters stand for the hours, while next two show the minutes.",
    "outputFormat": "The only line of the output should contain the time in format HH:MM that is a correct time in the given format. It should differ from the original in as few positions as possible. If there are many optimal solutions you can print any of them.",
    "samples": [
        [
            "24\n17:30\n",
            "17:30\n"
        ],
        [
            "12\n17:30\n",
            "07:30\n"
        ],
        [
            "24\n99:99\n",
            "09:09\n"
        ]
    ],
    "hint": "",
    "translation": "现在要你把一个错误的时间，通过改变最少的数字改成合理的。输入第一行为时间是24小时制或12小时制，第二行为错误的时间；输出一行为改正后的时间。"
}