{
    "description": "You are given a string $ s $ , consisting of lowercase English letters, and the integer $ m $ .\n\nOne should choose some symbols from the given string so that any contiguous subsegment of length $ m $ has at least one selected symbol. Note that here we choose positions of symbols, not the symbols themselves.\n\nThen one uses the chosen symbols to form a new string. All symbols from the chosen position should be used, but we are allowed to rearrange them in any order.\n\nFormally, we choose a subsequence of indices $ 1<=i_{1}&lt;i_{2}&lt;...&lt;i_{t}<=|s| $ . The selected sequence must meet the following condition: for every $ j $ such that $ 1<=j<=|s|-m+1 $ , there must be at least one selected index that belongs to the segment $ [j, j+m-1] $ , i.e. there should exist a $ k $ from $ 1 $ to $ t $ , such that $ j<=i_{k}<=j+m-1 $ .\n\nThen we take any permutation $ p $ of the selected indices and form a new string $ s_{ip1}s_{ip2}...\\ s_{ipt} $ .\n\nFind the lexicographically smallest string, that can be obtained using this procedure.",
    "inputFormat": "The first line of the input contains a single integer $ m $ ( $ 1<=m<=100000 $ ).\n\nThe second line contains the string $ s $ consisting of lowercase English letters. It is guaranteed that this string is non-empty and its length doesn't exceed $ 100000 $ . It is also guaranteed that the number $ m $ doesn't exceed the length of the string $ s $ .",
    "outputFormat": "Print the single line containing the lexicographically smallest string, that can be obtained using the procedure described above.",
    "samples": [
        [
            "3\ncbabc\n",
            "a\n"
        ],
        [
            "2\nabcab\n",
            "aab\n"
        ],
        [
            "3\nbcabcbaccba\n",
            "aaabb\n"
        ]
    ],
    "hint": "In the first sample, one can choose the subsequence $ {3} $ and form a string \"a\".\n\nIn the second sample, one can choose the subsequence $ {1,2,4} $ (symbols on this positions are 'a', 'b' and 'a') and rearrange the chosen symbols to form a string \"aab\".",
    "translation": "### 题目描述\r\n给定长度为n(1 <= n <= 100,000) 的字符串s，现在要求选取一些字符使得每个长度为m 的字符串区间均有一个被选中的字符，且选中的这些字符**重排列**后得到的字符串字典序最小\r\n\r\n### 输入格式\r\n输入包括两行\r\n\r\n第一行包括一个正整数m(1<=m<=100000) 意思如题目描述所示，第二行包括一段字符串s\r\n\r\n### 输出格式\r\n输出仅一行，为重排列后的选中字符串"
}