{
    "description": "Vanya is managed to enter his favourite site Codehorses. Vanya uses $ n $ distinct passwords for sites at all, however he can't remember which one exactly he specified during Codehorses registration.\n\nVanya will enter passwords in order of non-decreasing their lengths, and he will enter passwords of same length in arbitrary order. Just when Vanya will have entered the correct password, he is immediately authorized on the site. Vanya will not enter any password twice.\n\nEntering any passwords takes one second for Vanya. But if Vanya will enter wrong password $ k $ times, then he is able to make the next try only $ 5 $ seconds after that. Vanya makes each try immediately, that is, at each moment when Vanya is able to enter password, he is doing that.\n\nDetermine how many seconds will Vanya need to enter Codehorses in the best case for him (if he spends minimum possible number of second) and in the worst case (if he spends maximum possible amount of seconds).",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 1<=n,k<=100 $ ) — the number of Vanya's passwords and the number of failed tries, after which the access to the site is blocked for $ 5 $ seconds.\n\nThe next $ n $ lines contains passwords, one per line — pairwise distinct non-empty strings consisting of latin letters and digits. Each password length does not exceed $ 100 $ characters.\n\nThe last line of the input contains the Vanya's Codehorses password. It is guaranteed that the Vanya's Codehorses password is equal to some of his $ n $ passwords.",
    "outputFormat": "Print two integers — time (in seconds), Vanya needs to be authorized to Codehorses in the best case for him and in the worst case respectively.",
    "samples": [
        [
            "5 2\ncba\nabc\nbb1\nabC\nABC\nabc\n",
            "1 15\n"
        ],
        [
            "4 100\n11\n22\n1\n2\n22\n",
            "3 4\n"
        ]
    ],
    "hint": "Consider the first sample case. As soon as all passwords have the same length, Vanya can enter the right password at the first try as well as at the last try. If he enters it at the first try, he spends exactly $ 1 $ second. Thus in the best case the answer is $ 1 $ . If, at the other hand, he enters it at the last try, he enters another $ 4 $ passwords before. He spends $ 2 $ seconds to enter first $ 2 $ passwords, then he waits $ 5 $ seconds as soon as he made $ 2 $ wrong tries. Then he spends $ 2 $ more seconds to enter $ 2 $ wrong passwords, again waits $ 5 $ seconds and, finally, enters the correct password spending $ 1 $ more second. In summary in the worst case he is able to be authorized in $ 15 $ seconds.\n\nConsider the second sample case. There is no way of entering passwords and get the access to the site blocked. As soon as the required password has length of $ 2 $ , Vanya enters all passwords of length $ 1 $ anyway, spending $ 2 $ seconds for that. Then, in the best case, he immediately enters the correct password and the answer for the best case is $ 3 $ , but in the worst case he enters wrong password of length $ 2 $ and only then the right one, spending $ 4 $ seconds at all.",
    "translation": "## 题目大意\nVanya想去他最喜欢的名为Codehorses的网站，他平时用n个密码作为他所有网站的密码。但是这天，Vanya突然忘了他的密码。\nVanya试的所有密码中，不存在某一次长度小于上一次的长度，他每次会随机试同一长度的密码（当这种长度试完后，会试下一长度的密码）。当他试对时，会瞬间批准进入网站。\n他每次输入密码需要1秒，每连续k次输错后，需要等5秒再试下一次。他输密码的过程中不会休息停顿。\n准确算出他进入网站最好情况和最差情况所需要的秒数。\n## 输入输出格式\n### 输入格式\n第一行：输入整数n，k (1<=n,k<=100)\n接下来n行：输入密码，不超过100个字符，可以是拉丁字母也可以是数字。\n最后一行：正确的密码，必须和上面n个密码中的一个相同。\n### 输出格式\n两个整数，分别是最好情况所需的时间和最坏情况所需的时间。\n"
}