{
    "description": "Vasya is currently at a car rental service, and he wants to reach cinema. The film he has bought a ticket for starts in $ t $ minutes. There is a straight road of length $ s $ from the service to the cinema. Let's introduce a coordinate system so that the car rental service is at the point $ 0 $ , and the cinema is at the point $ s $ .\n\nThere are $ k $ gas stations along the road, and at each of them you can fill a car with any amount of fuel for free! Consider that this operation doesn't take any time, i.e. is carried out instantly.\n\nThere are $ n $ cars in the rental service, $ i $ -th of them is characterized with two integers $ c_{i} $ and $ v_{i} $ — the price of this car rent and the capacity of its fuel tank in liters. It's not allowed to fuel a car with more fuel than its tank capacity $ v_{i} $ . All cars are completely fueled at the car rental service.\n\nEach of the cars can be driven in one of two speed modes: normal or accelerated. In the normal mode a car covers $ 1 $ kilometer in $ 2 $ minutes, and consumes $ 1 $ liter of fuel. In the accelerated mode a car covers $ 1 $ kilometer in $ 1 $ minutes, but consumes $ 2 $ liters of fuel. The driving mode can be changed at any moment and any number of times.\n\nYour task is to choose a car with minimum price such that Vasya can reach the cinema before the show starts, i.e. not later than in $ t $ minutes. Assume that all cars are completely fueled initially.",
    "inputFormat": "The first line contains four positive integers $ n $ , $ k $ , $ s $ and $ t $ ( $ 1<=n<=2·10^{5} $ , $ 1<=k<=2·10^{5} $ , $ 2<=s<=10^{9} $ , $ 1<=t<=2·10^{9} $ ) — the number of cars at the car rental service, the number of gas stations along the road, the length of the road and the time in which the film starts.\n\nEach of the next $ n $ lines contains two positive integers $ c_{i} $ and $ v_{i} $ ( $ 1<=c_{i},v_{i}<=10^{9} $ ) — the price of the $ i $ -th car and its fuel tank capacity.\n\nThe next line contains $ k $ distinct integers $ g_{1},g_{2},...,g_{k} $ ( $ 1<=g_{i}<=s-1 $ ) — the positions of the gas stations on the road in arbitrary order.",
    "outputFormat": "Print the minimum rent price of an appropriate car, i.e. such car that Vasya will be able to reach the cinema before the film starts (not later than in $ t $ minutes). If there is no appropriate car, print -1.",
    "samples": [
        [
            "3 1 8 10\n10 8\n5 7\n11 9\n3\n",
            "10\n"
        ],
        [
            "2 2 10 18\n10 4\n20 6\n5 3\n",
            "20\n"
        ]
    ],
    "hint": "In the first sample, Vasya can reach the cinema in time using the first or the third cars, but it would be cheaper to choose the first one. Its price is equal to $ 10 $ , and the capacity of its fuel tank is $ 8 $ . Then Vasya can drive to the first gas station in the accelerated mode in $ 3 $ minutes, spending $ 6 $ liters of fuel. After that he can full the tank and cover $ 2 $ kilometers in the normal mode in $ 4 $ minutes, spending $ 2 $ liters of fuel. Finally, he drives in the accelerated mode covering the remaining $ 3 $ kilometers in $ 3 $ minutes and spending $ 6 $ liters of fuel.",
    "translation": "题意简述\n\n某人在起点处，到终点的距离为s。 汽车租赁公司提供n中车型，每种车型有属性ci（租车费用），vi（油箱容量）。 车子有两种前进方式 ：①. 慢速：1km消耗1L汽油，花费2分钟。 ②.快速：1km消耗2L汽油，花费1分钟。 路上有k个加油站，加油不需要花费时间，且直接给油箱加满。 问在t分钟内到达终点的最小花费是多少？（租车子的费用）  若无法到达终点，输出-1"
}