{
    "description": "You are given an undirected connected graph consisting of $ n $ vertices and $ m $ edges. There are no loops and no multiple edges in the graph.\n\nYou are also given two distinct vertices $ s $ and $ t $ , and two values $ d_{s} $ and $ d_{t} $ . Your task is to build any spanning tree of the given graph (note that the graph is not weighted), such that the degree of the vertex $ s $ doesn't exceed $ d_{s} $ , and the degree of the vertex $ t $ doesn't exceed $ d_{t} $ , or determine, that there is no such spanning tree.\n\nThe spanning tree of the graph $ G $ is a subgraph which is a tree and contains all vertices of the graph $ G $ . In other words, it is a connected graph which contains $ n-1 $ edges and can be obtained by removing some of the edges from $ G $ .\n\nThe degree of a vertex is the number of edges incident to this vertex.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 2<=n<=200000 $ , $ 1<=m<=min(400000,n·(n-1)/2) $ ) — the number of vertices and the number of edges in the graph.\n\nThe next $ m $ lines contain the descriptions of the graph's edges. Each of the lines contains two integers $ u $ and $ v $ ( $ 1<=u,v<=n $ , $ u≠v $ ) — the ends of the corresponding edge. It is guaranteed that the graph contains no loops and no multiple edges and that it is connected.\n\nThe last line contains four integers $ s $ , $ t $ , $ d_{s} $ , $ d_{t} $ ( $ 1<=s,t<=n $ , $ s≠t $ , $ 1<=d_{s},d_{t}<=n-1 $ ).",
    "outputFormat": "If the answer doesn't exist print \"No\" (without quotes) in the only line of the output.\n\nOtherwise, in the first line print \"Yes\" (without quotes). In the each of the next $ (n-1) $ lines print two integers — the description of the edges of the spanning tree. Each of the edges of the spanning tree must be printed exactly once.\n\nYou can output edges in any order. You can output the ends of each edge in any order.\n\nIf there are several solutions, print any of them.",
    "samples": [
        [
            "3 3\n1 2\n2 3\n3 1\n1 2 1 1\n",
            "Yes\n3 2\n1 3\n"
        ],
        [
            "7 8\n7 4\n1 3\n5 4\n5 7\n3 2\n2 4\n6 1\n1 2\n6 4 1 4\n",
            "Yes\n1 3\n5 7\n3 2\n7 4\n2 4\n6 1\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个n个点m条边的无向联通图，没有重边和自环。给定s和t，求一棵生成树，使得s,t的度数不超过ds,dt。若有解，输出“Yes”和方案，若无解，输出“No”。\r\n数据范围：$2 ≤ n ≤ 200 000$,\r\n$1 ≤ m ≤ min(400 000, n·(n - 1) / 2)$，$1 ≤ s, t ≤ n$, $s ≠ t$, $1 ≤ ds$, $dt ≤ n - 1$\r\n"
}