{
    "description": "Polycarp is a regular customer at the restaurant \"Ber Patio\". He likes having lunches there.\n\n\"Ber Patio\" has special discount program for regular customers. A customer can collect bonuses and partially cover expenses in the restaurant.\n\nLet's assume a customer currently has $ b $ bonuses and she has to pay $ r $ burles for a lunch. In this case the customer can use bonuses (1 bonus = 1 burle) to reduce the payment. She can cover at most half of the payment using bonuses. However, 1 bonus will be added to the customer's bonus balance per each 10 burles she paid.\n\nFormally:\n\n1. a customer can choose any number $ x $ of bonuses to use (![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF730F/376a242ded12895b22630ad5e90208fdc6c2a0e1.png))),\n2. the customer's bonus balance is reduced by $ x $ ,\n3. the customer pays $ r-x $ burles,\n4. the customer's bonus balance is increased by $ ⌊(r-x)/10⌋ $ (i.e. integer division rounded down is used).\n\nInitially, there are $ b $ bonuses on Polycarp's account. Polycarp is going to have a lunch in \"Ber Patio\" for the next $ n $ days. He estimated the values $ a_{1},a_{2},...,a_{n} $ , where $ a_{i} $ is the number of burles in a receipt for the $ i $ -th day. The sum over all receipts doesn't exceed $ 10^{5} $ burles.\n\nWrite a program to find the minimum number of burles Polycarp has to spend and an optimal strategy to use bonuses.",
    "inputFormat": "The first line contains two integer numbers $ n $ and $ b $ ( $ 1<=n<=5000 $ , $ 0<=b<=10^{5} $ ) — number of days and initial number of bonuses Polycarp has.\n\nThe second line contains the integer sequence $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=1000 $ ), where $ a_{i} $ is the amount of burles in the $ i $ -th day's receipt.\n\nIt is guaranteed that the sum of all receipts does not exceed $ 10^{5} $ burles.",
    "outputFormat": "On the first line, print the expected minimal number of burles to pay for all $ n $ receipts.\n\nOn the second line, print the sequence of integer numbers $ b_{1},b_{2},...,b_{n} $ , where $ b_{i} $ is the number of bonuses to use on the $ i $ -th day. If there are multiple solutions, print any of them.",
    "samples": [
        [
            "3 21\n12 75 52\n",
            "110\n2 5 22 \n"
        ],
        [
            "3 39\n58 64 33\n",
            "107\n28 4 16 \n"
        ]
    ],
    "hint": ""
}