{
    "description": "Anton likes to play chess. Also, he likes to do programming. That is why he decided to write the program that plays chess. However, he finds the game on $ 8 $ to $ 8 $ board to too simple, he uses an infinite one instead.\n\nThe first task he faced is to check whether the king is in check. Anton doesn't know how to implement this so he asks you to help.\n\nConsider that an infinite chess board contains one white king and the number of black pieces. There are only rooks, bishops and queens, as the other pieces are not supported yet. The white king is said to be in check if at least one black piece can reach the cell with the king in one move.\n\nHelp Anton and write the program that for the given position determines whether the white king is in check.\n\nRemainder, on how do chess pieces move:\n\n- Bishop moves any number of cells diagonally, but it can't \"leap\" over the occupied cells.\n- Rook moves any number of cells horizontally or vertically, but it also can't \"leap\" over the occupied cells.\n- Queen is able to move any number of cells horizontally, vertically or diagonally, but it also can't \"leap\".",
    "inputFormat": "The first line of the input contains a single integer $ n $ ( $ 1<=n<=500000 $ ) — the number of black pieces.\n\nThe second line contains two integers $ x_{0} $ and $ y_{0} $ ( $ -10^{9}<=x_{0},y_{0}<=10^{9} $ ) — coordinates of the white king.\n\nThen follow $ n $ lines, each of them contains a character and two integers $ x_{i} $ and $ y_{i} $ ( $ -10^{9}<=x_{i},y_{i}<=10^{9} $ ) — type of the $ i $ -th piece and its position. Character 'B' stands for the bishop, 'R' for the rook and 'Q' for the queen. It's guaranteed that no two pieces occupy the same position.",
    "outputFormat": "The only line of the output should contains \"YES\" (without quotes) if the white king is in check and \"NO\" (without quotes) otherwise.",
    "samples": [
        [
            "2\n4 2\nR 1 1\nB 1 5\n",
            "YES\n"
        ],
        [
            "2\n4 2\nR 3 3\nB 1 5\n",
            "NO\n"
        ]
    ],
    "hint": "Picture for the first sample:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF734D/3408090bb38d14bd7245478ef4aa728172888335.png) White king is in check, because the black bishop can reach the cell with the white king in one move. The answer is \"YES\".Picture for the second sample:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF734D/86e2eb5f33f5f5d3c8862bec94e786d4b0082afe.png) Here bishop can't reach the cell with the white king, because his path is blocked by the rook, and the bishop cant \"leap\" over it. Rook can't reach the white king, because it can't move diagonally. Hence, the king is not in check and the answer is \"NO\".",
    "translation": "## **题目描述**\r\n\r\nAnton喜欢下棋与编程，所以他决定写一个国际象棋游戏。然而，他认为8x8的棋盘太简单了，因此这个棋盘是无限大的。\r\n\r\n他的第一个任务是检查当前状态下是否被将军，他并不知道如何实现这点，因此向你求助。\r\n\r\n棋盘上有一个白色方的王与n个黑色方的棋子，它们仅由车、象和后组成。当至少一个黑色方的棋子可以在一步内移动到白色方王所在的格子时被视为将军。\r\n\r\n帮助Anton写一个程序，在给定所有棋子的位置时判定白色方的王是否被将军。\r\n\r\n以下是各种棋子的移动方式：\r\n\r\n- 象可以斜着移动，格子不限。\r\n- 车可以水平或垂直移动，格子不限。\r\n- 后可以水平、垂直或斜着移动，格子不限。\r\n- 所有的棋子不能越过已经占用的格子。\r\n\r\n## **输入输出格式**\r\n### 输入格式：\r\n第一行包含一个整数n(1<=n<=500 000)，代表黑色方棋子的数量。\r\n\r\n第二行包含两个整数x0和y0(-10^9<=x0,y0<=10^9)，代表白色方王的坐标。\r\n\r\n接下来的n行，每行包含一个字符和两个整数xi和yi(-10^9<=xi,yi<=10^9)，字符'B'代表象，'R'代表车，'Q'代表后，xi和yi代表它们在棋盘上的坐标。题目确保所有的棋子不会出现在同样的位置。\r\n\r\n### 输出格式：\r\n输出由一行组成：如果被将军，则输出\"YES\"（不带引号），否则输出\"NO\"（不带引号）。"
}