{
    "description": "Recently a dog was bought for Polycarp. The dog's name is Cormen. Now Polycarp has a lot of troubles. For example, Cormen likes going for a walk.\n\nEmpirically Polycarp learned that the dog needs at least $ k $ walks for any two consecutive days in order to feel good. For example, if $ k=5 $ and yesterday Polycarp went for a walk with Cormen $ 2 $ times, today he has to go for a walk at least $ 3 $ times.\n\nPolycarp analysed all his affairs over the next $ n $ days and made a sequence of $ n $ integers $ a_{1},a_{2},...,a_{n} $ , where $ a_{i} $ is the number of times Polycarp will walk with the dog on the $ i $ -th day while doing all his affairs (for example, he has to go to a shop, throw out the trash, etc.).\n\nHelp Polycarp determine the minimum number of walks he needs to do additionaly in the next $ n $ days so that Cormen will feel good during all the $ n $ days. You can assume that on the day before the first day and on the day after the $ n $ -th day Polycarp will go for a walk with Cormen exactly $ k $ times.\n\nWrite a program that will find the minumum number of additional walks and the appropriate schedule — the sequence of integers $ b_{1},b_{2},...,b_{n} $ ( $ b_{i}>=a_{i} $ ), where $ b_{i} $ means the total number of walks with the dog on the $ i $ -th day.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1<=n,k<=500 $ ) — the number of days and the minimum number of walks with Cormen for any two consecutive days.\n\nThe second line contains integers $ a_{1},a_{2},...,a_{n} $ ( $ 0<=a_{i}<=500 $ ) — the number of walks with Cormen on the $ i $ -th day which Polycarp has already planned.",
    "outputFormat": "In the first line print the smallest number of additional walks that Polycarp should do during the next $ n $ days so that Cormen will feel good during all days.\n\nIn the second line print $ n $ integers $ b_{1},b_{2},...,b_{n} $ , where $ b_{i} $ — the total number of walks on the $ i $ -th day according to the found solutions ( $ a_{i}<=b_{i} $ for all $ i $ from 1 to $ n $ ). If there are multiple solutions, print any of them.",
    "samples": [
        [
            "3 5\n2 0 1\n",
            "4\n2 3 2\n"
        ],
        [
            "3 1\n0 0 0\n",
            "1\n0 1 0\n"
        ],
        [
            "4 6\n2 4 3 5\n",
            "0\n2 4 3 5\n"
        ]
    ],
    "hint": "",
    "translation": "~~去掉了故事背景~~\n\n给你$n$个有序整数$a_1,a_2,...a_n$( \n$0\\leqslant a_i \\leqslant 500 $) ，和一个整数$k$ ( \n$1\\leqslant n,k\\leqslant500 $) 。\n\n要求使这个整数序列变得相邻两个数之和不小于$k$。\n\n请输出**最小增加数值之和**与**操作后的序列**。\n\n#### 输入\n第一行：两个正整数$n$与$k$\n\n第二行：n个非负整数$a_1,a_2,...a_n$\n#### 输出\n第一行：最小增加数值之和。\n\n第二行：n个整数$b_1,b_2,...b_n$——操作后的序列，如果有多种可能，输出任意一种即可。"
}