{
    "description": "Polycarp is a beginner programmer. He is studying how to use a command line.\n\nPolycarp faced the following problem. There are $ n $ files in a directory and he needs to delete some of them. Polycarp wants to run a single delete command with filename pattern as an argument. All the files to be deleted should match the pattern and all other files shouldn't match the pattern.\n\nPolycarp doesn't know about an asterisk '\\*', the only special character he knows is a question mark '?' which matches any single character. All other characters in the pattern match themselves only.\n\nFormally, a pattern matches a filename if and only if they have equal lengths and all characters in the corresponding positions are equal except when the character in the pattern is '?', in which case the corresponding filename character does not matter.\n\nFor example, the filename pattern \"a?ba?\":\n\n- matches filenames \"aabaa\", \"abba.\", \"a.ba9\" and \"a.ba.\";\n- does not match filenames \"aaba\", \"abaab\", \"aabaaa\" and \"aabaa.\".\n\nHelp Polycarp find a pattern which matches files to be deleted and only them or report if there is no such pattern.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ m $ ( $ 1<=m<=n<=100 $ ) — the total number of files and the number of files to be deleted.\n\nThe following $ n $ lines contain filenames, single filename per line. All filenames are non-empty strings containing only lowercase English letters, digits and dots ('.'). The length of each filename doesn't exceed 100. It is guaranteed that all filenames are distinct.\n\nThe last line of the input contains $ m $ distinct integer numbers in ascending order $ a_{1},a_{2},...,a_{m} $ ( $ 1<=a_{i}<=n $ ) — indices of files to be deleted. All files are indexed from $ 1 $ to $ n $ in order of their appearance in the input.",
    "outputFormat": "If the required pattern exists, print \"Yes\" in the first line of the output. The second line should contain the required pattern. If there are multiple solutions, print any of them.\n\nIf the required pattern doesn't exist, print the only line containing \"No\".",
    "samples": [
        [
            "3 2\nab\nac\ncd\n1 2\n",
            "Yes\na?\n"
        ],
        [
            "5 3\ntest\ntezt\ntest.\n.est\ntes.\n1 4 5\n",
            "Yes\n?es?\n"
        ],
        [
            "4 4\na\nb\nc\ndd\n1 2 3 4\n",
            "No\n"
        ],
        [
            "6 3\n.svn\n.git\n....\n...\n..\n.\n1 2 3\n",
            "Yes\n.???\n"
        ]
    ],
    "hint": "",
    "translation": "### 题意简述\r\n给定n个字符串，要求删除其中的m条，输出一条匹配的字符串：将这m条字串的公共字符保留，其余用'?'代替，且该匹配字符不能包含其他不能删除的字符串。若不存在这样匹配的字符串输出No。若存在则输出一行Yes和一行匹配字符串。\r\n   "
}