{
    "description": "Anton is playing a very interesting computer game, but now he is stuck at one of the levels. To pass to the next level he has to prepare $ n $ potions.\n\nAnton has a special kettle, that can prepare one potions in $ x $ seconds. Also, he knows spells of two types that can faster the process of preparing potions.\n\n1. Spells of this type speed up the preparation time of one potion. There are $ m $ spells of this type, the $ i $ -th of them costs $ b_{i} $ manapoints and changes the preparation time of each potion to $ a_{i} $ instead of $ x $ .\n2. Spells of this type immediately prepare some number of potions. There are $ k $ such spells, the $ i $ -th of them costs $ d_{i} $ manapoints and instantly create $ c_{i} $ potions.\n\nAnton can use no more than one spell of the first type and no more than one spell of the second type, and the total number of manapoints spent should not exceed $ s $ . Consider that all spells are used instantly and right before Anton starts to prepare potions.\n\nAnton wants to get to the next level as fast as possible, so he is interested in the minimum number of time he needs to spent in order to prepare at least $ n $ potions.",
    "inputFormat": "The first line of the input contains three integers $ n $ , $ m $ , $ k $ ( $ 1<=n<=2·10^{9},1<=m,k<=2·10^{5} $ ) — the number of potions, Anton has to make, the number of spells of the first type and the number of spells of the second type.\n\nThe second line of the input contains two integers $ x $ and $ s $ ( $ 2<=x<=2·10^{9},1<=s<=2·10^{9} $ ) — the initial number of seconds required to prepare one potion and the number of manapoints Anton can use.\n\nThe third line contains $ m $ integers $ a_{i} $ ( $ 1<=a_{i}&lt;x $ ) — the number of seconds it will take to prepare one potion if the $ i $ -th spell of the first type is used.\n\nThe fourth line contains $ m $ integers $ b_{i} $ ( $ 1<=b_{i}<=2·10^{9} $ ) — the number of manapoints to use the $ i $ -th spell of the first type.\n\nThere are $ k $ integers $ c_{i} $ ( $ 1<=c_{i}<=n $ ) in the fifth line — the number of potions that will be immediately created if the $ i $ -th spell of the second type is used. It's guaranteed that $ c_{i} $ are not decreasing, i.e. $ c_{i}<=c_{j} $ if $ i&lt;j $ .\n\nThe sixth line contains $ k $ integers $ d_{i} $ ( $ 1<=d_{i}<=2·10^{9} $ ) — the number of manapoints required to use the $ i $ -th spell of the second type. It's guaranteed that $ d_{i} $ are not decreasing, i.e. $ d_{i}<=d_{j} $ if $ i&lt;j $ .",
    "outputFormat": "Print one integer — the minimum time one has to spent in order to prepare $ n $ potions.",
    "samples": [
        [
            "20 3 2\n10 99\n2 4 3\n20 10 40\n4 15\n10 80\n",
            "20\n"
        ],
        [
            "20 3 2\n10 99\n2 4 3\n200 100 400\n4 15\n100 800\n",
            "200\n"
        ]
    ],
    "hint": "In the first sample, the optimum answer is to use the second spell of the first type that costs $ 10 $ manapoints. Thus, the preparation time of each potion changes to $ 4 $ seconds. Also, Anton should use the second spell of the second type to instantly prepare $ 15 $ potions spending $ 80 $ manapoints. The total number of manapoints used is $ 10+80=90 $ , and the preparation time is $ 4·5=20 $ seconds ( $ 15 $ potions were prepared instantly, and the remaining $ 5 $ will take $ 4 $ seconds each).\n\nIn the second sample, Anton can't use any of the spells, so he just prepares $ 20 $ potions, spending $ 10 $ seconds on each of them and the answer is $ 20·10=200 $ .",
    "translation": "$Anton$ 正在玩游戏，他卡在一关过不去了，想要过关必须准备n个溶液\n\n$Anton$ 有一种特殊的茶壶，可以用 $x$ 秒准备一个溶液.\n同时，他还知道两种咒语来加快速度\n\n第一种：加快一个溶液的准备速度，有m个这种咒语，\n第 $i$ 个花费 $b[i]$ ，并且把准备速度修改为 $a[i]$\n\n第二种：立刻准备好一定数量的溶液，有 $k$ 个咒语\n第 $i$个花费 $d[i]$ 并且立刻准备好 $c[i]$ 个溶液\n\n$Anton$ 最多只能用一次第一种咒语并且最多只能用一次\n第二种咒语，最多花费 $s$。可以认为使用每种咒语\n不额外消耗时间，并且在 $Anton$ 开始准备溶液\n之前使用\n\n求 $Anton$ 准备 至少 $n$ 个溶液需要花费的最小时间"
}