{
    "description": "Berland is a tourist country! At least, it can become such — the government of Berland is confident about this.\n\nThere are $ n $ cities in Berland, some pairs of which are connected by two-ways roads. Each road connects two different cities. In Berland there are no roads which connect the same pair of cities. It is possible to get from any city to any other city using given two-ways roads.\n\nAccording to the reform each road will become one-way. It will be oriented to one of two directions.\n\nTo maximize the tourist attraction of Berland, after the reform for each city $ i $ the value $ r_{i} $ will be calculated. It will equal to the number of cities $ x $ for which there is an oriented path from the city $ i $ to the city $ x $ . In other words, $ r_{i} $ will equal the number of cities which can be reached from the city $ i $ by roads.\n\nThe government is sure that tourist's attention will be focused on the minimum value of $ r_{i} $ .\n\nHelp the government of Berland make the reform to maximize the minimum of $ r_{i} $ .",
    "inputFormat": "The first line contains two integers $ n,m $ ( $ 2<=n<=400000,1<=m<=400000 $ ) — the number of cities and the number of roads.\n\nThe next $ m $ lines describe roads in Berland: the $ j $ -th of them contains two integers $ u_{j} $ and $ v_{j} $ ( $ 1<=u_{j},v_{j}<=n $ , $ u_{j}≠v_{j} $ ), where $ u_{j} $ and $ v_{j} $ are the numbers of cities which are connected by the $ j $ -th road.\n\nThe cities are numbered from $ 1 $ to $ n $ . It is guaranteed that it is possible to get from any city to any other by following two-ways roads. In Berland there are no roads which connect the same pair of cities.",
    "outputFormat": "In the first line print single integer — the maximum possible value $ min_{1<=i<=n}{r_{i}} $ after the orientation of roads.\n\nThe next $ m $ lines must contain the description of roads after the orientation: the $ j $ -th of them must contain two integers $ u_{j},v_{j} $ , it means that the $ j $ -th road will be directed from the city $ u_{j} $ to the city $ v_{j} $ . Print roads in the same order as they are given in the input data.",
    "samples": [
        [
            "7 9\n4 3\n2 6\n7 1\n4 1\n7 3\n3 5\n7 4\n6 5\n2 5\n",
            "4\n4 3\n6 2\n7 1\n1 4\n3 7\n5 3\n7 4\n5 6\n2 5\n"
        ]
    ],
    "hint": "",
    "translation": "Berland是一个旅游国家！至少——Berland政府对此充满信心。\n\nBerland有 $n$ 个城市，其中一些城市以两条道路连接。每条路连接两个不同的城市。在Berland没有连接同一城市的道路。城市之间两两可达。\n\n根据改革，每一条道路将成为单向的。它将面向两个方向之一。\n\n为了最大限度地提高Berland的旅游吸引力，在对每个城市进行改革后，我将计算值 $R_i$ 。它将等于城市 $X$ 的数量，其中有一个从城市 $i$ 到城市 $X$ 的有向路径。换言之，$R_i$ 等于可以通过道路从 $i$ 到达的城市的数量。\n\n\n政府确信游客的注意力将集中在 $R_i$ 的最小值上。\n\n\n帮助Berland政府进行改革，以最大限度地提高 $R_i$ 的最小值。\n\n翻译提供者：jzzcjb"
}