{
    "description": "On the way to Rio de Janeiro Ostap kills time playing with a grasshopper he took with him in a special box. Ostap builds a line of length $ n $ such that some cells of this line are empty and some contain obstacles. Then, he places his grasshopper to one of the empty cells and a small insect in another empty cell. The grasshopper wants to eat the insect.\n\nOstap knows that grasshopper is able to jump to any empty cell that is exactly $ k $ cells away from the current (to the left or to the right). Note that it doesn't matter whether intermediate cells are empty or not as the grasshopper makes a jump over them. For example, if $ k=1 $ the grasshopper can jump to a neighboring cell only, and if $ k=2 $ the grasshopper can jump over a single cell.\n\nYour goal is to determine whether there is a sequence of jumps such that grasshopper will get from his initial position to the cell with an insect.",
    "inputFormat": "The first line of the input contains two integers $ n $ and $ k $ ( $ 2<=n<=100 $ , $ 1<=k<=n-1 $ ) — the number of cells in the line and the length of one grasshopper's jump.\n\nThe second line contains a string of length $ n $ consisting of characters '.', '\\#', 'G' and 'T'. Character '.' means that the corresponding cell is empty, character '\\#' means that the corresponding cell contains an obstacle and grasshopper can't jump there. Character 'G' means that the grasshopper starts at this position and, finally, 'T' means that the target insect is located at this cell. It's guaranteed that characters 'G' and 'T' appear in this line exactly once.",
    "outputFormat": "If there exists a sequence of jumps (each jump of length $ k $ ), such that the grasshopper can get from his initial position to the cell with the insect, print \"YES\" (without quotes) in the only line of the input. Otherwise, print \"NO\" (without quotes).",
    "samples": [
        [
            "5 2\n#G#T#\n",
            "YES\n"
        ],
        [
            "6 1\nT....G\n",
            "YES\n"
        ],
        [
            "7 3\nT..#..G\n",
            "NO\n"
        ],
        [
            "6 2\n..GT..\n",
            "NO\n"
        ]
    ],
    "hint": "In the first sample, the grasshopper can make one jump to the right in order to get from cell $ 2 $ to cell $ 4 $ .\n\nIn the second sample, the grasshopper is only able to jump to neighboring cells but the way to the insect is free — he can get there by jumping left $ 5 $ times.\n\nIn the third sample, the grasshopper can't make a single jump.\n\nIn the fourth sample, the grasshopper can only jump to the cells with odd indices, thus he won't be able to reach the insect.",
    "translation": "题目大意：\n\n一只蚂蚱在路上蹦（给定直线），已知路的长度n和蚂蚱每次蹦的距离k。\n\n在这条路上，蚂蚱只能落在'.'上，不能落在'#'上，蚂蚱从G开始蹦，若能蹦到T，输出YES，否则NO。\n\n输入格式：\n\n一行两个数，N和K\n\n之后一行表示该条路\nTranslated by @xfydemx "
}