{
    "description": "This is an interactive problem. You have to use flush operation right after printing each line. For example, in C++ you should use function fflush(stdout), in Java — System.out.flush(), in Pascal — flush(output) and in Python — sys.stdout.flush().\n\nIn this problem, you need to find maximal and minimal elements of an array. What could be simpler?\n\nYou can imagine that the jury has an array, and initially you know the only number $ n $ — array's length.\n\nArray's elements are numbered from $ 1 $ to $ n $ . You are allowed to compare two elements of the array by using their indices $ i $ and $ j $ . There are three possible responses to this query: '<' (if $ a_{i} $ is less than $ a_{j} $ ), '=' (if $ a_{i} $ is equal to $ a_{j} $ ) and finally '>' (if $ a_{i} $ is greater than $ a_{j} $ ).\n\nIt's known that it's always possible to find both maximal and minimal elements of the array by using no more than ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF730B/64e27b3d6ef68e5168a71a1fda863cd37a7518ef.png) comparisons, where $ ⌈\\ x⌉ $ is the result of rounding $ x $ up.\n\nWrite the program that will find positions of the minimum and the maximum in the jury's array of length $ n $ , by using no more than $ f(n) $ comparisons.",
    "inputFormat": "",
    "outputFormat": "Each test for this problem will contain one or more arrays. You have to find positions of minimal and maximal elements for each of these arrays. The first line of the input contains integer $ T $ ( $ 1<=T<=1000 $ ) — number of arrays in the test.\n\nThus, at the beginning, you program should read number $ T $ , and then it should solve the problem for $ T $ jury's arrays one by one.\n\nThen input for each array goes. Firstly, your program has to read the number $ n $ ( $ 1<=n<=50 $ ) — the length of the array. It will be provided in the next line of the input.\n\nFurther, your program can perform comparisons or report that the answer is found.\n\n- To perform a comparison, you have to output string of the following pattern «? i j» ( $ i $ and $ j $ must be integer numbers from $ 1 $ to $ n $ ) — the indices of the elements to compare in the current query.\n- To report the indices of minimal and maximal elements of the hidden array, your program have to output a line in the form «! i j» ( $ i $ and $ j $ must be integer numbers from $ 1 $ to $ n $ ), where $ i $ is an index of the minimal element of array, and $ j $ is an index of the maximal element of the array. If there are several possible answers to the problem, you can output any of them.\n\nThere are several possible responses for a comparison:\n\n- '<' — if $ a_{i} $ is less than $ a_{j} $ ,\n- '=' — if $ a_{i} $ is equal to $ a_{j} $ ,\n- '>' — if $ a_{i} $ is greater than $ a_{j} $ .\n\nFor an array of length $ n $ your program can make at most ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF730B/64e27b3d6ef68e5168a71a1fda863cd37a7518ef.png) comparisons. Note that the operation of reporting an answer («! i j» ) is not included into the value of $ f(n) $ .\n\nAfter the answer is reported, your program has to solve the problem for the next array or it should terminate if all $ T $ arrays are processed.",
    "samples": [
        [
            "2\n2\n \n&gt;\n \n3\n \n=\n \n=\n ",
            " \n \n? 1 2\n \n! 2 1\n \n? 3 1\n \n? 2 1\n \n! 2 3"
        ]
    ],
    "hint": "",
    "translation": "这是一道交互题。\n输入共有$T$组数据。$1\\le T \\le 1000$\n你有一个长度为$n$的数组，编号。为$1,2,\\dots,n$。你需要猜测最小数和最大数的编号。$1\\le n \\le 50$\n每次，你可以询问数组中两个数的大小。格式为«? i j»，其中$i$和$j$是两个数的编号。每次会返回<,=或>。猜测的次数不能超过$\\lceil\\frac{3n}{2}\\rceil-2$次。\n如果猜测出，可以用«! i j»提交。其中$i$是最小数的编号，$j$是最大数的编号。如果有多种可能性提交一种即可。"
}