{
    "description": "Hongcow is learning to spell! One day, his teacher gives him a word that he needs to learn to spell. Being a dutiful student, he immediately learns how to spell the word.\n\nHongcow has decided to try to make new words from this one. He starts by taking the word he just learned how to spell, and moves the last character of the word to the beginning of the word. He calls this a cyclic shift. He can apply cyclic shift many times. For example, consecutively applying cyclic shift operation to the word \"abracadabra\" Hongcow will get words \"aabracadabr\", \"raabracadab\" and so on.\n\nHongcow is now wondering how many distinct words he can generate by doing the cyclic shift arbitrarily many times. The initial string is also counted.",
    "inputFormat": "The first line of input will be a single string $ s $ ( $ 1<=|s|<=50 $ ), the word Hongcow initially learns how to spell. The string $ s $ consists only of lowercase English letters ('a'–'z').",
    "outputFormat": "Output a single integer equal to the number of distinct strings that Hongcow can obtain by applying the cyclic shift arbitrarily many times to the given string.",
    "samples": [
        [
            "abcd\n",
            "4\n"
        ],
        [
            "bbb\n",
            "1\n"
        ],
        [
            "yzyz\n",
            "2\n"
        ]
    ],
    "hint": "For the first sample, the strings Hongcow can generate are \"abcd\", \"dabc\", \"cdab\", and \"bcda\".\n\nFor the second sample, no matter how many times Hongcow does the cyclic shift, Hongcow can only generate \"bbb\".\n\nFor the third sample, the two strings Hongcow can generate are \"yzyz\" and \"zyzy\".",
    "translation": "### 题目描述\nHongcow正在学习拼写单词！这天，他（他？）的老师给了他一个需要拼写的单词。作为一个好学生，他很快就学会了如何拼写。  \nHongcow决定搞个大新闻。他从刚学会拼写的单词开始，每次把最后一个字符移到单词开头。他称此为一次变换。他可以进行多次变换，例如：单词\"abracadabra\"可以变成\"aabracadabr\"、\"raabracadab\"等等  \n现在，他想知道通过变换能变成几个不同的单词，包括初始单词  \n### 输入输出格式：\n**输入格式：**  \n一行一个字符串$s(1\\leq|s|\\leq 50)$，表示初始单词，只由$a-z$组成  \n**输出格式：**  \n一行表示不同单词个数\n感谢 @Fheiwn  提供的翻译。"
}