{
    "description": "Vladik was bored on his way home and decided to play the following game. He took $ n $ cards and put them in a row in front of himself. Every card has a positive integer number not exceeding $ 8 $ written on it. He decided to find the longest subsequence of cards which satisfies the following conditions:\n\n- the number of occurrences of each number from $ 1 $ to $ 8 $ in the subsequence doesn't differ by more then $ 1 $ from the number of occurrences of any other number. Formally, if there are $ c_{k} $ cards with number $ k $ on them in the subsequence, than for all pairs of integers ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF743E/0c6cc5f621659ae2ddf5ab0dac10dd28e326ec14.png) the condition $ |c_{i}-c_{j}|<=1 $ must hold.\n- if there is at least one card with number $ x $ on it in the subsequence, then all cards with number $ x $ in this subsequence must form a continuous segment in it (but not necessarily a continuous segment in the original sequence). For example, the subsequence $ [1,1,2,2] $ satisfies this condition while the subsequence $ [1,2,2,1] $ doesn't. Note that $ [1,1,2,2] $ doesn't satisfy the first condition.\n\nPlease help Vladik to find the length of the longest subsequence that satisfies both conditions.",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1<=n<=1000 $ ) — the number of cards in Vladik's sequence.\n\nThe second line contains the sequence of $ n $ positive integers not exceeding $ 8 $ — the description of Vladik's sequence.",
    "outputFormat": "Print single integer — the length of the longest subsequence of Vladik's sequence that satisfies both conditions.",
    "samples": [
        [
            "3\n1 1 1\n",
            "1"
        ],
        [
            "8\n8 7 6 5 4 3 2 1\n",
            "8"
        ],
        [
            "24\n1 8 1 2 8 2 3 8 3 4 8 4 5 8 5 6 8 6 7 8 7 8 8 8\n",
            "17"
        ]
    ],
    "hint": "In the first sample all the numbers written on the cards are equal, so you can't take more than one card, otherwise you'll violate the first condition.",
    "translation": "# 翻译：\n\n题意：给定序列A，A中均元素为$[1,8]$中的整数，求一个A的最长子序列且满足以下2个条件，\n\n1. $[1,8]$中每2个整数的出现次数之差不超过1\n\n2. 每种数字的全部元素必须连续，\n即222333是合法的，223322不合法\n\nn<=1000,(2s)"
}