{
    "description": "Polycarp is mad about coding, that is why he writes Sveta encoded messages. He calls the median letter in a word the letter which is in the middle of the word. If the word's length is even, the median letter is the left of the two middle letters. In the following examples, the median letter is highlighted: contest, info. If the word consists of single letter, then according to above definition this letter is the median letter.\n\nPolycarp encodes each word in the following way: he writes down the median letter of the word, then deletes it and repeats the process until there are no letters left. For example, he encodes the word volga as logva.\n\nYou are given an encoding $ s $ of some word, your task is to decode it.",
    "inputFormat": "The first line contains a positive integer $ n $ ( $ 1<=n<=2000 $ ) — the length of the encoded word.\n\nThe second line contains the string $ s $ of length $ n $ consisting of lowercase English letters — the encoding.",
    "outputFormat": "Print the word that Polycarp encoded.",
    "samples": [
        [
            "5\nlogva\n",
            "volga\n"
        ],
        [
            "2\nno\n",
            "no\n"
        ],
        [
            "4\nabba\n",
            "baba\n"
        ]
    ],
    "hint": "In the first example Polycarp encoded the word volga. At first, he wrote down the letter l from the position $ 3 $ , after that his word looked like voga. After that Polycarp wrote down the letter o from the position $ 2 $ , his word became vga. Then Polycarp wrote down the letter g which was at the second position, the word became va. Then he wrote down the letter v, then the letter a. Thus, the encoding looked like logva.\n\nIn the second example Polycarp encoded the word no. He wrote down the letter n, the word became o, and he wrote down the letter o. Thus, in this example, the word and its encoding are the same.\n\nIn the third example Polycarp encoded the word baba. At first, he wrote down the letter a, which was at the position $ 2 $ , after that the word looked like bba. Then he wrote down the letter b, which was at the position $ 2 $ , his word looked like ba. After that he wrote down the letter b, which was at the position $ 1 $ , the word looked like a, and he wrote down that letter a. Thus, the encoding is abba.",
    "translation": "## **题目大意**\r\nPolycarp很想编码，这就是他编写Sveta编码信息的原因。他把中间字母称为单词中间的字母。如果单词的长度是偶数，则中间字母是两个中间字母的左边。在以下示例中，中间字母突出显示：con**t** est，i**n**fo。如果单词由单个字母组成，则根据上面的定义，这个字母是中间字母。\r\n\r\nPolycarp以下列方式对每个单词进行编码：他写下单词的中间字母，然后将其删除并重复该过程，直到没有字母为止。例如，他将volga编码为logva。\r\n\r\n你得到一个编码，你的任务是进行译码。\r\n### **输入格式：**\r\n第一行包含正整数（1<=n<=2000）n代表编码字的长度。\r\n\r\n第二行包含一个只由小写英文字母组成的字符串编码。\r\n\r\n### **输出格式：**\r\n输出Polycarp进行编码的原单词输出Polycarp进行编码的原单词。"
}