{
    "description": "This is an interactive problem. In the interaction section below you will see the information about flushing the output.\n\nIn this problem, you will be playing a game with Hongcow. How lucky of you!\n\nHongcow has a hidden $ n $ by $ n $ matrix $ M $ . Let $ M_{i,j} $ denote the entry $ i $ -th row and $ j $ -th column of the matrix. The rows and columns are labeled from $ 1 $ to $ n $ .\n\nThe matrix entries are between $ 0 $ and $ 10^{9} $ . In addition, $ M_{i,i}=0 $ for all valid $ i $ . Your task is to find the minimum value along each row, excluding diagonal elements. Formally, for each $ i $ , you must find ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF744B/60abf7e287a9efbab7664bfef9cac9ebdb2e6b1f.png).\n\nTo do this, you can ask Hongcow some questions.\n\nA question consists of giving Hongcow a subset of distinct indices $ {w_{1},w_{2},...,w_{k}} $ , with $ 1<=k<=n $ . Hongcow will respond with $ n $ integers. The $ i $ -th integer will contain the minimum value of $ min_{1<=j<=k}M_{i,wj} $ .\n\nYou may only ask Hongcow at most $ 20 $ questions — he thinks you only need that many questions answered.\n\nWhen you are ready to answer, print out a single integer $ -1 $ on its own line, then $ n $ integers on the next line. The $ i $ -th integer should be the minimum value in the $ i $ -th row of the matrix, excluding the $ i $ -th element. Do not forget to flush the final answer as well. Printing the answer does not count as asking a question.\n\nYou will get Wrong Answer verdict if\n\n- Your question or answers are not in the format described in this statement.\n- You ask strictly more than $ 20 $ questions.\n- Your question contains duplicate indices.\n- The value of $ k $ in your question does not lie in the range from $ 1 $ to $ n $ , inclusive.\n- Your final answer is not correct.\n\n You will get Idleness Limit Exceeded if you don't print anything or if you forget to flush the output, including for the final answer (more info about flushing output below).",
    "inputFormat": "The first line of input will contain a single integer $ n $ ( $ 2<=n<=1,000 $ ).",
    "outputFormat": "To print the final answer, print out the string -1 on its own line. Then, the next line should contain $ n $ integers. The $ i $ -th integer should be the minimum value of the $ i $ -th row of the matrix, excluding elements on the diagonal. Do not forget to flush your answer!\n\nInteraction\n\nTo ask a question, print out a single integer $ k $ on its own line, denoting the size of your subset. Then, the next line should contain $ k $ integers $ w_{1},w_{2},...\\ w_{k} $ . Note, you must flush your output to get a response.\n\nHongcow will respond by printing out a line with $ n $ integers. The $ i $ -th integer in this line represents the minimum value of $ M_{i,wj} $ where $ j $ is between $ 1 $ and $ k $ .\n\nYou may only ask a question at most $ 20 $ times, otherwise, you will get Wrong Answer.\n\nTo flush you can use (just after printing an integer and end-of-line):\n\n- fflush(stdout) in C++;\n- System.out.flush() in Java;\n- stdout.flush() in Python;\n- flush(output) in Pascal;\n- See the documentation for other languages.\n\nHacking To hack someone, use the following format\n\n`<br></br>n<br></br>M_{1,1} M_{1,2} ... M_{1,n}<br></br>M_{2,1} M_{2,2} ... M_{2,n}<br></br>...<br></br>M_{n,1} M_{n,2} ... M_{n,n}<br></br>`Of course, contestant programs will not be able to see this input.",
    "samples": [
        [
            "3\n0 0 0\n2 7 0\n0 0 4\n3 0 8\n0 5 4",
            "3\n1 2 3\n1\n3\n2\n1 2\n1\n2\n1\n1\n-1\n2 5 4\n"
        ],
        [
            "2\n0 0\n0 0",
            "1\n2\n1\n1\n-1\n0 0"
        ]
    ],
    "hint": "In the first sample, Hongcow has the hidden matrix\n\n`<br></br>[<br></br> [0, 3, 2],<br></br> [5, 0, 7],<br></br> [4, 8 ,0],<br></br>]<br></br>`Here is a more readable version demonstrating the interaction. The column on the left represents Hongcow, while the column on the right represents the contestant.\n\n`<br></br>3<br></br>              3<br></br>              1 2 3<br></br>0 0 0<br></br>              1<br></br>              3<br></br>2 7 0<br></br>              2<br></br>              1 2<br></br>0 0 4<br></br>              1<br></br>              2<br></br>3 0 8<br></br>              1<br></br>              1<br></br>0 5 4<br></br>              -1<br></br>              2 5 4<br></br>`For the second sample, it is possible for off-diagonal elements of the matrix to be zero."
}