{
    "description": "One day, Hongcow goes to the store and sees a brand new deck of $ n $ special cards. Each individual card is either red or blue. He decides he wants to buy them immediately. To do this, he needs to play a game with the owner of the store.\n\nThis game takes some number of turns to complete. On a turn, Hongcow may do one of two things:\n\n- Collect tokens. Hongcow collects $ 1 $ red token and $ 1 $ blue token by choosing this option (thus, $ 2 $ tokens in total per one operation).\n- Buy a card. Hongcow chooses some card and spends tokens to purchase it as specified below.\n\nThe $ i $ -th card requires $ r_{i} $ red resources and $ b_{i} $ blue resources. Suppose Hongcow currently has $ A $ red cards and $ B $ blue cards. Then, the $ i $ -th card will require Hongcow to spend $ max(r_{i}-A,0) $ red tokens, and $ max(b_{i}-B,0) $ blue tokens. Note, only tokens disappear, but the cards stay with Hongcow forever. Each card can be bought only once.\n\nGiven a description of the cards and their costs determine the minimum number of turns Hongcow needs to purchase all cards.",
    "inputFormat": "The first line of input will contain a single integer $ n $ ( $ 1<=n<=16 $ ).\n\nThe next $ n $ lines of input will contain three tokens $ c_{i} $ , $ r_{i} $ and $ b_{i} $ . $ c_{i} $ will be 'R' or 'B', denoting the color of the card as red or blue. $ r_{i} $ will be an integer denoting the amount of red resources required to obtain the card, and $ b_{i} $ will be an integer denoting the amount of blue resources required to obtain the card ( $ 0<=r_{i},b_{i}<=10^{7} $ ).",
    "outputFormat": "Output a single integer, denoting the minimum number of turns needed to acquire all the cards.",
    "samples": [
        [
            "3\nR 0 1\nB 1 0\nR 1 1\n",
            "4\n"
        ],
        [
            "3\nR 3 0\nR 2 0\nR 1 0\n",
            "6\n"
        ]
    ],
    "hint": "For the first sample, Hongcow's four moves are as follows:\n\n1. Collect tokens\n2. Buy card $ 1 $\n3. Buy card $ 2 $\n4. Buy card $ 3 $\n\n Note, at the fourth step, Hongcow is able to buy card $ 3 $ because Hongcow already has one red and one blue card, so we don't need to collect tokens.For the second sample, one optimal strategy is as follows:\n\n1. Collect tokens\n2. Collect tokens\n3. Buy card $ 2 $\n4. Collect tokens\n5. Buy card $ 3 $\n6. Buy card $ 1 $\n\n At the fifth step, even though Hongcow has a red token, Hongcow doesn't actually need to spend it, since Hongcow has a red card already.",
    "translation": "Hongcow 在玩游戏，它需要收集 $n$ 张卡牌。\n\n第 $i$ 张卡片有一种颜色 $\\texttt{R}$ 或者 $\\texttt{B}$，对应红色或者蓝色。它需要 $r_i$ 个红宝石和 $b_i$ 个蓝宝石才能收集。\n\n但是如果 Hongcow 现在有 $A$ 张红色卡片和 $B$ 张蓝色卡片，它只需要花费 $\\max(r_i-A,0)$ 个红宝石和 $\\max(b_i-B,0)$ 个蓝宝石就可以收集第 $i$ 张卡片。\n\n每一轮，Hongcow 可以做以下操作之一：\n\n+ 获得一个红宝石和一个蓝宝石。\n\n+ 买一张卡片。\n\nHongcow 想要尽量快地收集所有卡牌。\n\n它问你至少需要多少回合。\n\n$1\\le n\\le 16,0\\le r_i,b_i\\le 10^7$。"
}