{
    "description": "Santa Claus is the first who came to the Christmas Olympiad, and he is going to be the first to take his place at a desk! In the classroom there are $ n $ lanes of $ m $ desks each, and there are two working places at each of the desks. The lanes are numbered from $ 1 $ to $ n $ from the left to the right, the desks in a lane are numbered from $ 1 $ to $ m $ starting from the blackboard. Note that the lanes go perpendicularly to the blackboard, not along it (see picture).\n\nThe organizers numbered all the working places from $ 1 $ to $ 2nm $ . The places are numbered by lanes (i. e. all the places of the first lane go first, then all the places of the second lane, and so on), in a lane the places are numbered starting from the nearest to the blackboard (i. e. from the first desk in the lane), at each desk, the place on the left is numbered before the place on the right.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF748A/bbf8fc48769a6dddf0555cdcd0723e32248a57bd.png)The picture illustrates the first and the second samples.Santa Clause knows that his place has number $ k $ . Help him to determine at which lane at which desk he should sit, and whether his place is on the left or on the right!",
    "inputFormat": "The only line contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=10000 $ , $ 1<=k<=2nm $ ) — the number of lanes, the number of desks in each lane and the number of Santa Claus' place.",
    "outputFormat": "Print two integers: the number of lane $ r $ , the number of desk $ d $ , and a character $ s $ , which stands for the side of the desk Santa Claus. The character $ s $ should be \"L\", if Santa Clause should sit on the left, and \"R\" if his place is on the right.",
    "samples": [
        [
            "4 3 9\n",
            "2 2 L\n"
        ],
        [
            "4 3 24\n",
            "4 3 R\n"
        ],
        [
            "2 4 4\n",
            "1 2 R\n"
        ]
    ],
    "hint": "The first and the second samples are shown on the picture. The green place corresponds to Santa Claus' place in the first example, the blue place corresponds to Santa Claus' place in the second example.\n\nIn the third sample there are two lanes with four desks in each, and Santa Claus has the fourth place. Thus, his place is in the first lane at the second desk on the right.",
    "translation": "给定一个n * m的矩阵，其中n代表每行的桌子数，m代表行数，\n\n每个桌子有两个位子，每个位置从左到右依次有一个编号，编号依次是1, 2，3一直到2* n* m。\n\n现在圣诞老人知道自己的编号k，求他在矩阵中的位置\n\n输入\n\n三个数，n,m,k.( 1<=n,m<=10000  , 1<=k<=2 * n* m   )\n\n输出\n\n三个数，a,b,c\n\na为圣诞老人的行坐标, b为圣诞老人列坐标，如果圣诞老人在桌子左边，则c=‘L’,否则c='R'\n\n\n\n  "
}