{
    "description": "The country Treeland consists of $ n $ cities connected with $ n-1 $ bidirectional roads in such a way that it's possible to reach every city starting from any other city using these roads. There will be a soccer championship next year, and all participants are Santa Clauses. There are exactly $ 2k $ teams from $ 2k $ different cities.\n\nDuring the first stage all teams are divided into $ k $ pairs. Teams of each pair play two games against each other: one in the hometown of the first team, and the other in the hometown of the other team. Thus, each of the $ 2k $ cities holds exactly one soccer game. However, it's not decided yet how to divide teams into pairs.\n\nIt's also necessary to choose several cities to settle players in. Organizers tend to use as few cities as possible to settle the teams.\n\nNobody wants to travel too much during the championship, so if a team plays in cities $ u $ and $ v $ , it wants to live in one of the cities on the shortest path between $ u $ and $ v $ (maybe, in $ u $ or in $ v $ ). There is another constraint also: the teams from one pair must live in the same city.\n\nSummarizing, the organizers want to divide $ 2k $ teams into pairs and settle them in the minimum possible number of cities $ m $ in such a way that teams from each pair live in the same city which lies between their hometowns.",
    "inputFormat": "The first line of input contains two integers $ n $ and $ k $ ( $ 2<=n<=2·10^{5},2<=2k<=n $ ) — the number of cities in Treeland and the number of pairs of teams, respectively.\n\nThe following $ n-1 $ lines describe roads in Treeland: each of these lines contains two integers $ a $ and $ b $ ( $ 1<=a,b<=n,a≠b $ ) which mean that there is a road between cities $ a $ and $ b $ . It's guaranteed that there is a path between any two cities.\n\nThe last line contains $ 2k $ distinct integers $ c_{1},c_{2},...,c_{2k} $ ( $ 1<=c_{i}<=n $ ), where $ c_{i} $ is the hometown of the $ i $ -th team. All these numbers are distinct.",
    "outputFormat": "The first line of output must contain the only positive integer $ m $ which should be equal to the minimum possible number of cities the teams can be settled in.\n\nThe second line should contain $ m $ distinct numbers $ d_{1},d_{2},...,d_{m} $ ( $ 1<=d_{i}<=n $ ) denoting the indices of the cities where the teams should be settled.\n\nThe $ k $ lines should follow, the $ j $ -th of them should contain $ 3 $ integers $ u_{j} $ , $ v_{j} $ and $ x_{j} $ , where $ u_{j} $ and $ v_{j} $ are the hometowns of the $ j $ -th pair's teams, and $ x_{j} $ is the city they should live in during the tournament. Each of the numbers $ c_{1},c_{2},...,c_{2k} $ should occur in all $ u_{j} $ 's and $ v_{j} $ 's exactly once. Each of the numbers $ x_{j} $ should belong to $ {d_{1},d_{2},...,d_{m}} $ .\n\nIf there are several possible answers, print any of them.",
    "samples": [
        [
            "6 2\n1 2\n1 3\n2 4\n2 5\n3 6\n2 5 4 6\n",
            "1\n2\n5 4 2\n6 2 2\n"
        ]
    ],
    "hint": "In the first test the orginizers can settle all the teams in the city number $ 2 $ . The way to divide all teams into pairs is not important, since all requirements are satisfied anyway, because the city $ 2 $ lies on the shortest path between every two cities from $ {2,4,5,6} $ .",
    "translation": "Treeland 国家将要举办足球赛，整个国家有 $n$ 个城市，由 $n-1$ 条道路连接，每个城市都有一支队伍。现在已经选出了 $2k$ 支队伍，你需要使它们两两配对完成比赛。\n\n对于你配对的所有 $k$ 对队伍 $x_i,y_i$，它们之间的比赛将在城市 $x_i$ 和城市 $y_i$ 上分别举行一场，为了方便球员的住宿，你需要保证在 $x_i$ 到 $y_i$ 的路径上有不少于一个旅馆，请问你最少需要建造多少个旅馆，并输出方案。"
}