{
    "description": "There are $ n $ servers in a laboratory, each of them can perform tasks. Each server has a unique id — integer from $ 1 $ to $ n $ .\n\nIt is known that during the day $ q $ tasks will come, the $ i $ -th of them is characterized with three integers: $ t_{i} $ — the moment in seconds in which the task will come, $ k_{i} $ — the number of servers needed to perform it, and $ d_{i} $ — the time needed to perform this task in seconds. All $ t_{i} $ are distinct.\n\nTo perform the $ i $ -th task you need $ k_{i} $ servers which are unoccupied in the second $ t_{i} $ . After the servers begin to perform the task, each of them will be busy over the next $ d_{i} $ seconds. Thus, they will be busy in seconds $ t_{i},t_{i}+1,...,t_{i}+d_{i}-1 $ . For performing the task, $ k_{i} $ servers with the smallest ids will be chosen from all the unoccupied servers. If in the second $ t_{i} $ there are not enough unoccupied servers, the task is ignored.\n\nWrite the program that determines which tasks will be performed and which will be ignored.",
    "inputFormat": "The first line contains two positive integers $ n $ and $ q $ ( $ 1<=n<=100 $ , $ 1<=q<=10^{5} $ ) — the number of servers and the number of tasks.\n\nNext $ q $ lines contains three integers each, the $ i $ -th line contains integers $ t_{i} $ , $ k_{i} $ and $ d_{i} $ ( $ 1<=t_{i}<=10^{6} $ , $ 1<=k_{i}<=n $ , $ 1<=d_{i}<=1000 $ ) — the moment in seconds in which the $ i $ -th task will come, the number of servers needed to perform it, and the time needed to perform this task in seconds. The tasks are given in a chronological order and they will come in distinct seconds.",
    "outputFormat": "Print $ q $ lines. If the $ i $ -th task will be performed by the servers, print in the $ i $ -th line the sum of servers' ids on which this task will be performed. Otherwise, print -1.",
    "samples": [
        [
            "4 3\n1 3 2\n2 2 1\n3 4 3\n",
            "6\n-1\n10\n"
        ],
        [
            "3 2\n3 2 3\n5 1 2\n",
            "3\n3\n"
        ],
        [
            "8 6\n1 3 20\n4 2 1\n6 5 5\n10 1 1\n15 3 6\n21 8 8\n",
            "6\n9\n30\n-1\n15\n36\n"
        ]
    ],
    "hint": "In the first example in the second $ 1 $ the first task will come, it will be performed on the servers with ids $ 1 $ , $ 2 $ and $ 3 $ (the sum of the ids equals $ 6 $ ) during two seconds. In the second $ 2 $ the second task will come, it will be ignored, because only the server $ 4 $ will be unoccupied at that second. In the second $ 3 $ the third task will come. By this time, servers with the ids $ 1 $ , $ 2 $ and $ 3 $ will be unoccupied again, so the third task will be done on all the servers with the ids $ 1 $ , $ 2 $ , $ 3 $ and $ 4 $ (the sum of the ids is $ 10 $ ).\n\nIn the second example in the second $ 3 $ the first task will come, it will be performed on the servers with ids $ 1 $ and $ 2 $ (the sum of the ids is $ 3 $ ) during three seconds. In the second $ 5 $ the second task will come, it will be performed on the server $ 3 $ , because the first two servers will be busy performing the first task.",
    "translation": "一共有 n 个服务器，编号从 1 到 n，有 q 个任务； 每个任务在 t[i] 秒的时间收到，需要 k[i] 台服务器，每台会占用 d[i] 秒的时间；\n\n问题：当每个任务到达时，是否有足够的机器完成任务； 如果可以完成，则选择序号最小的机器，输出机器的序号和； 如果不能完成，则输出 -1。"
}