{
    "description": "The only difference from the previous problem is the constraint on the number of requests. In this problem your program should guess the answer doing at most 7 requests.\n\nThis problem is a little bit unusual. Here you are to implement an interaction with a testing system. That means that you can make queries and get responses in the online mode. Please be sure to use the stream flushing operation after each query's output in order not to leave part of your output in some buffer. For example, in C++ you've got to use the fflush(stdout) function, in Java — call System.out.flush(), and in Pascal — flush(output).\n\nBulls and Cows (also known as Cows and Bulls or Pigs and Bulls or Bulls and Cleots) is an old code-breaking paper and pencil game for two players, predating the similar commercially marketed board game Mastermind.\n\nOn a sheet of paper, the first player thinks a secret string. This string consists only of digits and has the length $ 4 $ . The digits in the string must be all different, no two or more equal digits are allowed.\n\nThen the second player tries to guess his opponent's string. For every guess the first player gives the number of matches. If the matching digits are on their right positions, they are \"bulls\", if on different positions, they are \"cows\". Thus a response is a pair of numbers — the number of \"bulls\" and the number of \"cows\". A try can contain equal digits.\n\nMore formally, let's the secret string is $ s $ and the second player are trying to guess it with a string $ x $ . The number of \"bulls\" is a number of such positions $ i $ ( $ 1<=i<=4 $ ) where $ s[i]=x[i] $ . The number of \"cows\" is a number of such digits $ c $ that $ s $ contains $ c $ in the position $ i $ (i.e. $ s[i]=c $ ), $ x $ contains $ c $ , but $ x[i]≠c $ .\n\nFor example, the secret string is \"0427\", the opponent's try is \"0724\", then the answer is $ 2 $ bulls and $ 2 $ cows (the bulls are \"0\" and \"2\", the cows are \"4\" and \"7\"). If the secret string is \"0123\", the opponent's try is \"0330\", then the answer is $ 1 $ bull and $ 1 $ cow.\n\nIn this problem you are to guess the string $ s $ that the system has chosen. You only know that the chosen string consists of $ 4 $ distinct digits.\n\nYou can make queries to the testing system, each query is the output of a single $ 4 $ -digit string. The answer to the query is the number of bulls and number of cows. If the system's response equals \"4 0\", that means the interaction with your problem is over and the program must terminate. That is possible for two reasons — the program either guessed the number $ x $ or made an invalid action (for example, printed letters instead of digits).\n\nYour program is allowed to do at most $ 7 $ queries.\n\nYou can hack solutions of other participants providing a 4-digit string containing distinct digits — the secret string.",
    "inputFormat": "To read answers to the queries, the program must use the standard input.\n\nThe program will receive pairs of non-negative integers in the input, one pair per line. The first number in a pair is a number of bulls and the second one is a number of cows of the string $ s $ and the string $ x_{i} $ printed by your program. If the system response equals \"4 0\", then your solution should terminate.\n\nThe testing system will let your program read the $ i $ -th pair of integers from the input only after your program displays the corresponding system query in the output: prints value $ x_{i} $ in a single line and executes operation flush.",
    "outputFormat": "The program must use the standard output to print queries.\n\nYour program must output requests — $ 4 $ -digit strings $ x_{1},x_{2},... $ , one per line. After the output of each line the program must execute flush operation. The program should read the answer to the query from the standard input.\n\nYour program is allowed to do at most $ 7 $ queries.",
    "samples": [
        [
            "0 1\n2 0\n1 1\n0 4\n2 1\n4 0\n",
            "8000\n0179\n3159\n3210\n0112\n0123"
        ]
    ],
    "hint": "The secret string $ s $ in the example is \"0123\".",
    "translation": "### 题目描述\n\n**本题是一道交互题。**\n\n你需要与交互库玩一个猜数游戏。\n\n首先，交互库随机生成一个**四个数位互不相同**的四位数。你需要尝试猜出这个数。\n\n每次你可以询问一个数，交互库可以告诉你这个数与答案的差异：\n\n- 具体地，记答案为 $s$，你询问的数字为 $x$；\n\n- 令 $A$ 类数码为对于某个位置 $i(1\\le i\\le 4)$ 使得 $s_i=x_i$（这里的 $s_i$ 表示 $s$ 的第 $i$ 位，$x$ 同理）的 $i$，其数量记为 $a$；\n\n- 令 $B$ 类数码为对于某两个位置 $i,j(1\\le i\\le j\\le 4)$ 使得 $s_i=x_j,i \\neq j$ 的 $(i,j)$，其数量记为 $b$；\n\n- 交互库会告诉你 $a$ 和 $b$ 的值。\n\n例如：答案为 $2139$，所猜的数字 $1239$，则交互库会返回 $a=2$ 和 $b=2$。其中，$A$ 类数码为 $3,9$，$B$ 类数码为 $1,2$。\n\n**您最多有 $7$ 次询问机会。**\n\n### 输入格式\n\n程序将从标准输入中读入两个整数 $a,b$，分别表示 $A$ 类和 $B$ 类数码的数量。\n\n若交互库返回 $4$ 和 $0$，则您应当立即终止程序。\n\n### 输出格式\n\n一行，表示您将要询问的数字，输出到标准输出。\n\n每次询问结束后，需刷新缓冲区。\n\n您的程序最多只能询问 $7$ 次。\n\n翻译自 @[zyc212303](https://www.luogu.com.cn/user/556366)。"
}