{
    "description": "It's Christmas time! PolandBall and his friends will be giving themselves gifts. There are $ n $ Balls overall. Each Ball has someone for whom he should bring a present according to some permutation $ p $ , $ p_{i}≠i $ for all $ i $ .\n\nUnfortunately, Balls are quite clumsy. We know earlier that exactly $ k $ of them will forget to bring their gift. A Ball number $ i $ will get his present if the following two constraints will hold:\n\n1. Ball number $ i $ will bring the present he should give.\n2. Ball $ x $ such that $ p_{x}=i $ will bring his present.\n\nWhat is minimum and maximum possible number of kids who will not get their present if exactly $ k $ Balls will forget theirs?",
    "inputFormat": "The first line of input contains two integers $ n $ and $ k $ ( $ 2<=n<=10^{6} $ , $ 0<=k<=n $ ), representing the number of Balls and the number of Balls who will forget to bring their presents.\n\nThe second line contains the permutation $ p $ of integers from $ 1 $ to $ n $ , where $ p_{i} $ is the index of Ball who should get a gift from the $ i $ -th Ball. For all $ i $ , $ p_{i}≠i $ holds.",
    "outputFormat": "You should output two values — minimum and maximum possible number of Balls who will not get their presents, in that order.",
    "samples": [
        [
            "5 2\n3 4 1 5 2\n",
            "2 4"
        ],
        [
            "10 1\n2 3 4 5 6 7 8 9 10 1\n",
            "2 2"
        ]
    ],
    "hint": "In the first sample, if the third and the first balls will forget to bring their presents, they will be th only balls not getting a present. Thus the minimum answer is $ 2 $ . However, if the first ans the second balls will forget to bring their presents, then only the fifth ball will get a present. So, the maximum answer is $ 4 $ .",
    "translation": "圣诞节到了，有 $n$ 个人要互相送礼物。有一个排列 $p$，第 $i$ 个人应该把礼物送给第 $p_i$ 个人（$p_i \\ne i$）。\n\n有 $k$ 个人是拖拉机，她们会忘记带礼物，但是我们不知道这些人是谁。一个人能收到礼物，当且仅当她带了礼物，并且应该送给她礼物的人也带了礼物。\n\n给定 $p, k$，对于所有 $k$ 个人没带礼物的情况，求最少、最多有多少人**不**能收到礼物。"
}