{
    "description": "PolandBall is playing a game with EnemyBall. The rules are simple. Players have to say words in turns. You cannot say a word which was already said. PolandBall starts. The Ball which can't say a new word loses.\n\nYou're given two lists of words familiar to PolandBall and EnemyBall. Can you determine who wins the game, if both play optimally?",
    "inputFormat": "The first input line contains two integers $ n $ and $ m $ ( $ 1<=n,m<=10^{3} $ ) — number of words PolandBall and EnemyBall know, respectively.\n\nThen $ n $ strings follow, one per line — words familiar to PolandBall.\n\nThen $ m $ strings follow, one per line — words familiar to EnemyBall.\n\nNote that one Ball cannot know a word more than once (strings are unique), but some words can be known by both players.\n\nEach word is non-empty and consists of no more than $ 500 $ lowercase English alphabet letters.",
    "outputFormat": "In a single line of print the answer — \"YES\" if PolandBall wins and \"NO\" otherwise. Both Balls play optimally.",
    "samples": [
        [
            "5 1\npolandball\nis\na\ncool\ncharacter\nnope\n",
            "YES"
        ],
        [
            "2 2\nkremowka\nwadowicka\nkremowka\nwiedenska\n",
            "YES"
        ],
        [
            "1 2\na\na\nb\n",
            "NO"
        ]
    ],
    "hint": "In the first example PolandBall knows much more words and wins effortlessly.\n\nIn the second example if PolandBall says kremowka first, then EnemyBall cannot use that word anymore. EnemyBall can only say wiedenska. PolandBall says wadowicka and wins.",
    "translation": "两个人玩一个游戏 他们轮流说单词  \n每一个人只能说出自己会的单词 并且任何一个在之前被说过(被自己或对方说过)的单词不能被再说一次  \n\n最后无话可说(所有会的单词都被说过)的人负  \n问先手是否能获胜  \n\n**输入格式**  \n第一行n,m分别代表先手和后手分别会多少单词  \n接下来n行每行一个字符串代表单词 先手会且仅会这些单词\n再接下来m行每行一个字符串代表单词 后手会且仅会这些单词  \n\n**输出格式**  \n一个字符串  \n先手胜(后手负)输出YES 否则输出NO"
}