{
    "description": "On the Literature lesson Sergei noticed an awful injustice, it seems that some students are asked more often than others.\n\nSeating in the class looks like a rectangle, where $ n $ rows with $ m $ pupils in each.\n\nThe teacher asks pupils in the following order: at first, she asks all pupils from the first row in the order of their seating, then she continues to ask pupils from the next row. If the teacher asked the last row, then the direction of the poll changes, it means that she asks the previous row. The order of asking the rows looks as follows: the $ 1 $ -st row, the $ 2 $ -nd row, $ ... $ , the $ n-1 $ -st row, the $ n $ -th row, the $ n-1 $ -st row, $ ... $ , the $ 2 $ -nd row, the $ 1 $ -st row, the $ 2 $ -nd row, $ ... $\n\nThe order of asking of pupils on the same row is always the same: the $ 1 $ -st pupil, the $ 2 $ -nd pupil, $ ... $ , the $ m $ -th pupil.\n\nDuring the lesson the teacher managed to ask exactly $ k $ questions from pupils in order described above. Sergei seats on the $ x $ -th row, on the $ y $ -th place in the row. Sergei decided to prove to the teacher that pupils are asked irregularly, help him count three values:\n\n1. the maximum number of questions a particular pupil is asked,\n2. the minimum number of questions a particular pupil is asked,\n3. how many times the teacher asked Sergei.\n\nIf there is only one row in the class, then the teacher always asks children from this row.",
    "inputFormat": "The first and the only line contains five integers $ n $ , $ m $ , $ k $ , $ x $ and $ y $ ( $ 1<=n,m<=100,1<=k<=10^{18},1<=x<=n,1<=y<=m $ ).",
    "outputFormat": "Print three integers:\n\n1. the maximum number of questions a particular pupil is asked,\n2. the minimum number of questions a particular pupil is asked,\n3. how many times the teacher asked Sergei.",
    "samples": [
        [
            "1 3 8 1 1\n",
            "3 2 3"
        ],
        [
            "4 2 9 4 2\n",
            "2 1 1"
        ],
        [
            "5 5 25 4 3\n",
            "1 1 1"
        ],
        [
            "100 100 1000000000000000000 100 100\n",
            "101010101010101 50505050505051 50505050505051"
        ]
    ],
    "hint": "The order of asking pupils in the first test:\n\n1. the pupil from the first row who seats at the first table, it means it is Sergei;\n2. the pupil from the first row who seats at the second table;\n3. the pupil from the first row who seats at the third table;\n4. the pupil from the first row who seats at the first table, it means it is Sergei;\n5. the pupil from the first row who seats at the second table;\n6. the pupil from the first row who seats at the third table;\n7. the pupil from the first row who seats at the first table, it means it is Sergei;\n8. the pupil from the first row who seats at the second table;\n\nThe order of asking pupils in the second test:\n\n1. the pupil from the first row who seats at the first table;\n2. the pupil from the first row who seats at the second table;\n3. the pupil from the second row who seats at the first table;\n4. the pupil from the second row who seats at the second table;\n5. the pupil from the third row who seats at the first table;\n6. the pupil from the third row who seats at the second table;\n7. the pupil from the fourth row who seats at the first table;\n8. the pupil from the fourth row who seats at the second table, it means it is Sergei;\n9. the pupil from the third row who seats at the first table;",
    "translation": "![](https://cdn.luogu.org/upload/pic/70586.png)"
}