{
    "description": "Nothing is eternal in the world, Kostya understood it on the 7-th of January when he saw partially dead four-color garland.\n\nNow he has a goal to replace dead light bulbs, however he doesn't know how many light bulbs for each color are required. It is guaranteed that for each of four colors at least one light is working.\n\nIt is known that the garland contains light bulbs of four colors: red, blue, yellow and green. The garland is made as follows: if you take any four consecutive light bulbs then there will not be light bulbs with the same color among them. For example, the garland can look like \"RYBGRYBGRY\", \"YBGRYBGRYBG\", \"BGRYB\", but can not look like \"BGRYG\", \"YBGRYBYGR\" or \"BGYBGY\". Letters denote colors: 'R' — red, 'B' — blue, 'Y' — yellow, 'G' — green.\n\nUsing the information that for each color at least one light bulb still works count the number of dead light bulbs of each four colors.",
    "inputFormat": "The first and the only line contains the string $ s $ ( $ 4<=|s|<=100 $ ), which describes the garland, the $ i $ -th symbol of which describes the color of the $ i $ -th light bulb in the order from the beginning of garland:\n\n- 'R' — the light bulb is red,\n- 'B' — the light bulb is blue,\n- 'Y' — the light bulb is yellow,\n- 'G' — the light bulb is green,\n- '!' — the light bulb is dead.\n\nThe string $ s $ can not contain other symbols except those five which were described.\n\nIt is guaranteed that in the given string at least once there is each of four letters 'R', 'B', 'Y' and 'G'.\n\nIt is guaranteed that the string $ s $ is correct garland with some blown light bulbs, it means that for example the line \"GRBY!!!B\" can not be in the input data.",
    "outputFormat": "In the only line print four integers $ k_{r},k_{b},k_{y},k_{g} $ — the number of dead light bulbs of red, blue, yellow and green colors accordingly.",
    "samples": [
        [
            "RYBGRYBGR\n",
            "0 0 0 0"
        ],
        [
            "!RGYB\n",
            "0 1 0 0"
        ],
        [
            "!!!!YGRB\n",
            "1 1 1 1"
        ],
        [
            "!GB!RG!Y!\n",
            "2 1 1 0"
        ]
    ],
    "hint": "In the first example there are no dead light bulbs.\n\nIn the second example it is obvious that one blue bulb is blown, because it could not be light bulbs of other colors on its place according to the statements.",
    "translation": "在这个世界上没有什么是永恒的，$Kostya$ 在看到四色花环上的花死去之后明白了这个道理。\n\n现在他有一个目标是取代所有死去的花，但他不知道每种颜色的花需要多少朵。保证每种颜色的花至少有一朵没有死。\n\n众所周知，花环包含四种颜色的花：红、黄、蓝、绿，花环中，任意四朵连续的花不会有相同的颜色。\n\n例如，花环可以长这样：“$\\texttt{RYBGRYBGRY}$”、“$\\texttt{YBGRYBGRYBG}$”、“$\\texttt{BGRYB}$”。\n\n但不能长这样：“$\\texttt{BGRYG}$”、“$\\texttt{YBGRYBYGR}$”、“$\\texttt{BGYBGY}$”。\n\n我们用字符表示花的颜色：\n\n‘$\\texttt{R}$’——红色\n\n‘$\\texttt{B}$’——蓝色\n\n‘$\\texttt{Y}$’——黄色\n\n‘$\\texttt{G}$’——绿色。\n\n利用题目所给的信息，求出每种花分别需要多少朵才能修补整个花环。\n\n$1\\leq |s|\\leq 100$\n\nTranslated by @Ted_hjl"
}