{
    "description": "Pay attention to the output section below, where you will see the information about flushing the output.\n\nBearland is a grid with $ h $ rows and $ w $ columns. Rows are numbered $ 1 $ through $ h $ from top to bottom. Columns are numbered $ 1 $ through $ w $ from left to right. Every cell is either allowed (denoted by '.' in the input) or permanently blocked (denoted by '\\#').\n\nBearland is a cold land, where heavy snow often makes travelling harder. Every day a few allowed cells are temporarily blocked by snow. Note, that this block works only on this particular day and next day any of these cells might be allowed again (unless there is another temporarily block).\n\nIt's possible to move directly between two cells only if they share a side and none of them is permanently or temporarily blocked.\n\nLimak is a little polar bear who lives in Bearland. His house is at the top left cell, while his school is at the bottom right cell. Every day Limak should first go from his house to the school and then return back to his house. Since he gets bored easily, he doesn't want to visit the same cell twice on one day, except for the cell with his house, where he starts and ends. If Limak can reach a school and return home avoiding revisiting cells, he calls a day interesting.\n\nThere are $ q $ days you must process, one after another. For each of these days you should check if it's interesting and print \"YES\" or \"NO\" on a separate line. In order to be able to read the description of the next day you should print the answer for the previous one and flush the output.\n\nIt's guaranteed that a day with no cells temporarily blocked by snow would be interesting. It's also guaranteed that cells with Limak's house and school are never blocked (neither permanently or temporarily).",
    "inputFormat": "The first line of the input contains three integers $ h $ , $ w $ and $ q $ ( $ 2<=h,w<=1000 $ , $ 1<=q<=10000 $ ) — the height and the width of the grid, and the number of days, respectively.\n\nNext $ h $ lines describe which cells are allowed and which permanently blocked. The $ i $ -th line contains a string of length $ w $ , describing the $ i $ -th row. Every character is either '.' (denoting an allowed cell) or '\\#' (denoting a permanently blocked cell). It's guaranteed that a day with no cells temporarily blocked by snow would be interesting.\n\nThen, the description of $ q $ days is given. The description of the $ i $ -th day starts with a line containing a single integer $ k_{i} $ ( $ 1<=k_{i}<=10 $ ) — the number of cells that are temporarily blocked by snow on that day. Each of next $ k_{i} $ lines contains two integers $ r_{i,j} $ and $ c_{i,j} $ ( $ 1<=r_{i,j}<=h $ , $ 1<=c_{i,j}<=w $ ), representing a cell at the intersection of the row $ r_{i,j} $ and the column $ c_{i,j} $ . The given $ k_{i} $ cells are distinct and none of them is permanently blocked. Also, none of them contains Limak's house or school.",
    "outputFormat": "For each of $ q $ days print \"YES\" if that day is interesting, and otherwise print \"NO\", both without the quotes. After printing an answer, you have to both print the end-of-line character and flush the output. Then you can proceed to the next day. You can get Idleness Limit Exceeded if you don't print anything or if you forget to flush the output.\n\nTo flush you can use (just after printing a YES/NO and end-of-line):\n\n- fflush(stdout) in C++;\n- System.out.flush() in Java;\n- stdout.flush() in Python;\n- flush(output) in Pascal;\n- See the documentation for other languages.",
    "samples": [
        [
            "3 5 4\n.....\n.....\n.#...\n1\n1 4\n1\n1 5\n2\n2 4\n3 1\n2\n1 5\n3 3\n",
            "NO\nYES\nYES\nNO\n"
        ],
        [
            "9 31 5\n...............................\n...............................\n.###.###.#.###...###.###.#.###.\n...#.#.#.#.#.......#.#.#.#...#.\n.###.#.#.#.###...###.#.#.#...#.\n.#...#.#.#.#.#...#...#.#.#...#.\n.###.###.#.###...###.###.#...#.\n...............................\n...............................\n5\n6 5\n2 11\n1 14\n8 15\n2 14\n5\n2 14\n1 14\n8 16\n6 5\n2 11\n3\n2 2\n1 4\n8 30\n10\n3 1\n3 11\n5 16\n7 21\n4 16\n3 5\n7 31\n3 9\n7 25\n3 27\n10\n3 1\n3 9\n7 25\n3 27\n7 21\n4 17\n3 5\n7 31\n4 16\n3 11\n",
            "NO\nYES\nYES\nYES\nNO\n"
        ]
    ],
    "hint": "In the first sample, there are $ 4 $ days. Drawings below show how Limak could go to school and return to his home in the second and the third day (on the left and on the right respectively). A permanently blocked cell is painted red, while cells temporarily blocked by snow are painted orange. Black and green arrows should Limak's way to the school and back to the house respectively.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF750H/12faf454c20e549286698bdfff6e5baa8b1aae30.png)For the second sample, below you can see how the grid looks like on each day, where '\\#' denotes a cell that is blocked, either temporarily or permanently.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF750H/f3a41e654116d8de6780666e33ff7f4faa3b7c75.png)",
    "translation": "给一个 $h\\times w$ 的棋盘，有障碍。$q$ 次询问，每次把 $k$ 个点变成障碍后询问能否找到两条从 $(1,1)$ 到 $(n,n)$ 的不相交的路径，询问独立。需要通过交互实现强制在线。\n\n$h, w \\leq 10^3$，$q \\leq 10^4$，$k \\leq 10$。"
}