{
    "description": "Bash wants to become a Pokemon master one day. Although he liked a lot of Pokemon, he has always been fascinated by Bulbasaur the most. Soon, things started getting serious and his fascination turned into an obsession. Since he is too young to go out and catch Bulbasaur, he came up with his own way of catching a Bulbasaur.\n\nEach day, he takes the front page of the newspaper. He cuts out the letters one at a time, from anywhere on the front page of the newspaper to form the word \"Bulbasaur\" (without quotes) and sticks it on his wall. Bash is very particular about case — the first letter of \"Bulbasaur\" must be upper case and the rest must be lower case. By doing this he thinks he has caught one Bulbasaur. He then repeats this step on the left over part of the newspaper. He keeps doing this until it is not possible to form the word \"Bulbasaur\" from the newspaper.\n\nGiven the text on the front page of the newspaper, can you tell how many Bulbasaurs he will catch today?\n\nNote: uppercase and lowercase letters are considered different.",
    "inputFormat": "Input contains a single line containing a string $ s $ ( $ 1<=|s|<=10^{5} $ ) — the text on the front page of the newspaper without spaces and punctuation marks. $ |s| $ is the length of the string $ s $ .\n\nThe string $ s $ contains lowercase and uppercase English letters, i.e. ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF757A/5a3118f39129b2a74b924e2ddab1fc42162a4073.png).",
    "outputFormat": "Output a single integer, the answer to the problem.",
    "samples": [
        [
            "Bulbbasaur\n",
            "1\n"
        ],
        [
            "F\n",
            "0\n"
        ],
        [
            "aBddulbasaurrgndgbualdBdsagaurrgndbb\n",
            "2\n"
        ]
    ],
    "hint": "In the first case, you could pick: Bulbbasaur.\n\nIn the second case, there is no way to pick even a single Bulbasaur.\n\nIn the third case, you can rearrange the string to BulbasaurBulbasauraddrgndgddgargndbb to get two words \"Bulbasaur\".",
    "translation": "```\nBash有一张报纸，上面有一些字。\n\nBash可以剪下这些字\n\n他想把这些字拼成\"Bulbasaur\"(不包括引号)\n\n问可以拼成多少个$Bulbasaur$(注意本题区分大小写)\n\n输入一个字符串代表Bash的那张报纸里面的字\n\n输出可以拼成多少个$Bulbasaur$\n```\n\n@[chen_zhe](/space/show?uid=8457)\n\n@[yjjr](/space/show?uid=5088)"
}