{
    "description": "Student Arseny likes to plan his life for $ n $ days ahead. He visits a canteen every day and he has already decided what he will order in each of the following $ n $ days. Prices in the canteen do not change and that means Arseny will spend $ c_{i} $ rubles during the $ i $ -th day.\n\nThere are $ 1 $ -ruble coins and $ 100 $ -ruble notes in circulation. At this moment, Arseny has $ m $ coins and a sufficiently large amount of notes (you can assume that he has an infinite amount of them). Arseny loves modern technologies, so he uses his credit card everywhere except the canteen, but he has to pay in cash in the canteen because it does not accept cards.\n\nCashier always asks the student to pay change-free. However, it's not always possible, but Arseny tries to minimize the dissatisfaction of the cashier. Cashier's dissatisfaction for each of the days is determined by the total amount of notes and coins in the change. To be precise, if the cashier gives Arseny $ x $ notes and coins on the $ i $ -th day, his dissatisfaction for this day equals $ x·w_{i} $ . Cashier always gives change using as little coins and notes as possible, he always has enough of them to be able to do this.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF767E/64d62fb5157d1985972f5b10ec8077c5e6d11b1c.png)\"Caution! Angry cashier\"Arseny wants to pay in such a way that the total dissatisfaction of the cashier for $ n $ days would be as small as possible. Help him to find out how he needs to pay in each of the $ n $ days!\n\nNote that Arseny always has enough money to pay, because he has an infinite amount of notes. Arseny can use notes and coins he received in change during any of the following days.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n<=10^{5} $ , $ 0<=m<=10^{9} $ ) — the amount of days Arseny planned his actions for and the amount of coins he currently has.\n\nThe second line contains a sequence of integers $ c_{1},c_{2},...,c_{n} $ ( $ 1<=c_{i}<=10^{5} $ ) — the amounts of money in rubles which Arseny is going to spend for each of the following days.\n\nThe third line contains a sequence of integers $ w_{1},w_{2},...,w_{n} $ ( $ 1<=w_{i}<=10^{5} $ ) — the cashier's dissatisfaction coefficients for each of the following days.",
    "outputFormat": "In the first line print one integer — minimum possible total dissatisfaction of the cashier.\n\nThen print $ n $ lines, the $ i $ -th of then should contain two numbers — the amount of notes and the amount of coins which Arseny should use to pay in the canteen on the $ i $ -th day.\n\nOf course, the total amount of money Arseny gives to the casher in any of the days should be no less than the amount of money he has planned to spend. It also shouldn't exceed $ 10^{6} $ rubles: Arseny never carries large sums of money with him.\n\nIf there are multiple answers, print any of them.",
    "samples": [
        [
            "5 42\n117 71 150 243 200\n1 1 1 1 1\n",
            "79\n1 17\n1 0\n2 0\n2 43\n2 0\n"
        ],
        [
            "3 0\n100 50 50\n1 3 2\n",
            "150\n1 0\n1 0\n0 50\n"
        ],
        [
            "5 42\n117 71 150 243 200\n5 4 3 2 1\n",
            "230\n1 17\n1 0\n1 50\n3 0\n2 0\n"
        ]
    ],
    "hint": "",
    "translation": "你有无限张  $100$ 元的纸币和  $m$ 张  $1$ 元的纸币。\n\n在接下来的  $n$ 天，你第  $i$ 天需要花费  $c_i$ 元，但收银员第  $i$ 天每找零  $1$ 元，就会增加  $w_i$ 点愤怒值，你想要最小化收银员的愤怒值。\n\n注意，你不能多付钱，比如说如果你要付  $239$ 元钱，你只能付  $2\\times 100+39\\times 1$ ，或者，付  $3\\times 100$，让收银员找你  $71\\times 1$ 元钱。你不可以付  $4\\times 100$ 元钱让收银员找你  $161\\times 1$ 元钱。\n\n输出内容第一行为最小愤怒值，接下来  $n$ 行，每行输出两个数，分别是你本次花费  $100$ 元纸币的数量和你本次付给收银员的零钱。"
}