{
    "description": "While Mahmoud and Ehab were practicing for IOI, they found a problem which name was Longest common subsequence. They solved it, and then Ehab challenged Mahmoud with another problem.\n\nGiven two strings $ a $ and $ b $ , find the length of their longest uncommon subsequence, which is the longest string that is a subsequence of one of them and not a subsequence of the other.\n\nA subsequence of some string is a sequence of characters that appears in the same order in the string, The appearances don't have to be consecutive, for example, strings \"ac\", \"bc\", \"abc\" and \"a\" are subsequences of string \"abc\" while strings \"abbc\" and \"acb\" are not. The empty string is a subsequence of any string. Any string is a subsequence of itself.",
    "inputFormat": "The first line contains string $ a $ , and the second line — string $ b $ . Both of these strings are non-empty and consist of lowercase letters of English alphabet. The length of each string is not bigger than $ 10^{5} $ characters.",
    "outputFormat": "If there's no uncommon subsequence, print \"-1\". Otherwise print the length of the longest uncommon subsequence of $ a $ and $ b $ .",
    "samples": [
        [
            "abcd\ndefgh\n",
            "5\n"
        ],
        [
            "a\na\n",
            "-1\n"
        ]
    ],
    "hint": "In the first example: you can choose \"defgh\" from string $ b $ as it is the longest subsequence of string $ b $ that doesn't appear as a subsequence of string $ a $ .",
    "translation": "给你两个字符串，对于其中一个字符串的一个子序列，如果该子序列不是另一个字符串的子序列，定义该子序列为“Uncommon Subsequence”。\n\n输入两行为两个字符串，输出一个数字为最长的“Uncommon Subsequence”的长度。如果不存在“Uncommon Subsequence”,输出-1。\n\nTranslated by @AdzearDisjudge"
}