{
    "description": "The Robot is in a rectangular maze of size $ n×m $ . Each cell of the maze is either empty or occupied by an obstacle. The Robot can move between neighboring cells on the side left (the symbol \"L\"), right (the symbol \"R\"), up (the symbol \"U\") or down (the symbol \"D\"). The Robot can move to the cell only if it is empty. Initially, the Robot is in the empty cell.\n\nYour task is to find lexicographically minimal Robot's cycle with length exactly $ k $ , which begins and ends in the cell where the Robot was initially. It is allowed to the Robot to visit any cell many times (including starting).\n\nConsider that Robot's way is given as a line which consists of symbols \"L\", \"R\", \"U\" and \"D\". For example, if firstly the Robot goes down, then left, then right and up, it means that his way is written as \"DLRU\".\n\nIn this task you don't need to minimize the length of the way. Find the minimum lexicographical (in alphabet order as in the dictionary) line which satisfies requirements above.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=1000 $ , $ 1<=k<=10^{6} $ ) — the size of the maze and the length of the cycle.\n\nEach of the following $ n $ lines contains $ m $ symbols — the description of the maze. If the symbol equals to \".\" the current cell is empty. If the symbol equals to \"\\*\" the current cell is occupied by an obstacle. If the symbol equals to \"X\" then initially the Robot is in this cell and it is empty. It is guaranteed that the symbol \"X\" is found in the maze exactly once.",
    "outputFormat": "Print the lexicographically minimum Robot's way with the length exactly $ k $ , which starts and ends in the cell where initially Robot is. If there is no such way, print \"IMPOSSIBLE\"(without quotes).",
    "samples": [
        [
            "2 3 2\n.**\nX..\n",
            "RL\n"
        ],
        [
            "5 6 14\n..***.\n*...X.\n..*...\n..*.**\n....*.\n",
            "DLDDLLLRRRUURU\n"
        ],
        [
            "3 3 4\n***\n*X*\n***\n",
            "IMPOSSIBLE\n"
        ]
    ],
    "hint": "In the first sample two cyclic ways for the Robot with the length $ 2 $ exist — \"UD\" and \"RL\". The second cycle is lexicographically less.\n\nIn the second sample the Robot should move in the following way: down, left, down, down, left, left, left, right, right, right, up, up, right, up.\n\nIn the third sample the Robot can't move to the neighboring cells, because they are occupied by obstacles.",
    "translation": "机器人在一个大小为 $n * m$ 的矩形迷宫中移动。迷宫由空地和墙组成。开始时，机器人在空地中。\n\n机器人每步可以向左（符号 “L”）、向右（符号 “R”）、向上（符号 “U”）或向下（符号 “D”）的空地移动一格。例如机器人的路线是：下、左、右、上，那么它的路线将会被表达为 “DLRU”。\n\n您的任务是找到一个，总长度为 $k$ 的，字典序最小的，从机器人所在位置开始和结束的路线，不需要最小化路径长度。允许多次访问同一个位置。"
}