{
    "description": "Kostya likes Codeforces contests very much. However, he is very disappointed that his solutions are frequently hacked. That's why he decided to obfuscate (intentionally make less readable) his code before upcoming contest.\n\nTo obfuscate the code, Kostya first looks at the first variable name used in his program and replaces all its occurrences with a single symbol $ a $ , then he looks at the second variable name that has not been replaced yet, and replaces all its occurrences with $ b $ , and so on. Kostya is well-mannered, so he doesn't use any one-letter names before obfuscation. Moreover, there are at most 26 unique identifiers in his programs.\n\nYou are given a list of identifiers of some program with removed spaces and line breaks. Check if this program can be a result of Kostya's obfuscation.",
    "inputFormat": "In the only line of input there is a string $ S $ of lowercase English letters ( $ 1<=|S|<=500 $ ) — the identifiers of a program with removed whitespace characters.",
    "outputFormat": "If this program can be a result of Kostya's obfuscation, print \"YES\" (without quotes), otherwise print \"NO\".",
    "samples": [
        [
            "abacaba\n",
            "YES\n"
        ],
        [
            "jinotega\n",
            "NO\n"
        ]
    ],
    "hint": "In the first sample case, one possible list of identifiers would be \"number string number character number string number\". Here how Kostya would obfuscate the program:\n\n- replace all occurences of number with a, the result would be \"a string a character a string a\",\n- replace all occurences of string with b, the result would be \"a b a character a b a\",\n- replace all occurences of character with c, the result would be \"a b a c a b a\",\n- all identifiers have been replaced, thus the obfuscation is finished.",
    "translation": "给你一个字符串，然后把它变成另一个字符串，如果第一个出现的字符就把他变成a,第二个就变成b，以此类推，现告诉你转换后的字符串，问你是否有可能由其他字符串转换过来  \n翻译贡献者UID：71371"
}