{
    "description": "According to an old legeng, a long time ago Ankh-Morpork residents did something wrong to miss Fortune, and she cursed them. She said that at some time $ n $ snacks of distinct sizes will fall on the city, and the residents should build a Snacktower of them by placing snacks one on another. Of course, big snacks should be at the bottom of the tower, while small snacks should be at the top.\n\nYears passed, and once different snacks started to fall onto the city, and the residents began to build the Snacktower.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF767A/180cab69cae65dd25cd78379f99c54f80aacaf67.png)However, they faced some troubles. Each day exactly one snack fell onto the city, but their order was strange. So, at some days the residents weren't able to put the new stack on the top of the Snacktower: they had to wait until all the bigger snacks fell. Of course, in order to not to anger miss Fortune again, the residents placed each snack on the top of the tower immediately as they could do it.\n\nWrite a program that models the behavior of Ankh-Morpork residents.",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1<=n<=100000 $ ) — the total number of snacks.\n\nThe second line contains $ n $ integers, the $ i $ -th of them equals the size of the snack which fell on the $ i $ -th day. Sizes are distinct integers from $ 1 $ to $ n $ .",
    "outputFormat": "Print $ n $ lines. On the $ i $ -th of them print the sizes of the snacks which the residents placed on the top of the Snacktower on the $ i $ -th day in the order they will do that. If no snack is placed on some day, leave the corresponding line empty.",
    "samples": [
        [
            "3\n3 1 2\n",
            "3\n \n2 1"
        ],
        [
            "5\n4 5 1 2 3\n",
            " \n5 4\n \n \n3 2 1\n"
        ]
    ],
    "hint": "In the example a snack of size $ 3 $ fell on the first day, and the residents immediately placed it. On the second day a snack of size $ 1 $ fell, and the residents weren't able to place it because they were missing the snack of size $ 2 $ . On the third day a snack of size $ 2 $ fell, and the residents immediately placed it. Right after that they placed the snack of size $ 1 $ which had fallen before.",
    "translation": "天上会掉下来 $n$ 个糖果，每天一个，持续 $n$ 天。居民们要把它们摆放好，底下放大的，上面放小的，依次连续。最大的糖果大小是 $n$，最小的糖果大小是 $1$。由于事情紧急，当居民们有糖果可放的时候便会放上糖果。\n\n在一天中，如果掉下来的糖果以及之前还没放好的糖果可以放在已有的塔上，就输出糖果的大小。每天结束后换行。"
}