{
    "description": "Vanya wants to minimize a tree. He can perform the following operation multiple times: choose a vertex $ v $ , and two disjoint (except for $ v $ ) paths of equal length $ a_{0}=v $ , $ a_{1} $ , ..., $ a_{k} $ , and $ b_{0}=v $ , $ b_{1} $ , ..., $ b_{k} $ . Additionally, vertices $ a_{1} $ , ..., $ a_{k} $ , $ b_{1} $ , ..., $ b_{k} $ must not have any neighbours in the tree other than adjacent vertices of corresponding paths. After that, one of the paths may be merged into the other, that is, the vertices $ b_{1} $ , ..., $ b_{k} $ can be effectively erased:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF765E/8a327dc5b22e7a12ad1fd6e8837e08cb4a661c45.png)Help Vanya determine if it possible to make the tree into a path via a sequence of described operations, and if the answer is positive, also determine the shortest length of such path.",
    "inputFormat": "The first line of input contains the number of vertices $ n $ ( $ 2<=n<=2·10^{5} $ ).\n\nNext $ n-1 $ lines describe edges of the tree. Each of these lines contains two space-separated integers $ u $ and $ v $ ( $ 1<=u,v<=n $ , $ u≠v $ ) — indices of endpoints of the corresponding edge. It is guaranteed that the given graph is a tree.",
    "outputFormat": "If it is impossible to obtain a path, print -1. Otherwise, print the minimum number of edges in a possible path.",
    "samples": [
        [
            "6\n1 2\n2 3\n2 4\n4 5\n1 6\n",
            "3\n"
        ],
        [
            "7\n1 2\n1 3\n3 4\n1 5\n5 6\n6 7\n",
            "-1\n"
        ]
    ],
    "hint": "In the first sample case, a path of three edges is obtained after merging paths $ 2-1-6 $ and $ 2-4-5 $ .\n\nIt is impossible to perform any operation in the second sample case. For example, it is impossible to merge paths $ 1-3-4 $ and $ 1-5-6 $ , since vertex 6 additionally has a neighbour 7 that is not present in the corresponding path.",
    "translation": "给你一棵树，可以把树上父亲相同的两条长度相同的链合并。（如图）问你最后能不能变成一条链，能的话求链的最短长度。\r\n（n<2*10^5）\r\n"
}