{
    "description": "One of Timofey's birthday presents is a colourbook in a shape of an infinite plane. On the plane $ n $ rectangles with sides parallel to coordinate axes are situated. All sides of the rectangles have odd length. Rectangles cannot intersect, but they can touch each other.\n\nHelp Timofey to color his rectangles in $ 4 $ different colors in such a way that every two rectangles touching each other by side would have different color, or determine that it is impossible.\n\nTwo rectangles intersect if their intersection has positive area. Two rectangles touch by sides if there is a pair of sides such that their intersection has non-zero length\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF763B/1e56315d730703e37fe416b7a434283dfefe0bca.png)The picture corresponds to the first example",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1<=n<=5·10^{5} $ ) — the number of rectangles.\n\n $ n $ lines follow. The $ i $ -th of these lines contains four integers $ x_{1} $ , $ y_{1} $ , $ x_{2} $ and $ y_{2} $ ( $ -10^{9}<=x_{1}&lt;x_{2}<=10^{9} $ , $ -10^{9}<=y_{1}&lt;y_{2}<=10^{9} $ ), that means that points $ (x_{1},y_{1}) $ and $ (x_{2},y_{2}) $ are the coordinates of two opposite corners of the $ i $ -th rectangle.\n\nIt is guaranteed, that all sides of the rectangles have odd lengths and rectangles don't intersect each other.",
    "outputFormat": "Print \"NO\" in the only line if it is impossible to color the rectangles in $ 4 $ different colors in such a way that every two rectangles touching each other by side would have different color.\n\nOtherwise, print \"YES\" in the first line. Then print $ n $ lines, in the $ i $ -th of them print single integer $ c_{i} $ ( $ 1<=c_{i}<=4 $ ) — the color of $ i $ -th rectangle.",
    "samples": [
        [
            "8\n0 0 5 3\n2 -1 5 0\n-3 -4 2 -1\n-1 -1 2 0\n-3 0 0 5\n5 2 10 3\n7 -3 10 2\n4 -2 7 -1\n",
            "YES\n1\n2\n2\n3\n2\n2\n4\n1\n"
        ]
    ],
    "hint": "",
    "translation": "- 平面上有n个与坐标轴平行的矩形。矩形的所有边的长度都是奇数。矩形不能相交，但它们可以互相接触。\n\n- 你要让每两个相邻的矩形就会有不同的颜色。输出YES，并给出每个矩形图上的颜色（1,2,3,4）。\n\n- 如果不行输出NO。"
}