{
    "description": "After his birthday party, Timofey went to his favorite tree alley in a park. He wants to feed there his favorite birds — crows.\n\nIt's widely known that each tree is occupied by a single crow family. The trees in the alley form a row and are numbered from $ 1 $ to $ n $ . Some families are friends to each other. For some reasons, two families can be friends only if they live not too far from each other, more precisely, there is no more than $ k-1 $ trees between any pair of friend families. Formally, the family on the $ u $ -th tree and the family on the $ v $ -th tree can be friends only if $ |u-v|<=k $ holds.\n\nOne of the friendship features is that if some family learns that Timofey is feeding crows somewhere, it notifies about this all friend families. Thus, after Timofey starts to feed crows under some tree, all the families that are friends to the family living on this tree, as well as their friends and so on, fly to the feeding place. Of course, the family living on the tree also comes to the feeding place.\n\nToday Timofey came to the alley and noticed that all the families that live on trees with numbers strictly less than $ l $ or strictly greater than $ r $ have flown away. Thus, it is not possible to pass the information about feeding through them. Moreover, there is no need to feed them. Help Timofey to learn what is the minimum number of trees under which he has to feed crows so that all the families that have remained will get the information about feeding. You are given several situations, described by integers $ l $ and $ r $ , you need to calculate the answer for all of them.",
    "inputFormat": "The first line contains integers $ n $ and $ k $ ( $ 1<=n<=10^{5} $ , $ 1<=k<=5 $ ), where $ n $ is the number of trees, and $ k $ is the maximum possible distance between friend families.\n\nThe next line contains single integer $ m $ ( $ 0<=m<=n·k $ ) — the number of pair of friend families.\n\nEach of the next $ m $ lines contains two integers $ u $ and $ v $ ( $ 1<=u,v<=10^{5} $ ), that means that the families on trees $ u $ and $ v $ are friends. It is guaranteed that $ u≠v $ and $ |u-v|<=k $ . All the given pairs are distinct.\n\nThe next line contains single integer $ q $ ( $ 1<=q<=10^{5} $ ) — the number of situations you need to calculate the answer in.\n\nEach of the next $ q $ lines contains two integers $ l $ and $ r $ ( $ 1<=l<=r<=10^{5} $ ), that means that in this situation families that have flown away lived on such trees $ x $ , so that either $ x&lt;l $ or $ x&gt;r $ .",
    "outputFormat": "Print $ q $ lines. Line $ i $ should contain single integer — the answer in the $ i $ -th situation.",
    "samples": [
        [
            "5 3\n3\n1 3\n2 3\n4 5\n5\n1 1\n1 2\n2 3\n1 3\n1 5\n",
            "1\n2\n1\n1\n2\n"
        ]
    ],
    "hint": "In the first example the following family pairs are friends: $ (1,3) $ , $ (2,3) $ and $ (4,5) $ .\n\n- In the first situation only the first family has remained, so the answer is $ 1 $ .\n- In the second situation the first two families have remained, and they aren't friends, so the answer is $ 2 $ .\n- In the third situation the families $ 2 $ and $ 3 $ are friends, so it is enough to feed any of them, the answer is $ 1 $ .\n- In the fourth situation we can feed the first family, then the third family will get the information from the first family, and the second family will get the information from the third. The answer is $ 1 $ .\n- In the fifth situation we can feed the first and the fifth families, so the answer is $ 2 $ .",
    "translation": "给定 $n$ 个点，一个正整数 $k$ 和 $m$ 条边，保证对于每条边 $(u,v)$ 有 $|u-v|\\le k$，$q$ 次询问若只保留编号在 $[l,r]$ 内的点，剩余的联通块数是多少。\n\n$n,q\\le 10^5$，$k\\le5$，$m\\le 5\\times 10^5$。"
}