{
    "description": "There are literally dozens of snooker competitions held each year, and team Jinotega tries to attend them all (for some reason they prefer name \"snookah\")! When a competition takes place somewhere far from their hometown, Ivan, Artsem and Konstantin take a flight to the contest and back.\n\nJinotega's best friends, team Base have found a list of their itinerary receipts with information about departure and arrival airports. Now they wonder, where is Jinotega now: at home or at some competition far away? They know that:\n\n- this list contains all Jinotega's flights in this year (in arbitrary order),\n- Jinotega has only flown from his hometown to a snooker contest and back,\n- after each competition Jinotega flies back home (though they may attend a competition in one place several times),\n- and finally, at the beginning of the year Jinotega was at home.\n\nPlease help them to determine Jinotega's location!",
    "inputFormat": "In the first line of input there is a single integer $ n $ : the number of Jinotega's flights ( $ 1<=n<=100 $ ). In the second line there is a string of $ 3 $ capital Latin letters: the name of Jinotega's home airport. In the next $ n $ lines there is flight information, one flight per line, in form \"XXX->YYY\", where \"XXX\" is the name of departure airport \"YYY\" is the name of arrival airport. Exactly one of these airports is Jinotega's home airport.\n\nIt is guaranteed that flights information is consistent with the knowledge of Jinotega's friends, which is described in the main part of the statement.",
    "outputFormat": "If Jinotega is now at home, print \"home\" (without quotes), otherwise print \"contest\".",
    "samples": [
        [
            "4\nSVO\nSVO->CDG\nLHR->SVO\nSVO->LHR\nCDG->SVO\n",
            "home\n"
        ],
        [
            "3\nSVO\nSVO->HKT\nHKT->SVO\nSVO->RAP\n",
            "contest\n"
        ]
    ],
    "hint": "In the first sample Jinotega might first fly from SVO to CDG and back, and then from SVO to LHR and back, so now they should be at home. In the second sample Jinotega must now be at RAP because a flight from RAP back to SVO is not on the list.",
    "translation": "每年都有一些斯诺克比赛，Jinotega团队试图参加，由于赛场十分远，他们不得不~~学乌鸦~~坐飞机♂去参加比赛。\n\nJinotega团队的一个好友收到了Jinotega的航班信息，他希望能够根据这些航班信息知道Jinotega团队是正在比赛还是在家中。由于他们心急所以没心情写程序因而找到了你，他们告诉你：\n- 航班信息包括起飞机场和降落机场（均采用三位大写字母简称法），但是由于他们过于心急弄乱了顺序。\n- Jinotega团队每次都从家出发参加比赛并返回。\n- 每次比赛完，Jinotega团队都会回家，无论在这个地点将有多少比赛（这是因为间隔时间比较长）。\n- 一开始，Jinotega团队从家出发。\n\n请帮这个好友确定Jinotega团队的位置。\n\n输入中刚开始有一个数n表示航班信息总数，接下来一行是Jinotega团队家乡的机场简称，紧跟着的n行是航班信息，为\"(起飞机场简称)->(降落机场简称)\"。\n\n输出中输出一行字符串，如果Jinotega团队在比赛，则输出\"contest\"，否则输出\"home\"。"
}