{
    "description": "...Mike the TV greets you again!\n\nTired of the monotonous furniture? Sick of gray routine? Dreaming about dizzying changes in your humble abode? We have something to offer you!\n\nThis domino carpet for only $99.99 will change your life! You can lay it on the floor, hang it on the wall or even on the ceiling! Among other things ...\n\nHaving watched the commercial, virus Hexadecimal also wanted to get a Domino Carpet and wanted badly to be photographed in front of it. But of course, a virus will never consent to buying a licensed Carpet! So she ordered a truck of dominoes and decided to make such a Carpet herself.\n\nThe original Domino Carpet is a field of squares $ n×m $ in size. Each square is half of a domino, and can be rotated either vertically or horizontally, independently from its neighbors. Vertically rotated domino halves look like this:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/24b223911e7d414b4105f5f7b384a2c2404033bc.png)And horizontally rotated halves look like this:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/2e953cc07e102d1dc6925e21d1623a202ee1f98f.png)Notice, that some halves looks the same in both rotations, but other halves differ.\n\nDominoes bought by Hexadecimal are represented by uncuttable chips $ 1×2 $ in size, which can be laid either vertically or horizontally. If the chip is laid vertically, then both of it's halves should be laid vertically orientated; if the chip is laid horizontally, then both of it's halves should be laid horizontally.\n\nThe samples of valid and invalid dominoes laid vertically and horizontally are:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/5374017256a96c5a451a244dd383a369135da2b6.png)Virus Hexadecimal assembles her own Domino Carpet so that the following conditions are satisfied:\n\n- each carpet square is covered by a domino chip, i.e. there are no empty squares;\n- all domino chips lie entirely within the carpet and don't overlap with each other;\n- if there is a horizontal domino chip with its left half in column $ j $ then there are no horizontal domino chips with their left halves in columns $ j-1 $ or $ j+1 $ .\n\nBefore starting to assemble her own Domino Carpet, the virus wants to know the number of ways to achieve the intended purpose modulo $ 10^{9}+7 $ .\n\nYou can assume that the virus has an infinitely large number of dominoes of each type.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ , separated by a space — the size of the Domino Carpet ( $ 1<=n,m<=250 $ ). Next $ 4n+1 $ lines contain $ 4m+1 $ symbols.\n\nEach square of the Domino Carpet, which is a domino half, is described by a $ 3×3 $ square. Symbol 'O' in this square indicates the presence of a point, symbol '.' — its absence.\n\nEach $ 3×3 $ square is delineated from adjacent squares by symbols '#' as shown in the examples.\n\nIt is guaranteed that every box describes the correct half of a domino.\n\nIn all pretests the Domino Carpets have the size of $ 2×2 $ and $ 4×4 $ .",
    "outputFormat": "Print a single number, the number of ways to assemble the Domino Carpet modulo $ 10^{9}+7 $ , using only standard dominoes of size $ 1×2 $ .",
    "samples": [
        [
            "3 4\n#################\n#O..#...#O.O#...#\n#.O.#.O.#.O.#...#\n#..O#...#O.O#...#\n#################\n#O.O#OOO#O.O#...#\n#.O.#...#...#.O.#\n#O.O#OOO#O.O#...#\n#################\n#O.O#...#O.O#...#\n#...#...#...#.O.#\n#O.O#...#O.O#...#\n#################\n",
            "3"
        ],
        [
            "2 2\n#########\n#O.O#O.O#\n#.O.#...#\n#O.O#O.O#\n#########\n#...#O.O#\n#...#...#\n#...#O.O#\n#########\n",
            "2"
        ],
        [
            "2 2\n#########\n#..O#O..#\n#...#...#\n#O..#..O#\n#########\n#O..#..O#\n#...#...#\n#..O#O..#\n#########\n",
            "0"
        ]
    ],
    "hint": "A note to the first example: all correct ways to make Domino Carpet are represented below:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/981dbdf83cacdc8575134f74d310175de347a9dc.png)And this way is incorrect:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/e27d2b360b8d6e5a93ae8ba6b82c2ca4f625b27b.png)",
    "translation": "有若干个 $1\\times2$ 的多米诺骨牌。\n\n横向的骨牌由如图所示的几个方格中的任意两个**不加旋转**拼接而成。\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/2e953cc07e102d1dc6925e21d1623a202ee1f98f.png)\n\n纵向的骨牌由如图所示的几个方格中的任意两个**不加旋转**拼接而成。\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/24b223911e7d414b4105f5f7b384a2c2404033bc.png)\n\n如图为合法的骨牌，而打了红叉的为不合法的骨牌。\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF77D/5374017256a96c5a451a244dd383a369135da2b6.png)\n\n给定一个多米诺骨牌拼接成的图形，求一共有几种方案拼接这个图形。\n\n答案对于 $10^9+7$ 取模。\n\n由 [Error_Eric](https://www.luogu.com.cn/user/217300)翻译。"
}