{
    "description": "You have $ n $ devices that you want to use simultaneously.\n\nThe $ i $ -th device uses $ a_{i} $ units of power per second. This usage is continuous. That is, in $ λ $ seconds, the device will use $ λ·a_{i} $ units of power. The $ i $ -th device currently has $ b_{i} $ units of power stored. All devices can store an arbitrary amount of power.\n\nYou have a single charger that can plug to any single device. The charger will add $ p $ units of power per second to a device. This charging is continuous. That is, if you plug in a device for $ λ $ seconds, it will gain $ λ·p $ units of power. You can switch which device is charging at any arbitrary unit of time (including real numbers), and the time it takes to switch is negligible.\n\nYou are wondering, what is the maximum amount of time you can use the devices until one of them hits $ 0 $ units of power.\n\nIf you can use the devices indefinitely, print -1. Otherwise, print the maximum amount of time before any one device hits $ 0 $ power.",
    "inputFormat": "The first line contains two integers, $ n $ and $ p $ ( $ 1<=n<=100000 $ , $ 1<=p<=10^{9} $ ) — the number of devices and the power of the charger.\n\nThis is followed by $ n $ lines which contain two integers each. Line $ i $ contains the integers $ a_{i} $ and $ b_{i} $ ( $ 1<=a_{i},b_{i}<=100000 $ ) — the power of the device and the amount of power stored in the device in the beginning.",
    "outputFormat": "If you can use the devices indefinitely, print -1. Otherwise, print the maximum amount of time before any one device hits $ 0 $ power.\n\nYour answer will be considered correct if its absolute or relative error does not exceed $ 10^{-4} $ .\n\nNamely, let's assume that your answer is $ a $ and the answer of the jury is $ b $ . The checker program will consider your answer correct if ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF772A/52c84cb27b50fce8b08f35fa39c1f083ebd1a014.png).",
    "samples": [
        [
            "2 1\n2 2\n2 1000\n",
            "2.0000000000"
        ],
        [
            "1 100\n1 1\n",
            "-1\n"
        ],
        [
            "3 5\n4 3\n5 2\n6 1\n",
            "0.5000000000"
        ]
    ],
    "hint": "In sample test 1, you can charge the first device for the entire time until it hits zero power. The second device has enough power to last this time without being charged.\n\nIn sample test 2, you can use the device indefinitely.\n\nIn sample test 3, we can charge the third device for $ 2/5 $ of a second, then switch to charge the second device for a $ 1/10 $ of a second.",
    "translation": "N个机器，每个机器每秒需要消耗能量，每台机器自己有一些能量，\r\n我们有一个充电器可以提供能量（只能同时充一台机器）\r\n问最多可以用多长时间（如果可以永动就输出-1）\r\n注：时间可以为任意实数（就是有小数）\r\n输入第一行就是 n,p n是几台机器 p是充电器每秒充多少电\r\n接下来n行 两个数 第一个是每秒耗电量 第二个是自己带了多少电"
}