{
    "description": "It's well-known that blog posts are an important part of Codeforces platform. Every blog post has a global characteristic changing over time — its community rating. A newly created blog post's community rating is 0. Codeforces users may visit the blog post page and rate it, changing its community rating by +1 or -1.\n\nConsider the following model of Codeforces users' behavior. The $ i $ -th user has his own estimated blog post rating denoted by an integer $ a_{i} $ . When a user visits a blog post page, he compares his estimated blog post rating to its community rating. If his estimated rating is higher, he rates the blog post with +1 (thus, the blog post's community rating increases by 1). If his estimated rating is lower, he rates the blog post with -1 (decreasing its community rating by 1). If the estimated rating and the community rating are equal, user doesn't rate the blog post at all (in this case we'll say that user rates the blog post for 0). In any case, after this procedure user closes the blog post page and never opens it again.\n\nConsider a newly created blog post with the initial community rating of 0. For each of $ n $ Codeforces users, numbered from 1 to $ n $ , his estimated blog post rating $ a_{i} $ is known.\n\nFor each $ k $ from 1 to $ n $ , inclusive, the following question is asked. Let users with indices from 1 to $ k $ , in some order, visit the blog post page, rate the blog post and close the page. Each user opens the blog post only after the previous user closes it. What could be the maximum possible community rating of the blog post after these $ k $ visits?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=5·10^{5} $ ) — the number of Codeforces users.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ -5·10^{5}<=a_{i}<=5·10^{5} $ ) — estimated blog post ratings for users in order from 1 to $ n $ .",
    "outputFormat": "For each $ k $ from 1 to $ n $ , output a single integer equal to the maximum possible community rating of the blog post after users with indices from 1 to $ k $ , in some order, visit the blog post page, rate the blog post, and close the page.",
    "samples": [
        [
            "4\n2 0 2 2\n",
            "1\n1\n2\n2\n"
        ],
        [
            "7\n2 -3 -2 5 0 -3 1\n",
            "1\n0\n-1\n0\n1\n1\n2\n"
        ]
    ],
    "hint": "",
    "translation": "对一个排好序的数组 $a$, 我们计算这样一个函数 F 。\n\nF 初值为 0 。\n按顺序依次将 F 与 $a_i$ 比较\n\n如果 F < $a_i$ ， F++ 。\n\n如果 F = $a_i$ ， F 不变 。\n\n如果 F > $a_i$ ， F-- 。\n\n依次插入 n 个数字，保证之后数组有序，维护每次加入后的 F 值。\n\n$n \\le 5\\times 10^5$"
}