{
    "description": "Bomboslav likes to look out of the window in his room and watch lads outside playing famous shell game. The game is played by two persons: operator and player. Operator takes three similar opaque shells and places a ball beneath one of them. Then he shuffles the shells by swapping some pairs and the player has to guess the current position of the ball.\n\nBomboslav noticed that guys are not very inventive, so the operator always swaps the left shell with the middle one during odd moves (first, third, fifth, etc.) and always swaps the middle shell with the right one during even moves (second, fourth, etc.).\n\nLet's number shells from $ 0 $ to $ 2 $ from left to right. Thus the left shell is assigned number $ 0 $ , the middle shell is $ 1 $ and the right shell is $ 2 $ . Bomboslav has missed the moment when the ball was placed beneath the shell, but he knows that exactly $ n $ movements were made by the operator and the ball was under shell $ x $ at the end. Now he wonders, what was the initial position of the ball?",
    "inputFormat": "The first line of the input contains an integer $ n $ ( $ 1<=n<=2·10^{9} $ ) — the number of movements made by the operator.\n\nThe second line contains a single integer $ x $ ( $ 0<=x<=2 $ ) — the index of the shell where the ball was found after $ n $ movements.",
    "outputFormat": "Print one integer from $ 0 $ to $ 2 $ — the index of the shell where the ball was initially placed.",
    "samples": [
        [
            "4\n2\n",
            "1\n"
        ],
        [
            "1\n1\n",
            "0\n"
        ]
    ],
    "hint": "In the first sample, the ball was initially placed beneath the middle shell and the operator completed four movements.\n\n1. During the first move operator swapped the left shell and the middle shell. The ball is now under the left shell.\n2. During the second move operator swapped the middle shell and the right one. The ball is still under the left shell.\n3. During the third move operator swapped the left shell and the middle shell again. The ball is again in the middle.\n4. Finally, the operators swapped the middle shell and the right shell. The ball is now beneath the right shell.",
    "translation": "给你三张牌0，1，2。\n最初选一张，然后依次进行n次交换，交换规则为：中间一张和左边的一张，中间一张和右边一张，中间一张和左边一张......\n最后问选的那张在哪个位置。\n(YRH)"
}