{
    "description": "Innokentiy decides to change the password in the social net \"Contact!\", but he is too lazy to invent a new password by himself. That is why he needs your help.\n\nInnokentiy decides that new password should satisfy the following conditions:\n\n- the length of the password must be equal to $ n $ ,\n- the password should consist only of lowercase Latin letters,\n- the number of distinct symbols in the password must be equal to $ k $ ,\n- any two consecutive symbols in the password must be distinct.\n\nYour task is to help Innokentiy and to invent a new password which will satisfy all given conditions.",
    "inputFormat": "The first line contains two positive integers $ n $ and $ k $ ( $ 2<=n<=100 $ , $ 2<=k<=min(n,26) $ ) — the length of the password and the number of distinct symbols in it.\n\nPay attention that a desired new password always exists.",
    "outputFormat": "Print any password which satisfies all conditions given by Innokentiy.",
    "samples": [
        [
            "4 3\n",
            "java\n"
        ],
        [
            "6 6\n",
            "python\n"
        ],
        [
            "5 2\n",
            "phphp\n"
        ]
    ],
    "hint": "In the first test there is one of the appropriate new passwords — java, because its length is equal to $ 4 $ and $ 3 $ distinct lowercase letters a, j and v are used in it.\n\nIn the second test there is one of the appropriate new passwords — python, because its length is equal to $ 6 $ and it consists of $ 6 $ distinct lowercase letters.\n\nIn the third test there is one of the appropriate new passwords — phphp, because its length is equal to $ 5 $ and $ 2 $ distinct lowercase letters p and h are used in it.\n\nPay attention the condition that no two identical symbols are consecutive is correct for all appropriate passwords in tests.",
    "translation": "小明要修改他的Ugoul密码，要求其密码必须满足以下要求：\n    \n    1、长度必须是N\n    2、必须是由小写字母组成\n    3、共有K种不同的字符\n    4、任意两个相同字符不可以相连\n  \n请你为他构造一个合适的密码，使得密码满足以上条件  "
}