{
    "description": "Peterson loves to learn new languages, but his favorite hobby is making new ones. Language is a set of words, and word is a sequence of lowercase Latin letters.\n\nPeterson makes new language every morning. It is difficult task to store the whole language, so Peterson have invented new data structure for storing his languages which is called broom. Broom is rooted tree with edges marked with letters. Initially broom is represented by the only vertex — the root of the broom. When Peterson wants to add new word to the language he stands at the root and processes the letters of new word one by one. Consider that Peterson stands at the vertex $ u $ . If there is an edge from $ u $ marked with current letter, Peterson goes through this edge. Otherwise Peterson adds new edge from $ u $ to the new vertex $ v $ , marks it with the current letter and goes through the new edge. Size of broom is the number of vertices in it.\n\nIn the evening after working day Peterson can't understand the language he made this morning. It is too difficult for bored Peterson and he tries to make it simpler. Simplification of the language is the process of erasing some letters from some words of this language. Formally, Peterson takes some positive integer $ p $ and erases $ p $ -th letter from all the words of this language having length at least $ p $ . Letters in words are indexed starting by 1. Peterson considers that simplification should change at least one word, i.e. there has to be at least one word of length at least $ p $ . Peterson tries to make his language as simple as possible, so he wants to choose $ p $ such that the size of the broom for his simplified language is as small as possible.\n\nPeterson is pretty annoyed with this task so he asks you for help. Write a program to find the smallest possible size of the broom and integer $ p $ .",
    "inputFormat": "The first line of input contains integer $ n $ ( $ 2<=n<=3·10^{5} $ ) — the size of the broom.\n\nNext $ n-1 $ lines describe the broom: $ i $ -th of them contains integers $ u_{i} $ , $ v_{i} $ and letter $ x_{i} $ — describing the edge from $ u_{i} $ to $ v_{i} $ marked with letter $ x_{i} $ .\n\nVertices are numbered from 1 to $ n $ . All $ x_{i} $ are lowercase latin letters. Vertex 1 is the root of the broom.\n\nEdges describe correct broom which is made from Peterson's language.",
    "outputFormat": "The first line of output should contain the minimum possible size of the broom after its simplification. The second line of output should contain integer $ p $ to choose. If there are several suitable $ p $ values, print the smallest one.",
    "samples": [
        [
            "5\n1 2 c\n2 3 a\n3 4 t\n2 5 t\n",
            "3\n2\n"
        ],
        [
            "16\n1 2 o\n2 3 f\n1 4 p\n4 5 i\n5 6 e\n6 7 c\n7 8 e\n4 9 r\n9 10 e\n10 11 t\n11 12 t\n12 13 y\n10 14 f\n14 15 i\n15 16 x\n",
            "12\n2\n"
        ]
    ],
    "hint": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF778C/f15fa0cc8758e6866285fb29653e592b9e8e324d.png)\n\nBroom from the second sample test can be built using language \"piece\", \"of\", \"pie\", \"pretty\", \"prefix\". Its simplification with $ p=2 $ obtains the language of words \"pece\", \"o\", \"pe\", \"petty\", \"pefix\". This language gives us the broom with minimum possible size.",
    "translation": "知道trie的可以自动跳过\r\n\r\n---\r\n\r\n(Peterson每天早上都制作新语言\r\n\r\n存储整个语言是一个困难的任务，所以Peterson发明了broom,一个新的数据结构,来存储他的语言\r\n\r\nBroom是一棵边上带有字母的有根树。\r\n\r\n初始的broom只有根节点,当Peterson向语言中添加新单词的时候,他站在根节点,逐一处理新单词的字母\r\n\r\n假设Peterson现在在节点$u$,如果已经有一条边$u\\xrightarrow{\\text{当前字母}} v$,Peterson就直接到$v$\r\n\r\n否则Peterson会新建边$u\\xrightarrow{\\text{当前字母}} v$后再到$v$\r\n\r\n节点数就是broom的大小)\r\n\r\n---\r\n\r\n这个broom不就是trie吗???\r\n\r\n晚上,Peterson尝试简化这个语言,也就是从这个语言中删除某些单词\r\n\r\nPeterson选取了某个正整数$p$,删除了这个语言中所有长度不小于$p$的单词的第$p$个字母\r\n\r\n所有单词中必须要有长度不小于$p$的\r\n\r\nPeterson想尽可能简化这个语言\r\n\r\n你需要求出最优的$p$来最小化broom的大小\r\n\r\n请输出broom的最小大小与$p$(如有多个$p$,任意一个都可以)\r\n\r\n(原broom大小$n(2\\le n \\le 3\\cdot 10^5)$)\r\n"
}