{
    "description": "ALT is a planet in a galaxy called \"Encore\". Humans rule this planet but for some reason there's no dog in their planet, so the people there are sad and depressed. Rick and Morty are universal philanthropists and they want to make people in ALT happy.\n\nALT has $ n $ cities numbered from $ 1 $ to $ n $ and $ n-1 $ bidirectional roads numbered from $ 1 $ to $ n-1 $ . One can go from any city to any other city using these roads.\n\nThere are two types of people in ALT:\n\n1. Guardians. A guardian lives in a house alongside a road and guards the road.\n2. Citizens. A citizen lives in a house inside a city and works in an office in another city.\n\nEvery person on ALT is either a guardian or a citizen and there's exactly one guardian alongside each road.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF786E/98823384a51131ca904b345eb24e1dfd63229a39.png)Rick and Morty talked to all the people in ALT, and here's what they got:\n\n- There are $ m $ citizens living in ALT.\n- Citizen number $ i $ lives in city number $ x_{i} $ and works in city number $ y_{i} $ .\n- Every day each citizen will go through all roads along the shortest path from his home to his work.\n- A citizen will be happy if and only if either he himself has a puppy himself or all of guardians along his path to his work has a puppy (he sees the guardian's puppy in each road and will be happy).\n- A guardian is always happy.\n\nYou need to tell Rick and Morty the minimum number of puppies they need in order to make all people in ALT happy, and also provide an optimal way to distribute these puppies.",
    "inputFormat": "The first line of input contains two integers $ n $ and $ m $ ( $ 2<=n<=2×10^{4} $ , $ 1<=m<=10^{4} $ ) — number of cities and number of citizens respectively.\n\nThe next $ n-1 $ lines contain the roads, $ i $ -th line contains endpoint of $ i $ -th edge, $ v $ and $ u $ ( $ 1<=v,u<=n $ , $ v≠u $ ).\n\nThe next $ m $ lines contain the information about citizens. $ i $ -th line contains two integers $ x_{i} $ and $ y_{i} $ ( $ 1<=x_{i},y_{i}<=n $ , $ x_{i}≠y_{i} $ ).",
    "outputFormat": "In the first line of input print a single integer $ k $ , the total number of puppies they need ( $ 1<=k<=n $ ).\n\nIn the second line print an integer $ q $ , the number of puppies to give to citizens, followed by $ q $ distinct integers $ a_{1},a_{2},...,a_{q} $ , index of citizens to give puppy to ( $ 0<=q<=min(m,k) $ , $ 1<=a_{i}<=m $ ).\n\nIn the third line print an integer $ e $ , the number of puppies to give to guardians, followed by $ e $ distinct integers $ b_{1},b_{2},...,b_{e} $ , index of road of guardians to give puppy to ( $ 0<=e<=min(n-1,k) $ , $ 1<=b_{i}<=n-1 $ ).\n\nSum of $ q $ and $ e $ should be equal to $ k $ .",
    "samples": [
        [
            "4 5\n2 4\n3 4\n1 4\n2 4\n2 1\n2 4\n1 2\n2 3\n",
            "3\n1 5 \n2 3 1 \n"
        ],
        [
            "4 7\n3 4\n1 4\n2 1\n4 2\n4 2\n2 4\n1 4\n2 1\n3 1\n4 2\n",
            "3\n1 6 \n2 2 3 \n"
        ]
    ],
    "hint": "Map of ALT in the first sample testcase (numbers written on a road is its index):\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF786E/7a9e6fa1daa23b80f01b793c79a6a9d57b816dca.png)Map of ALT in the second sample testcase (numbers written on a road is its index):\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF786E/4dd536a81d1bc8f835994567a99f1287412e7178.png)",
    "translation": "给一颗 $n$ 个节点的树，每个边上有一个守卫。有 $m$ 个居民，每个居民有一个散步路径（两个节点的树上最短路）。一个居民高兴当且仅当他获得了一个宠物或者他散步的路径上所有的守卫都有宠物。宠物可以分配给居民或者守卫者。求最少需要几只宠物才能让所有居民高兴。输出方案。\n\n$n,m \\leq 20000$。\n"
}