{
    "description": "Anton likes to listen to fairy tales, especially when Danik, Anton's best friend, tells them. Right now Danik tells Anton a fairy tale:\n\n\"Once upon a time, there lived an emperor. He was very rich and had much grain. One day he ordered to build a huge barn to put there all his grain. Best builders were building that barn for three days and three nights. But they overlooked and there remained a little hole in the barn, from which every day sparrows came through. Here flew a sparrow, took a grain and flew away...\"\n\nMore formally, the following takes place in the fairy tale. At the beginning of the first day the barn with the capacity of $ n $ grains was full. Then, every day (starting with the first day) the following happens:\n\n- $ m $ grains are brought to the barn. If $ m $ grains doesn't fit to the barn, the barn becomes full and the grains that doesn't fit are brought back (in this problem we can assume that the grains that doesn't fit to the barn are not taken into account).\n- Sparrows come and eat grain. In the $ i $ -th day $ i $ sparrows come, that is on the first day one sparrow come, on the second day two sparrows come and so on. Every sparrow eats one grain. If the barn is empty, a sparrow eats nothing.\n\nAnton is tired of listening how Danik describes every sparrow that eats grain from the barn. Anton doesn't know when the fairy tale ends, so he asked you to determine, by the end of which day the barn will become empty for the first time. Help Anton and write a program that will determine the number of that day!",
    "inputFormat": "The only line of the input contains two integers $ n $ and $ m $ $ (1<=n,m<=10^{18}) $ — the capacity of the barn and the number of grains that are brought every day.",
    "outputFormat": "Output one integer — the number of the day when the barn will become empty for the first time. Days are numbered starting with one.",
    "samples": [
        [
            "5 2\n",
            "4\n"
        ],
        [
            "8 1\n",
            "5\n"
        ]
    ],
    "hint": "In the first sample the capacity of the barn is five grains and two grains are brought every day. The following happens:\n\n- At the beginning of the first day grain is brought to the barn. It's full, so nothing happens.\n- At the end of the first day one sparrow comes and eats one grain, so $ 5-1=4 $ grains remain.\n- At the beginning of the second day two grains are brought. The barn becomes full and one grain doesn't fit to it.\n- At the end of the second day two sparrows come. $ 5-2=3 $ grains remain.\n- At the beginning of the third day two grains are brought. The barn becomes full again.\n- At the end of the third day three sparrows come and eat grain. $ 5-3=2 $ grains remain.\n- At the beginning of the fourth day grain is brought again. $ 2+2=4 $ grains remain.\n- At the end of the fourth day four sparrows come and eat grain. $ 4-4=0 $ grains remain. The barn is empty.\n\nSo the answer is $ 4 $ , because by the end of the fourth day the barn becomes empty.",
    "translation": "有一个仓库，容量为 $n$，刚开始有 $n$ 粒谷，每天会依次发生以下两件事：\n\n1. 带来 $m$ 粒谷，如果超过容量 $n$，就只会有 $n$ 粒谷。\n\n2. 第一天有一只鸟，第二天有两只鸟，以此类推，每天一只鸟都会吃一粒谷。\n\n求：第几天结束后，仓库一粒谷都没有了。"
}