{
    "description": "A new bus route is opened in the city ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF780H/5aac860ae08d1fa2af214332e3d0efb0ba34ce30.png). The route is a closed polygon line in the place, with all segments parallel to one of the axes. $ m $ buses will operate on the route. All buses move in a loop along the route in the same direction with equal constant velocities (stopping times are negligible in this problem).\n\nBuses start their movement in the first vertex of the route with equal interval. Suppose that $ T $ is the total time for a single bus to travel the whole loop of the route. Then, the bus 1 starts moving at time 0, the bus 2 starts at time $ T/m $ , the bus 3 starts at time $ 2T/m $ , and so on; finally, the bus $ m $ starts moving at time $ (m-1)T/m $ . Thus, all intervals between pairs of consecutive buses (including the interval between the last and the first bus) are equal.\n\nBuses can communicate with each other via wireless transmitters of equal power. If the transmitters have power $ D $ , then only buses within distance $ D $ of each other can communicate.\n\nThe buses are also equipped with a distributed system of schedule tracking. For all buses to stick to the schedule, the system has to synchronize the necessary data between all buses from time to time. At the moment of synchronization, the bus 1 communicates with the bus 2, the bus 2 — with bus 3, and so on; also, the bus $ m $ communicates with the bus 1.\n\nAs a research employee, you are tasked with finding the smallest value of $ D $ such that it is possible to find a time moment to perform synchronization once all buses have started moving.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 2<=n,m<=10^{5} $ ) — the number of vertices of the polygonal line, and the number of buses respectively.\n\nNext $ n $ lines describe the vertices of the route in the traversing order. Each of these lines contains two integers $ x_{i} $ , $ y_{i} $ ( $ -1000<=x_{i},y_{i}<=1000 $ ) — coordinates of respective vertex.\n\nIt is guaranteed that each leg of the route (including the leg between the last and the first vertex) is paralles to one of the coordinate axes. Moreover, no two subsequent vertices of the route coincide. The route is allowed to have self-intersections, and travel along the same segment multiple times.",
    "outputFormat": "Print one real number — the answer to the problem. Your answer will be accepted if the relative or the absolute error doesn't exceed $ 10^{-6} $ .",
    "samples": [
        [
            "4 2\n0 0\n0 1\n1 1\n1 0\n",
            "1.000000000\n"
        ],
        [
            "2 2\n0 0\n1 0\n",
            "0.000000000"
        ]
    ],
    "hint": "Suppose that each bus travel 1 distance unit per second.\n\nIn the first sample case, in 0.5 seconds buses will be at distance 1, hence we can choose $ D=1 $ .\n\nIn the second sample case, in 0.5 seconds both buses will be at $ (0.5,0) $ , hence we can choose $ D=0 $ .",
    "translation": "平面上$n$个点，依次连边，记边的总长为$C$。\n\n有$m$个动点，从$1$出发，第$i$个点在时刻$\\frac{iC}{m}$出发，它们的速度为$1$（单位长度/时刻）\n\n求最小的距离$s$,使存在某一时刻（点全部出发后），第$i$和$i+1$，第$1$和第$n$个点距离都不大于$s$\n\n保证给出的多边形中每一条边都与一条坐标轴平行。"
}