{
    "description": "Arkady plays Gardenscapes a lot. Arkady wants to build two new fountains. There are $ n $ available fountains, for each fountain its beauty and cost are known. There are two types of money in the game: coins and diamonds, so each fountain cost can be either in coins or diamonds. No money changes between the types are allowed.\n\nHelp Arkady to find two fountains with maximum total beauty so that he can buy both at the same time.",
    "inputFormat": "The first line contains three integers $ n $ , $ c $ and $ d $ ( $ 2<=n<=100000 $ , $ 0<=c,d<=100000 $ ) — the number of fountains, the number of coins and diamonds Arkady has.\n\nThe next $ n $ lines describe fountains. Each of these lines contain two integers $ b_{i} $ and $ p_{i} $ ( $ 1<=b_{i},p_{i}<=100000 $ ) — the beauty and the cost of the $ i $ -th fountain, and then a letter \"C\" or \"D\", describing in which type of money is the cost of fountain $ i $ : in coins or in diamonds, respectively.",
    "outputFormat": "Print the maximum total beauty of exactly two fountains Arkady can build. If he can't build two fountains, print 0.",
    "samples": [
        [
            "3 7 6\n10 8 C\n4 3 C\n5 6 D\n",
            "9\n"
        ],
        [
            "2 4 5\n2 5 C\n2 1 D\n",
            "0\n"
        ],
        [
            "3 10 10\n5 5 C\n5 5 C\n10 11 D\n",
            "10\n"
        ]
    ],
    "hint": "In the first example Arkady should build the second fountain with beauty $ 4 $ , which costs $ 3 $ coins. The first fountain he can't build because he don't have enough coins. Also Arkady should build the third fountain with beauty $ 5 $ which costs $ 6 $ diamonds. Thus the total beauty of built fountains is $ 9 $ .\n\nIn the second example there are two fountains, but Arkady can't build both of them, because he needs $ 5 $ coins for the first fountain, and Arkady has only $ 4 $ coins.",
    "translation": "## 题目描述\r\n\r\nArkady想要建 $2$ 座喷泉，他有 $n$ 座可以选的喷泉，$c$ 个金币和 $d$个钻石， 每座喷泉可且仅可用金币或钻石一种货币来买，金币和钻石也不能以任何方式转化。现在要使两座喷泉美丽值总和最大且Arkady能买得起，求出最大美丽值。\r\n\r\n## 输入格式\r\n\r\n第一行 $3$ 个数，$n$ ，$c$，$d$ $(2<=n<=100000,0<=c,d<=100000)$，分别表示喷泉的数量，Arkady金币和钻石的个数。\r\n\r\n接下来 $n$ 行描述喷泉，每行 $2$ 个正整数，$b_i$，$p_i$ $(1<=b_i,p_i<=100000)$，还有一个字母 \"C\" 或 \"D\"，分别表示第 $i$ 座喷泉的美丽值，价格，还有买喷泉所需要的货币类型，\"C\"是金币，\"D\"是钻石。\r\n\r\n## 输出格式\r\n\r\n输出一行一个正整数，即两座喷泉的最大美丽值总和。"
}