{
    "description": "After hard work Igor decided to have some rest.\n\nHe decided to have a snail. He bought an aquarium with a slippery tree trunk in the center, and put a snail named Julia into the aquarium.\n\nIgor noticed that sometimes Julia wants to climb onto the trunk, but can't do it because the trunk is too slippery. To help the snail Igor put some ropes on the tree, fixing the lower end of the $ i $ -th rope on the trunk on the height $ l_{i} $ above the ground, and the higher end on the height $ r_{i} $ above the ground.\n\nFor some reason no two ropes share the same position of the higher end, i.e. all $ r_{i} $ are distinct. Now Julia can move down at any place of the trunk, and also move up from the lower end of some rope to its higher end. Igor is proud of his work, and sometimes think about possible movements of the snail. Namely, he is interested in the following questions: «Suppose the snail is on the trunk at height $ x $ now. What is the highest position on the trunk the snail can get on if it would never be lower than $ x $ or higher than $ y $ ?» Please note that Julia can't move from a rope to the trunk before it reaches the higher end of the rope, and Igor is interested in the highest position on the tree trunk.\n\nIgor is interested in many questions, and not always can answer them. Help him, write a program that answers these questions.",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1<=n<=100000 $ ) — the height of the trunk.\n\nThe second line contains single integer $ m $ ( $ 1<=m<=100000 $ ) — the number of ropes.\n\nThe next $ m $ lines contain information about the ropes.\n\nThe $ i $ -th of these lines contains two integers $ l_{i} $ and $ r_{i} $ ( $ 1<=l_{i}<=r_{i}<=n $ ) — the heights on which the lower and the higher ends of the $ i $ -th rope are fixed, respectively. It is guaranteed that all $ r_{i} $ are distinct.\n\nThe next line contains single integer $ q $ ( $ 1<=q<=100000 $ ) — the number of questions.\n\nThe next $ q $ lines contain information about the questions.\n\nEach of these lines contain two integers $ x $ and $ y $ ( $ 1<=x<=y<=n $ ), where $ x $ is the height where Julia starts (and the height Julia can't get lower than), and $ y $ is the height Julia can't get higher than.",
    "outputFormat": "For each question print the maximum reachable for Julia height.",
    "samples": [
        [
            "8\n4\n1 2\n3 4\n2 5\n6 7\n5\n1 2\n1 4\n1 6\n2 7\n6 8\n",
            "2\n2\n5\n5\n7\n"
        ],
        [
            "10\n10\n3 7\n1 4\n1 6\n5 5\n1 1\n3 9\n7 8\n1 2\n3 3\n7 10\n10\n2 4\n1 7\n3 4\n3 5\n2 8\n2 5\n5 5\n3 5\n7 7\n3 10\n",
            "2\n7\n3\n3\n2\n2\n5\n3\n7\n10\n"
        ]
    ],
    "hint": "The picture of the first sample is on the left, the picture of the second sample is on the right. Ropes' colors are just for clarity, they don't mean anything.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF793F/fd0920e125cd0c2131a4cdbb7a6c682c972642f8.png)",
    "translation": "有一个长为 $n$ 的杆，上面有 $m$ 条绳子，每条绳子可以让蜗牛从 $l_i$ 爬到 $r_i$（中途不能离开），保证 $r_i$ 各不相同。蜗牛也可以自然下落。\n\n现在有 $q$ 次询问，询问 $x$ 出发，途中高度不能低于 $x$ 或高于 $y$，问最高能爬到的位置。\n\n$n,m,q\\leq 10^5$。"
}