{
    "description": "After Fox Ciel got off a bus, she found that the bus she was on was a wrong bus and she lost her way in a strange town. However, she fortunately met her friend Beaver Taro and asked which way to go to her castle. Taro's response to her was a string $ s $ , and she tried to remember the string $ s $ correctly.\n\nHowever, Ciel feels $ n $ strings $ b_{1},b_{2},...\\ ,b_{n} $ are really boring, and unfortunately she dislikes to remember a string that contains a boring substring. To make the thing worse, what she can remember is only the contiguous substring of $ s $ .\n\nDetermine the longest contiguous substring of $ s $ that does not contain any boring string, so that she can remember the longest part of Taro's response.",
    "inputFormat": "In the first line there is a string $ s $ . The length of $ s $ will be between $ 1 $ and $ 10^{5} $ , inclusive.\n\nIn the second line there is a single integer $ n $ ( $ 1<=n<=10 $ ). Next $ n $ lines, there is a string $ b_{i} $ ( $ 1<=i<=n $ ). Each length of $ b_{i} $ will be between $ 1 $ and $ 10 $ , inclusive.\n\nEach character of the given strings will be either a English alphabet (both lowercase and uppercase) or a underscore ('\\_') or a digit. Assume that these strings are case-sensitive.",
    "outputFormat": "Output in the first line two space-separated integers $ len $ and $ pos $ : the length of the longest contiguous substring of $ s $ that does not contain any $ b_{i} $ , and the first position of the substring (0-indexed). The position $ pos $ must be between $ 0 $ and $ |s|-len $ inclusive, where $ |s| $ is the length of string $ s $ .\n\nIf there are several solutions, output any.",
    "samples": [
        [
            "Go_straight_along_this_street\n5\nstr\nlong\ntree\nbiginteger\nellipse\n",
            "12 4\n"
        ],
        [
            "IhaveNoIdea\n9\nI\nh\na\nv\ne\nN\no\nI\nd\n",
            "0 0\n"
        ],
        [
            "unagioisii\n2\nioi\nunagi\n",
            "5 5\n"
        ]
    ],
    "hint": "In the first sample, the solution is traight\\_alon.\n\nIn the second sample, the solution is an empty string, so the output can be «0 0», «0 1», «0 2», and so on.\n\nIn the third sample, the solution is either nagio or oisii.",
    "translation": "给定一个字符串s和n个字符串b，求s中最长的连续子串使得其中不包含任意b。\n\n### 输入格式：\n\n第一行为字符串s\n\n第二行为n\n\n接下来n行为b\n\n### 输出格式：\n两个整数：最长子串的长度和它的起始位置（中间用空格隔开）"
}