{
    "description": "Fox Ciel saw a large field while she was on a bus. The field was a $ n×m $ rectangle divided into $ 1×1 $ cells. Some cells were wasteland, and other each cell contained crop plants: either carrots or kiwis or grapes.\n\nAfter seeing the field carefully, Ciel found that the crop plants of each cell were planted in following procedure:\n\n- Assume that the rows are numbered $ 1 $ to $ n $ from top to bottom and the columns are numbered $ 1 $ to $ m $ from left to right, and a cell in row $ i $ and column $ j $ is represented as $ (i,j) $ .\n- First, each field is either cultivated or waste. Crop plants will be planted in the cultivated cells in the order of $ (1,1)→...→(1,m)→(2,1)→...→(2,m)→...→(n,1)→...→(n,m) $ . Waste cells will be ignored.\n- Crop plants (either carrots or kiwis or grapes) will be planted in each cell one after another cyclically. Carrots will be planted in the first cell, then kiwis in the second one, grapes in the third one, carrots in the forth one, kiwis in the fifth one, and so on.\n\nThe following figure will show you the example of this procedure. Here, a white square represents a cultivated cell, and a black square represents a waste cell.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF79B/4112aead9f18c470b96f8cf0030b69746887b049.png)Now she is wondering how to determine the crop plants in some certain cells.",
    "inputFormat": "In the first line there are four positive integers $ n,m,k,t $ ( $ 1<=n<=4·10^{4},1<=m<=4·10^{4},1<=k<=10^{3},1<=t<=10^{3} $ ), each of which represents the height of the field, the width of the field, the number of waste cells and the number of queries that ask the kind of crop plants in a certain cell.\n\nFollowing each $ k $ lines contains two integers $ a,b $ ( $ 1<=a<=n,1<=b<=m $ ), which denotes a cell $ (a,b) $ is waste. It is guaranteed that the same cell will not appear twice in this section.\n\nFollowing each $ t $ lines contains two integers $ i,j $ ( $ 1<=i<=n,1<=j<=m $ ), which is a query that asks you the kind of crop plants of a cell $ (i,j) $ .",
    "outputFormat": "For each query, if the cell is waste, print Waste. Otherwise, print the name of crop plants in the cell: either Carrots or Kiwis or Grapes.",
    "samples": [
        [
            "4 5 5 6\n4 3\n1 3\n3 3\n2 5\n3 2\n1 3\n1 4\n2 3\n2 4\n1 1\n1 1\n",
            "Waste\nGrapes\nCarrots\nKiwis\nCarrots\nCarrots\n"
        ]
    ],
    "hint": "The sample corresponds to the figure in the statement.",
    "translation": "## 题意简述\n\n给出一个 $n \\times m$ 的矩阵，当中有 $k$ 个点是坏的。然后按照 **从上往下，从左往右** 的顺序依次填入胡萝卜、奇异果和葡萄（英文分别为 $\\mathtt{Carrots}$、$\\mathtt{Kiwis}$ 和 $\\mathtt{Grapes}$ ）。当然，坏掉的点无法填入东西，也不参与填入矩阵的次序。\n\n现给你 $t$ 次询问，每次给出一对数 $i$ 和 $j$，请输出矩阵第 $i$ 行第 $j$ 列所填的物品。（ **如果这一个点是坏的点，则输出**$\\mathtt{Waste}$）\n\n## 输入格式\n\n第一行给出四个数 $n,m,k,t$，具体含义同上。\n\n接下来 $k$ 行，每一行给出一对数 $x$ 和 $y$，表示第 $x$ 行的第 $y$ 列这个点是坏的点。\n\n接下来是 $t$ 行，每一行给出一对数 $i$ 和 $j$，表示询问的点。\n\n## 输出格式\n\n对于每一次询问，输出一个字符串。（$\\mathtt{Carrots}$、$\\mathtt{Kiwis}$、$\\mathtt{Grapes}$ 或 $\\mathtt{Waste}$，注意需要大写第一个字母）\n\n## 数据范围\n\n$1 \\le n,m \\le 4\\cdot10^4$，$1 \\le k,t \\le 10^3$"
}