{
    "description": "Although Inzane successfully found his beloved bone, Zane, his owner, has yet to return. To search for Zane, he would need a lot of money, of which he sadly has none. To deal with the problem, he has decided to hack the banks.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF796C/2dce5999c2db79450d45fe87441c705c32509051.png)There are $ n $ banks, numbered from $ 1 $ to $ n $ . There are also $ n-1 $ wires connecting the banks. All banks are initially online. Each bank also has its initial strength: bank $ i $ has initial strength $ a_{i} $ .\n\nLet us define some keywords before we proceed. Bank $ i $ and bank $ j $ are neighboring if and only if there exists a wire directly connecting them. Bank $ i $ and bank $ j $ are semi-neighboring if and only if there exists an online bank $ k $ such that bank $ i $ and bank $ k $ are neighboring and bank $ k $ and bank $ j $ are neighboring.\n\nWhen a bank is hacked, it becomes offline (and no longer online), and other banks that are neighboring or semi-neighboring to it have their strengths increased by $ 1 $ .\n\nTo start his plan, Inzane will choose a bank to hack first. Indeed, the strength of such bank must not exceed the strength of his computer. After this, he will repeatedly choose some bank to hack next until all the banks are hacked, but he can continue to hack bank $ x $ if and only if all these conditions are met:\n\n1. Bank $ x $ is online. That is, bank $ x $ is not hacked yet.\n2. Bank $ x $ is neighboring to some offline bank.\n3. The strength of bank $ x $ is less than or equal to the strength of Inzane's computer.\n\nDetermine the minimum strength of the computer Inzane needs to hack all the banks.",
    "inputFormat": "The first line contains one integer $ n $ ( $ 1<=n<=3·10^{5} $ ) — the total number of banks.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ -10^{9}<=a_{i}<=10^{9} $ ) — the strengths of the banks.\n\nEach of the next $ n-1 $ lines contains two integers $ u_{i} $ and $ v_{i} $ ( $ 1<=u_{i},v_{i}<=n $ , $ u_{i}≠v_{i} $ ) — meaning that there is a wire directly connecting banks $ u_{i} $ and $ v_{i} $ .\n\nIt is guaranteed that the wires connect the banks in such a way that Inzane can somehow hack all the banks using a computer with appropriate strength.",
    "outputFormat": "Print one integer — the minimum strength of the computer Inzane needs to accomplish the goal.",
    "samples": [
        [
            "5\n1 2 3 4 5\n1 2\n2 3\n3 4\n4 5\n",
            "5"
        ],
        [
            "7\n38 -29 87 93 39 28 -55\n1 2\n2 5\n3 2\n2 4\n1 7\n7 6\n",
            "93"
        ],
        [
            "5\n1 2 7 6 7\n1 5\n5 3\n3 4\n2 4\n",
            "8"
        ]
    ],
    "hint": "In the first sample, Inzane can hack all banks using a computer with strength $ 5 $ . Here is how:\n\n- Initially, strengths of the banks are $ [1,2,3,4,5] $ .\n- He hacks bank $ 5 $ , then strengths of the banks become $ [1,2,4,5,-] $ .\n- He hacks bank $ 4 $ , then strengths of the banks become $ [1,3,5,-,-] $ .\n- He hacks bank $ 3 $ , then strengths of the banks become $ [2,4,-,-,-] $ .\n- He hacks bank $ 2 $ , then strengths of the banks become $ [3,-,-,-,-] $ .\n- He completes his goal by hacking bank $ 1 $ .\n\nIn the second sample, Inzane can hack banks $ 4 $ , $ 2 $ , $ 3 $ , $ 1 $ , $ 5 $ , $ 7 $ , and $ 6 $ , in this order. This way, he can hack all banks using a computer with strength $ 93 $ .",
    "translation": "给定一棵带点权树，选出一个最佳的根节点，使得根节点的点权不变，它的儿子点权加1，其余点点权加2，并使最大点权最小，输出这个最小的最大点权"
}