{
    "description": "Heidi is terrified by your estimate and she found it unrealistic that her friends would collaborate to drive her into debt. She expects that, actually, each person will just pick a random friend to send Heidi to. (This randomness assumption implies, however, that she can now visit the same friend an arbitrary number of times...) Moreover, if a person only has one friend in common with Heidi (i.e., if that person is in a leaf of the tree), then that person will not send Heidi back (so that Heidi's travel will end at some point).\n\nHeidi also found unrealistic the assumption that she can make all the travels in one day. Therefore now she assumes that every time she travels a route between two friends, she needs to buy a new ticket. She wants to know: how much should she expect to spend on the trips?\n\nFor what it's worth, Heidi knows that Jenny has at least two friends.",
    "inputFormat": "The first line contains the number of friends $ n $ ( $ 3<=n<=10^{5} $ ). The next $ n-1 $ lines each contain three space-separated integers $ u $ , $ v $ and $ c $ ( $ 0<=u,v<=n-1 $ , $ 1<=c<=10^{4} $ ) meaning that $ u $ and $ v $ are friends and the cost for traveling between $ u $ and $ v $ is $ c $ (paid every time!).\n\nIt is again guaranteed that the social network of the input forms a tree.",
    "outputFormat": "Assume that the expected cost of the trips is written as an irreducible fraction $ a/b $ (that is, $ a $ and $ b $ are coprime). Then Heidi, the weird cow that she is, asks you to output ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF802L/769068c972f474e4a0c2077e46023120eead066a.png). (Output a single integer between $ 0 $ and $ 10^{9}+6 $ .)",
    "samples": [
        [
            "3\n0 1 10\n0 2 20\n",
            "15\n"
        ],
        [
            "4\n0 1 3\n0 2 9\n0 3 27\n",
            "13\n"
        ],
        [
            "7\n0 1 3\n0 5 7\n1 2 2\n1 3 1\n1 4 5\n5 6 8\n",
            "400000019\n"
        ],
        [
            "11\n1 0 6646\n2 0 8816\n3 2 9375\n4 2 5950\n5 1 8702\n6 2 2657\n7 2 885\n8 7 2660\n9 2 5369\n10 6 3798\n",
            "153869806\n"
        ],
        [
            "6\n0 1 8\n0 2 24\n1 3 40\n1 4 16\n4 5 8\n",
            "39\n"
        ]
    ],
    "hint": "In the first example, with probability $ 1/2 $ Heidi will go to $ 1 $ from $ 0 $ , and with probability $ 1/2 $ she will go to $ 2 $ . In the first case the cost would be $ 10 $ , and in the second it would be $ 20 $ . After reaching $ 1 $ or $ 2 $ she will stop, as $ 1 $ and $ 2 $ are leaves of the social tree. Hence, the expected cost she has to pay is $ 10·1/2+20·1/2=15 $ .\n\nIn the third example, the expected cost is $ 81/5 $ . You should output $ 400000019 $ .\n\nIn her travels, Heidi has learned an intriguing fact about the structure of her social network. She tells you the following: The mysterious determinant that you might be wondering about is such that it does not cause strange errors in your reasonable solution... Did we mention that Heidi is a weird cow?",
    "translation": "给你一颗树 \n从1号点开始随机游走 \n如果走到叶子就停下来 \n问你期望步数\n\n翻译 louhao088"
}