{
    "description": "Berland has a long and glorious history. To increase awareness about it among younger citizens, King of Berland decided to compose an anthem.\n\nThough there are lots and lots of victories in history of Berland, there is the one that stand out the most. King wants to mention it in the anthem as many times as possible.\n\nHe has already composed major part of the anthem and now just needs to fill in some letters. King asked you to help him with this work.\n\nThe anthem is the string $ s $ of no more than $ 10^{5} $ small Latin letters and question marks. The most glorious victory is the string $ t $ of no more than $ 10^{5} $ small Latin letters. You should replace all the question marks with small Latin letters in such a way that the number of occurrences of string $ t $ in string $ s $ is maximal.\n\nNote that the occurrences of string $ t $ in $ s $ can overlap. Check the third example for clarification.",
    "inputFormat": "The first line contains string of small Latin letters and question marks $ s $ ( $ 1<=|s|<=10^{5} $ ).\n\nThe second line contains string of small Latin letters $ t $ ( $ 1<=|t|<=10^{5} $ ).\n\nProduct of lengths of strings $ |s|·|t| $ won't exceed $ 10^{7} $ .",
    "outputFormat": "Output the maximum number of occurrences of string $ t $ you can achieve by replacing all the question marks in string $ s $ with small Latin letters.",
    "samples": [
        [
            "winlose???winl???w??\nwin\n",
            "5\n"
        ],
        [
            "glo?yto?e??an?\nor\n",
            "3\n"
        ],
        [
            "??c?????\nabcab\n",
            "2\n"
        ]
    ],
    "hint": "In the first example the resulting string $ s $ is \"winlosewinwinlwinwin\"\n\nIn the second example the resulting string $ s $ is \"glorytoreorand\". The last letter of the string can be arbitrary.\n\nIn the third example occurrences of string $ t $ are overlapping. String $ s $ with maximal number of occurrences of $ t $ is \"abcabcab\".",
    "translation": "给定 $s$ 串和 $t$ 串，其中 $s$ 串包含小写字母和问号，$t$ 串只包含小写字母。\n\n假设共有 $k$ 个问号。\n\n你需要给把每个问号变成一个小写字母，共有 $26^k$ 种可能。\n\n对于每种可能，设 $t$ 匹配 $s$ 的次数为 $f_i$，请输出 $\\max(f_i)$ 。\n\n$1\\leq |s|,|t|\\leq 10^5,|s|\\cdot |t|\\leq 10^7$\n\n由 @Ghastlcon 提供翻译"
}