{
    "description": "Each evening Roma plays online poker on his favourite website. The rules of poker on this website are a bit strange: there are always two players in a hand, there are no bets, and the winner takes $ 1 $ virtual bourle from the loser.\n\nLast evening Roma started to play poker. He decided to spend no more than $ k $ virtual bourles — he will stop immediately if the number of his loses exceeds the number of his wins by $ k $ . Also Roma will leave the game if he wins enough money for the evening, i.e. if the number of wins exceeds the number of loses by $ k $ .\n\nNext morning Roma found a piece of paper with a sequence on it representing his results. Roma doesn't remember the results exactly, and some characters in the sequence are written in a way such that it's impossible to recognize this character, so Roma can't recall whether he won $ k $ bourles or he lost.\n\nThe sequence written by Roma is a string $ s $ consisting of characters W (Roma won the corresponding hand), L (Roma lost), D (draw) and ? (unknown result). Roma wants to restore any valid sequence by changing all ? characters to W, L or D. The sequence is called valid if all these conditions are met:\n\n- In the end the absolute difference between the number of wins and loses is equal to $ k $ ;\n- There is no hand such that the absolute difference before this hand was equal to $ k $ .\n\nHelp Roma to restore any such sequence.",
    "inputFormat": "The first line contains two numbers $ n $ (the length of Roma's sequence) and $ k $ ( $ 1<=n,k<=1000 $ ).\n\nThe second line contains the sequence $ s $ consisting of characters W, L, D and ?. There are exactly $ n $ characters in this sequence.",
    "outputFormat": "If there is no valid sequence that can be obtained from $ s $ by replacing all ? characters by W, L or D, print NO.\n\nOtherwise print this sequence. If there are multiple answers, print any of them.",
    "samples": [
        [
            "3 2\nL??\n",
            "LDL\n"
        ],
        [
            "3 1\nW??\n",
            "NO\n"
        ],
        [
            "20 5\n?LLLLLWWWWW?????????\n",
            "WLLLLLWWWWWWWWLWLWDW\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个由 $W,D,L,?$ 构成的长度为 $n$ 的字符串，并给定一个常数 $k$ ，你要替换字符串中的所有 $?$ ，使得原串的 $W,L$ 出现次数之差的绝对值 $=k$ ，且除原串外任意前缀的 $W,L$ 出现次数之差的绝对值 $<k$ ，求构造出的字符串，无解输出 `NO`，否则输出构造后的字符串。"
}