{
    "description": "Heidi's friend Jenny is asking Heidi to deliver an important letter to one of their common friends. Since Jenny is Irish, Heidi thinks that this might be a prank. More precisely, she suspects that the message she is asked to deliver states: \"Send the fool further!\", and upon reading it the recipient will ask Heidi to deliver the same message to yet another friend (that the recipient has in common with Heidi), and so on.\n\nHeidi believes that her friends want to avoid awkward situations, so she will not be made to visit the same person (including Jenny) twice. She also knows how much it costs to travel between any two of her friends who know each other. She wants to know: what is the maximal amount of money she will waste on travel if it really is a prank?\n\nHeidi's $ n $ friends are labeled $ 0 $ through $ n-1 $ , and their network of connections forms a tree. In other words, every two of her friends $ a $ , $ b $ know each other, possibly indirectly (there is a sequence of friends starting from $ a $ and ending on $ b $ and such that each two consecutive friends in the sequence know each other directly), and there are exactly $ n-1 $ pairs of friends who know each other directly.\n\nJenny is given the number $ 0 $ .",
    "inputFormat": "The first line of the input contains the number of friends $ n $ ( $ 3<=n<=100 $ ). The next $ n-1 $ lines each contain three space-separated integers $ u $ , $ v $ and $ c $ ( $ 0<=u,v<=n-1 $ , $ 1<=c<=10^{4} $ ), meaning that $ u $ and $ v $ are friends (know each other directly) and the cost for travelling between $ u $ and $ v $ is $ c $ .\n\nIt is guaranteed that the social network of the input forms a tree.",
    "outputFormat": "Output a single integer – the maximum sum of costs.",
    "samples": [
        [
            "4\n0 1 4\n0 2 2\n2 3 3\n",
            "5\n"
        ],
        [
            "6\n1 2 3\n0 2 100\n1 4 2\n0 3 7\n3 5 10\n",
            "105\n"
        ],
        [
            "11\n1 0 1664\n2 0 881\n3 2 4670\n4 2 1555\n5 1 1870\n6 2 1265\n7 2 288\n8 7 2266\n9 2 1536\n10 6 3378\n",
            "5551\n"
        ]
    ],
    "hint": "In the second example, the worst-case scenario goes like this: Jenny sends Heidi to the friend labeled by number $ 2 $ (incurring a cost of $ 100 $ ), then friend $ 2 $ sends her to friend $ 1 $ (costing Heidi $ 3 $ ), and finally friend $ 1 $ relays her to friend $ 4 $ (incurring an additional cost of $ 2 $ ).",
    "translation": "给你一棵有 $n$ 个节点并以节点 $0$ 为根的树，每条边有一个权值，权值为正整数。\n\n让你从根开始找一条路径，路径的边的权值之和最大。"
}