{
    "description": "This is an interactive problem. In the output section below you will see the information about flushing the output.\n\nOn Sunday Leha the hacker took Nura from the house where she lives and went with her to one of the most luxurious restaurants in Vičkopolis. Upon arrival, they left the car in a huge parking lot near the restaurant and hurried inside the building.\n\nIn the restaurant a polite waiter immediately brought the menu to Leha and Noora, consisting of $ n $ dishes. It is interesting that all dishes in the menu are numbered with integers from $ 1 $ to $ n $ . After a little thought, the girl ordered exactly $ k $ different dishes from available in the menu. To pass the waiting time while the chefs prepare ordered dishes, the girl invited the hacker to play a game that will help them get to know each other better.\n\nThe game itself is very simple: Noora wants Leha to guess any two dishes among all ordered. At the same time, she is ready to answer only one type of questions. Leha can say two numbers $ x $ and $ y $ $ (1<=x,y<=n) $ . After that Noora chooses some dish $ a $ for the number $ x $ such that, at first, $ a $ is among the dishes Noora ordered ( $ x $ can be equal to $ a $ ), and, secondly, the value ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809B/5b39ae684d986558584ee8b76189689ad8c74fb2.png) is the minimum possible. By the same rules the girl chooses dish $ b $ for $ y $ . After that Noora says «TAK» to Leha, if ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809B/ae5a4cbdbe904f98871cc774766e6f251e22446e.png), and «NIE» otherwise. However, the restaurant is preparing quickly, so Leha has enough time to ask no more than $ 60 $ questions. After that he should name numbers of any two dishes Noora ordered.\n\nHelp Leha to solve this problem!",
    "inputFormat": "There are two numbers $ n $ and $ k $ $ (2<=k<=n<=10^{5}) $ in the single line of input denoting the number of dishes in the menu and the number of dishes Noora ordered.",
    "outputFormat": "If you want to provide an answer, output a string of the form $ 2 $ $ x $ $ y $ $ (1<=x,y<=n,x≠y) $ , if you think the dishes $ x $ and $ y $ was among dishes ordered by Noora. After that, flush the output and terminate your program.\n\nInteraction\n\nWhile helping Leha, you can ask queries to Noora no more than $ 60 $ times. Each query should be printed in it's own line and have the form $ 1 $ $ x $ $ y $ $ (1<=x,y<=n) $ . You have to both print the end-of-line character and flush the output. After flushing you should read the answer for this query from input.\n\nAfter each query jury's program will print one line «TAK» or «NIE» (without quotes) in input stream depending on the girl's answer.\n\nTo flush you can use (just after printing an integer and end-of-line):\n\n- fflush(stdout) in C++;\n- System.out.flush() in Java;\n- stdout.flush() in Python;\n- flush(output) in Pascal;\n- see the documentation for other languages.\n\nHacking\n\nFor hacking you should write numbers $ n $ and $ k $ $ (2<=k<=n<=10^{5}) $ in the first line and, for describing dishes Noora ordered, $ k $ different integers $ a_{1},a_{2},...,a_{k} $ $ (1<=a_{i}<=n) $ , written in ascending order in the second line. Of course, solution you want to hack won't be able to read the numbers of ordered dishes.",
    "samples": [
        [
            "3 2\nNIE\nTAK\nNIE\nTAK\nTAK\nTAK\n",
            "1 1 2\n1 2 1\n1 1 3\n1 3 1\n1 2 3\n1 3 2\n2 2 3\n"
        ]
    ],
    "hint": "There are three dishes in sample. Noora ordered dished numberes $ 2 $ and $ 3 $ , which Leha should guess. If Noora receive requests for the first dish ( $ x=1 $ ), then she'll choose the second dish ( $ a=2 $ ) as the dish with the minimum value ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809B/5b39ae684d986558584ee8b76189689ad8c74fb2.png). For the second ( $ x=2 $ ) and the third ( $ x=3 $ ) dishes themselves will be optimal, because in that case ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809B/dc32bff1a2127d4d1040e24b8616661f02b0c678.png).\n\nLet Leha asks Noora about the next couple of dishes:\n\n- $ x=1 $ , $ y=2 $ , then he'll recieve «NIE» answer, because $ |1-2|&gt;|2-2| $\n- $ x=2 $ , $ y=1 $ , then he'll recieve «TAK» answer, because $ |2-2|<=|1-2| $\n- $ x=1 $ , $ y=3 $ , then he'll recieve «NIE» answer, because $ |1-2|&gt;|3-3| $\n- $ x=3 $ , $ y=1 $ , then he'll recieve «TAK» answer, because $ |3-3|<=|1-2| $\n- $ x=2 $ , $ y=3 $ , then he'll recieve «TAK» answer, because $ |2-2|<=|3-3| $\n- $ x=3 $ , $ y=2 $ , then he'll recieve «TAK» answer, because $ |3-3|<=|2-2| $\n\nAccording to the available information, it is possible to say that Nura ordered dishes with numbers $ 2 $ and $ 3 $ .",
    "translation": "交互题。已知在一个长度为$n$的序列中选中了$k$个位置，你每次可以询问两个位置$x,y$，则若$|x-a|\\le |y-b|$（$a,b$为$k$个被选中的位置中分别离$x,y$最近的位置），返回$TAK$，否则返回$NIE$。你需要在$60$次询问内求出任意两个被选中的位置并输出。"
}