{
    "description": "After a wonderful evening in the restaurant the time to go home came. Leha as a true gentlemen suggested Noora to give her a lift. Certainly the girl agreed with pleasure. Suddenly one problem appeared: Leha cannot find his car on a huge parking near the restaurant. So he decided to turn to the watchman for help.\n\nFormally the parking can be represented as a matrix $ 10^{9}×10^{9} $ . There is exactly one car in every cell of the matrix. All cars have their own machine numbers represented as a positive integer. Let's index the columns of the matrix by integers from $ 1 $ to $ 10^{9} $ from left to right and the rows by integers from $ 1 $ to $ 10^{9} $ from top to bottom. By coincidence it turned out, that for every cell $ (x,y) $ the number of the car, which stands in this cell, is equal to the minimum positive integer, which can't be found in the cells $ (i,y) $ and $ (x,j) $ , $ 1<=i&lt;x,1<=j&lt;y $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809C/ae332bca5d9d01e82f5b508b0b8ed89c69aaabc8.png)The upper left fragment $ 5×5 $ of the parkingLeha wants to ask the watchman $ q $ requests, which can help him to find his car. Every request is represented as five integers $ x_{1},y_{1},x_{2},y_{2},k $ . The watchman have to consider all cells $ (x,y) $ of the matrix, such that $ x_{1}<=x<=x_{2} $ and $ y_{1}<=y<=y_{2} $ , and if the number of the car in cell $ (x,y) $ does not exceed $ k $ , increase the answer to the request by the number of the car in cell $ (x,y) $ . For each request Leha asks the watchman to tell him the resulting sum. Due to the fact that the sum can turn out to be quite large, hacker asks to calculate it modulo $ 10^{9}+7 $ .\n\nHowever the requests seem to be impracticable for the watchman. Help the watchman to answer all Leha's requests.",
    "inputFormat": "The first line contains one integer $ q $ $ (1<=q<=10^{4}) $ — the number of Leha's requests.\n\nThe next $ q $ lines contain five integers $ x_{1},y_{1},x_{2},y_{2},k $ $ (1<=x_{1}<=x_{2}<=10^{9},1<=y_{1}<=y_{2}<=10^{9},1<=k<=2·10^{9}) $ — parameters of Leha's requests.",
    "outputFormat": "Print exactly $ q $ lines — in the first line print the answer to the first request, in the second — the answer to the second request and so on.",
    "samples": [
        [
            "4\n1 1 1 1 1\n3 2 5 4 5\n1 1 5 5 10000\n1 4 2 5 2\n",
            "1\n13\n93\n0\n"
        ]
    ],
    "hint": "Let's analyze all the requests. In each case the requested submatrix is highlighted in blue.\n\nIn the first request $ (k=1) $ Leha asks only about the upper left parking cell. In this cell the car's number is $ 1 $ . Consequentally the answer is $ 1 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809C/d2875ff3db76503beed44fa5c085d5d3869ee951.png)\n\nIn the second request $ (k=5) $ suitable numbers are $ 4,1,2,3,2,1 $ . Consequentally the answer is $ 4+1+2+3+2+1=13 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809C/ede1b276e2f90d48fe9a9d6eefb80fff17357cda.png)\n\nIn the third request $ (k=10000) $ Leha asks about the upper left frament $ 5×5 $ of the parking. Since $ k $ is big enough, the answer is equal to $ 93 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809C/34d4b59403122816fc368bbef865be8d24e23c43.png)\n\nIn the last request $ (k=2) $ none of the cur's numbers are suitable, so the answer is $ 0 $ .\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF809C/c06af08c1e07e51a52a8f851e5994e563f76af08.png)",
    "translation": "有一个无限大的矩阵$a$，$a_{x,y}$等于所有$a_{i,y}(i<x)$和$a_{x,j}(j<y)$中没有出现过的最小正整数。\r\n\r\n$q$次询问,\r\n每次询问一个矩形范围内小于等于某个数的所有数的和。"
}