{
    "description": "On the way to school, Karen became fixated on the puzzle game on her phone!\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF815A/69d9eed46962e3cdadeae01ef67d1e4bd4bac050.png)The game is played as follows. In each level, you have a grid with $ n $ rows and $ m $ columns. Each cell originally contains the number $ 0 $ .\n\nOne move consists of choosing one row or column, and adding $ 1 $ to all of the cells in that row or column.\n\nTo win the level, after all the moves, the number in the cell at the $ i $ -th row and $ j $ -th column should be equal to $ g_{i,j} $ .\n\nKaren is stuck on one level, and wants to know a way to beat this level using the minimum number of moves. Please, help her with this task!",
    "inputFormat": "The first line of input contains two integers, $ n $ and $ m $ ( $ 1<=n,m<=100 $ ), the number of rows and the number of columns in the grid, respectively.\n\nThe next $ n $ lines each contain $ m $ integers. In particular, the $ j $ -th integer in the $ i $ -th of these rows contains $ g_{i,j} $ ( $ 0<=g_{i,j}<=500 $ ).",
    "outputFormat": "If there is an error and it is actually not possible to beat the level, output a single integer -1.\n\nOtherwise, on the first line, output a single integer $ k $ , the minimum number of moves necessary to beat the level.\n\nThe next $ k $ lines should each contain one of the following, describing the moves in the order they must be done:\n\n- row $ x $ , ( $ 1<=x<=n $ ) describing a move of the form \"choose the $ x $ -th row\".\n- col $ x $ , ( $ 1<=x<=m $ ) describing a move of the form \"choose the $ x $ -th column\".\n\nIf there are multiple optimal solutions, output any one of them.",
    "samples": [
        [
            "3 5\n2 2 2 3 2\n0 0 0 1 0\n1 1 1 2 1\n",
            "4\nrow 1\nrow 1\ncol 4\nrow 3\n"
        ],
        [
            "3 3\n0 0 0\n0 1 0\n0 0 0\n",
            "-1\n"
        ],
        [
            "3 3\n1 1 1\n1 1 1\n1 1 1\n",
            "3\nrow 1\nrow 2\nrow 3\n"
        ]
    ],
    "hint": "In the first test case, Karen has a grid with $ 3 $ rows and $ 5 $ columns. She can perform the following $ 4 $ moves to beat the level:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF815A/2c8fcc04f5be718b03f1b0d9aafd9c48834c67b9.png)In the second test case, Karen has a grid with $ 3 $ rows and $ 3 $ columns. It is clear that it is impossible to beat the level; performing any move will create three $ 1 $ s on the grid, but it is required to only have one $ 1 $ in the center.\n\nIn the third test case, Karen has a grid with $ 3 $ rows and $ 3 $ columns. She can perform the following $ 3 $ moves to beat the level:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF815A/b5d0f3212dd0b57527e9775bb29c6dbecaf28d27.png)Note that this is not the only solution; another solution, among others, is col 1, col 2, col 3.",
    "translation": "给你一个初始全为零的n*m的方格，每次操作可以使一行或一列全部加一，问最少要操作几步能使方格和输入一样 \n\nTranslated by Dreamer丶杨"
}