{
    "description": "It's been long after the events of the previous problems, and Karen has now moved on from student life and is looking to relocate to a new neighborhood.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF815E/8bd2a5609d0d80a04305caa2f81f70648ac35159.png)The neighborhood consists of $ n $ houses in a straight line, labelled $ 1 $ to $ n $ from left to right, all an equal distance apart.\n\nEveryone in this neighborhood loves peace and quiet. Because of this, whenever a new person moves into the neighborhood, he or she always chooses the house whose minimum distance to any occupied house is maximized. If there are multiple houses with the maximum possible minimum distance, he or she chooses the leftmost one.\n\nNote that the first person to arrive always moves into house $ 1 $ .\n\nKaren is the $ k $ -th person to enter this neighborhood. If everyone, including herself, follows this rule, which house will she move into?",
    "inputFormat": "The first and only line of input contains two integers, $ n $ and $ k $ ( $ 1<=k<=n<=10^{18} $ ), describing the number of houses in the neighborhood, and that Karen was the $ k $ -th person to move in, respectively.",
    "outputFormat": "Output a single integer on a line by itself, the label of the house Karen will move into.",
    "samples": [
        [
            "6 4\n",
            "2\n"
        ],
        [
            "39 3\n",
            "20\n"
        ]
    ],
    "hint": "In the first test case, there are $ 6 $ houses in the neighborhood, and Karen is the fourth person to move in:\n\n1. The first person moves into house $ 1 $ .\n2. The second person moves into house $ 6 $ .\n3. The third person moves into house $ 3 $ .\n4. The fourth person moves into house $ 2 $ .\n\nIn the second test case, there are $ 39 $ houses in the neighborhood, and Karen is the third person to move in:\n\n1. The first person moves into house $ 1 $ .\n2. The second person moves into house $ 39 $ .\n3. The third person moves into house $ 20 $ .",
    "translation": "$Karen$要住进新房子。这一条街上有$n$栋房子，编号为$1$~$n$。在$Karen$之前有$k-1$个人住进这条街，即$Karen$是第$k$个搬进这条街的人。每个人住进这条街都有一个选房子的法则：如果他选的房子与离这栋房子最近的一栋房子的距离最大，那么就选这栋房子；如果有多栋房子满足前面一条规则，就选择最靠左的房子（这样的话，第$1$个人选的是$1$号房）。请问$Karen$选的房子是几号房子？\n\n### 输入：\n\n一行两个整数$n$和$k$。\n\n### 输出：\n\n一个整数为$Karen$选的房子。\n\n### 数据范围：\n\n $1<=k<=n<=10^{18}$"
}