{
    "description": "Author note: I think some of you might remember the problem \"Two Melodies\" from Eductational Codeforces Round 22. Now it's time to make it a bit more difficult!\n\nAlice is a composer, and recently she had recorded two tracks that became very popular. Now she has got a lot of fans who are waiting for new tracks.\n\nThis time Alice wants to form four melodies for her tracks.\n\nAlice has a sheet with $ n $ notes written on it. She wants to take four such non-empty non-intersecting subsequences that all of them form a melody and sum of their lengths is maximal.\n\nSubsequence is a sequence that can be derived from another sequence by deleting some elements without changing the order of the remaining elements.\n\nSubsequence forms a melody when each two adjacent notes either differ by 1 or are congruent modulo 7.\n\nYou should write a program which will calculate maximum sum of lengths of such four non-empty non-intersecting subsequences that all of them form a melody.",
    "inputFormat": "The first line contains one integer number $ n $ ( $ 4<=n<=3000 $ ).\n\nThe second line contains $ n $ integer numbers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{5} $ ) — notes written on a sheet.",
    "outputFormat": "Print maximum sum of lengths of such four non-empty non-intersecting subsequences that all of them form a melody.",
    "samples": [
        [
            "5\n1 3 5 7 9\n",
            "4\n"
        ],
        [
            "5\n1 3 5 7 2\n",
            "5\n"
        ]
    ],
    "hint": "In the first example it is possible to compose $ 4 $ melodies by choosing any $ 4 $ notes (and each melody will consist of only one note).\n\nIn the second example it is possible to compose one melody with $ 2 $ notes — $ {1,2} $ . Remaining notes are used in other three melodies (one note per each melody).",
    "translation": "定义一个 Melody 子序列为，子序列中任意两个相邻元素差为 $1$ 或模 $7$ 同余，这里的子序列不要求连续。\n\n给定一个长度为 $n$ 的序列，求出一种选出 $4$ 个互不相交的 Melody 子序列的方案，使得它们的并的大小尽量大。输出这个大小。\n\n$n \\le 3000,a_i \\le 10^5$"
}