{
    "description": "Some people leave the lights at their workplaces on when they leave that is a waste of resources. As a hausmeister of DHBW, Sagheer waits till all students and professors leave the university building, then goes and turns all the lights off.\n\nThe building consists of $ n $ floors with stairs at the left and the right sides. Each floor has $ m $ rooms on the same line with a corridor that connects the left and right stairs passing by all the rooms. In other words, the building can be represented as a rectangle with $ n $ rows and $ m+2 $ columns, where the first and the last columns represent the stairs, and the $ m $ columns in the middle represent rooms.\n\nSagheer is standing at the ground floor at the left stairs. He wants to turn all the lights off in such a way that he will not go upstairs until all lights in the floor he is standing at are off. Of course, Sagheer must visit a room to turn the light there off. It takes one minute for Sagheer to go to the next floor using stairs or to move from the current room/stairs to a neighboring room/stairs on the same floor. It takes no time for him to switch the light off in the room he is currently standing in. Help Sagheer find the minimum total time to turn off all the lights.\n\nNote that Sagheer does not have to go back to his starting position, and he does not have to visit rooms where the light is already switched off.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n<=15 $ and $ 1<=m<=100 $ ) — the number of floors and the number of rooms in each floor, respectively.\n\nThe next $ n $ lines contains the building description. Each line contains a binary string of length $ m+2 $ representing a floor (the left stairs, then $ m $ rooms, then the right stairs) where $ 0 $ indicates that the light is off and $ 1 $ indicates that the light is on. The floors are listed from top to bottom, so that the last line represents the ground floor.\n\nThe first and last characters of each string represent the left and the right stairs, respectively, so they are always $ 0 $ .",
    "outputFormat": "Print a single integer — the minimum total time needed to turn off all the lights.",
    "samples": [
        [
            "2 2\n0010\n0100\n",
            "5\n"
        ],
        [
            "3 4\n001000\n000010\n000010\n",
            "12\n"
        ],
        [
            "4 3\n01110\n01110\n01110\n01110\n",
            "18\n"
        ]
    ],
    "hint": "In the first example, Sagheer will go to room $ 1 $ in the ground floor, then he will go to room $ 2 $ in the second floor using the left or right stairs.\n\nIn the second example, he will go to the fourth room in the ground floor, use right stairs, go to the fourth room in the second floor, use right stairs again, then go to the second room in the last floor.\n\nIn the third example, he will walk through the whole corridor alternating between the left and right stairs at each floor.",
    "translation": "# Sagheer, the Hausmeister\n\n## 题目大意\n\n有一栋楼房，里面有很多盏灯没关，为了节约用电Sagheer决定把这些灯都关了。\n\n这楼有 n 层，最左边和最右边有楼梯。每一层有 m 个房间排成一排。这栋楼可以被表示成一个 n 行 m + 2 列的矩阵，其中每行第一个和最后一个格点表示楼梯， 剩余 m 个格点表示房间。\n\n现在Sagheer在最底层的最左边楼梯，他想要关掉所有的灯。他每次可以走到相邻的房间，如果在楼梯口可以上下楼梯。他打算关掉所有开着的灯，在他没有将一层的所有灯都关闭前他不会上楼。现在求他最少需要走多少步可以关闭所有灯。\n\n注意Sagheer不需要返回原处，最终可以停留在任意一个地方。\n\n## 输入格式\n\n第一行包含两个整数 n 和 m (1 ≤ n ≤ 15 并且 1 ≤ m ≤ 100) — 表示层数和每层的房间数。\n\n之后 n 行描述这栋楼。每行包含一个长度为 m + 2 的字符串表示这层楼的情况，如果值是1表示灯亮着，否则表示灯没亮。\n\n保证每个字符串首尾位都为0。\n\n## 输出格式\n\n输出一个整数，表示熄灭所有灯所需的最少步数。\n\n## 样例 #1\n\n### 样例输入 #1\n\n```\n2 2\n0010\n0100\n```\n\n### 样例输出 #1\n\n```\n5\n```\n\n## 样例 #2\n\n### 样例输入 #2\n\n```\n3 4\n001000\n000010\n000010\n```\n\n### 样例输出 #2\n\n```\n12\n```\n\n## 样例 #3\n\n### 样例输入 #3\n\n```\n4 3\n01110\n01110\n01110\n01110\n```\n\n### 样例输出 #3\n\n```\n18\n```"
}