{
    "description": "To stay woke and attentive during classes, Karen needs some coffee!\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF816B/84ca24fa194ecce1cb9c3e825b543dfb7809c444.png)Karen, a coffee aficionado, wants to know the optimal temperature for brewing the perfect cup of coffee. Indeed, she has spent some time reading several recipe books, including the universally acclaimed \"The Art of the Covfefe\".\n\nShe knows $ n $ coffee recipes. The $ i $ -th recipe suggests that coffee should be brewed between $ l_{i} $ and $ r_{i} $ degrees, inclusive, to achieve the optimal taste.\n\nKaren thinks that a temperature is admissible if at least $ k $ recipes recommend it.\n\nKaren has a rather fickle mind, and so she asks $ q $ questions. In each question, given that she only wants to prepare coffee with a temperature between $ a $ and $ b $ , inclusive, can you tell her how many admissible integer temperatures fall within the range?",
    "inputFormat": "The first line of input contains three integers, $ n $ , $ k $ ( $ 1<=k<=n<=200000 $ ), and $ q $ ( $ 1<=q<=200000 $ ), the number of recipes, the minimum number of recipes a certain temperature must be recommended by to be admissible, and the number of questions Karen has, respectively.\n\nThe next $ n $ lines describe the recipes. Specifically, the $ i $ -th line among these contains two integers $ l_{i} $ and $ r_{i} $ ( $ 1<=l_{i}<=r_{i}<=200000 $ ), describing that the $ i $ -th recipe suggests that the coffee be brewed between $ l_{i} $ and $ r_{i} $ degrees, inclusive.\n\nThe next $ q $ lines describe the questions. Each of these lines contains $ a $ and $ b $ , ( $ 1<=a<=b<=200000 $ ), describing that she wants to know the number of admissible integer temperatures between $ a $ and $ b $ degrees, inclusive.",
    "outputFormat": "For each question, output a single integer on a line by itself, the number of admissible integer temperatures between $ a $ and $ b $ degrees, inclusive.",
    "samples": [
        [
            "3 2 4\n91 94\n92 97\n97 99\n92 94\n93 97\n95 96\n90 100\n",
            "3\n3\n0\n4\n"
        ],
        [
            "2 1 1\n1 1\n200000 200000\n90 100\n",
            "0\n"
        ]
    ],
    "hint": "In the first test case, Karen knows $ 3 $ recipes.\n\n1. The first one recommends brewing the coffee between $ 91 $ and $ 94 $ degrees, inclusive.\n2. The second one recommends brewing the coffee between $ 92 $ and $ 97 $ degrees, inclusive.\n3. The third one recommends brewing the coffee between $ 97 $ and $ 99 $ degrees, inclusive.\n\nA temperature is admissible if at least $ 2 $ recipes recommend it.\n\nShe asks $ 4 $ questions.\n\nIn her first question, she wants to know the number of admissible integer temperatures between $ 92 $ and $ 94 $ degrees, inclusive. There are $ 3 $ : $ 92 $ , $ 93 $ and $ 94 $ degrees are all admissible.\n\nIn her second question, she wants to know the number of admissible integer temperatures between $ 93 $ and $ 97 $ degrees, inclusive. There are $ 3 $ : $ 93 $ , $ 94 $ and $ 97 $ degrees are all admissible.\n\nIn her third question, she wants to know the number of admissible integer temperatures between $ 95 $ and $ 96 $ degrees, inclusive. There are none.\n\nIn her final question, she wants to know the number of admissible integer temperatures between $ 90 $ and $ 100 $ degrees, inclusive. There are $ 4 $ : $ 92 $ , $ 93 $ , $ 94 $ and $ 97 $ degrees are all admissible.\n\nIn the second test case, Karen knows $ 2 $ recipes.\n\n1. The first one, \"wikiHow to make Cold Brew Coffee\", recommends brewing the coffee at exactly $ 1 $ degree.\n2. The second one, \"What good is coffee that isn't brewed at at least $ 36.3306 $ times the temperature of the surface of the sun?\", recommends brewing the coffee at exactly $ 200000 $ degrees.\n\nA temperature is admissible if at least $ 1 $ recipe recommends it.\n\nIn her first and only question, she wants to know the number of admissible integer temperatures that are actually reasonable. There are none.",
    "translation": "Karen 喜欢咖啡。  \n她有  $n$ 本食谱，第  $i$ 本食谱包含两个数  $l_i,r_i$，表示这本食谱推荐用  $[l_i,r_i]$ 之间的温度（包含  $l_i.r_i$）来煮咖啡。  \nKaren 认为一个温度  $a$ 是可接受的**当且仅当**有  $\\ge k$ 本食谱推荐用  $a$ 来煮咖啡。  \nKaren 有  $q$ 个问题，每个问题用一对正整数  $a_i,b_i$ 来表示，表示她问  $[a_i,b_i]$ 之间有多少个温度是**可接受的**。"
}