{
    "description": "Karen is getting ready for a new school day!\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF816A/d9d19918bc23426418750518f0726b72abe028b5.png)It is currently hh:mm, given in a 24-hour format. As you know, Karen loves palindromes, and she believes that it is good luck to wake up when the time is a palindrome.\n\nWhat is the minimum number of minutes she should sleep, such that, when she wakes up, the time is a palindrome?\n\nRemember that a palindrome is a string that reads the same forwards and backwards. For instance, 05:39 is not a palindrome, because 05:39 backwards is 93:50. On the other hand, 05:50 is a palindrome, because 05:50 backwards is 05:50.",
    "inputFormat": "The first and only line of input contains a single string in the format hh:mm ( $ 00<= $ hh $ <=23 $ , $ 00<= $ mm $ <=59 $ ).",
    "outputFormat": "Output a single integer on a line by itself, the minimum number of minutes she should sleep, such that, when she wakes up, the time is a palindrome.",
    "samples": [
        [
            "05:39\n",
            "11\n"
        ],
        [
            "13:31\n",
            "0\n"
        ],
        [
            "23:59\n",
            "1\n"
        ]
    ],
    "hint": "In the first test case, the minimum number of minutes Karen should sleep for is $ 11 $ . She can wake up at 05:50, when the time is a palindrome.\n\nIn the second test case, Karen can wake up immediately, as the current time, 13:31, is already a palindrome.\n\nIn the third test case, the minimum number of minutes Karen should sleep for is $ 1 $ minute. She can wake up at 00:00, when the time is a palindrome.",
    "translation": "## 题目描述\n\n可怜已经准备好迎接在学校的新的一天。\n\n现在是hh:mm，一个被以24小时制给与的时间。正如你所知道的，可怜喜欢回文，并且她相信如果在她醒来时的时间是回文的话会给她带来好运。\n\n当她醒来时时间是回文的话，她最少应当睡多长时间？\n\n记住，一个回文数是一个从前读和从后读相同的字符串。例如，05:39是不是回文数，因为05:39倒着读是93:50。另一方面，05:50是回文，因为05:50倒着读是05:50。\n\n### 输入格式：\n\n仅有一行，包含一个格式为hh:mm的字符串（$00\\leq hh\\leq23,00\\leq mm\\leq59$ ）。\n\n### 输出格式：\n\n仅输出一行一个整数，表示要使她醒来时的时间是回文，她所睡的最少时间。\n\n### 说明\n\n在第一个样例中，可怜最少应睡的时间为$11$ ，这样她可以在05:50时醒来，这是一个回文时间。\n\n在第二个样例中，可怜可以立刻起来，当前时间13:31就是一个回文。\n\n在第三个样例中，可怜最少应睡的时间为$1$ 分钟。她可以在00:00醒来，这是一个回文时间。\n\n感谢@Khassar 提供的翻译"
}