{
    "description": "Noora is a student of one famous high school. It's her final year in school — she is going to study in university next year. However, she has to get an «A» graduation certificate in order to apply to a prestigious one.\n\nIn school, where Noora is studying, teachers are putting down marks to the online class register, which are integers from $ 1 $ to $ k $ . The worst mark is $ 1 $ , the best is $ k $ . Mark that is going to the certificate, is calculated as an average of all the marks, rounded to the closest integer. If several answers are possible, rounding up is produced. For example, $ 7.3 $ is rounded to $ 7 $ , but $ 7.5 $ and $ 7.8784 $ — to $ 8 $ .\n\nFor instance, if Noora has marks $ [8,9] $ , then the mark to the certificate is $ 9 $ , because the average is equal to $ 8.5 $ and rounded to $ 9 $ , but if the marks are $ [8,8,9] $ , Noora will have graduation certificate with $ 8 $ .\n\nTo graduate with «A» certificate, Noora has to have mark $ k $ .\n\nNoora got $ n $ marks in register this year. However, she is afraid that her marks are not enough to get final mark $ k $ . Noora decided to ask for help in the internet, where hacker Leha immediately responded to her request. He is ready to hack class register for Noora and to add Noora any number of additional marks from $ 1 $ to $ k $ . At the same time, Leha want his hack be unseen to everyone, so he decided to add as less as possible additional marks. Please help Leha to calculate the minimal number of marks he has to add, so that final Noora's mark will become equal to $ k $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ $ (1<=n<=100,1<=k<=100) $ denoting the number of marks, received by Noora and the value of highest possible mark.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ $ (1<=a_{i}<=k) $ denoting marks received by Noora before Leha's hack.",
    "outputFormat": "Print a single integer — minimal number of additional marks, that Leha has to add in order to change Noora's final mark to $ k $ .",
    "samples": [
        [
            "2 10\n8 9\n",
            "4"
        ],
        [
            "3 5\n4 4 4\n",
            "3"
        ]
    ],
    "hint": "Consider the first example testcase.\n\nMaximal mark is $ 10 $ , Noora received two marks — $ 8 $ and $ 9 $ , so current final mark is $ 9 $ . To fix it, Leha can add marks $ [10,10,10,10] $ ( $ 4 $ marks in total) to the registry, achieving Noora having average mark equal to ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF810A/b75d87f7c46ec7c9f8f2851b79244a71ffa349ba.png). Consequently, new final mark is $ 10 $ . Less number of marks won't fix the situation.\n\nIn the second example Leha can add $ [5,5,5] $ to the registry, so that making average mark equal to $ 4.5 $ , which is enough to have $ 5 $ in the certificate.",
    "translation": "给出一个包含n个整数的序列和目标平均数k，求出： 最少要在这个序列中加上多少个k，才能使平均数四舍五入后等于k？\n\n\n感谢@iWApD3 提供的翻译"
}