{
    "description": "The first semester ended. You know, after the end of the first semester the holidays begin. On holidays Noora decided to return to Vičkopolis. As a modest souvenir for Leha, she brought a sausage of length $ m $ from Pavlopolis. Everyone knows that any sausage can be represented as a string of lowercase English letters, the length of which is equal to the length of the sausage.\n\nLeha was very pleased with the gift and immediately ate the sausage. But then he realized that it was a quite tactless act, because the sausage was a souvenir! So the hacker immediately went to the butcher shop. Unfortunately, there was only another sausage of length $ n $ in the shop. However Leha was not upset and bought this sausage. After coming home, he decided to cut the purchased sausage into several pieces and number the pieces starting from $ 1 $ from left to right. Then he wants to select several pieces and glue them together so that the obtained sausage is equal to the sausage that Noora gave. But the hacker can glue two pieces together only when the number of the left piece is less than the number of the right piece. Besides he knows that if he glues more than $ x $ pieces, Noora will notice that he has falsified souvenir sausage and will be very upset. Of course Leha doesn’t want to upset the girl. The hacker asks you to find out whether he is able to cut the sausage he bought, and then glue some of the pieces so that Noora doesn't notice anything.\n\nFormally, you are given two strings $ s $ and $ t $ . The length of the string $ s $ is $ n $ , the length of the string $ t $ is $ m $ . It is required to select several pairwise non-intersecting substrings from $ s $ , so that their concatenation in the same order as these substrings appear in $ s $ , is equal to the string $ t $ . Denote by $ f(s,t) $ the minimal number of substrings to be chosen so that their concatenation is equal to the string $ t $ . If it is impossible to choose such substrings, then $ f(s,t)=∞ $ . Leha really wants to know whether it’s true that $ f(s,t)<=x $ .",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1<=n<=10^{5} $ ) — length of sausage bought by Leha, i.e. the length of the string $ s $ .\n\nThe second line contains string $ s $ of the length $ n $ consisting of lowercase English letters.\n\nThe third line contains single integer $ m $ ( $ 1<=m<=n $ ) — length of sausage bought by Noora, i.e. the length of the string $ t $ .\n\nThe fourth line contains string $ t $ of the length $ m $ consisting of lowercase English letters.\n\nThe fifth line contains single integer $ x $ ( $ 1<=x<=30 $ ) — the maximum number of pieces of sausage that Leha can glue so that Noora doesn’t notice anything.",
    "outputFormat": "In the only line print \"YES\" (without quotes), if Leha is able to succeed in creating new sausage so that Noora doesn't notice anything. Otherwise print \"NO\" (without quotes).",
    "samples": [
        [
            "9\nhloyaygrt\n6\nloyyrt\n3\n",
            "YES\n"
        ],
        [
            "9\nhloyaygrt\n6\nloyyrt\n2\n",
            "NO\n"
        ]
    ],
    "hint": "Let's consider the first sample.\n\nIn the optimal answer, Leha should cut the sausage he bought in the following way: hloyaygrt = h + loy + a + y + g + rt. Then he numbers received parts from $ 1 $ to $ 6 $ :\n\n- h — number $ 1 $\n- loy — number $ 2 $\n- a — number $ 3 $\n- y — number $ 4 $\n- g — number $ 5 $\n- rt — number $ 6 $\n\nHereupon the hacker should glue the parts with numbers $ 2 $ , $ 4 $ and $ 6 $ and get sausage loyygrt equal to one that is given by Noora. Thus, he will have to glue three pieces. Since $ x=3 $ you should print \"YES\" (without quotes).\n\nIn the second sample both sausages coincide with sausages from the first sample. However since $ x=2 $ you should print \"NO\" (without quotes).",
    "translation": "## 题目描述\r\n\r\n给定两个字符串s，t，长度分别为n，m。你需要选择s的若干个两两不相交的子串，然后将它们按照原先在s中出现的顺序合并起来，希望得到t。\r\n\r\n令f（s，t）表示要选择的s的子串数目，以便它们的并是串t。如果无法合理选择这样的子串，则f（s，t）=+∞。现在我们想知道，对于给定的s，t，是否有f（s，t）<=x。\r\n\r\nm<=n<=1e5，x<=30"
}