{
    "description": "Mister B once received a gift: it was a book about aliens, which he started read immediately. This book had $ c $ pages.\n\nAt first day Mister B read $ v_{0} $ pages, but after that he started to speed up. Every day, starting from the second, he read $ a $ pages more than on the previous day (at first day he read $ v_{0} $ pages, at second — $ v_{0}+a $ pages, at third — $ v_{0}+2a $ pages, and so on). But Mister B is just a human, so he physically wasn't able to read more than $ v_{1} $ pages per day.\n\nAlso, to refresh his memory, every day, starting from the second, Mister B had to reread last $ l $ pages he read on the previous day. Mister B finished the book when he read the last page for the first time.\n\nHelp Mister B to calculate how many days he needed to finish the book.",
    "inputFormat": "First and only line contains five space-separated integers: $ c $ , $ v_{0} $ , $ v_{1} $ , $ a $ and $ l $ ( $ 1<=c<=1000 $ , $ 0<=l&lt;v_{0}<=v_{1}<=1000 $ , $ 0<=a<=1000 $ ) — the length of the book in pages, the initial reading speed, the maximum reading speed, the acceleration in reading speed and the number of pages for rereading.",
    "outputFormat": "Print one integer — the number of days Mister B needed to finish the book.",
    "samples": [
        [
            "5 5 10 5 4\n",
            "1\n"
        ],
        [
            "12 4 12 4 1\n",
            "3\n"
        ],
        [
            "15 1 100 0 0\n",
            "15\n"
        ]
    ],
    "hint": "In the first sample test the book contains $ 5 $ pages, so Mister B read it right at the first day.\n\nIn the second sample test at first day Mister B read pages number $ 1-4 $ , at second day — $ 4-11 $ , at third day — $ 11-12 $ and finished the book.\n\nIn third sample test every day Mister B read $ 1 $ page of the book, so he finished in 15 days.",
    "translation": "有一本一共 $c$ 页的书，第 $i$ 天可以看 $\\min(v_0+a(i-1), v_1)$ 页。但是从第二天开始每一天都必复习前一天读的 $l$ 页。求需要多少天把书看完。\n\nTranslated by Eason_AC  \n2020.11.30"
}