{
    "description": "Arkady likes to walk around his kitchen. His labyrinthine kitchen consists of several important places connected with passages. Unfortunately it happens that these passages are flooded with milk so that it's impossible to pass through them. Namely, it's possible to pass through each passage in any direction only during some time interval.\n\nThe lengths of all passages are equal and Arkady makes through them in one second. For security reasons, Arkady can never stop, also, he can't change direction while going through a passage. In other words, if he starts walking in some passage, he should reach its end and immediately leave the end.\n\nToday Arkady needs to quickly reach important place $ n $ from place $ 1 $ . He plans to exit the place $ 1 $ at time moment $ 0 $ and reach the place $ n $ as early as he can. Please find the minimum time he should spend on his way.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n<=5·10^{5} $ , $ 0<=m<=5·10^{5} $ ) — the number of important places and the number of passages, respectively.\n\nAfter that, $ m $ lines follow, each of them describe one passage. Each line contains four integers $ a $ , $ b $ , $ l $ and $ r $ ( $ 1<=a,b<=n $ , $ a≠b $ , $ 0<=l&lt;r<=10^{9} $ ) — the places the passage connects and the time segment during which it's possible to use this passage.",
    "outputFormat": "Print one integer — minimum time Arkady should spend to reach the destination. If he can't reach the place $ n $ , print -1.",
    "samples": [
        [
            "5 6\n1 2 0 1\n2 5 2 3\n2 5 0 1\n1 3 0 1\n3 4 1 2\n4 5 2 3\n",
            "3\n"
        ],
        [
            "2 1\n1 2 1 100\n",
            "-1\n"
        ]
    ],
    "hint": "In the first example Arkady should go through important places $ 1→3→4→5 $ .\n\nIn the second example Arkady can't start his walk because at time moment $ 0 $ it's impossible to use the only passage.",
    "translation": "给定一张无向图，每条边在时间 $[l_i,r_i)$ 才能通过，通过花费 $1$ 的时间。你不能在原地停留。\n\n你在时刻 $0$ 从 $1$ 号点，求最快何时能到达 $n$ 号点。\n\n无法到达或被迫停留，输出 `-1`。"
}