{
    "description": "Okabe likes to be able to walk through his city on a path lit by street lamps. That way, he doesn't get beaten up by schoolchildren.\n\nOkabe's city is represented by a 2D grid of cells. Rows are numbered from $ 1 $ to $ n $ from top to bottom, and columns are numbered $ 1 $ to $ m $ from left to right. Exactly $ k $ cells in the city are lit by a street lamp. It's guaranteed that the top-left cell is lit.\n\nOkabe starts his walk from the top-left cell, and wants to reach the bottom-right cell. Of course, Okabe will only walk on lit cells, and he can only move to adjacent cells in the up, down, left, and right directions. However, Okabe can also temporarily light all the cells in any single row or column at a time if he pays $ 1 $ coin, allowing him to walk through some cells not lit initially.\n\nNote that Okabe can only light a single row or column at a time, and has to pay a coin every time he lights a new row or column. To change the row or column that is temporarily lit, he must stand at a cell that is lit initially. Also, once he removes his temporary light from a row or column, all cells in that row/column not initially lit are now not lit.\n\nHelp Okabe find the minimum number of coins he needs to pay to complete his walk!",
    "inputFormat": "The first line of input contains three space-separated integers $ n $ , $ m $ , and $ k $ ( $ 2<=n,m,k<=10^{4} $ ).\n\nEach of the next $ k $ lines contains two space-separated integers $ r_{i} $ and $ c_{i} $ ( $ 1<=r_{i}<=n $ , $ 1<=c_{i}<=m $ ) — the row and the column of the $ i $ -th lit cell.\n\nIt is guaranteed that all $ k $ lit cells are distinct. It is guaranteed that the top-left cell is lit.",
    "outputFormat": "Print the minimum number of coins Okabe needs to pay to complete his walk, or -1 if it's not possible.",
    "samples": [
        [
            "4 4 5\n1 1\n2 1\n2 3\n3 3\n4 3\n",
            "2\n"
        ],
        [
            "5 5 4\n1 1\n2 1\n3 1\n3 2\n",
            "-1\n"
        ],
        [
            "2 2 4\n1 1\n1 2\n2 1\n2 2\n",
            "0\n"
        ],
        [
            "5 5 4\n1 1\n2 2\n3 3\n4 4\n",
            "3\n"
        ]
    ],
    "hint": "In the first sample test, Okabe can take the path ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF821D/889fb52cd8e59d84c301f0f8e944c8435ec73245.png), paying only when moving to $ (2,3) $ and $ (4,4) $ .\n\nIn the fourth sample, Okabe can take the path ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF821D/43c065d86f3862fdd168fa32390c7090f0f90d51.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF821D/9437e98f5dfee3b86205c3722d844f74591a1a9d.png), paying when moving to $ (1,2) $ , $ (3,4) $ , and $ (5,4) $ .",
    "translation": "Okabe喜欢沿着有路灯的小路穿行城市。但是如果沿途的路灯没有点亮，在一片漆黑中，他就会被他那些跑得超级快的小伙伴抛弃。\n\nOkabe居住的苟城可以用一个二维网格表示。行从上到下编为1~N，列从左到右编为1~N。有K盏路灯是亮着的。初始时左上角的路灯已点亮。\n\nOkabe开始了他的旅程。他从左上角出发，目的地是右下角。.当然，Okabe只会经过点亮的灯，而且只能向相邻的上、下、左、右单元走。然而，Okabe也可以支出1s的寿命来暂时点亮某一行或某一列的灯，从而通过一些最初没有点亮的区域。\n\n值得注意的是，Okabe在同一时间内只能点亮某一行或某一列的路灯，且在每次点亮新的行列时都必须重新-1s。要更改临时点亮的行和列时，他必须站在一开始就亮着的地方。而当他更改时，被点亮的一整行或一整列灯会同时熄灭。\n\n由于Okabe的寿命是有限的，请帮助Okabe找出最少需要支出多少寿命来完成这次旅行。\n\n输入 输入的第一行包括三个整数n、m、k，中间用空格隔开。(2 ≤ n, m, k ≤ 104).\n\n接下来的k行，每行有两个整数 ri 和 ci (1 ≤ ri ≤ n, 1 ≤ ci ≤ m) ，表示初始时已经点亮的灯的行和列。\n\n输入保证每个被点亮的灯的坐标不重合，且左上角的灯一定是亮的。\n\n输出\n\n输出Okabe到达目的地需要支出的最少寿命。如果不可能到达，输出-1。"
}