{
    "description": "It's well known that the best way to distract from something is to do one's favourite thing. Job is such a thing for Leha.\n\nSo the hacker began to work hard in order to get rid of boredom. It means that Leha began to hack computers all over the world. For such zeal boss gave the hacker a vacation of exactly $ x $ days. You know the majority of people prefer to go somewhere for a vacation, so Leha immediately went to the travel agency. There he found out that $ n $ vouchers left. $ i $ -th voucher is characterized by three integers $ l_{i} $ , $ r_{i} $ , $ cost_{i} $ — day of departure from Vičkopolis, day of arriving back in Vičkopolis and cost of the voucher correspondingly. The duration of the $ i $ -th voucher is a value $ r_{i}-l_{i}+1 $ .\n\nAt the same time Leha wants to split his own vocation into two parts. Besides he wants to spend as little money as possible. Formally Leha wants to choose exactly two vouchers $ i $ and $ j $ $ (i≠j) $ so that they don't intersect, sum of their durations is exactly $ x $ and their total cost is as minimal as possible. Two vouchers $ i $ and $ j $ don't intersect if only at least one of the following conditions is fulfilled: $ r_{i}&lt;l_{j} $ or $ r_{j}&lt;l_{i} $ .\n\nHelp Leha to choose the necessary vouchers!",
    "inputFormat": "The first line contains two integers $ n $ and $ x $ $ (2<=n,x<=2·10^{5}) $ — the number of vouchers in the travel agency and the duration of Leha's vacation correspondingly.\n\nEach of the next $ n $ lines contains three integers $ l_{i} $ , $ r_{i} $ and $ cost_{i} $ $ (1<=l_{i}<=r_{i}<=2·10^{5},1<=cost_{i}<=10^{9}) $ — description of the voucher.",
    "outputFormat": "Print a single integer — a minimal amount of money that Leha will spend, or print $ -1 $ if it's impossible to choose two disjoint vouchers with the total duration exactly $ x $ .",
    "samples": [
        [
            "4 5\n1 3 4\n1 2 5\n5 6 1\n1 2 4\n",
            "5\n"
        ],
        [
            "3 2\n4 6 3\n2 4 1\n3 5 4\n",
            "-1\n"
        ]
    ],
    "hint": "In the first sample Leha should choose first and third vouchers. Hereupon the total duration will be equal to $ (3-1+1)+(6-5+1)=5 $ and the total cost will be $ 4+1=5 $ .\n\nIn the second sample the duration of each voucher is $ 3 $ therefore it's impossible to choose two vouchers with the total duration equal to $ 2 $ .",
    "translation": "给定  $n,m$以及  $n$个区间，区间  $i$有左端点  $l_i$右端点  $r_i$以及价值  $cost_i$。要求你选出两个区间，选出的两个区间满足下面两个条件：\n\n+ 两个区间没有交集。\n\n+ 这两个区间的长度和等于 $m$ （这里一个区间的长度是 $r_i - l_i + 1$ ）。\n\n现在要求你选出的两个区间的权值和最小，输出最小权值和。"
}