{
    "description": "Makes solves problems on Decoforces and lots of other different online judges. Each problem is denoted by its difficulty — a positive integer number. Difficulties are measured the same across all the judges (the problem with difficulty $ d $ on Decoforces is as hard as the problem with difficulty $ d $ on any other judge).\n\nMakes has chosen $ n $ problems to solve on Decoforces with difficulties $ a_{1},a_{2},...,a_{n} $ . He can solve these problems in arbitrary order. Though he can solve problem $ i $ with difficulty $ a_{i} $ only if he had already solved some problem with difficulty ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF825C/dcc3f539eeb6ae660df27e0ba4735db648eac084.png) (no matter on what online judge was it).\n\nBefore starting this chosen list of problems, Makes has already solved problems with maximum difficulty $ k $ .\n\nWith given conditions it's easy to see that Makes sometimes can't solve all the chosen problems, no matter what order he chooses. So he wants to solve some problems on other judges to finish solving problems from his list.\n\nFor every positive integer $ y $ there exist some problem with difficulty $ y $ on at least one judge besides Decoforces.\n\nMakes can solve problems on any judge at any time, it isn't necessary to do problems from the chosen list one right after another.\n\nMakes doesn't have too much free time, so he asked you to calculate the minimum number of problems he should solve on other judges in order to solve all the chosen problems from Decoforces.",
    "inputFormat": "The first line contains two integer numbers $ n $ , $ k $ ( $ 1<=n<=10^{3} $ , $ 1<=k<=10^{9} $ ).\n\nThe second line contains $ n $ space-separated integer numbers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{9} $ ).",
    "outputFormat": "Print minimum number of problems Makes should solve on other judges in order to solve all chosen problems on Decoforces.",
    "samples": [
        [
            "3 3\n2 1 9\n",
            "1\n"
        ],
        [
            "4 20\n10 3 6 3\n",
            "0\n"
        ]
    ],
    "hint": "In the first example Makes at first solves problems 1 and 2. Then in order to solve the problem with difficulty 9, he should solve problem with difficulty no less than 5. The only available are difficulties 5 and 6 on some other judge. Solving any of these will give Makes opportunity to solve problem 3.\n\nIn the second example he can solve every problem right from the start.",
    "translation": "DecoForces 上存在 $n$ 个问题，难度为 $a_1,a_2,a_3\\cdots a_n$，你已经做到了难度最高为 $k$ 的题目。\n\n现在存在两种 OJ，一个是上述的 DecoForces，一个是其他的 OJ。如果 DecoForces 没有某一难度的题目，那其他 OJ 上一定有。\n\n假设你现在做到了难度为 $k$ 的题目，那你下次可以做 $a_i\\le 2\\times k$ 的题目，做完之后 $k$ 就要更新为你做过最难的题目。\n\n你至少要在其他 OJ 上做几道题？\n\nTranslate By [Aw顿顿](https://www.luogu.com.cn/user/212283)"
}