{
    "description": "Little Vasya likes very much to play with sets consisting of positive integers. To make the game more interesting, Vasya chose $ n $ non-empty sets in such a way, that no two of them have common elements.\n\nOne day he wanted to show his friends just how interesting playing with numbers is. For that he wrote out all possible unions of two different sets on $ n·(n-1)/2 $ pieces of paper. Then he shuffled the pieces of paper. He had written out the numbers in the unions in an arbitrary order.\n\nFor example, if $ n=4 $ , and the actual sets have the following form $ {1,3} $ , $ {5} $ , $ {2,4} $ , $ {7} $ , then the number of set pairs equals to six. The six pieces of paper can contain the following numbers:\n\n- $ 2,7,4 $ .\n- $ 1,7,3 $ ;\n- $ 5,4,2 $ ;\n- $ 1,3,5 $ ;\n- $ 3,1,2,4 $ ;\n- $ 5,7 $ .\n\nThen Vasya showed the pieces of paper to his friends, but kept the $ n $ sets secret from them. His friends managed to calculate which sets Vasya had thought of in the first place. And how about you, can you restore the sets by the given pieces of paper?",
    "inputFormat": "The first input file line contains a number $ n $ ( $ 2<=n<=200 $ ), $ n $ is the number of sets at Vasya's disposal. Then follow sets of numbers from the pieces of paper written on $ n·(n-1)/2 $ lines. Each set starts with the number $ k_{i} $ ( $ 2<=k_{i}<=200 $ ), which is the number of numbers written of the $ i $ -th piece of paper, and then follow $ k_{i} $ numbers $ a_{ij} $ ( $ 1<=a_{ij}<=200 $ ). All the numbers on the lines are separated by exactly one space. It is guaranteed that the input data is constructed according to the above given rules from $ n $ non-intersecting sets.",
    "outputFormat": "Print on $ n $ lines Vasya's sets' description. The first number on the line shows how many numbers the current set has. Then the set should be recorded by listing its elements. Separate the numbers by spaces. Each number and each set should be printed exactly once. Print the sets and the numbers in the sets in any order. If there are several answers to that problem, print any of them.\n\nIt is guaranteed that there is a solution.",
    "samples": [
        [
            "4\n3 2 7 4\n3 1 7 3\n3 5 4 2\n3 1 3 5\n4 3 1 2 4\n2 5 7\n",
            "1 7 \n2 2 4 \n2 1 3 \n1 5 \n"
        ],
        [
            "4\n5 6 7 8 9 100\n4 7 8 9 1\n4 7 8 9 2\n3 1 6 100\n3 2 6 100\n2 1 2\n",
            "3 7 8 9 \n2 6 100 \n1 1 \n1 2 \n"
        ],
        [
            "3\n2 1 2\n2 1 3\n2 2 3\n",
            "1 1 \n1 2 \n1 3 \n"
        ]
    ],
    "hint": "",
    "translation": "小瓦西亚非常喜欢玩由正整数组成的集合。为了使游戏更有趣，瓦西亚选择了n个非空集，使它们中没有两个具有共同的元素。\n\n有一天，他想向他的朋友们展示玩数字是多么有趣。为此，他在n*(n-1)/2张纸片上写下了每两个不同集合之间所有可能的并集。然后他把纸片洗了一遍。之后按照任意的顺序写下了不同并集中的数字。\n\n例如，如果 n=4 ，并且实际集合的形式如下{1，3},{5},{2，4},{7}则集合对的数量等于 6。这六张纸可以包含以下数字：\n\n* 2,7,4 ;\n\n* 1,7,3 ;\n\n* 5,4,2 ;\n\n* 1 ,3,5 ;\n\n* 3,1,2,4 ;\n\n* 5,7.\n\n然后瓦西亚把这些纸片给他的朋友看，但对他们保密了原来的n个集合。他的朋友设法成功计算出瓦西亚最初想到了哪些集合。那你呢，你能用给定的纸片恢复原来的n个集合吗？\n\n### 输入格式\n\n第一个输入文件行包含一个数字 n （ 2<=n<=200），n 是瓦西亚写下的集合数。然后接下来的n*(n-1)/2行以一个数字ki开头，为第i个纸片的数字个数，接下来的ki个数字是第i个纸片上的数字，每一行的数字是由一个空格隔开，且保证输入数据是由n个非空集合按照上述规则生成的。\n\n### 输出格式\n\n输出n 行瓦西亚的集合的描述。该行上的第一个数字意义为这个集合有多少个数字。然后，应通过列出该集合的元素。每个数字用空格隔开。每个数字和每组应只打印一次。按任意顺序打印集合和集合中的数字。如果该问题有多个答案，请打印其中任何一个。 数据保证有一组解。"
}