{
    "description": "Vasya has recently developed a new algorithm to optimize the reception of customer flow and he considered the following problem.\n\nLet the queue to the cashier contain $ n $ people, at that each of them is characterized by a positive integer $ a_{i} $ — that is the time needed to work with this customer. What is special about this very cashier is that it can serve two customers simultaneously. However, if two customers need $ a_{i} $ and $ a_{j} $ of time to be served, the time needed to work with both of them customers is equal to $ max(a_{i},a_{j}) $ . Please note that working with customers is an uninterruptable process, and therefore, if two people simultaneously come to the cashier, it means that they begin to be served simultaneously, and will both finish simultaneously (it is possible that one of them will have to wait).\n\nVasya used in his algorithm an ingenious heuristic — as long as the queue has more than one person waiting, then some two people of the first three standing in front of the queue are sent simultaneously. If the queue has only one customer number $ i $ , then he goes to the cashier, and is served within $ a_{i} $ of time. Note that the total number of phases of serving a customer will always be equal to $ ⌈n/2⌉ $ .\n\nVasya thinks that this method will help to cope with the queues we all hate. That's why he asked you to work out a program that will determine the minimum time during which the whole queue will be served using this algorithm.",
    "inputFormat": "The first line of the input file contains a single number $ n $ ( $ 1<=n<=1000 $ ), which is the number of people in the sequence. The second line contains space-separated integers $ a_{1},a_{2},...,a_{n} $ ( $ 1<=a_{i}<=10^{6} $ ). The people are numbered starting from the cashier to the end of the queue.",
    "outputFormat": "Print on the first line a single number — the minimum time needed to process all $ n $ people. Then on $ ⌈n/2⌉ $ lines print the order in which customers will be served. Each line (probably, except for the last one) must contain two numbers separated by a space — the numbers of customers who will be served at the current stage of processing. If $ n $ is odd, then the last line must contain a single number — the number of the last served customer in the queue. The customers are numbered starting from $ 1 $ .",
    "samples": [
        [
            "4\n1 2 3 4\n",
            "6\n1 2\n3 4\n"
        ],
        [
            "5\n2 4 3 1 4\n",
            "8\n1 3\n2 5\n4\n"
        ]
    ],
    "hint": "",
    "translation": "一队顾客排在一位收银员前面。他采取这样一个策略：每次，假如队伍有至少两人，就会从前面的前三人（如果有）中选取两位一起收银，所花费的时间为这两人单独收银所需时间的最大值。如果只有两人，那么一起收银；如果只有一人，那么单独收银。请问所需的总时间最少是多少？"
}