{
    "description": "Polycarp has a checkered sheet of paper of size $ n×m $ . Polycarp painted some of cells with black, the others remained white. Inspired by Malevich's \"Black Square\", Polycarp wants to paint minimum possible number of white cells with black so that all black cells form a square.\n\nYou are to determine the minimum possible number of cells needed to be painted black so that the black cells form a black square with sides parallel to the painting's sides. All the cells that do not belong to the square should be white. The square's side should have positive length.",
    "inputFormat": "The first line contains two integers $ n $ and $ m $ ( $ 1<=n,m<=100 $ ) — the sizes of the sheet.\n\nThe next $ n $ lines contain $ m $ letters 'B' or 'W' each — the description of initial cells' colors. If a letter is 'B', then the corresponding cell is painted black, otherwise it is painted white.",
    "outputFormat": "Print the minimum number of cells needed to be painted black so that the black cells form a black square with sides parallel to the painting's sides. All the cells that do not belong to the square should be white. If it is impossible, print -1.",
    "samples": [
        [
            "5 4\nWWWW\nWWWB\nWWWB\nWWBB\nWWWW\n",
            "5\n"
        ],
        [
            "1 2\nBB\n",
            "-1\n"
        ],
        [
            "3 3\nWWW\nWWW\nWWW\n",
            "1\n"
        ]
    ],
    "hint": "In the first example it is needed to paint $ 5 $ cells — $ (2,2) $ , $ (2,3) $ , $ (3,2) $ , $ (3,3) $ and $ (4,2) $ . Then there will be a square with side equal to three, and the upper left corner in $ (2,2) $ .\n\nIn the second example all the cells are painted black and form a rectangle, so it's impossible to get a square.\n\nIn the third example all cells are colored white, so it's sufficient to color any cell black.",
    "translation": "有一张大小为 $n × m$ 的方格纸, 一些方格涂成了黑色，其余的保持白色。想用黑色绘制最少数量的方格，以便所有黑色方格形成一个正方形。 请你确定需要涂成黑色的方格的最小数量，以使所有黑色方格形成一个黑色正方形，其边与绘画的边平行。不属于正方形的所有单元格应为白色。"
}