{
    "description": "In Pavlopolis University where Noora studies it was decided to hold beauty contest \"Miss Pavlopolis University\". Let's describe the process of choosing the most beautiful girl in the university in more detail.\n\nThe contest is held in several stages. Suppose that exactly $ n $ girls participate in the competition initially. All the participants are divided into equal groups, $ x $ participants in each group. Furthermore the number $ x $ is chosen arbitrarily, i. e. on every stage number $ x $ can be different. Within each group the jury of the contest compares beauty of the girls in the format \"each with each\". In this way, if group consists of $ x $ girls, then ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF822D/969c596ed060cb668747b79aae52c3adc4b7f3f8.png) comparisons occur. Then, from each group, the most beautiful participant is selected. Selected girls enter the next stage of the competition. Thus if $ n $ girls were divided into groups, $ x $ participants in each group, then exactly ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF822D/8f8703916c06209ae2c6ec59180f52b09e3975b5.png) participants will enter the next stage. The contest continues until there is exactly one girl left who will be \"Miss Pavlopolis University\"\n\nBut for the jury this contest is a very tedious task. They would like to divide the girls into groups in each stage so that the total number of pairwise comparisons of the girls is as few as possible. Let $ f(n) $ be the minimal total number of comparisons that should be made to select the most beautiful participant, if we admit $ n $ girls to the first stage.\n\nThe organizers of the competition are insane. They give Noora three integers $ t $ , $ l $ and $ r $ and ask the poor girl to calculate the value of the following expression: $ t^{0}·f(l)+t^{1}·f(l+1)+...+t^{r-l}·f(r) $ . However, since the value of this expression can be quite large the organizers ask her to calculate it modulo $ 10^{9}+7 $ . If Noora can calculate the value of this expression the organizers promise her to help during the beauty contest. But the poor girl is not strong in mathematics, so she turned for help to Leha and he turned to you.",
    "inputFormat": "The first and single line contains three integers $ t $ , $ l $ and $ r $ ( $ 1<=t&lt;10^{9}+7,2<=l<=r<=5·10^{6} $ ).",
    "outputFormat": "In the first line print single integer — the value of the expression modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "2 2 4\n",
            "19\n"
        ]
    ],
    "hint": "Consider the sample.\n\nIt is necessary to find the value of ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF822D/cada51a85db8e48cf197de751d78ba932c387644.png).\n\n $ f(2)=1 $ . From two girls you can form only one group of two people, in which there will be one comparison.\n\n $ f(3)=3 $ . From three girls you can form only one group of three people, in which there will be three comparisons.\n\n $ f(4)=3 $ . From four girls you can form two groups of two girls each. Then at the first stage there will be two comparisons, one in each of the two groups. In the second stage there will be two girls and there will be one comparison between them. Total $ 2+1=3 $ comparisons. You can also leave all girls in same group in the first stage. Then ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF822D/f0bdffc4a640a3c926e3ac1b0c07f337ac1e9d1c.png) comparisons will occur. Obviously, it's better to split girls into groups in the first way.\n\nThen the value of the expression is ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF822D/766d39075b51c44c1ef841a8899d917995ced842.png).",
    "translation": "$n$个女生，进行若干论选美。选美的方式如下：\r\n\r\n- 设当前人数为$m$，选择一个正整数$x(m\\ge x>1, x\\ |\\  m)$，划分为$\\frac{m}{x}$组，每组$x$个人。\r\n\r\n- 每一组中的女生两两比较，共进行$\\frac{x\\times(x-1)}{2}$次比较。最终每一组只会有$1$名女生晋级。\r\n\r\n- 所有晋级的女生继续进行选美，直到只剩下一名女生。\r\n\r\n设初始为$n$名女生时最少的**总比较次数**为$f(n)$，求$\\sum_{i=l}^r t^{i-l}\\times f(i) \\mod (10^9+7)$。"
}