{
    "description": " ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF833C/c33d858fd2851e05374522a30a7adabbf702fc1e.png)Recently, a wild Krakozyabra appeared at Jelly Castle. It is, truth to be said, always eager to have something for dinner.\n\nIts favorite meal is natural numbers (typically served with honey sauce), or, to be more precise, the zeros in their corresponding decimal representations. As for other digits, Krakozyabra dislikes them; moreover, they often cause it indigestion! So, as a necessary precaution, Krakozyabra prefers to sort the digits of a number in non-descending order before proceeding to feast. Then, the leading zeros of the resulting number are eaten and the remaining part is discarded as an inedible tail.\n\nFor example, if Krakozyabra is to have the number $ 57040 $ for dinner, its inedible tail would be the number $ 457 $ .\n\nSlastyona is not really fond of the idea of Krakozyabra living in her castle. Hovewer, her natural hospitality prevents her from leaving her guest without food. Slastyona has a range of natural numbers from $ L $ to $ R $ , which she is going to feed the guest with. Help her determine how many distinct inedible tails are going to be discarded by Krakozyabra by the end of the dinner.",
    "inputFormat": "In the first and only string, the numbers $ L $ and $ R $ are given – the boundaries of the range $ (1<=L<=R<=10^{18}) $ .",
    "outputFormat": "Output the sole number – the answer for the problem.",
    "samples": [
        [
            "1 10\n",
            "9\n"
        ],
        [
            "40 57\n",
            "17\n"
        ],
        [
            "157 165\n",
            "9\n"
        ]
    ],
    "hint": "In the first sample case, the inedible tails are the numbers from $ 1 $ to $ 9 $ . Note that $ 10 $ and $ 1 $ have the same inedible tail – the number $ 1 $ .\n\nIn the second sample case, each number has a unique inedible tail, except for the pair $ 45,54 $ . The answer to this sample case is going to be $ (57-40+1)-1=17 $ .",
    "translation": "对一个数进行操作把这个数字按照不降序进行排列，之后把所有的前导零去掉。\n\n对 $[L,R]$ 里的数都进行操作，最后能得到多少不同的数。"
}