{
    "description": "Two boys decided to compete in text typing on the site \"Key races\". During the competition, they have to type a text consisting of $ s $ characters. The first participant types one character in $ v_{1} $ milliseconds and has ping $ t_{1} $ milliseconds. The second participant types one character in $ v_{2} $ milliseconds and has ping $ t_{2} $ milliseconds.\n\nIf connection ping (delay) is $ t $ milliseconds, the competition passes for a participant as follows:\n\n1. Exactly after $ t $ milliseconds after the start of the competition the participant receives the text to be entered.\n2. Right after that he starts to type it.\n3. Exactly $ t $ milliseconds after he ends typing all the text, the site receives information about it.\n\nThe winner is the participant whose information on the success comes earlier. If the information comes from both participants at the same time, it is considered that there is a draw.\n\nGiven the length of the text and the information about participants, determine the result of the game.",
    "inputFormat": "The first line contains five integers $ s $ , $ v_{1} $ , $ v_{2} $ , $ t_{1} $ , $ t_{2} $ ( $ 1<=s,v_{1},v_{2},t_{1},t_{2}<=1000 $ ) — the number of characters in the text, the time of typing one character for the first participant, the time of typing one character for the the second participant, the ping of the first participant and the ping of the second participant.",
    "outputFormat": "If the first participant wins, print \"First\". If the second participant wins, print \"Second\". In case of a draw print \"Friendship\".",
    "samples": [
        [
            "5 1 2 1 2\n",
            "First\n"
        ],
        [
            "3 3 1 1 1\n",
            "Second\n"
        ],
        [
            "4 5 3 1 5\n",
            "Friendship\n"
        ]
    ],
    "hint": "In the first example, information on the success of the first participant comes in $ 7 $ milliseconds, of the second participant — in $ 14 $ milliseconds. So, the first wins.\n\nIn the second example, information on the success of the first participant comes in $ 11 $ milliseconds, of the second participant — in $ 5 $ milliseconds. So, the second wins.\n\nIn the third example, information on the success of the first participant comes in $ 22 $ milliseconds, of the second participant — in $ 22 $ milliseconds. So, it is be a draw.",
    "translation": "## 题目描述\n两位参赛者参加文字输入比赛，第一位参与者在v1毫秒内输入一个字符，延迟t1毫秒。第二个参与者在v2毫秒内键入一个字符，延迟t2毫秒。 在比赛开始后的t毫秒后，参与者收到文本，之后他开始输入。在他结束输入所有文本后t毫秒，网站收到有关它的信息。所用总时间短者胜。\n## 输入\n第一行包含五个整数s，v1，v2，t1，t2（1≤s，v1，v2，t1，t2≤1000)(s为文本字符数) 输出 第一位赢输出First，第二位赢输出Second，时间相同输出Friendship \n## 输入输出样例\n### 输入样例#1：          \n5 1 2 1 2\n### 输出样例#1：\nFirst\n### 输入样例#2：          \n3 3 1 1 1\n### 输出样例#2：\nSecond\n### 输入样例#3：          \n4 5 3 1 5\n### 输出样例#3：\nFriendship\n## 说明\n在样例1中，第一个参与者用时7毫秒，第二个参与者用时14毫秒。所以，第一个胜利。 在样例2中，第一个参与者用时11毫秒，第二个参与者的参与者用时5毫秒。所以，第二个胜利。 在样例3中，第一个参与者用时22毫秒，第二个参与者用时22毫秒。所以，这是一个平局。\n\n\n翻译提供者：zxy222222"
}