{
    "description": "A game field is a strip of $ 1×n $ square cells. In some cells there are Packmen, in some cells — asterisks, other cells are empty.\n\nPackman can move to neighboring cell in $ 1 $ time unit. If there is an asterisk in the target cell then Packman eats it. Packman doesn't spend any time to eat an asterisk.\n\nIn the initial moment of time all Packmen begin to move. Each Packman can change direction of its move unlimited number of times, but it is not allowed to go beyond the boundaries of the game field. Packmen do not interfere with the movement of other packmen; in one cell there can be any number of packmen moving in any directions.\n\nYour task is to determine minimum possible time after which Packmen can eat all the asterisks.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2<=n<=10^{5} $ ) — the length of the game field.\n\nThe second line contains the description of the game field consisting of $ n $ symbols. If there is symbol '.' in position $ i $ — the cell $ i $ is empty. If there is symbol '\\*' in position $ i $ — in the cell $ i $ contains an asterisk. If there is symbol 'P' in position $ i $ — Packman is in the cell $ i $ .\n\nIt is guaranteed that on the game field there is at least one Packman and at least one asterisk.",
    "outputFormat": "Print minimum possible time after which Packmen can eat all asterisks.",
    "samples": [
        [
            "7\n*..P*P*\n",
            "3\n"
        ],
        [
            "10\n.**PP.*P.*\n",
            "2\n"
        ]
    ],
    "hint": "In the first example Packman in position $ 4 $ will move to the left and will eat asterisk in position $ 1 $ . He will spend $ 3 $ time units on it. During the same $ 3 $ time units Packman in position $ 6 $ will eat both of neighboring with it asterisks. For example, it can move to the left and eat asterisk in position $ 5 $ (in $ 1 $ time unit) and then move from the position $ 5 $ to the right and eat asterisk in the position $ 7 $ (in $ 2 $ time units). So in $ 3 $ time units Packmen will eat all asterisks on the game field.\n\nIn the second example Packman in the position $ 4 $ will move to the left and after $ 2 $ time units will eat asterisks in positions $ 3 $ and $ 2 $ . Packmen in positions $ 5 $ and $ 8 $ will move to the right and in $ 2 $ time units will eat asterisks in positions $ 7 $ and $ 10 $ , respectively. So $ 2 $ time units is enough for Packmen to eat all asterisks on the game field.",
    "translation": "输入n, 接着给你一个长度为n的字符串。 \n*代表包装, P代表人, .代表为空, 人移动一单位距离需要花费一秒，人可以向左或者向右移动。人只要走到包装的位置，就会把包装吃掉，问你最少需要多少秒。所有的包装就被人全吃完"
}