{
    "description": "Hideo Kojima has just quit his job at Konami. Now he is going to find a new place to work. Despite being such a well-known person, he still needs a CV to apply for a job.\n\nDuring all his career Hideo has produced $ n $ games. Some of them were successful, some were not. Hideo wants to remove several of them (possibly zero) from his CV to make a better impression on employers. As a result there should be no unsuccessful game which comes right after successful one in his CV.\n\nMore formally, you are given an array $ s_{1},s_{2},...,s_{n} $ of zeros and ones. Zero corresponds to an unsuccessful game, one — to a successful one. Games are given in order they were produced, and Hideo can't swap these values. He should remove some elements from this array in such a way that no zero comes right after one.\n\nBesides that, Hideo still wants to mention as much games in his CV as possible. Help this genius of a man determine the maximum number of games he can leave in his CV.",
    "inputFormat": "The first line contains one integer number $ n $ ( $ 1<=n<=100 $ ).\n\nThe second line contains $ n $ space-separated integer numbers $ s_{1},s_{2},...,s_{n} $ ( $ 0<=s_{i}<=1 $ ). $ 0 $ corresponds to an unsuccessful game, $ 1 $ — to a successful one.",
    "outputFormat": "Print one integer — the maximum number of games Hideo can leave in his CV so that no unsuccessful game comes after a successful one.",
    "samples": [
        [
            "4\n1 1 0 1\n",
            "3\n"
        ],
        [
            "6\n0 1 0 0 1 0\n",
            "4\n"
        ],
        [
            "1\n0\n",
            "1\n"
        ]
    ],
    "hint": "",
    "translation": "## 输入\n第一行：n(≥1，≤100）\n第二行：n个整数，要么是0，要么是1\n## 任务\n删除若干个数（0个也行），使得0不出现在1后面。\n## 输出\n最多剩下多少个数。\n"
}