{
    "description": "In the evening Polycarp decided to analyze his today's travel expenses on public transport.\n\nThe bus system in the capital of Berland is arranged in such a way that each bus runs along the route between two stops. Each bus has no intermediate stops. So each of the buses continuously runs along the route from one stop to the other and back. There is at most one bus running between a pair of stops.\n\nPolycarp made $ n $ trips on buses. About each trip the stop where he started the trip and the the stop where he finished are known. The trips follow in the chronological order in Polycarp's notes.\n\nIt is known that one trip on any bus costs $ a $ burles. In case when passenger makes a transshipment the cost of trip decreases to $ b $ burles ( $ b&lt;a $ ). A passenger makes a transshipment if the stop on which he boards the bus coincides with the stop where he left the previous bus. Obviously, the first trip can not be made with transshipment.\n\nFor example, if Polycarp made three consecutive trips: \"BerBank\" ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF847K/355fee5161a1808ee95ea5dc6d815d4071657131.png) \"University\", \"University\" ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF847K/355fee5161a1808ee95ea5dc6d815d4071657131.png) \"BerMall\", \"University\" ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF847K/355fee5161a1808ee95ea5dc6d815d4071657131.png) \"BerBank\", then he payed $ a+b+a=2a+b $ burles. From the BerBank he arrived to the University, where he made transshipment to the other bus and departed to the BerMall. Then he walked to the University and returned to the BerBank by bus.\n\nAlso Polycarp can buy no more than $ k $ travel cards. Each travel card costs $ f $ burles. The travel card for a single bus route makes free of charge any trip by this route (in both directions). Once purchased, a travel card can be used any number of times in any direction.\n\nWhat is the smallest amount of money Polycarp could have spent today if he can buy no more than $ k $ travel cards?",
    "inputFormat": "The first line contains five integers $ n,a,b,k,f $ ( $ 1<=n<=300 $ , $ 1<=b&lt;a<=100 $ , $ 0<=k<=300 $ , $ 1<=f<=1000 $ ) where:\n\n- $ n $ — the number of Polycarp trips,\n- $ a $ — the cost of a regualar single trip,\n- $ b $ — the cost of a trip after a transshipment,\n- $ k $ — the maximum number of travel cards Polycarp can buy,\n- $ f $ — the cost of a single travel card.\n\nThe following $ n $ lines describe the trips in the chronological order. Each line contains exactly two different words separated by a single space — the name of the start stop and the name of the finish stop of the trip. All names consist of uppercase and lowercase English letters and have lengths between $ 1 $ to $ 20 $ letters inclusive. Uppercase and lowercase letters should be considered different.",
    "outputFormat": "Print the smallest amount of money Polycarp could have spent today, if he can purchase no more than $ k $ travel cards.",
    "samples": [
        [
            "3 5 3 1 8\nBerBank University\nUniversity BerMall\nUniversity BerBank\n",
            "11\n"
        ],
        [
            "4 2 1 300 1000\na A\nA aa\naa AA\nAA a\n",
            "5\n"
        ]
    ],
    "hint": "In the first example Polycarp can buy travel card for the route \"BerBank ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF847K/020e46f55824918e845cf09cdcf9e4d7853d3223.png) University\" and spend $ 8 $ burles. Note that his second trip \"University\" ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF847K/355fee5161a1808ee95ea5dc6d815d4071657131.png) \"BerMall\" was made after transshipment, so for this trip Polycarp payed $ 3 $ burles. So the minimum total sum equals to $ 8+3=11 $ burles.\n\nIn the second example it doesn't make sense to buy travel cards. Note that each of Polycarp trip (except the first) was made with transshipment. So the minimum total sum equals to $ 2+1+1+1=5 $ burles.",
    "translation": "有 $n$ 次旅行计划，一次单程旅行的车费为 $a$，代表从下车的地方上车再到另一个地点的花费为 $b$，\n\n有特价券 $k$ 张价格为 $f$ 的特价券。特价券可以使一条 $a↔b$ 路线变成免费的，给一个旅游路线。求最小的花费。"
}