{
    "description": "The hero of our story, Valera, and his best friend Arcady are still in school, and therefore they spend all the free time playing turn-based strategy \"GAGA: Go And Go Again\". The gameplay is as follows.\n\nThere are two armies on the playing field each of which consists of $ n $ men ( $ n $ is always even). The current player specifies for each of her soldiers an enemy's soldier he will shoot (a target) and then all the player's soldiers shot simultaneously. This is a game world, and so each soldier shoots perfectly, that is he absolutely always hits the specified target. If an enemy soldier is hit, he will surely die. It may happen that several soldiers had been indicated the same target. Killed soldiers do not participate in the game anymore.\n\nThe game \"GAGA\" consists of three steps: first Valera makes a move, then Arcady, then Valera again and the game ends.\n\nYou are asked to calculate the maximum total number of soldiers that may be killed during the game.",
    "inputFormat": "The input data consist of a single integer $ n $ ( $ 2<=n<=10^{8} $ , $ n $ is even). Please note that before the game starts there are $ 2n $ soldiers on the fields.",
    "outputFormat": "Print a single number — a maximum total number of soldiers that could be killed in the course of the game in three turns.",
    "samples": [
        [
            "2\n",
            "3\n"
        ],
        [
            "4\n",
            "6\n"
        ]
    ],
    "hint": "The first sample test:\n\n1\\) Valera's soldiers 1 and 2 shoot at Arcady's soldier 1.\n\n2\\) Arcady's soldier 2 shoots at Valera's soldier 1.\n\n3\\) Valera's soldier 1 shoots at Arcady's soldier 2.\n\nThere are 3 soldiers killed in total: Valera's soldier 1 and Arcady's soldiers 1 and 2.",
    "translation": "运功场上有两支队伍，分别是 $A$、$B$ 两队，每支队伍由 $n$ 人组成（$n$ 一定是偶数），双方会进行一次互相射击（肯定能射中人，被射中的人会被杀死）。\n\n如果 $n$ 模 $4$ 等于 $0$，那么 $A$ 队、$B$ 队都还剩下$\\frac{n}{4}$ 个人。 否则，$A$ 队还剩下 $\\lfloor \\frac{n}{4}\\rfloor+1$ 个人，B队还剩下 $\\lfloor \\frac{n}{4}\\rfloor$ 个人。\n\n输出多少人被杀死了。"
}