{
    "description": "The capital of Berland looks like a rectangle of size $ n×m $ of the square blocks of same size.\n\nFire!\n\nIt is known that $ k+1 $ blocks got caught on fire ( $ k+1<=n·m $ ). Those blocks are centers of ignition. Moreover positions of $ k $ of these centers are known and one of these stays unknown. All $ k+1 $ positions are distinct.\n\nThe fire goes the following way: during the zero minute of fire only these $ k+1 $ centers of ignition are burning. Every next minute the fire goes to all neighbouring blocks to the one which is burning. You can consider blocks to burn for so long that this time exceeds the time taken in the problem. The neighbouring blocks are those that touch the current block by a side or by a corner.\n\nBerland Fire Deparment wants to estimate the minimal time it takes the fire to lighten up the whole city. Remember that the positions of $ k $ blocks (centers of ignition) are known and ( $ k+1 $ )-th can be positioned in any other block.\n\nHelp Berland Fire Department to estimate the minimal time it takes the fire to lighten up the whole city.",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=10^{9} $ , $ 1<=k<=500 $ ).\n\nEach of the next $ k $ lines contain two integers $ x_{i} $ and $ y_{i} $ ( $ 1<=x_{i}<=n $ , $ 1<=y_{i}<=m $ ) — coordinates of the $ i $ -th center of ignition. It is guaranteed that the locations of all centers of ignition are distinct.",
    "outputFormat": "Print the minimal time it takes the fire to lighten up the whole city (in minutes).",
    "samples": [
        [
            "7 7 3\n1 2\n2 1\n5 5\n",
            "3\n"
        ],
        [
            "10 5 1\n3 3\n",
            "2\n"
        ]
    ],
    "hint": "In the first example the last block can have coordinates $ (4,4) $ .\n\nIn the second example the last block can have coordinates $ (8,3) $ .",
    "translation": "有一个 $n$ 行 $m$ 列的网格。其中有 $k+1$ 个格子着火了。每个时刻，火会蔓延至相邻的格子（八联通）。现在给出其中 $k$ 个着火的格子，请确定第 $k+1$ 格子，使得网格被烧完的用时最短。\n\n你只需要输出最短用时。"
}