{
    "description": "You are given a tree with $ n $ vertices and you are allowed to perform no more than $ 2n $ transformations on it. Transformation is defined by three vertices $ x,y,y' $ and consists of deleting edge $ (x,y) $ and adding edge $ (x,y') $ . Transformation $ x,y,y' $ could be performed if all the following conditions are satisfied:\n\n1. There is an edge $ (x,y) $ in the current tree.\n2. After the transformation the graph remains a tree.\n3. After the deletion of edge $ (x,y) $ the tree would consist of two connected components. Let's denote the set of nodes in the component containing vertex $ x $ by $ V_{x} $ , and the set of nodes in the component containing vertex $ y $ by $ V_{y} $ . Then condition $ |V_{x}|&gt;|V_{y}| $ should be satisfied, i.e. the size of the component with $ x $ should be strictly larger than the size of the component with $ y $ .\n\nYou should minimize the sum of squared distances between all pairs of vertices in a tree, which you could get after no more than $ 2n $ transformations and output any sequence of transformations leading initial tree to such state.\n\nNote that you don't need to minimize the number of operations. It is necessary to minimize only the sum of the squared distances.",
    "inputFormat": "The first line of input contains integer $ n $ ( $ 1<=n<=2·10^{5} $ ) — number of vertices in tree.\n\nThe next $ n-1 $ lines of input contains integers $ a $ and $ b $ ( $ 1<=a,b<=n,a≠b $ ) — the descriptions of edges. It is guaranteed that the given edges form a tree.",
    "outputFormat": "In the first line output integer $ k $ ( $ 0<=k<=2n $ ) — the number of transformations from your example, minimizing sum of squared distances between all pairs of vertices.\n\nIn each of the next $ k $ lines output three integers $ x,y,y' $ — indices of vertices from the corresponding transformation.\n\nTransformations with $ y=y' $ are allowed (even though they don't change tree) if transformation conditions are satisfied.\n\nIf there are several possible answers, print any of them.",
    "samples": [
        [
            "3\n3 2\n1 3\n",
            "0\n"
        ],
        [
            "7\n1 2\n2 3\n3 4\n4 5\n5 6\n6 7\n",
            "2\n4 3 2\n4 5 6"
        ]
    ],
    "hint": "This is a picture for the second sample. Added edges are dark, deleted edges are dotted.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF843C/5905cec6b2c0826d6ba38e3611ad2a2ba852ba57.png)",
    "translation": "每次可以对一个树经行最多 $2n$ 次操作  $(x,y,y')$ 表示将 $(x,y)$ 删除，同时加入一条边 $(x,y')$ 。\n\n每次操作要求 ：\n\n1. 每次操作中 $(x,y)$ 存在。\n\n1. 操作后仍然是树。\n\n1. 每次删了 $(x,y)$ 时，必须保证包含 $x$ 的子树中的节点数比包含 $y$ 的节点数大。\n\n最后使得所有点距离的平方和最小。输出一种操作的方案。"
}