{
    "description": "Masha is fond of cacti. When she was a little girl, she decided to plant a tree. Now Masha wants to make a nice cactus out of her tree.\n\nRecall that tree is a connected undirected graph that has no cycles. Cactus is a connected undirected graph such that each vertex belongs to at most one cycle.\n\nMasha has some additional edges that she can add to a tree. For each edge she knows which vertices it would connect and the beauty of this edge. Masha can add some of these edges to the graph if the resulting graph is a cactus. Beauty of the resulting cactus is sum of beauties of all added edges.\n\nHelp Masha find out what maximum beauty of the resulting cactus she can achieve.",
    "inputFormat": "The first line of the input data contains two integers $ n $ and $ m $ — the number of vertices in a tree, and the number of additional edges available ( $ 3<=n<=2·10^{5} $ ; $ 0<=m<=2·10^{5} $ ).\n\nLet us describe Masha's tree. It has a root at vertex 1. The second line contains $ n-1 $ integers: $ p_{2},p_{3},...,p_{n} $ , here $ p_{i} $ — is the parent of a vertex $ i $ — the first vertex on a path from the vertex $ i $ to the root of the tree ( $ 1<=p_{i}&lt;i $ ).\n\nThe following $ m $ lines contain three integers $ u_{i} $ , $ v_{i} $ and $ c_{i} $ — pairs of vertices to be connected by the additional edges that Masha can add to the tree and beauty of edge ( $ 1<=u_{i},v_{i}<=n $ ; $ u_{i}≠v_{i} $ ; $ 1<=c_{i}<=10^{4} $ ).\n\nIt is guaranteed that no additional edge coincides with the edge of the tree.",
    "outputFormat": "Output one integer — the maximum beauty of a cactus Masha can achieve.",
    "samples": [
        [
            "7 3\n1 1 2 2 3 3\n4 5 1\n6 7 1\n2 3 1\n",
            "2\n"
        ]
    ],
    "hint": "",
    "translation": "给定一棵$n$个点的树，另有$m$条边，每条边有一个权值$c_i$，要选择一些边加入树中，使得树成为仙人掌，指每一个点至多包含于一个环的图，并使得选择的边的权值和最大，求出这个最大值。"
}