{
    "description": "After long-term research and lots of experiments leading Megapolian automobile manufacturer «AutoVoz» released a brand new car model named «Lada Malina». One of the most impressive features of «Lada Malina» is its highly efficient environment-friendly engines.\n\nConsider car as a point in $ Oxy $ plane. Car is equipped with $ k $ engines numbered from $ 1 $ to $ k $ . Each engine is defined by its velocity vector whose coordinates are $ (vx_{i},vy_{i}) $ measured in distance units per day. An engine may be turned on at any level $ w_{i} $ , that is a real number between $ -1 $ and $ +1 $ (inclusive) that result in a term of $ (w_{i}·vx_{i},w_{i}·vy_{i}) $ in the final car velocity. Namely, the final car velocity is equal to\n\n $ (w_{1}·vx_{1}+w_{2}·vx_{2}+...+w_{k}·vx_{k},  w_{1}·vy_{1}+w_{2}·vy_{2}+...+w_{k}·vy_{k}) $ Formally, if car moves with constant values of $ w_{i} $ during the whole day then its $ x $ -coordinate will change by the first component of an expression above, and its $ y $ -coordinate will change by the second component of an expression above. For example, if all $ w_{i} $ are equal to zero, the car won't move, and if all $ w_{i} $ are equal to zero except $ w_{1}=1 $ , then car will move with the velocity of the first engine.\n\nThere are $ n $ factories in Megapolia, $ i $ -th of them is located in $ (fx_{i},fy_{i}) $ . On the $ i $ -th factory there are $ a_{i} $ cars «Lada Malina» that are ready for operation.\n\nAs an attempt to increase sales of a new car, «AutoVoz» is going to hold an international exposition of cars. There are $ q $ options of exposition location and time, in the $ i $ -th of them exposition will happen in a point with coordinates $ (px_{i},py_{i}) $ in $ t_{i} $ days.\n\nOf course, at the «AutoVoz» is going to bring as much new cars from factories as possible to the place of exposition. Cars are going to be moved by enabling their engines on some certain levels, such that at the beginning of an exposition car gets exactly to the exposition location.\n\nHowever, for some of the options it may be impossible to bring cars from some of the factories to the exposition location by the moment of an exposition. Your task is to determine for each of the options of exposition location and time how many cars will be able to get there by the beginning of an exposition.",
    "inputFormat": "The first line of input contains three integers $ k,n,q $ ( $ 2<=k<=10 $ , $ 1<=n<=10^{5} $ , $ 1<=q<=10^{5} $ ), the number of engines of «Lada Malina», number of factories producing «Lada Malina» and number of options of an exposition time and location respectively.\n\nThe following $ k $ lines contain the descriptions of «Lada Malina» engines. The $ i $ -th of them contains two integers $ vx_{i} $ , $ vy_{i} $ ( $ -1000<=vx_{i},vy_{i}<=1000 $ ) defining the velocity vector of the $ i $ -th engine. Velocity vector can't be zero, i.e. at least one of $ vx_{i} $ and $ vy_{i} $ is not equal to zero. It is guaranteed that no two velosity vectors are collinear (parallel).\n\nNext $ n $ lines contain the descriptions of factories. The $ i $ -th of them contains two integers $ fx_{i} $ , $ fy_{i} $ , $ a_{i} $ ( $ -10^{9}<=fx_{i},fy_{i}<=10^{9} $ , $ 1<=a_{i}<=10^{9} $ ) defining the coordinates of the $ i $ -th factory location and the number of cars that are located there.\n\nThe following $ q $ lines contain the descriptions of the car exposition. The $ i $ -th of them contains three integers $ px_{i} $ , $ py_{i} $ , $ t_{i} $ ( $ -10^{9}<=px_{i},py_{i}<=10^{9} $ , $ 1<=t_{i}<=10^{5} $ ) defining the coordinates of the exposition location and the number of days till the exposition start in the $ i $ -th option.",
    "outputFormat": "For each possible option of the exposition output the number of cars that will be able to get to the exposition location by the moment of its beginning.",
    "samples": [
        [
            "2 4 1\n1 1\n-1 1\n2 3 1\n2 -2 1\n-2 1 1\n-2 -2 1\n0 0 2\n",
            "3\n"
        ],
        [
            "3 4 3\n2 0\n-1 1\n-1 -2\n-3 0 6\n1 -2 1\n-3 -7 3\n3 2 2\n-1 -4 1\n0 4 2\n6 0 1\n",
            "4\n9\n0\n"
        ]
    ],
    "hint": "Images describing sample tests are given below. Exposition options are denoted with crosses, factories are denoted with points. Each factory is labeled with a number of cars that it has.\n\nFirst sample test explanation:\n\n- Car from the first factory is not able to get to the exposition location in time.\n- Car from the second factory can get to the exposition in time if we set $ w_{1}=0 $ , $ w_{2}=1 $ .\n- Car from the third factory can get to the exposition in time if we set ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF853E/b110e33cbcaef784c5d5e2523b33d5d5e1c3046f.png), ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF853E/9ec5fc6256d93b8dc1d1f200c5e97cd0827148cc.png).\n- Car from the fourth factory can get to the exposition in time if we set $ w_{1}=1 $ , $ w_{2}=0 $ .\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF853E/ae012cf14fc316b913be033843d90e752e0004eb.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF853E/a39955c2e969258ea6617f727e8bf1c3b271a5c6.png)",
    "translation": "给出平面上 $n$ 个带权点 $f_i$，再给出 $k$ 个向量 $v_i$，每次询问给出一个点 $p$ 和一个值 $t$，求能满足 $f_i+∑w_jv_j=p$$(−t\\le w_j \\le t)$的 $f_i $ 的点权和。"
}