{
    "description": "This year, as in previous years, MemSQL is inviting the top 25 competitors from the Start\\[c\\]up qualification round to compete onsite for the final round. Not everyone who is eligible to compete onsite can afford to travel to the office, though. Initially the top 25 contestants are invited to come onsite. Each eligible contestant must either accept or decline the invitation. Whenever a contestant declines, the highest ranked contestant not yet invited is invited to take the place of the one that declined. This continues until 25 contestants have accepted invitations.\n\nAfter the qualifying round completes, you know $ K $ of the onsite finalists, as well as their qualifying ranks (which start at $ 1 $ , there are no ties). Determine the minimum possible number of contestants that declined the invitation to compete onsite in the final round.",
    "inputFormat": "The first line of input contains $ K $ ( $ 1<=K<=25 $ ), the number of onsite finalists you know. The second line of input contains $ r_{1},r_{2},...,r_{K} $ ( $ 1<=r_{i}<=10^{6} $ ), the qualifying ranks of the finalists you know. All these ranks are distinct.",
    "outputFormat": "Print the minimum possible number of contestants that declined the invitation to compete onsite.",
    "samples": [
        [
            "25\n2 3 4 5 6 7 8 9 10 11 12 14 15 16 17 18 19 20 21 22 23 24 25 26 28\n",
            "3\n"
        ],
        [
            "5\n16 23 8 15 4\n",
            "0\n"
        ],
        [
            "3\n14 15 92\n",
            "67\n"
        ]
    ],
    "hint": "In the first example, you know all 25 onsite finalists. The contestants who ranked $ 1 $ -st, $ 13 $ -th, and $ 27 $ -th must have declined, so the answer is $ 3 $ .",
    "translation": "描述\n\n今年，和往年一样，MemSQL正在邀请Start[c]up资格赛的排名前25的选手参加决赛。不过，并不是每个有资格参加决赛的选手都有钱去比赛地。开始时，排名前25的选手被邀请来现场参加比赛。每个有资格的参赛者都必须接受或者拒绝邀请。一个参赛者拒绝时，排名最靠前的未被邀请候选人会被邀请来以代替拒绝的那个人。这个流程持续到25个选手接受了邀请。 资格赛结束后，你知道K个入围者和他们的排名（从1开始，之间没有关系）。确定拒绝参加决赛邀请者的可能最小数目。\n输入格式\n\n输入的第一行包括K（1≤k≤25），即你得知的入围者数量。输入的第二行包括r1，r2，……，rk（1≤ri≤10^6），即你得知的入围者排名。每个人的排名都是不同的。"
}