{
    "description": "Harry, Ron and Hermione have figured out that Helga Hufflepuff's cup is a horcrux. Through her encounter with Bellatrix Lestrange, Hermione came to know that the cup is present in Bellatrix's family vault in Gringott's Wizarding Bank.\n\nThe Wizarding bank is in the form of a tree with total $ n $ vaults where each vault has some type, denoted by a number between $ 1 $ to $ m $ . A tree is an undirected connected graph with no cycles.\n\nThe vaults with the highest security are of type $ k $ , and all vaults of type $ k $ have the highest security.\n\nThere can be at most $ x $ vaults of highest security.\n\nAlso, if a vault is of the highest security, its adjacent vaults are guaranteed to not be of the highest security and their type is guaranteed to be less than $ k $ .\n\nHarry wants to consider every possibility so that he can easily find the best path to reach Bellatrix's vault. So, you have to tell him, given the tree structure of Gringotts, the number of possible ways of giving each vault a type such that the above conditions hold.",
    "inputFormat": "The first line of input contains two space separated integers, $ n $ and $ m $ — the number of vaults and the number of different vault types possible. ( $ 1<=n<=10^{5},1<=m<=10^{9} $ ).\n\nEach of the next $ n-1 $ lines contain two space separated integers $ u_{i} $ and $ v_{i} $ ( $ 1<=u_{i},v_{i}<=n $ ) representing the $ i $ -th edge, which shows there is a path between the two vaults $ u_{i} $ and $ v_{i} $ . It is guaranteed that the given graph is a tree.\n\nThe last line of input contains two integers $ k $ and $ x $ ( $ 1<=k<=m,1<=x<=10 $ ), the type of the highest security vault and the maximum possible number of vaults of highest security.",
    "outputFormat": "Output a single integer, the number of ways of giving each vault a type following the conditions modulo $ 10^{9}+7 $ .",
    "samples": [
        [
            "4 2\n1 2\n2 3\n1 4\n1 2\n",
            "1\n"
        ],
        [
            "3 3\n1 2\n1 3\n2 1\n",
            "13\n"
        ],
        [
            "3 1\n1 2\n1 3\n1 1\n",
            "0\n"
        ]
    ],
    "hint": "In test case $ 1 $ , we cannot have any vault of the highest security as its type is $ 1 $ implying that its adjacent vaults would have to have a vault type less than $ 1 $ , which is not allowed. Thus, there is only one possible combination, in which all the vaults have type $ 2 $ .",
    "translation": "### 题目描述\n\n给你一棵树，可以染 $m$ 种颜色，定义一个特殊颜色 $k$，要求保证整棵树上特殊颜色的个数不超过 $x$ 个。同时，如果一个结点是特殊颜色，那么它的相邻结点的颜色编号必须全部小于 $k$。求方案数。\n\n### 输入格式\n\n第 $1$ 行，输入两个正整数 $n,m$。\n\n第 $2 \\thicksim n$ 行，每行输入两个数 $u_{i},v_{i}$，表示在 $u_{i}$ 到 $v_{i}$ 间存在一条边。\n\n第 $n+1$ 行，输入两个正整数 $k,x$。\n\n### 说明/提示\n\n$1 \\leq n \\leq 10^5$，$1 \\leq m \\leq 10^9$；\n\n$1 \\leq k \\leq m$，$1 \\leq x \\leq 10$。\n"
}