{
    "description": "Beroffice text editor has a wide range of features that help working with text. One of the features is an automatic search for typos and suggestions of how to fix them.\n\nBeroffice works only with small English letters (i.e. with 26 letters from a to z). Beroffice thinks that a word is typed with a typo if there are three or more consonants in a row in the word. The only exception is that if the block of consonants has all letters the same, then this block (even if its length is greater than three) is not considered a typo. Formally, a word is typed with a typo if there is a block of not less that three consonants in a row, and there are at least two different letters in this block.\n\nFor example:\n\n- the following words have typos: \"hellno\", \"hackcerrs\" and \"backtothefutttture\";\n- the following words don't have typos: \"helllllooooo\", \"tobeornottobe\" and \"oooooo\".\n\nWhen Beroffice editor finds a word with a typo, it inserts as little as possible number of spaces in this word (dividing it into several words) in such a way that each of the resulting words is typed without any typos.\n\nImplement this feature of Beroffice editor. Consider the following letters as the only vowels: 'a', 'e', 'i', 'o' and 'u'. All the other letters are consonants in this problem.",
    "inputFormat": "The only line contains a non-empty word consisting of small English letters. The length of the word is between $ 1 $ and $ 3000 $ letters.",
    "outputFormat": "Print the given word without any changes if there are no typos.\n\nIf there is at least one typo in the word, insert the minimum number of spaces into the word so that each of the resulting words doesn't have any typos. If there are multiple solutions, print any of them.",
    "samples": [
        [
            "hellno\n",
            "hell no \n"
        ],
        [
            "abacaba\n",
            "abacaba \n"
        ],
        [
            "asdfasdf\n",
            "asd fasd f \n"
        ]
    ],
    "hint": "",
    "translation": "都是小写字母。\r\n\r\n给你一个字符串，如果它的子串同时满足  \r\n1、三个或以上个连着的辅音字母   \r\n2、这一段连着的辅音字母不是全部一样的   \r\n就认为它不合法\r\n\r\n现在要求用最少的空格隔开这个字符串，使得它变成合法的。"
}