{
    "description": "It's Piegirl's birthday soon, and Pieguy has decided to buy her a bouquet of flowers and a basket of chocolates.\n\nThe flower shop has $ F $ different types of flowers available. The $ i $ -th type of flower always has exactly $ p_{i} $ petals. Pieguy has decided to buy a bouquet consisting of exactly $ N $ flowers. He may buy the same type of flower multiple times. The $ N $ flowers are then arranged into a bouquet. The position of the flowers within a bouquet matters. You can think of a bouquet as an ordered list of flower types.\n\nThe chocolate shop sells chocolates in boxes. There are $ B $ different types of boxes available. The $ i $ -th type of box contains $ c_{i} $ pieces of chocolate. Pieguy can buy any number of boxes, and can buy the same type of box multiple times. He will then place these boxes into a basket. The position of the boxes within the basket matters. You can think of the basket as an ordered list of box types.\n\nPieguy knows that Piegirl likes to pluck a petal from a flower before eating each piece of chocolate. He would like to ensure that she eats the last piece of chocolate from the last box just after plucking the last petal from the last flower. That is, the total number of petals on all the flowers in the bouquet should equal the total number of pieces of chocolate in all the boxes in the basket.\n\nHow many different bouquet+basket combinations can Pieguy buy? The answer may be very large, so compute it modulo $ 1000000007=10^{9}+7 $ .",
    "inputFormat": "The first line of input will contain integers $ F $ , $ B $ , and $ N $ $ (1<=F<=10,1<=B<=100,1<=N<=10^{18}) $ , the number of types of flowers, the number of types of boxes, and the number of flowers that must go into the bouquet, respectively.\n\nThe second line of input will contain $ F $ integers $ p_{1},p_{2},...,p_{F} $ $ (1<=p_{i}<=10^{9}) $ , the numbers of petals on each of the flower types.\n\nThe third line of input will contain $ B $ integers $ c_{1},c_{2},...,c_{B} $ $ (1<=c_{i}<=250) $ , the number of pieces of chocolate in each of the box types.",
    "outputFormat": "Print the number of bouquet+basket combinations Pieguy can buy, modulo $ 1000000007=10^{9}+7 $ .",
    "samples": [
        [
            "2 3 3\n3 5\n10 3 7\n",
            "17\n"
        ],
        [
            "6 5 10\n9 3 3 4 9 9\n9 9 1 6 4\n",
            "31415926\n"
        ]
    ],
    "hint": "In the first example, there is $ 1 $ way to make a bouquet with $ 9 $ petals $ (3+3+3) $ , and $ 1 $ way to make a basket with $ 9 $ pieces of chocolate $ (3+3+3) $ , for $ 1 $ possible combination. There are $ 3 $ ways to make a bouquet with $ 13 $ petals $ (3+5+5,5+3+5,5+5+3) $ , and $ 5 $ ways to make a basket with $ 13 $ pieces of chocolate $ (3+10,10+3,3+3+7,3+7+3,7+3+3) $ , for $ 15 $ more combinations. Finally there is $ 1 $ way to make a bouquet with $ 15 $ petals $ (5+5+5) $ and $ 1 $ way to make a basket with $ 15 $ pieces of chocolate $ (3+3+3+3+3) $ , for $ 1 $ more combination.\n\nNote that it is possible for multiple types of flowers to have the same number of petals. Such types are still considered different. Similarly different types of boxes may contain the same number of pieces of chocolate, but are still considered different.",
    "translation": "给定长为 $F$ 的序列 $p$、长为 $B$ 的序列 $c$ 和整数 $N$，你需要对满足如下条件的二元组 $(f,b)$ 计数：\n- $f$ 是由 $1$ 至 $F$ 的整数组成的长为 $N$ 的序列，$b$ 是由 $1$ 至 $B$ 的整数组成的序列；\n- $\\sum\\limits_{i=1}^Np_{f_i}=\\sum\\limits_{i=1}^{|b|}c_{b_i}$，其中 $|b|$ 代表序列 $b$ 的长度。\n\n答案对 $10^9+7$ 取模。\n\nTranslated by @FZzzz "
}