{
    "description": "Dr. Evil kidnapped Mahmoud and Ehab in the evil land because of their performance in the Evil Olympiad in Informatics (EOI). He decided to give them some problems to let them go.\n\nDr. Evil is interested in sets, He has a set of $ n $ integers. Dr. Evil calls a set of integers evil if the MEX of it is exactly $ x $ . the MEX of a set of integers is the minimum non-negative integer that doesn't exist in it. For example, the MEX of the set $ {0,2,4} $ is $ 1 $ and the MEX of the set $ {1,2,3} $ is $ 0 $ .\n\nDr. Evil is going to make his set evil. To do this he can perform some operations. During each operation he can add some non-negative integer to his set or erase some element from it. What is the minimal number of operations Dr. Evil has to perform to make his set evil?",
    "inputFormat": "The first line contains two integers $ n $ and $ x $ ( $ 1<=n<=100 $ , $ 0<=x<=100 $ ) — the size of the set Dr. Evil owns, and the desired MEX.\n\nThe second line contains $ n $ distinct non-negative integers not exceeding $ 100 $ that represent the set.",
    "outputFormat": "The only line should contain one integer — the minimal number of operations Dr. Evil should perform.",
    "samples": [
        [
            "5 3\n0 4 5 6 7\n",
            "2\n"
        ],
        [
            "1 0\n0\n",
            "1\n"
        ],
        [
            "5 0\n1 2 3 4 5\n",
            "0\n"
        ]
    ],
    "hint": "For the first test case Dr. Evil should add $ 1 $ and $ 2 $ to the set performing $ 2 $ operations.\n\nFor the second test case Dr. Evil should erase $ 0 $ from the set. After that, the set becomes empty, so the MEX of it is $ 0 $ .\n\nIn the third test case the set is already evil.",
    "translation": "**题意描述**\n\n在一片邪恶之地，邪恶博士绑架了Mahmoud和Ehab，因为他们在邪恶信息学奥林匹克竞赛(Evil Olympiad in Informatics,EOI)中的突出表现。邪恶博士又决定给他们一些问题让他们回答。问题如下：\n\n邪恶博士对集合很感兴趣。他有一个包含n个整数的集合。邪恶博士认为，如果一个集合的Mex值恰好为x，那么这个集合就是邪恶的。定义Mex值为一个集合中没有出现的最小非负整数。举个例子，Mex（{0,2,4}） = 1，Mex（{1,2,3}） = 0 。\n\n邪恶博士想让他的集合变得邪恶，因此他会执行一些操作。在每个操作中他可能会加入一个非负整数，也可能删去一个数。请问最少需要多少次操作才能让邪恶博士的集合变得邪恶？\n\n**输入输出格式**\n\n**输入格式：**\n\n第一行，包括两个整数n和x，意义如上述。1<=n<=100,1<=x<=100.\n\n第二行，包括n个不同的非负整数，且每个数均不超过100，表示一开始集合中的元素。\n\n**输出格式：**\n\n仅输出一行，表示邪恶博士最少需要执行多少次操作。"
}