{
    "description": "Polycarp is in really serious trouble — his house is on fire! It's time to save the most valuable items. Polycarp estimated that it would take $ t_{i} $ seconds to save $ i $ -th item. In addition, for each item, he estimated the value of $ d_{i} $ — the moment after which the item $ i $ will be completely burned and will no longer be valuable for him at all. In particular, if $ t_{i}>=d_{i} $ , then $ i $ -th item cannot be saved.\n\nGiven the values $ p_{i} $ for each of the items, find a set of items that Polycarp can save such that the total value of this items is maximum possible. Polycarp saves the items one after another. For example, if he takes item $ a $ first, and then item $ b $ , then the item $ a $ will be saved in $ t_{a} $ seconds, and the item $ b $ — in $ t_{a}+t_{b} $ seconds after fire started.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=100 $ ) — the number of items in Polycarp's house.\n\nEach of the following $ n $ lines contains three integers $ t_{i},d_{i},p_{i} $ ( $ 1<=t_{i}<=20 $ , $ 1<=d_{i}<=2000 $ , $ 1<=p_{i}<=20 $ ) — the time needed to save the item $ i $ , the time after which the item $ i $ will burn completely and the value of item $ i $ .",
    "outputFormat": "In the first line print the maximum possible total value of the set of saved items. In the second line print one integer $ m $ — the number of items in the desired set. In the third line print $ m $ distinct integers — numbers of the saved items in the order Polycarp saves them. Items are 1-indexed in the same order in which they appear in the input. If there are several answers, print any of them.",
    "samples": [
        [
            "3\n3 7 4\n2 6 5\n3 7 6\n",
            "11\n2\n2 3 \n"
        ],
        [
            "2\n5 6 1\n3 3 5\n",
            "1\n1\n1 \n"
        ]
    ],
    "hint": "In the first example Polycarp will have time to save any two items, but in order to maximize the total value of the saved items, he must save the second and the third item. For example, he can firstly save the third item in $ 3 $ seconds, and then save the second item in another $ 2 $ seconds. Thus, the total value of the saved items will be $ 6+5=11 $ .\n\nIn the second example Polycarp can save only the first item, since even if he immediately starts saving the second item, he can save it in $ 3 $ seconds, but this item will already be completely burned by this time.",
    "translation": "### 题目描述\n\n某人的房子着火了，他想从大火中带走价值总和尽量多的物品，每次他只能带走一个，分别给出挽救某物品需要的时间 $t$，该物品开始燃烧的时间 $d$（从 $d$ 时间开始就不能再挽救该物品了），该物品的价值 $p$。\n\n### 输入格式\n\n第一行为物品总数 $n$（$1\\leqslant n\\leqslant100$）；\n\n接下来 $n$ 行，每行有三个整数 $t_i$（$1\\leqslant t_i\\leqslant20$），$di$（$1\\leqslant d_i\\leqslant2000$），$pi$（$1\\leqslant p_i\\leqslant20$）。\n\n### 输出格式\n\n第一行为能带走的最大的价值总和；\n\n第二行为能带走的物品的数量；\n\n第三行为能带走的物品的编号（按带走顺序排序）。\n\nTranslated by 凌幽"
}