{
    "description": "Petya and Vasya decided to play a game. They have $ n $ cards ( $ n $ is an even number). A single integer is written on each card.\n\nBefore the game Petya will choose an integer and after that Vasya will choose another integer (different from the number that Petya chose). During the game each player takes all the cards with number he chose. For example, if Petya chose number $ 5 $ before the game he will take all cards on which $ 5 $ is written and if Vasya chose number $ 10 $ before the game he will take all cards on which $ 10 $ is written.\n\nThe game is considered fair if Petya and Vasya can take all $ n $ cards, and the number of cards each player gets is the same.\n\nDetermine whether Petya and Vasya can choose integer numbers before the game so that the game is fair.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2<=n<=100 $ ) — number of cards. It is guaranteed that $ n $ is an even number.\n\nThe following $ n $ lines contain a sequence of integers $ a_{1},a_{2},...,a_{n} $ (one integer per line, $ 1<=a_{i}<=100 $ ) — numbers written on the $ n $ cards.",
    "outputFormat": "If it is impossible for Petya and Vasya to choose numbers in such a way that the game will be fair, print \"NO\" (without quotes) in the first line. In this case you should not print anything more.\n\nIn the other case print \"YES\" (without quotes) in the first line. In the second line print two distinct integers — number that Petya should choose and the number that Vasya should choose to make the game fair. If there are several solutions, print any of them.",
    "samples": [
        [
            "4\n11\n27\n27\n11\n",
            "YES\n11 27\n"
        ],
        [
            "2\n6\n6\n",
            "NO\n"
        ],
        [
            "6\n10\n20\n30\n20\n10\n20\n",
            "NO\n"
        ],
        [
            "6\n1\n1\n2\n2\n3\n3\n",
            "NO\n"
        ]
    ],
    "hint": "In the first example the game will be fair if, for example, Petya chooses number $ 11 $ , and Vasya chooses number $ 27 $ . Then the will take all cards — Petya will take cards $ 1 $ and $ 4 $ , and Vasya will take cards $ 2 $ and $ 3 $ . Thus, each of them will take exactly two cards.\n\nIn the second example fair game is impossible because the numbers written on the cards are equal, but the numbers that Petya and Vasya should choose should be distinct.\n\nIn the third example it is impossible to take all cards. Petya and Vasya can take at most five cards — for example, Petya can choose number $ 10 $ and Vasya can choose number $ 20 $ . But for the game to be fair it is necessary to take $ 6 $ cards.",
    "translation": "CF864A Fair Game\n\n题意: Petya和Vasya决定玩一个游戏,他们有偶数张卡片,每张卡片上一个数字.每人选择一个数字(两个人选择的数字不能相同),选择了该数字就意味着需要把写有这个数字的所有卡片都拿走.Petya和Vasya认为,这个游戏是公平的,当仅当两个人可以拿走全部的卡片并且两人拿走的卡片数相同,否则这个游戏就是不公平的. \n\n读入: 第一行:卡片数量n(2<=n<=100),接下来n行每行一个数字表示第i张卡片上的数字\n\n输出: 第一行表示游戏是否公平,公平输出YES,不公平输出NO;若游戏公平,第二行输出两个数字表示Petya和Vasya分别选择的数字 \n\nTranslated by 凌幽"
}