{
    "description": "Polycarp loves lowercase letters and dislikes uppercase ones. Once he got a string $ s $ consisting only of lowercase and uppercase Latin letters.\n\nLet $ A $ be a set of positions in the string. Let's call it pretty if following conditions are met:\n\n- letters on positions from $ A $ in the string are all distinct and lowercase;\n- there are no uppercase letters in the string which are situated between positions from $ A $ (i.e. there is no such $ j $ that $ s[j] $ is an uppercase letter, and $ a_{1}<j<a_{2} $ for some $ a_{1} $ and $ a_{2} $ from $ A $ ).\n\nWrite a program that will determine the maximum number of elements in a pretty set of positions.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=200 $ ) — length of string $ s $ .\n\nThe second line contains a string $ s $ consisting of lowercase and uppercase Latin letters.",
    "outputFormat": "Print maximum number of elements in pretty set of positions for string $ s $ .",
    "samples": [
        [
            "11\naaaaBaabAbA\n",
            "2\n"
        ],
        [
            "12\nzACaAbbaazzC\n",
            "3\n"
        ],
        [
            "3\nABC\n",
            "0\n"
        ]
    ],
    "hint": "In the first example the desired positions might be $ 6 $ and $ 8 $ or $ 7 $ and $ 8 $ . Positions $ 6 $ and $ 7 $ contain letters 'a', position $ 8 $ contains letter 'b'. The pair of positions $ 1 $ and $ 8 $ is not suitable because there is an uppercase letter 'B' between these position.\n\nIn the second example desired positions can be $ 7 $ , $ 8 $ and $ 11 $ . There are other ways to choose pretty set consisting of three elements.\n\nIn the third example the given string $ s $ does not contain any lowercase letters, so the answer is $ 0 $ .",
    "translation": "题意: \n    已知一个只包含大写字母和小写字母的字符串s.现在有这样一个集合:它可以包含字符串中不同小写字母的位置,但是这些位置中任意两个之间不能有大写字母.现在请你写一个程序求集合最大时的大小. \n输入:\n    第一行一个整数n(1<=n<=200),表示字符串的长度 \n    第二行一个字符串s \n输出:\n    这个集合最大时的大小 \n\nTranslated by 凌幽"
}