{
    "description": "Recently, Dima met with Sasha in a philatelic store, and since then they are collecting coins together. Their favorite occupation is to sort collections of coins. Sasha likes having things in order, that is why he wants his coins to be arranged in a row in such a way that firstly come coins out of circulation, and then come coins still in circulation.\n\nFor arranging coins Dima uses the following algorithm. One step of his algorithm looks like the following:\n\n1. He looks through all the coins from left to right;\n2. If he sees that the $ i $ -th coin is still in circulation, and $ (i+1) $ -th coin is already out of circulation, he exchanges these two coins and continues watching coins from $ (i+1) $ -th.\n\nDima repeats the procedure above until it happens that no two coins were exchanged during this procedure. Dima calls hardness of ordering the number of steps required for him according to the algorithm above to sort the sequence, e.g. the number of times he looks through the coins from the very beginning. For example, for the ordered sequence hardness of ordering equals one.\n\nToday Sasha invited Dima and proposed him a game. First he puts $ n $ coins in a row, all of them are out of circulation. Then Sasha chooses one of the coins out of circulation and replaces it with a coin in circulation for $ n $ times. During this process Sasha constantly asks Dima what is the hardness of ordering of the sequence.\n\nThe task is more complicated because Dima should not touch the coins and he should determine hardness of ordering in his mind. Help Dima with this task.",
    "inputFormat": "The first line contains single integer $ n $ ( $ 1<=n<=300000 $ ) — number of coins that Sasha puts behind Dima.\n\nSecond line contains $ n $ distinct integers $ p_{1},p_{2},...,p_{n} $ ( $ 1<=p_{i}<=n $ ) — positions that Sasha puts coins in circulation to. At first Sasha replaces coin located at position $ p_{1} $ , then coin located at position $ p_{2} $ and so on. Coins are numbered from left to right.",
    "outputFormat": "Print $ n+1 $ numbers $ a_{0},a_{1},...,a_{n} $ , where $ a_{0} $ is a hardness of ordering at the beginning, $ a_{1} $ is a hardness of ordering after the first replacement and so on.",
    "samples": [
        [
            "4\n1 3 4 2\n",
            "1 2 3 2 1\n"
        ],
        [
            "8\n6 8 3 4 7 2 1 5\n",
            "1 2 2 3 4 3 4 5 1\n"
        ]
    ],
    "hint": "Let's denote as O coin out of circulation, and as X — coin is circulation.\n\nAt the first sample, initially in row there are coins that are not in circulation, so Dima will look through them from left to right and won't make any exchanges.\n\nAfter replacement of the first coin with a coin in circulation, Dima will exchange this coin with next three times and after that he will finally look through the coins and finish the process.\n\nXOOO $ → $ OOOX\n\nAfter replacement of the third coin, Dima's actions look this way:\n\nXOXO $ → $ OXOX $ → $ OOXX\n\nAfter replacement of the fourth coin, Dima's actions look this way:\n\nXOXX $ → $ OXXX\n\nFinally, after replacement of the second coin, row becomes consisting of coins that are in circulation and Dima will look through coins from left to right without any exchanges.",
    "translation": "## 题意\n\n现有 $n(1\\le n\\le 3\\times 10^5)$ 枚硬币，对其进行如下操作：\n\n1. 从第 $1$ 枚硬币向第 $n$ 枚顺次遍历。\n2. 若第 $i$ 枚硬币反面朝上且第 $i+1$ 枚正面朝上，交换这两枚硬币的位置。\n\n重复以上操作直到没有发生交换。\n\n开始时，所有硬币都正面朝上。给出 $n$ 次修改，第 $i$ 次修改是在第 $i-1$ 次修改的初状态（即操作前）的基础上将第 $p_i(\\{p_1,p_2,\\ldots,p_n\\}=\\{1,2,\\ldots,n\\})$ 枚硬币从正面朝上翻转为反面朝上，每次修改（包括第 $0$ 次）后请求出操作次数。"
}