{
    "description": "In Ann's favorite book shop are as many as $ n $ books on math and economics. Books are numbered from $ 1 $ to $ n $ . Each of them contains non-negative number of problems.\n\nToday there is a sale: any subsegment of a segment from $ l $ to $ r $ can be bought at a fixed price.\n\nAnn decided that she wants to buy such non-empty subsegment that the sale operates on it and the number of math problems is greater than the number of economics problems exactly by $ k $ . Note that $ k $ may be positive, negative or zero.\n\nUnfortunately, Ann is not sure on which segment the sale operates, but she has $ q $ assumptions. For each of them she wants to know the number of options to buy a subsegment satisfying the condition (because the time she spends on choosing depends on that).\n\nCurrently Ann is too busy solving other problems, she asks you for help. For each her assumption determine the number of subsegments of the given segment such that the number of math problems is greaten than the number of economics problems on that subsegment exactly by $ k $ .",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1<=n<=100000 $ , $ -10^{9}<=k<=10^{9} $ ) — the number of books and the needed difference between the number of math problems and the number of economics problems.\n\nThe second line contains $ n $ integers $ t_{1},t_{2},...,t_{n} $ ( $ 1<=t_{i}<=2 $ ), where $ t_{i} $ is $ 1 $ if the $ i $ -th book is on math or $ 2 $ if the $ i $ -th is on economics.\n\nThe third line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ 0<=a_{i}<=10^{9} $ ), where $ a_{i} $ is the number of problems in the $ i $ -th book.\n\nThe fourth line contains a single integer $ q $ ( $ 1<=q<=100000 $ ) — the number of assumptions.\n\nEach of the next $ q $ lines contains two integers $ l_{i} $ and $ r_{i} $ ( $ 1<=l_{i}<=r_{i}<=n $ ) describing the $ i $ -th Ann's assumption.",
    "outputFormat": "Print $ q $ lines, in the $ i $ -th of them print the number of subsegments for the $ i $ -th Ann's assumption.",
    "samples": [
        [
            "4 1\n1 1 1 2\n1 1 1 1\n4\n1 2\n1 3\n1 4\n3 4\n",
            "2\n3\n4\n1\n"
        ],
        [
            "4 0\n1 2 1 2\n0 0 0 0\n1\n1 4\n",
            "10\n"
        ]
    ],
    "hint": "In the first sample Ann can buy subsegments $ [1;1],[2;2],[3;3],[2;4] $ if they fall into the sales segment, because the number of math problems is greater by $ 1 $ on them that the number of economics problems. So we should count for each assumption the number of these subsegments that are subsegments of the given segment.\n\nSegments $ [1;1] $ and $ [2;2] $ are subsegments of $ [1;2] $ .\n\nSegments $ [1;1],[2;2] $ and $ [3;3] $ are subsegments of $ [1;3] $ .\n\nSegments $ [1;1],[2;2],[3;3],[2;4] $ are subsegments of $ [1;4] $ .\n\nSegment $ [3;3] $ is subsegment of $ [3;4] $ .",
    "translation": "商店里有 $n$ 本书，每本书中有 $a_i$ 个 $t_i=1/2$ 类问题。\n\n有 $q$ 次询问，每次询问给出一个区间，求有多少个符合下列条件的区间:\n\n+ 这个区间是给出区间的子区间\n\n+ 这个区间的所有书中第 $1$ 类问题比第 $2$ 类问题多 $k$ 个，其中 $k$ 在所有询问中相同。"
}