{
    "description": "Petya learned a new programming language CALPAS. A program in this language always takes one non-negative integer and returns one non-negative integer as well.\n\nIn the language, there are only three commands: apply a bitwise operation AND, OR or XOR with a given constant to the current integer. A program can contain an arbitrary sequence of these operations with arbitrary constants from $ 0 $ to $ 1023 $ . When the program is run, all operations are applied (in the given order) to the argument and in the end the result integer is returned.\n\nPetya wrote a program in this language, but it turned out to be too long. Write a program in CALPAS that does the same thing as the Petya's program, and consists of no more than $ 5 $ lines. Your program should return the same integer as Petya's program for all arguments from $ 0 $ to $ 1023 $ .",
    "inputFormat": "The first line contains an integer $ n $ ( $ 1<=n<=5·10^{5} $ ) — the number of lines.\n\nNext $ n $ lines contain commands. A command consists of a character that represents the operation (\"&\", \"|\" or \"^\" for AND, OR or XOR respectively), and the constant $ x_{i} $ $ 0<=x_{i}<=1023 $ .",
    "outputFormat": "Output an integer $ k $ ( $ 0<=k<=5 $ ) — the length of your program.\n\nNext $ k $ lines must contain commands in the same format as in the input.",
    "samples": [
        [
            "3\n| 3\n^ 2\n| 1\n",
            "2\n| 3\n^ 2\n"
        ],
        [
            "3\n&amp; 1\n&amp; 3\n&amp; 5\n",
            "1\n&amp; 1\n"
        ],
        [
            "3\n^ 1\n^ 2\n^ 3\n",
            "0\n"
        ]
    ],
    "hint": "You can read about bitwise operations in [https://en.wikipedia.org/wiki/Bitwise\\_operation](https://en.wikipedia.org/wiki/Bitwise_operation).\n\nSecond sample:\n\nLet $ x $ be an input of the Petya's program. It's output is $ ((x&amp;1)&amp;3)&amp;5=x&amp;(1&amp;3&amp;5)=x&amp;1 $ . So these two programs always give the same outputs.",
    "translation": "Petya学习了一种新的编程语言CALPAS。在这种语言中，程序总是接受一个非负整数，并返回一个非负整数。在该语言中，只有三个命令：对当前整数应用按位操作AND、OR或XOR(给定常量)。程序可以包含从0到1023 1023之间的任意常量的这些操作的任意序列。当程序运行时，所有操作(按给定顺序)应用于参数，最后返回结果整数。Petya用这种语言写了一个程序，但结果太长了。用CALPAS编写一个与Petya程序相同的程序，该程序由不超过5行的代码组成。对于从0到1023 1023的所有参数，您的程序应该返回与Petya程序相同的整数。"
}