{
    "description": "Masha's little brother draw two points on a sheet of paper. After that, he draws some circles and gave the sheet to his sister.\n\nMasha has just returned from geometry lesson so she instantly noticed some interesting facts about brother's drawing.\n\nAt first, the line going through two points, that brother drew, doesn't intersect or touch any circle.\n\nAlso, no two circles intersect or touch, and there is no pair of circles such that one circle is located inside another.\n\nMoreover, for each circle, Masha drew a square of the minimal area with sides parallel axis such that this circle is located inside the square and noticed that there is no two squares intersect or touch and there is no pair of squares such that one square is located inside other.\n\nNow Masha wants to draw circle of minimal possible radius such that it goes through two points that brother drew and doesn't intersect any other circle, but other circles can touch Masha's circle and can be located inside it.\n\nIt's guaranteed, that answer won't exceed $ 10^{12} $ . It should be held for hacks as well.",
    "inputFormat": "First line contains four integers $ x1 $ , $ y1 $ , $ x2 $ , $ y2 $ ( $ -10^{5}<=x1,y1,x2,y2<=10^{5} $ ) — coordinates of points that brother drew. First point has coordinates ( $ x1 $ , $ y1 $ ) and second point has coordinates ( $ x2 $ , $ y2 $ ). These two points are different.\n\nThe second line contains single integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of circles that brother drew.\n\nNext $ n $ lines contains descriptions of circles. Each line contains three integers $ x_{i} $ , $ y_{i} $ , $ r_{i} $ ( $ -10^{5}<=x_{i},y_{i}<=10^{5} $ , $ 1<=r_{i}<=10^{5} $ ) describing circle with center ( $ x_{i} $ , $ y_{i} $ ) and radius $ r_{i} $ .",
    "outputFormat": "Output smallest real number, that it's possible to draw a circle with such radius through given points in such a way that it doesn't intersect other circles.\n\nThe output is considered correct if it has a relative or absolute error of at most $ 10^{-4} $ .",
    "samples": [
        [
            "2 4 7 13\n3\n3 0 1\n12 4 2\n-4 14 2\n",
            "5.1478150705"
        ],
        [
            "-2 3 10 -10\n2\n7 0 3\n-5 -5 2\n",
            "9.1481831923"
        ]
    ],
    "hint": "![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF887E/c56ab2a2cf4434792fa48955a8bcd4695bbfb437.png)![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF887E/a5776f5def7ef4a4aa8e3a9f35c33da2f858ab42.png)",
    "translation": "有$n$个圆和一条线段，保证圆与圆、圆与线段所在直线不相交，不相切，不包含。求过线段两端点且不与其他圆相交（可以相切）的圆的最小半径"
}