{
    "description": "Evlampiy has found one more cool application to process photos. However the application has certain limitations.\n\nEach photo $ i $ has a contrast $ v_{i} $ . In order for the processing to be truly of high quality, the application must receive at least $ k $ photos with contrasts which differ as little as possible.\n\nEvlampiy already knows the contrast $ v_{i} $ for each of his $ n $ photos. Now he wants to split the photos into groups, so that each group contains at least $ k $ photos. As a result, each photo must belong to exactly one group.\n\nHe considers a processing time of the $ j $ -th group to be the difference between the maximum and minimum values of $ v_{i} $ in the group. Because of multithreading the processing time of a division into groups is the maximum processing time among all groups.\n\nSplit $ n $ photos into groups in a such way that the processing time of the division is the minimum possible, i.e. that the the maximum processing time over all groups as least as possible.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1<=k<=n<=3·10^{5} $ ) — number of photos and minimum size of a group.\n\nThe second line contains $ n $ integers $ v_{1},v_{2},...,v_{n} $ ( $ 1<=v_{i}<=10^{9} $ ), where $ v_{i} $ is the contrast of the $ i $ -th photo.",
    "outputFormat": "Print the minimal processing time of the division into groups.",
    "samples": [
        [
            "5 2\n50 110 130 40 120\n",
            "20\n"
        ],
        [
            "4 1\n2 3 4 1\n",
            "0\n"
        ]
    ],
    "hint": "In the first example the photos should be split into 2 groups: $ [40,50] $ and $ [110,120,130] $ . The processing time of the first group is $ 10 $ , and the processing time of the second group is $ 20 $ . Maximum among $ 10 $ and $ 20 $ is $ 20 $ . It is impossible to split the photos into groups in a such way that the processing time of division is less than $ 20 $ .\n\nIn the second example the photos should be split into four groups, each containing one photo. So the minimal possible processing time of a division is $ 0 $ .",
    "translation": "给出n个数，让你分组，每组最少m个\n规定每组的价值是组里面最大数-最小数\n要求使得最大价值最小\nn,m<=3*10^5\n"
}