{
    "description": "This is an interactive problem. Refer to the Interaction section below for better understanding.\n\nIthea and Chtholly want to play a game in order to determine who can use the kitchen tonight.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF896B/ebd88a49a2a132acb0c645722b8cb8c3d385dabb.png)\n\nInitially, Ithea puts $ n $ clear sheets of paper in a line. They are numbered from $ 1 $ to $ n $ from left to right.\n\nThis game will go on for $ m $ rounds. In each round, Ithea will give Chtholly an integer between $ 1 $ and $ c $ , and Chtholly needs to choose one of the sheets to write down this number (if there is already a number before, she will erase the original one and replace it with the new one).\n\nChtholly wins if, at any time, all the sheets are filled with a number and the $ n $ numbers are in non-decreasing order looking from left to right from sheet $ 1 $ to sheet $ n $ , and if after $ m $ rounds she still doesn't win, she loses the game.\n\nChtholly really wants to win the game as she wants to cook something for Willem. But she doesn't know how to win the game. So Chtholly finds you, and your task is to write a program to receive numbers that Ithea gives Chtholly and help her make the decision on which sheet of paper write this number.",
    "inputFormat": "The first line contains 3 integers $ n,m $ and $ c $ (![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF896B/6fe2bd15e021b147fb5005407a27f05417b03766.png), ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF896B/c34b3ba4302b2b19ef11096468acf388bbd18e1a.png) means ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF896B/fbefa1eb921505114a7a65d81fd21128ae1cf083.png) rounded up) — the number of sheets, the number of rounds and the largest possible number Ithea can give to Chtholly respectively. The remaining parts of input are given throughout the interaction process.",
    "outputFormat": "In each round, your program needs to read one line containing a single integer $ p_{i} $ ( $ 1<=p_{i}<=c $ ), indicating the number given to Chtholly.\n\nYour program should then output a line containing an integer between $ 1 $ and $ n $ , indicating the number of sheet to write down this number in.\n\nAfter outputting each line, don't forget to flush the output. For example:\n\n- fflush(stdout) in C/C++;\n- System.out.flush() in Java;\n- sys.stdout.flush() in Python;\n- flush(output) in Pascal;\n- See the documentation for other languages.\n\nIf Chtholly wins at the end of a round, no more input will become available and your program should terminate normally. It can be shown that under the constraints, it's always possible for Chtholly to win the game.",
    "samples": [
        [
            "2 4 4\n2\n1\n3\n",
            "1\n2\n2\n"
        ]
    ],
    "hint": "In the example, Chtholly initially knew there were $ 2 $ sheets, $ 4 $ rounds and each number was between $ 1 $ and $ 4 $ . She then received a $ 2 $ and decided to write it in the $ 1 $ st sheet. Then she received a $ 1 $ and wrote it in the $ 2 $ nd sheet. At last, she received a $ 3 $ and replaced $ 1 $ with $ 3 $ in the $ 2 $ nd sheet. At this time all the sheets were filled with a number and they were non-decreasing, so she won the game.\n\nNote that it is required that your program terminate immediately after Chtholly wins and do not read numbers from the input for the remaining rounds. If not, undefined behaviour may arise and it won't be sure whether your program will be accepted or rejected. Also because of this, please be careful when hacking others' codes. In the sample, Chtholly won the game after the $ 3 $ rd round, so it is required that your program doesn't read the number of the remaining $ 4 $ th round.\n\nThe input format for hacking:\n\n- The first line contains 3 integers $ n,m $ and $ c $ ;\n- The following $ m $ lines each contains an integer between $ 1 $ and $ c $ , indicating the number given to Chtholly in each round.",
    "translation": "这是一道交互题，请在每次输出之后根据题目中的说法清空输出。\n桌子上面摆着n张纸。给你m个不超过c的数，你每次可以把所获得的数写在一张纸上或者替换掉某一张纸上写的数。任何时候，如果所有纸上都写了数字并且成非降序排列，你就赢了，直接结束程序。\n每当你获得一个数，你输出将它写在哪张纸上。输入数据保证一定有解。"
}