{
    "description": "Vova promised himself that he would never play computer games... But recently Firestorm — a well-known game developing company — published their newest game, World of Farcraft, and it became really popular. Of course, Vova started playing it.\n\nNow he tries to solve a quest. The task is to come to a settlement named Overcity and spread a rumor in it.\n\nVova knows that there are $ n $ characters in Overcity. Some characters are friends to each other, and they share information they got. Also Vova knows that he can bribe each character so he or she starts spreading the rumor; $ i $ -th character wants $ c_{i} $ gold in exchange for spreading the rumor. When a character hears the rumor, he tells it to all his friends, and they start spreading the rumor to their friends (for free), and so on.\n\nThe quest is finished when all $ n $ characters know the rumor. What is the minimum amount of gold Vova needs to spend in order to finish the quest?\n\nTake a look at the notes if you think you haven't understood the problem completely.",
    "inputFormat": "The first line contains two integer numbers $ n $ and $ m $ ( $ 1<=n<=10^{5},0<=m<=10^{5} $ ) — the number of characters in Overcity and the number of pairs of friends.\n\nThe second line contains $ n $ integer numbers $ c_{i} $ ( $ 0<=c_{i}<=10^{9} $ ) — the amount of gold $ i $ -th character asks to start spreading the rumor.\n\nThen $ m $ lines follow, each containing a pair of numbers ( $ x_{i},y_{i} $ ) which represent that characters $ x_{i} $ and $ y_{i} $ are friends ( $ 1<=x_{i},y_{i}<=n $ , $ x_{i}≠y_{i} $ ). It is guaranteed that each pair is listed at most once.",
    "outputFormat": "Print one number — the minimum amount of gold Vova has to spend in order to finish the quest.",
    "samples": [
        [
            "5 2\n2 5 3 4 8\n1 4\n4 5\n",
            "10\n"
        ],
        [
            "10 0\n1 2 3 4 5 6 7 8 9 10\n",
            "55\n"
        ],
        [
            "10 5\n1 6 2 7 3 8 4 9 5 10\n1 2\n3 4\n5 6\n7 8\n9 10\n",
            "15\n"
        ]
    ],
    "hint": "In the first example the best decision is to bribe the first character (he will spread the rumor to fourth character, and the fourth one will spread it to fifth). Also Vova has to bribe the second and the third characters, so they know the rumor.\n\nIn the second example Vova has to bribe everyone.\n\nIn the third example the optimal decision is to bribe the first, the third, the fifth, the seventh and the ninth characters.",
    "translation": "有n个人，其中有m对朋友，现在你有一个秘密你想告诉所有人，第i个人愿意出价a[i]买你的秘密，获得秘密的人会免费告诉它的所有朋友（他朋友的朋友也会免费知道），现在他们想出最少的价钱买秘密，那么你最少能得到多少钱？"
}