{
    "description": "Ann and Borya have $ n $ piles with candies and $ n $ is even number. There are $ a_{i} $ candies in pile with number $ i $ .\n\nAnn likes numbers which are square of some integer and Borya doesn't like numbers which are square of any integer. During one move guys can select some pile with candies and add one candy to it (this candy is new and doesn't belong to any other pile) or remove one candy (if there is at least one candy in this pile).\n\nFind out minimal number of moves that is required to make exactly $ n/2 $ piles contain number of candies that is a square of some integer and exactly $ n/2 $ piles contain number of candies that is not a square of any integer.",
    "inputFormat": "First line contains one even integer $ n $ ( $ 2<=n<=200000 $ ) — number of piles with candies.\n\nSecond line contains sequence of integers $ a_{1},a_{2},...,a_{n} $ ( $ 0<=a_{i}<=10^{9} $ ) — amounts of candies in each pile.",
    "outputFormat": "Output minimal number of steps required to make exactly $ n/2 $ piles contain number of candies that is a square of some integer and exactly $ n/2 $ piles contain number of candies that is not a square of any integer. If condition is already satisfied output 0.",
    "samples": [
        [
            "4\n12 14 30 4\n",
            "2\n"
        ],
        [
            "6\n0 0 0 0 0 0\n",
            "6\n"
        ],
        [
            "6\n120 110 23 34 25 45\n",
            "3\n"
        ],
        [
            "10\n121 56 78 81 45 100 1 0 54 78\n",
            "0\n"
        ]
    ],
    "hint": "In first example you can satisfy condition in two moves. During each move you should add one candy to second pile. After it size of second pile becomes $ 16 $ . After that Borya and Ann will have two piles with number of candies which is a square of integer (second and fourth pile) and two piles with number of candies which is not a square of any integer (first and third pile).\n\nIn second example you should add two candies to any three piles.",
    "translation": "Ann和Borya有n堆糖果并且n是偶数。第i堆糖果里有a[i]个糖果\r\n\r\nAnn喜欢完全平方数但Borya不喜欢。每次操作可以在一堆糖果中加上或减少一个糖果。糖果数不可以是负数。\r\n\r\n输出最小操作次数使得n堆糖果中有恰好n/2堆的糖果数是完全平方数"
}