{
    "description": "Alex, Bob and Carl will soon participate in a team chess tournament. Since they are all in the same team, they have decided to practise really hard before the tournament. But it's a bit difficult for them because chess is a game for two players, not three.\n\nSo they play with each other according to following rules:\n\n- Alex and Bob play the first game, and Carl is spectating;\n- When the game ends, the one who lost the game becomes the spectator in the next game, and the one who was spectating plays against the winner.\n\nAlex, Bob and Carl play in such a way that there are no draws.\n\nToday they have played $ n $ games, and for each of these games they remember who was the winner. They decided to make up a log of games describing who won each game. But now they doubt if the information in the log is correct, and they want to know if the situation described in the log they made up was possible (that is, no game is won by someone who is spectating if Alex, Bob and Carl play according to the rules). Help them to check it!",
    "inputFormat": "The first line contains one integer $ n $ ( $ 1<=n<=100 $ ) — the number of games Alex, Bob and Carl played.\n\nThen $ n $ lines follow, describing the game log. $ i $ -th line contains one integer $ a_{i} $ ( $ 1<=a_{i}<=3 $ ) which is equal to $ 1 $ if Alex won $ i $ -th game, to $ 2 $ if Bob won $ i $ -th game and $ 3 $ if Carl won $ i $ -th game.",
    "outputFormat": "Print YES if the situation described in the log was possible. Otherwise print NO.",
    "samples": [
        [
            "3\n1\n1\n2\n",
            "YES\n"
        ],
        [
            "2\n1\n2\n",
            "NO\n"
        ]
    ],
    "hint": "In the first example the possible situation is:\n\n1. Alex wins, Carl starts playing instead of Bob;\n2. Alex wins, Bob replaces Carl;\n3. Bob wins.\n\nThe situation in the second example is impossible because Bob loses the first game, so he cannot win the second one.",
    "translation": "## 题目描述\nA，B，C 三人下棋，A和B先下，每次下完棋之后由现在观战的人（例如第一局就由C）代替下输的人。\n每次输入一个数表示谁赢了（A是1，B是2，C是3），如果每一次输入的赢家都不是当时旁观者，则输出 “YES”，否则输出“NO”。\n## 输入输出格式\n**输入格式：**\n第一行输入正整数n（n≤100），表示比赛局数。\n接下来n行，每一行输入一个正整数ai（1≤ai≤3），表示此局赢家\n\n**输出格式：**\n如果此过程中不存在旁观者胜利，则输出“YES”，否则输出“NO”。（没有引号）\n## 说明\n第一个样例顺序：  \nA:B，A胜  \nA:C，A胜   \nA:B，B胜 \n\n第二个样例B输了第一场，可是他第二场赢了，矛盾，输出“NO”。"
}