{
    "description": "There are $ n $ shovels in Polycarp's shop. The $ i $ -th shovel costs $ i $ burles, that is, the first shovel costs $ 1 $ burle, the second shovel costs $ 2 $ burles, the third shovel costs $ 3 $ burles, and so on. Polycarps wants to sell shovels in pairs.\n\nVisitors are more likely to buy a pair of shovels if their total cost ends with several $ 9 $ s. Because of this, Polycarp wants to choose a pair of shovels to sell in such a way that the sum of their costs ends with maximum possible number of nines. For example, if he chooses shovels with costs $ 12345 $ and $ 37454 $ , their total cost is $ 49799 $ , it ends with two nines.\n\nYou are to compute the number of pairs of shovels such that their total cost ends with maximum possible number of nines. Two pairs are considered different if there is a shovel presented in one pair, but not in the other.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2<=n<=10^{9} $ ) — the number of shovels in Polycarp's shop.",
    "outputFormat": "Print the number of pairs of shovels such that their total cost ends with maximum possible number of nines.\n\nNote that it is possible that the largest number of 9s at the end is 0, then you should count all such ways.\n\nIt is guaranteed that for every $ n<=10^{9} $ the answer doesn't exceed $ 2·10^{9} $ .",
    "samples": [
        [
            "7\n",
            "3\n"
        ],
        [
            "14\n",
            "9\n"
        ],
        [
            "50\n",
            "1\n"
        ]
    ],
    "hint": "In the first example the maximum possible number of nines at the end is one. Polycarp cah choose the following pairs of shovels for that purpose:\n\n- $ 2 $ and $ 7 $ ;\n- $ 3 $ and $ 6 $ ;\n- $ 4 $ and $ 5 $ .\n\nIn the second example the maximum number of nines at the end of total cost of two shovels is one. The following pairs of shovels suit Polycarp:\n\n- $ 1 $ and $ 8 $ ;\n- $ 2 $ and $ 7 $ ;\n- $ 3 $ and $ 6 $ ;\n- $ 4 $ and $ 5 $ ;\n- $ 5 $ and $ 14 $ ;\n- $ 6 $ and $ 13 $ ;\n- $ 7 $ and $ 12 $ ;\n- $ 8 $ and $ 11 $ ;\n- $ 9 $ and $ 10 $ .\n\nIn the third example it is necessary to choose shovels $ 49 $ and $ 50 $ , because the sum of their cost is $ 99 $ , that means that the total number of nines is equal to two, which is maximum possible for $ n=50 $ .",
    "translation": "用小于等于 $n$ 的任意两个不同的正整数相加，求末尾的 $9$ 的位数最多时的相加方案数。"
}