{
    "description": "The whole world got obsessed with robots,and to keep pace with the progress, great Berland's programmer Draude decided to build his own robot. He was working hard at the robot. He taught it to walk the shortest path from one point to another, to record all its movements, but like in many Draude's programs, there was a bug — the robot didn't always walk the shortest path. Fortunately, the robot recorded its own movements correctly. Now Draude wants to find out when his robot functions wrong. Heh, if Draude only remembered the map of the field, where he tested the robot, he would easily say if the robot walked in the right direction or not. But the field map was lost never to be found, that's why he asks you to find out if there exist at least one map, where the path recorded by the robot is the shortest.\n\nThe map is an infinite checkered field, where each square is either empty, or contains an obstruction. It is also known that the robot never tries to run into the obstruction. By the recorded robot's movements find out if there exist at least one such map, that it is possible to choose for the robot a starting square (the starting square should be empty) such that when the robot moves from this square its movements coincide with the recorded ones (the robot doesn't run into anything, moving along empty squares only), and the path from the starting square to the end one is the shortest.\n\nIn one movement the robot can move into the square (providing there are no obstrutions in this square) that has common sides with the square the robot is currently in.",
    "inputFormat": "The first line of the input file contains the recording of the robot's movements. This recording is a non-empty string, consisting of uppercase Latin letters L, R, U and D, standing for movements left, right, up and down respectively. The length of the string does not exceed 100.",
    "outputFormat": "In the first line output the only word OK (if the above described map exists), or BUG (if such a map does not exist).",
    "samples": [
        [
            "LLUUUR\n",
            "OK\n"
        ],
        [
            "RRUULLDD\n",
            "BUG\n"
        ]
    ],
    "hint": "",
    "translation": "有一个机器人在一个无穷大的网格上，网格中有些格子机器人无法通过而剩下的可以。现在给出了他的路径，`UDLR` 分别表示往上下左右走 $1$ 个单位长。请判断是否存在一个网格，使得机器人的这个路径合法，且为这个网格中起点到终点的最短路径。如果存在输出 `OK`，否则输出 `BUG`。\n\n输入字符串长度不超过 $100$。"
}