{
    "description": "Two neighbours, Alan and Bob, live in the city, where there are three buildings only: a cinema, a shop and the house, where they live. The rest is a big asphalt square.\n\nOnce they went to the cinema, and the film impressed them so deeply, that when they left the cinema, they did not want to stop discussing it.\n\nBob wants to get home, but Alan has to go to the shop first, and only then go home. So, they agreed to cover some distance together discussing the film (their common path might pass through the shop, or they might walk circles around the cinema together), and then to part each other's company and go each his own way. After they part, they will start thinking about their daily pursuits; and even if they meet again, they won't be able to go on with the discussion. Thus, Bob's path will be a continuous curve, having the cinema and the house as its ends. Alan's path — a continuous curve, going through the shop, and having the cinema and the house as its ends.\n\nThe film ended late, that's why the whole distance covered by Alan should not differ from the shortest one by more than $ t_{1} $ , and the distance covered by Bob should not differ from the shortest one by more than $ t_{2} $ .\n\nFind the maximum distance that Alan and Bob will cover together, discussing the film.",
    "inputFormat": "The first line contains two integers: $ t_{1},t_{2} $ ( $ 0<=t_{1},t_{2}<=100 $ ). The second line contains the cinema's coordinates, the third one — the house's, and the last line — the shop's.\n\nAll the coordinates are given in meters, are integer, and do not exceed 100 in absolute magnitude. No two given places are in the same building.",
    "outputFormat": "In the only line output one number — the maximum distance that Alan and Bob will cover together, discussing the film. Output the answer accurate to not less than 4 decimal places.",
    "samples": [
        [
            "0 2\n0 0\n4 0\n-3 0\n",
            "1.0000000000\n"
        ],
        [
            "0 0\n0 0\n2 0\n1 0\n",
            "2.0000000000\n"
        ]
    ],
    "hint": "",
    "translation": "平面上有3个点：A，B，C.(a cinema, a shop and the house) 现在Alice和Bob都在A，Alice想要走到B，走的路线长度减去最短路线长度不得超过t1，Bob想经过C然后到B， 走的路径长减去最短路径长不超过t2。 要求设计他们的路线，使得从A开始的公共部分尽可能长（也就是一旦两人分开，即使重 新会合也不计入公共部分的长度了）\n\n输入格式:\n\n第一行t1和t2(空格隔开),第二行是A,B,C(空格隔开)。\n\n输出格式：\n\n输出最长距离，保留至少四位小数。\nTranslated by @liyifeng"
}