{
    "description": "Your friend has $ n $ cards.\n\nYou know that each card has a lowercase English letter on one side and a digit on the other.\n\nCurrently, your friend has laid out the cards on a table so only one side of each card is visible.\n\nYou would like to know if the following statement is true for cards that your friend owns: \"If a card has a vowel on one side, then it has an even digit on the other side.\" More specifically, a vowel is one of 'a', 'e', 'i', 'o' or 'u', and even digit is one of '0', '2', '4', '6' or '8'.\n\nFor example, if a card has 'a' on one side, and '6' on the other side, then this statement is true for it. Also, the statement is true, for example, for a card with 'b' and '4', and for a card with 'b' and '3' (since the letter is not a vowel). The statement is false, for example, for card with 'e' and '5'. You are interested if the statement is true for all cards. In particular, if no card has a vowel, the statement is true.\n\nTo determine this, you can flip over some cards to reveal the other side. You would like to know what is the minimum number of cards you need to flip in the worst case in order to verify that the statement is true.",
    "inputFormat": "The first and only line of input will contain a string $ s $ ( $ 1<=|s|<=50 $ ), denoting the sides of the cards that you can see on the table currently. Each character of $ s $ is either a lowercase English letter or a digit.",
    "outputFormat": "Print a single integer, the minimum number of cards you must turn over to verify your claim.",
    "samples": [
        [
            "ee\n",
            "2\n"
        ],
        [
            "z\n",
            "0\n"
        ],
        [
            "0ay1\n",
            "2\n"
        ]
    ],
    "hint": "In the first sample, we must turn over both cards. Note that even though both cards have the same letter, they could possibly have different numbers on the other side.\n\nIn the second sample, we don't need to turn over any cards. The statement is vacuously true, since you know your friend has no cards with a vowel on them.\n\nIn the third sample, we need to flip the second and fourth cards.",
    "translation": "翻译：\n\n你的朋友有N张牌。\n\n每一张卡片上都有一个小写的英文字母和一个数字。\n\n现在，你的朋友已经把卡片放在了一张桌子上，所以每张卡片只有一面可见。你很想知道你的朋友对所拥有的卡片的描述是否正确：“如果一张卡片上有一个元音，那么它的另一面一定是一个偶数”(元音是“A”、“E”、“I”、“O”或“u”的一个，偶数是“0”、“2”、“4”、“6”或“8”的一种)。\n\n例如，如果一张牌的一面是“A”，另一面有“6”，那么这句话是对的。此外，一张有“B”和“4”的卡片，以及一张有“B”和“3”的卡片的描述也是正确的（因为字母不是元音）。\n\n而有“E”和“5”的卡是错误的。\n\n如果所有的卡都是符合要求的，你会感兴趣。另外，如果没有卡是元音，描述是真的。\n\n为了确定这一点，你可以翻转一些卡片来显示另一面。你想知道在最坏的情况下需要翻转的最小卡片数。\n\n输入输出格式\n\n输入格式：\n\n输入的只有一行，为一个字符串S（1≤s的长度≤50），表示你在桌子上看到的每个字符（只包含字母和数字）\n\n输出格式：\n\n输出一个整数，表示最少要翻几张卡片。\n\nTranslated by @引领天下 "
}