{
    "description": "Valentin participates in a show called \"Shockers\". The rules are quite easy: jury selects one letter which Valentin doesn't know. He should make a small speech, but every time he pronounces a word that contains the selected letter, he receives an electric shock. He can make guesses which letter is selected, but for each incorrect guess he receives an electric shock too. The show ends when Valentin guesses the selected letter correctly.\n\nValentin can't keep in mind everything, so he could guess the selected letter much later than it can be uniquely determined and get excessive electric shocks. Excessive electric shocks are those which Valentin got after the moment the selected letter can be uniquely determined. You should find out the number of excessive electric shocks.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of actions Valentin did.\n\nThe next $ n $ lines contain descriptions of his actions, each line contains description of one action. Each action can be of one of three types:\n\n1. Valentin pronounced some word and didn't get an electric shock. This action is described by the string \". w\" (without quotes), in which \".\" is a dot (ASCII-code 46), and $ w $ is the word that Valentin said.\n2. Valentin pronounced some word and got an electric shock. This action is described by the string \"! w\" (without quotes), in which \"!\" is an exclamation mark (ASCII-code 33), and $ w $ is the word that Valentin said.\n3. Valentin made a guess about the selected letter. This action is described by the string \"? s\" (without quotes), in which \"?\" is a question mark (ASCII-code 63), and $ s $ is the guess — a lowercase English letter.\n\nAll words consist only of lowercase English letters. The total length of all words does not exceed $ 10^{5} $ .\n\nIt is guaranteed that last action is a guess about the selected letter. Also, it is guaranteed that Valentin didn't make correct guesses about the selected letter before the last action. Moreover, it's guaranteed that if Valentin got an electric shock after pronouncing some word, then it contains the selected letter; and also if Valentin didn't get an electric shock after pronouncing some word, then it does not contain the selected letter.",
    "outputFormat": "Output a single integer — the number of electric shocks that Valentin could have avoided if he had told the selected letter just after it became uniquely determined.",
    "samples": [
        [
            "5\n! abc\n. ad\n. b\n! cd\n? c\n",
            "1\n"
        ],
        [
            "8\n! hello\n! codeforces\n? c\n. o\n? d\n? h\n. l\n? e\n",
            "2\n"
        ],
        [
            "7\n! ababahalamaha\n? a\n? b\n? a\n? b\n? a\n? h\n",
            "0\n"
        ]
    ],
    "hint": "In the first test case after the first action it becomes clear that the selected letter is one of the following: $ a,b,c $ . After the second action we can note that the selected letter is not $ a $ . Valentin tells word \"b\" and doesn't get a shock. After that it is clear that the selected letter is $ c $ , but Valentin pronounces the word $ cd $ and gets an excessive electric shock.\n\nIn the second test case after the first two electric shocks we understand that the selected letter is $ e $ or $ o $ . Valentin tries some words consisting of these letters and after the second word it's clear that the selected letter is $ e $ , but Valentin makes 3 more actions before he makes a correct hypothesis.\n\nIn the third example the selected letter can be uniquely determined only when Valentin guesses it, so he didn't get excessive electric shocks.",
    "translation": "## 题目描述\r\n```Valentin```参加了一个名为“震惊者(Shockers)”的节目。节目规则很简单：节目团队选择一个字母，但```Valentin```不知道是什么。```Valentin```需要做一个很短的演讲，在演讲中他每说到这个字母，都会受到电击。他可以猜测节目组选的是哪个字母，但是如果他猜错了，也会受到电击。当```Valentin```正确猜出所选字母时，流程结束。\r\n```Valentin```记性不好，记不住之前每次电击的时间，所以他有可能会后知后觉，在已经能判断选定字母是什么的时候还猜错了，于是被电。这种电击成为“过量电击”，它是本可以避免的。简单来说，过量电击是```Valentin```在所选字母可以唯一确定之后挨的电击。\r\n## 输入输出格式\r\n### 输入格式：\r\n第一行一个整数nnn (1≤n≤105)(1\\le n \\le 10^5 )(1≤n≤105)，表示```Valentin```做出的行动，包括演讲以及猜测等。\r\n下面nnn行内容，为他行动的描述，每行描述一个行动。每个行动可以是以下三种类型之一：\r\n1. 他发表了一段演讲，且没有受到电击。此行动由字符串\".w\"（不带引号）描述，其中\".\" 是一个点（ASCII码46），\"w\"代表他说的话。\r\n2. ```Valentin```发表了一段演讲，而且被电了。此行动由字符串\"!w\"（不带引号）描述，其中\"!\"是感叹号（ASCII码33），\"w\"代表他说的话。\r\n3. 他对所选字母做了猜测。此操作由字符串\"? s\"（不带引号）描述，其中\"?\"是问号（ASCII码63），\"s\"是一个小写英文字母，代表```Valentin```所作的猜测。\r\n他发表的演讲中只有小写英文字母。\r\n保证最后一个行动是他对所选字母的猜测。\r\n此外，保证```Valentin```在最后一次行动之前所做出的任何猜测全都是错的。（此处省略一句废话）\r\n### 输出格式：\r\n输出一个整数，即为过量点击的次数。\r\n## 样例说明\r\n在样例1中：第一个行动之后，我们已经能看出所选的字母一定是a,b,c中的一个。第二个行动又告诉我们它不是a。```Valentin```又在演讲中说到了“b”这个词，但并没有被电，所以选定字母肯定是c。他后来又讲出了\"cd\"这个词导致被电，这很明显是一次过量点击。\r\n在样例2中：在前两次电击后，我们可以得出所选字母肯定是e和o中的一个。于是```Valentin```又试了几次，在他说出\"o\"之后并没有被电，所以所选的字母是e。但他还问了d和h，导致自己被电，所以答案为2。\r\n在样例3中：```Valentin```打出完美操作，没有受到过量电击。"
}