{
    "description": "Roy and Biv have a set of $ n $ points on the infinite number line.\n\nEach point has one of 3 colors: red, green, or blue.\n\nRoy and Biv would like to connect all the points with some edges. Edges can be drawn between any of the two of the given points. The cost of an edge is equal to the distance between the two points it connects.\n\nThey want to do this in such a way that they will both see that all the points are connected (either directly or indirectly).\n\nHowever, there is a catch: Roy cannot see the color red and Biv cannot see the color blue.\n\nTherefore, they have to choose the edges in such a way that if all the red points are removed, the remaining blue and green points are connected (and similarly, if all the blue points are removed, the remaining red and green points are connected).\n\nHelp them compute the minimum cost way to choose edges to satisfy the above constraints.",
    "inputFormat": "The first line will contain an integer $ n $ ( $ 1<=n<=300000 $ ), the number of points.\n\nThe next $ n $ lines will contain two tokens $ p_{i} $ and $ c_{i} $ ( $ p_{i} $ is an integer, $ 1<=p_{i}<=10^{9} $ , $ c_{i} $ is a uppercase English letter 'R', 'G' or 'B'), denoting the position of the $ i $ -th point and the color of the $ i $ -th point. 'R' means red, 'G' denotes green, and 'B' means blue. The positions will be in strictly increasing order.",
    "outputFormat": "Print a single integer, the minimum cost way to solve the problem.",
    "samples": [
        [
            "4\n1 G\n5 R\n10 B\n15 G\n",
            "23\n"
        ],
        [
            "4\n1 G\n2 R\n3 B\n10 G\n",
            "12\n"
        ]
    ],
    "hint": "In the first sample, it is optimal to draw edges between the points (1,2), (1,4), (3,4). These have costs 4, 14, 5, respectively.",
    "translation": "数轴上有n个点，为红或绿或蓝色，用几条边连接它们，边长为两点距离，使去掉所有红点或蓝点后剩下的点连通，求最小边长和"
}