{
    "description": "Will shares a psychic connection with the Upside Down Monster, so everything the monster knows, Will knows. Suddenly, he started drawing, page after page, non-stop. Joyce, his mom, and Chief Hopper put the drawings together, and they realized, it's a labeled tree!\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF917D/df747e5880f95d5a7f2a7fa3db2b2bf252f41ce9.png)A tree is a connected acyclic graph. Will's tree has $ n $ vertices. Joyce and Hopper don't know what that means, so they're investigating this tree and similar trees. For each $ k $ such that $ 0<=k<=n-1 $ , they're going to investigate all labeled trees with $ n $ vertices that share exactly $ k $ edges with Will's tree. Two labeled trees are different if and only if there's a pair of vertices $ (v,u) $ such that there's an edge between $ v $ and $ u $ in one tree and not in the other one.\n\nHopper and Joyce want to know how much work they have to do, so they asked you to tell them the number of labeled trees with $ n $ vertices that share exactly $ k $ edges with Will's tree, for each $ k $ . The answer could be very large, so they only asked you to tell them the answers modulo $ 1000000007=10^{9}+7 $ .",
    "inputFormat": "The first line of input contains a single integer $ n $ ( $ 2<=n<=100 $ ) — the size of the tree.\n\nThe next $ n-1 $ lines contain the edges of Will's tree. Each line contains two integers $ v $ and $ u $ ( $ 1<=v,u<=n $ , $ v≠u $ ), endpoints of an edge. It is guaranteed that the given graph is a tree.",
    "outputFormat": "Print $ n $ integers in one line. $ i $ -th integer should be the number of the number of labeled trees with $ n $ vertices that share exactly $ i-1 $ edges with Will's tree, modulo $ 1000000007=10^{9}+7 $ .",
    "samples": [
        [
            "3\n1 2\n1 3\n",
            "0 2 1 "
        ],
        [
            "4\n1 2\n2 3\n3 4\n",
            "1 7 7 1 "
        ],
        [
            "4\n1 2\n1 3\n1 4\n",
            "0 9 6 1 "
        ]
    ],
    "hint": "",
    "translation": "\n\n给定一棵有n个节点的无权无向树\n\n求对于这n个点，以及每个k=0,1,2...n-1，有多少棵由这n个点之间的边构造成的树，与给定的树恰好有k条边重复\n\n答案 MOD 1e9+7 输出\n\ne.g. n=3, edge ={(1,2),(1,3)} ，\n\nans[0]={}，ans[1]={ tree{(2,3),(1,3),tree{(2,3),(1,2)} },ans[2]={ tree{(1,2),(1,3)} }\n\n（即为第一个样例）\n\nTranslated by KamijuIndex\n"
}