{
    "description": "A frog lives on the axis $ Ox $ and needs to reach home which is in the point $ n $ . She starts from the point $ 1 $ . The frog can jump to the right at a distance not more than $ d $ . So, after she jumped from the point $ x $ she can reach the point $ x+a $ , where $ a $ is an integer from $ 1 $ to $ d $ .\n\nFor each point from $ 1 $ to $ n $ is known if there is a lily flower in it. The frog can jump only in points with a lilies. Guaranteed that there are lilies in the points $ 1 $ and $ n $ .\n\nDetermine the minimal number of jumps that the frog needs to reach home which is in the point $ n $ from the point $ 1 $ . Consider that initially the frog is in the point $ 1 $ . If the frog can not reach home, print -1.",
    "inputFormat": "The first line contains two integers $ n $ and $ d $ ( $ 2<=n<=100 $ , $ 1<=d<=n-1 $ ) — the point, which the frog wants to reach, and the maximal length of the frog jump.\n\nThe second line contains a string $ s $ of length $ n $ , consisting of zeros and ones. If a character of the string $ s $ equals to zero, then in the corresponding point there is no lily flower. In the other case, in the corresponding point there is a lily flower. Guaranteed that the first and the last characters of the string $ s $ equal to one.",
    "outputFormat": "If the frog can not reach the home, print -1.\n\nIn the other case, print the minimal number of jumps that the frog needs to reach the home which is in the point $ n $ from the point $ 1 $ .",
    "samples": [
        [
            "8 4\n10010101\n",
            "2\n"
        ],
        [
            "4 2\n1001\n",
            "-1\n"
        ],
        [
            "8 4\n11100101\n",
            "3\n"
        ],
        [
            "12 3\n101111100101\n",
            "4\n"
        ]
    ],
    "hint": "In the first example the from can reach home in two jumps: the first jump from the point $ 1 $ to the point $ 4 $ (the length of the jump is three), and the second jump from the point $ 4 $ to the point $ 8 $ (the length of the jump is four).\n\nIn the second example the frog can not reach home, because to make it she need to jump on a distance three, but the maximum length of her jump equals to two.",
    "translation": "## 题目描述\n一只青蛙现在在一个数轴上，它现在要从点 $1$ 跳到点 $n$ ，它每次可以向右跳不超过 $d$ 个单位。比如，它可以从点 $x$ 跳到点 $x+a$  $( 1<=a<=d )$ 。特别的，青蛙只能在有百合花的点上停留。保证点 $1$ 和点 $n$ 之间有一些点有百合花。请输出青蛙到达点 $n$ 的最小跳跃次数。\n\n## 输入输出格式\n### 输入格式\n输入的第一行包括两个正整数 $n$ 和 $d$  $( 2<=n<=100, 1<=d<=n-1 )$ 。\n输入的第二行是一个长度为 $n$ 的无空格字符串，由`0`和`1`组成，表示哪些点上有百合花（`1`表示有）。保证点 $1$ 和点 $n$ 有百合花。\n\n### 输出格式\n输出青蛙的最小跳跃次数。如果它不可能到达，输出-1。\n\n## 输入输出样例\n略\n\n## 说明\n在样例1中，青蛙可以从点 $1$ 跳3个单位到点 $4$ ，再从点 $4$ 跳4个单位到点 $8$ .\n在样例2中，青蛙不能到达点 $n$ ，因为它至少需要跳3个单位，但它最多只能跳2个单位。\n\n由 @星烁晶熠辉 提供翻译"
}