{
    "description": "During the winter holidays, the demand for Christmas balls is exceptionally high. Since it's already $ 2018 $ , the advances in alchemy allow easy and efficient ball creation by utilizing magic crystals.\n\nGrisha needs to obtain some yellow, green and blue balls. It's known that to produce a yellow ball one needs two yellow crystals, green — one yellow and one blue, and for a blue ball, three blue crystals are enough.\n\nRight now there are $ A $ yellow and $ B $ blue crystals in Grisha's disposal. Find out how many additional crystals he should acquire in order to produce the required number of balls.",
    "inputFormat": "The first line features two integers $ A $ and $ B $ ( $ 0<=A,B<=10^{9} $ ), denoting the number of yellow and blue crystals respectively at Grisha's disposal.\n\nThe next line contains three integers $ x $ , $ y $ and $ z $ ( $ 0<=x,y,z<=10^{9} $ ) — the respective amounts of yellow, green and blue balls to be obtained.",
    "outputFormat": "Print a single integer — the minimum number of crystals that Grisha should acquire in addition.",
    "samples": [
        [
            "4 3\n2 1 1\n",
            "2\n"
        ],
        [
            "3 9\n1 1 3\n",
            "1\n"
        ],
        [
            "12345678 87654321\n43043751 1000000000 53798715\n",
            "2147483648\n"
        ]
    ],
    "hint": "In the first sample case, Grisha needs five yellow and four blue crystals to create two yellow balls, one green ball, and one blue ball. To do that, Grisha needs to obtain two additional crystals: one yellow and one blue.",
    "translation": "Grisha有一些水晶，可以用这些水晶造出一些水晶球。现在他有A个黄水晶，B个蓝水晶。现在他要造出x个黄水晶球，y个绿水晶球，z个蓝水晶球。请问他还额外需要几个水晶(不需要就输出0)才能完成任务。\n\n> 2个黄水晶可造出1个黄水晶球\n\n> 1个黄水晶加上1个蓝水晶可造出1个绿水晶球\n\n> 3个蓝水晶可造出1个蓝水晶球"
}