{
    "description": "Arkady the air traffic controller is now working with $ n $ planes in the air. All planes move along a straight coordinate axis with Arkady's station being at point $ 0 $ on it. The $ i $ -th plane, small enough to be represented by a point, currently has a coordinate of $ x_{i} $ and is moving with speed $ v_{i} $ . It's guaranteed that $ x_{i}·v_{i}<0 $ , i.e., all planes are moving towards the station.\n\nOccasionally, the planes are affected by winds. With a wind of speed $ v_{wind} $ (not necessarily positive or integral), the speed of the $ i $ -th plane becomes $ v_{i}+v_{wind} $ .\n\nAccording to weather report, the current wind has a steady speed falling inside the range $ [-w,w] $ (inclusive), but the exact value cannot be measured accurately since this value is rather small — smaller than the absolute value of speed of any plane.\n\nEach plane should contact Arkady at the exact moment it passes above his station. And you are to help Arkady count the number of pairs of planes $ (i,j) $ ( $ i<j $ ) there are such that there is a possible value of wind speed, under which planes $ i $ and $ j $ contact Arkady at the same moment. This value needn't be the same across different pairs.\n\nThe wind speed is the same for all planes. You may assume that the wind has a steady speed and lasts arbitrarily long.",
    "inputFormat": "The first line contains two integers $ n $ and $ w $ ( $ 1<=n<=100000 $ , $ 0<=w<10^{5} $ ) — the number of planes and the maximum wind speed.\n\nThe $ i $ -th of the next $ n $ lines contains two integers $ x_{i} $ and $ v_{i} $ ( $ 1<=|x_{i}|<=10^{5} $ , $ w+1<=|v_{i}|<=10^{5} $ , $ x_{i}·v_{i}<0 $ ) — the initial position and speed of the $ i $ -th plane.\n\nPlanes are pairwise distinct, that is, no pair of $ (i,j) $ ( $ i<j $ ) exists such that both $ x_{i}=x_{j} $ and $ v_{i}=v_{j} $ .",
    "outputFormat": "Output a single integer — the number of unordered pairs of planes that can contact Arkady at the same moment.",
    "samples": [
        [
            "5 1\n-3 2\n-3 3\n-1 2\n1 -3\n3 -5\n",
            "3\n"
        ],
        [
            "6 1\n-3 2\n-2 2\n-1 2\n1 -2\n2 -2\n3 -2\n",
            "9\n"
        ]
    ],
    "hint": "In the first example, the following $ 3 $ pairs of planes satisfy the requirements:\n\n- $ (2,5) $  passes the station at time $ 3/4 $ with $ v_{wind}=1 $ ;\n- $ (3,4) $  passes the station at time $ 2/5 $ with $ v_{wind}=1/2 $ ;\n- $ (3,5) $  passes the station at time $ 4/7 $ with $ v_{wind}=-1/4 $ .\n\nIn the second example, each of the $ 3 $ planes with negative coordinates can form a valid pair with each of the other $ 3 $ , totaling $ 9 $ pairs.",
    "translation": "一条数轴上有$n(n\\le 10^5)$个点，第$i$个点坐标为$x_i$，速度为$v_i$，保证$x_i\\cdot v_i<0$即所有点都像原点移动，其中$x_i,v_i$均是整数。\r\n\r\n现在你有能力刮一股大风，风速可以为$[w,-w](w<\\min\\{|v_i|\\})$的任意**实数**，使得第$i$点的速度为$v_i+v_{\\text{风}}$。\r\n\r\n现在想要问你的是有多少对点当你调整到一定风速之后他们会在原点相遇。"
}