{
    "description": "Imp likes his plush toy a lot.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF922A/62fe36f6fbde65681f909b9b7cc85dddda4799f7.png)Recently, he found a machine that can clone plush toys. Imp knows that if he applies the machine to an original toy, he additionally gets one more original toy and one copy, and if he applies the machine to a copied toy, he gets two additional copies.\n\nInitially, Imp has only one original toy. He wants to know if it is possible to use machine to get exactly $ x $ copied toys and $ y $ original toys? He can't throw toys away, and he can't apply the machine to a copy if he doesn't currently have any copies.",
    "inputFormat": "The only line contains two integers $ x $ and $ y $ ( $ 0<=x,y<=10^{9} $ ) — the number of copies and the number of original toys Imp wants to get (including the initial one).",
    "outputFormat": "Print \"Yes\", if the desired configuration is possible, and \"No\" otherwise.\n\nYou can print each letter in arbitrary case (upper or lower).",
    "samples": [
        [
            "6 3\n",
            "Yes\n"
        ],
        [
            "4 2\n",
            "No\n"
        ],
        [
            "1000 1001\n",
            "Yes\n"
        ]
    ],
    "hint": "In the first example, Imp has to apply the machine twice to original toys and then twice to copies.",
    "translation": "题目描述\n\nImp非常喜欢他的毛绒玩具。\n\n![](https://cdn.luogu.org/upload/vjudge_pic/CF922A/62fe36f6fbde65681f909b9b7cc85dddda4799f7.png)\n\n最近，他发现了一个可以克隆毛绒玩具的机器。Imp知道如果他将一个玩具本体进行克隆，他将会得到两个本体（新增一个）和一个克隆体；而如果将一个克隆体进行克隆，他将会得到三个克隆体（新增两个）。\n\n一开始，Imp只有一个毛绒玩具本体。他想要知道他能否使用这个机器得到恰好$x$ 个克隆体和$y$ 个本体。他不能把玩具扔掉，也不能在没有克隆体的时候对一个克隆体进行克隆。\n输入格式\n\n一行两个整数$x,y(0 \\le x,y \\le 10^9)$ ，分别表示Imp想要得到的玩具克隆体数量和本体数量（包括一开始的一个本体）。\n输出格式\n\n如果能够满足题意，输出\"Yes\"，否则输出\"No\"。大小写不敏感。\n说明\n\n在样例一中，Imp可以对本体进行两次克隆，再对克隆体进行两次克隆。\n翻译贡献者：浮尘ii"
}