{
    "description": "When registering in a social network, users are allowed to create their own convenient login to make it easier to share contacts, print it on business cards, etc.\n\nLogin is an arbitrary sequence of lower and uppercase latin letters, digits and underline symbols («\\_»). However, in order to decrease the number of frauds and user-inattention related issues, it is prohibited to register a login if it is similar with an already existing login. More precisely, two logins $ s $ and $ t $ are considered similar if we can transform $ s $ to $ t $ via a sequence of operations of the following types:\n\n- transform lowercase letters to uppercase and vice versa;\n- change letter «O» (uppercase latin letter) to digit «0» and vice versa;\n- change digit «1» (one) to any letter among «l» (lowercase latin «L»), «I» (uppercase latin «i») and vice versa, or change one of these letters to other.\n\nFor example, logins «Codeforces» and «codef0rces» as well as «OO0OOO00O0OOO0O00OOO0OO\\_lol» and «OO0OOO0O00OOO0O00OO0OOO\\_1oI» are considered similar whereas «Codeforces» and «Code\\_forces» are not.\n\nYou're given a list of existing logins with no two similar amonst and a newly created user login. Check whether this new login is similar with any of the existing ones.",
    "inputFormat": "The first line contains a non-empty string $ s $ consisting of lower and uppercase latin letters, digits and underline symbols («\\_») with length not exceeding $ 50 $ — the login itself.\n\nThe second line contains a single integer $ n $ ( $ 1<=n<=1000 $ ) — the number of existing logins.\n\nThe next $ n $ lines describe the existing logins, following the same constraints as the user login (refer to the first line of the input). It's guaranteed that no two existing logins are similar.",
    "outputFormat": "Print «Yes» (without quotes), if user can register via this login, i.e. none of the existing logins is similar with it.\n\nOtherwise print «No» (without quotes).",
    "samples": [
        [
            "1_wat\n2\n2_wat\nwat_1\n",
            "Yes\n"
        ],
        [
            "000\n3\n00\nooA\noOo\n",
            "No\n"
        ],
        [
            "_i_\n3\n__i_\n_1_\nI\n",
            "No\n"
        ],
        [
            "La0\n3\n2a0\nLa1\n1a0\n",
            "No\n"
        ],
        [
            "abc\n1\naBc\n",
            "No\n"
        ],
        [
            "0Lil\n2\nLIL0\n0Ril\n",
            "Yes\n"
        ]
    ],
    "hint": "In the second sample case the user wants to create a login consisting of three zeros. It's impossible due to collision with the third among the existing.\n\nIn the third sample case the new login is similar with the second one.",
    "translation": "**题目描述：**\n登录名是由小写和大写拉丁字母、数字和下划线符号“_”组成的任意序列。\n如果登录名与已经存在的登录名类似，则禁止注册。\n如果我们可以通过以下类型的操作组成的序列将S转化成T，则认为S,T是类似的。\n- 将小写字母转换为大写字母，将大写字母转换为小写字母\n- 将字母“O”更改为数字“0”,将数字“0”更改为字母“O”\n- \"1\"\"l\"\"L\"相互转化\n例如，\n登录名«codeforces»和«codefwrces»，\n«oo0oo00oo0oo0oo0oo_lol»和«oo0oo0oo0oo0oo0oo0oo0oo0oo_1oo»是类似的，\n而«codeforces»和«code_forces»则不是。\n给你一个登录名的列表,其中没有两个类似的登录名。\n检查新登录名是否和已有登录名类似。\n\n------------\n**输入格式：**\n第一行包括一个非空字符串s（新登录名）,由小写和大写拉丁字母、数字和下划线符号_组成，长度不超过50。\n第二行是一个整数n，1<=n<=1000——已有登录名的数目\n接下来有n行，每行一个已有登录名。\n保证没有两个已有的登录是类似的\n\n------------\n**输出格式：**\n如果登录名合法（不与已有登录名类似），输出Yes。\n否则输出No"
}