{
    "description": "Alice likes snow a lot! Unfortunately, this year's winter is already over, and she can't expect to have any more of it. Bob has thus bought her a gift — a large snow maker. He plans to make some amount of snow every day. On day $ i $ he will make a pile of snow of volume $ V_{i} $ and put it in her garden.\n\nEach day, every pile will shrink a little due to melting. More precisely, when the temperature on a given day is $ T_{i} $ , each pile will reduce its volume by $ T_{i} $ . If this would reduce the volume of a pile to or below zero, it disappears forever. All snow piles are independent of each other.\n\nNote that the pile made on day $ i $ already loses part of its volume on the same day. In an extreme case, this may mean that there are no piles left at the end of a particular day.\n\nYou are given the initial pile sizes and the temperature on each day. Determine the total volume of snow melted on each day.",
    "inputFormat": "The first line contains a single integer $ N $ ( $ 1<=N<=10^{5} $ ) — the number of days.\n\nThe second line contains $ N $ integers $ V_{1},V_{2},...,V_{N} $ ( $ 0<=V_{i}<=10^{9} $ ), where $ V_{i} $ is the initial size of a snow pile made on the day $ i $ .\n\nThe third line contains $ N $ integers $ T_{1},T_{2},...,T_{N} $ ( $ 0<=T_{i}<=10^{9} $ ), where $ T_{i} $ is the temperature on the day $ i $ .",
    "outputFormat": "Output a single line with $ N $ integers, where the $ i $ -th integer represents the total volume of snow melted on day $ i $ .",
    "samples": [
        [
            "3\n10 10 5\n5 7 2\n",
            "5 12 4\n"
        ],
        [
            "5\n30 25 20 15 10\n9 10 12 4 13\n",
            "9 20 35 11 25\n"
        ]
    ],
    "hint": "In the first sample, Bob first makes a snow pile of volume 10, which melts to the size of 5 on the same day. On the second day, he makes another pile of size 10. Since it is a bit warmer than the day before, the first pile disappears completely while the second pile shrinks to 3. At the end of the second day, he has only a single pile of size 3. On the third day he makes a smaller pile than usual, but as the temperature dropped too, both piles survive till the end of the day.",
    "translation": "题目描述\n\nAlice非常喜欢雪！\n\n她每天都会堆一堆$V$  升的雪，然而每堆雪每天都会融化$T$  升，当然，要是这堆雪的体积$V<=0$  时，它就永远消失了。\n\n现在她想知道，$n$  天中每天融化了多少升雪呢？\n\n输入输出格式\n\n输入格式：\n\n第一行包括一个整数 $n$  ($1<=N<=10^{5}$ ) 表示天数。\n\n第二行包括 $n$  个整数 $V_{1},V_{2},...,V_{N}$  表示每天堆的那堆雪的体积。\n\n第三行包括 $n$  个整数 $T_{1},T_{2},...,T_{N}$  表示每天每堆雪熔化的体积。\n\n输出格式：\n\n输出一行 每一天雪总共的熔化量（共 $n$  个整数）。\n\nTranslated by @Playnext "
}