{
    "description": "Recently $ n $ students from city S moved to city P to attend a programming camp.\n\nThey moved there by train. In the evening, all students in the train decided that they want to drink some tea. Of course, no two people can use the same teapot simultaneously, so the students had to form a queue to get their tea.\n\n $ i $ -th student comes to the end of the queue at the beginning of $ l_{i} $ -th second. If there are multiple students coming to the queue in the same moment, then the student with greater index comes after the student with lesser index. Students in the queue behave as follows: if there is nobody in the queue before the student, then he uses the teapot for exactly one second and leaves the queue with his tea; otherwise the student waits for the people before him to get their tea. If at the beginning of $ r_{i} $ -th second student $ i $ still cannot get his tea (there is someone before him in the queue), then he leaves the queue without getting any tea.\n\nFor each student determine the second he will use the teapot and get his tea (if he actually gets it).",
    "inputFormat": "The first line contains one integer $ t $ — the number of test cases to solve ( $ 1<=t<=1000 $ ).\n\nThen $ t $ test cases follow. The first line of each test case contains one integer $ n $ ( $ 1<=n<=1000 $ ) — the number of students.\n\nThen $ n $ lines follow. Each line contains two integer $ l_{i} $ , $ r_{i} $ ( $ 1<=l_{i}<=r_{i}<=5000 $ ) — the second $ i $ -th student comes to the end of the queue, and the second he leaves the queue if he still cannot get his tea.\n\nIt is guaranteed that for every ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF920B/748ee9e1ae91d0e555bb85d14ee499f01d330017.png) condition $ l_{i-1}<=l_{i} $ holds.\n\nThe sum of $ n $ over all test cases doesn't exceed $ 1000 $ .\n\nNote that in hacks you have to set $ t=1 $ .",
    "outputFormat": "For each test case print $ n $ integers. $ i $ -th of them must be equal to the second when $ i $ -th student gets his tea, or $ 0 $ if he leaves without tea.",
    "samples": [
        [
            "2\n2\n1 3\n1 4\n3\n1 5\n1 1\n2 3\n",
            "1 2 \n1 0 2 \n"
        ]
    ],
    "hint": "The example contains $ 2 $ tests:\n\n1. During $ 1 $ -st second, students $ 1 $ and $ 2 $ come to the queue, and student $ 1 $ gets his tea. Student $ 2 $ gets his tea during $ 2 $ -nd second.\n2. During $ 1 $ -st second, students $ 1 $ and $ 2 $ come to the queue, student $ 1 $ gets his tea, and student $ 2 $ leaves without tea. During $ 2 $ -nd second, student $ 3 $ comes and gets his tea.",
    "translation": "题面：\n\n有n个学生排队喝茶。\n\n第i 个学生在$l_i$的时刻来排队。如果在同一时刻有多名学生来排队，那么id 较大的学生就会在id 较小的学生之后。\n\n队列中的学生的行为如下：如果学生面前没有人排队，那么他就用茶一秒钟，然后出队。否则会等待。如果第i 个学生在$r_i$的开始，仍然喝不到茶（队列前面有人），那么他就离开队伍了。\n\n输入：\n\n第一行：t，数据组数\n\n每组数据的开头输入n，学生数\n\n接下来n行每行为$l_i $, $r_i$\n​\t \n\n输出：\n\n对于每组数据输出一行n个数，每个数表示这个学生喝到茶的时间，如果不能喝到就输出0\n\nTranslated by @@Lyrance"
}