{
    "description": "A classroom in a school has six rows with $ 3 $ desks in each row. Two people can use the same desk: one sitting on the left and one sitting on the right.\n\nSome places are already occupied, and some places are vacant. Petya has just entered the class and wants to occupy the most convenient place. The conveniences of the places are shown on the picture:\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF926D/a082c4bc1c1ccaad840bb7d19543d2ab2a60cd65.png)Here, the desks in the top row are the closest to the blackboard, while the desks in the bottom row are the furthest from the blackboard.\n\nYou are given a plan of the class, where '\\*' denotes an occupied place, '.' denotes a vacant place, and the aisles are denoted by '-'.\n\nFind any of the most convenient vacant places for Petya.",
    "inputFormat": "The input consists of $ 6 $ lines. Each line describes one row of desks, starting from the closest to the blackboard. Each line is given in the following format: two characters, each is '\\*' or '.' — the description of the left desk in the current row; a character '-' — the aisle; two characters, each is '\\*' or '.' — the description of the center desk in the current row; a character '-' — the aisle; two characters, each is '\\*' or '.' — the description of the right desk in the current row. So, the length of each of the six lines is $ 8 $ .\n\nIt is guaranteed that there is at least one vacant place in the classroom.",
    "outputFormat": "Print the plan of the classroom after Petya takes one of the most convenient for him places. Mark this place with the letter 'P'. There should be exactly one letter 'P' in the plan. Petya can only take a vacant place. In all other places the output should coincide with the input.\n\nIf there are multiple answers, print any.",
    "samples": [
        [
            "..-**-..\n..-**-..\n..-..-..\n..-..-..\n..-..-..\n..-..-..\n",
            "..-**-..\n..-**-..\n..-..-..\n..-P.-..\n..-..-..\n..-..-..\n"
        ],
        [
            "**-**-**\n**-**-**\n..-**-.*\n**-**-**\n..-..-..\n..-**-..\n",
            "**-**-**\n**-**-**\n..-**-.*\n**-**-**\n..-P.-..\n..-**-..\n"
        ],
        [
            "**-**-*.\n*.-*.-**\n**-**-**\n**-**-**\n..-..-..\n..-**-..\n",
            "**-**-*.\n*.-*P-**\n**-**-**\n**-**-**\n..-..-..\n..-**-..\n"
        ]
    ],
    "hint": "In the first example the maximum convenience is $ 3 $ .\n\nIn the second example the maximum convenience is $ 2 $ .\n\nIn the third example the maximum convenience is $ 4 $ .",
    "translation": "教师是一个 $6\\times 8$ 的空间，其中有 `*` 表示被占用的位置，`.` 表示空位置，`-` 表示过道。保证有空位。\n\nPetya 要选一个空位，使得方便值最大，方便值如图。输出任意一个位置即可。"
}