{
    "description": "Petya sometimes has to water his field. To water the field, Petya needs a tank with exactly $ V $ ml of water.\n\nPetya has got $ N $ tanks, $ i $ -th of them initially containing $ a_{i} $ ml of water. The tanks are really large, any of them can contain any amount of water (no matter how large this amount is).\n\nAlso Petya has got a scoop that can contain up to $ K $ ml of water (initially the scoop is empty). This scoop can be used to get some water from some tank, and after that pour it all into some other tank (it is impossible to get water from multiple tanks without pouring it, or leave some water in the scoop when pouring it). When Petya tries to get some water from a tank, he gets $ min(v,K) $ water, where $ v $ is the current volume of water in the tank.\n\nIs it possible to obtain a tank with exactly $ V $ ml of water using these operations? If it is possible, print a sequence of operations that allows to do it. If there are multiple ways to obtain needed amount of water in some tank, print any of them.",
    "inputFormat": "The first line contains $ 3 $ integers: $ N $ $ (2<=N<=5000) $ , $ K $ $ (1<=K<=5000) $ , and $ V $ $ (0<=V<=10^{9}) $ — the number of tanks, the maximum volume of water the scoop can contain, and the required amount of water in some tank, respectively.\n\nThe second line contains $ N $ integers $ a_{i} $ $ (0<=a_{i}<=10^{5}) $ , where $ a_{i} $ is initial volume of water in $ i $ -th tank.",
    "outputFormat": "If it is impossible to obtain a tank with exactly $ V $ ml of water, print NO.\n\nOtherwise print YES in the first line, and beginning from the second line, print the sequence of operations in the following format:\n\nEach line has to contain $ 3 $ numbers denoting a compressed operation: \" $ cnt $ $ x $ $ y $ \" $ (1<=cnt<=10^{9},1<=x,y<=N) $ , where $ x $ is the index of the tank where we get water, $ y $ is the index of the tank where we pour water, and $ cnt $ is the number of times we transfer water from tank $ x $ to tank $ y $ .\n\nThe number of these lines must not exceed $ N+5 $ .",
    "samples": [
        [
            "2 3 5\n2 3\n",
            "YES\n1 2 1\n"
        ],
        [
            "2 3 4\n2 3\n",
            "NO\n"
        ],
        [
            "5 2 0\n1 3 5 7 9\n",
            "YES\n2 2 1\n3 3 1\n4 4 1\n5 5 1\n"
        ]
    ],
    "hint": "",
    "translation": "有$n$个水槽\n\n都可以装无穷多的水\n\n第$i$个水槽里面有的水的体积为$ai$\n\n有一个容量为$k$的水瓢\n\n每次可以从一个水槽中拿走$min(ai,k)$的水（$ai$是剩余的水）放到另外一个水槽中\n\n问最后能否使得某个水槽中剩余容量为$V$\n\n需要输出方案（不能超过$n+5$步）\n\n输出的形式形如：$cnt\\ x\\ y$\n\n表示从$x$中向$y$中用水瓢转移$cnt$次水\n贡献者：yybyyb"
}