{
    "description": "Ancient Egyptians are known to have understood difficult concepts in mathematics. The ancient Egyptian mathematician Ahmes liked to write a kind of arithmetic expressions on papyrus paper which he called as Ahmes arithmetic expression.\n\nAn Ahmes arithmetic expression can be defined as:\n\n- \" $ d $ \" is an Ahmes arithmetic expression, where $ d $ is a one-digit positive integer;\n- \" $ (E_{1}opE_{2}) $ \" is an Ahmes arithmetic expression, where $ E_{1} $ and $ E_{2} $ are valid Ahmes arithmetic expressions (without spaces) and $ op $ is either plus $ (+) $ or minus $ (-) $ .\n\n For example 5, (1-1) and ((1+(2-3))-5) are valid Ahmes arithmetic expressions.On his trip to Egypt, Fafa found a piece of papyrus paper having one of these Ahmes arithmetic expressions written on it. Being very ancient, the papyrus piece was very worn out. As a result, all the operators were erased, keeping only the numbers and the brackets. Since Fafa loves mathematics, he decided to challenge himself with the following task:\n\nGiven the number of plus and minus operators in the original expression, find out the maximum possible value for the expression on the papyrus paper after putting the plus and minus operators in the place of the original erased operators.",
    "inputFormat": "The first line contains a string $ E $ $ (1<=|E|<=10^{4}) $ — a valid Ahmes arithmetic expression. All operators are erased and replaced with '?'.\n\nThe second line contains two space-separated integers $ P $ and $ M $ ( $ 0<=min(P,M)<=100 $ ) — the number of plus and minus operators, respectively.\n\nIt is guaranteed that $ P+M= $ the number of erased operators.",
    "outputFormat": "Print one line containing the answer to the problem.",
    "samples": [
        [
            "(1?1)\n1 0\n",
            "2\n"
        ],
        [
            "(2?(1?2))\n1 1\n",
            "1\n"
        ],
        [
            "((1?(5?7))?((6?2)?7))\n3 2\n",
            "18\n"
        ],
        [
            "((1?(5?7))?((6?2)?7))\n2 3\n",
            "16\n"
        ]
    ],
    "hint": "- The first sample will be $ (1+1)=2 $ .\n- The second sample will be $ (2+(1-2))=1 $ .\n- The third sample will be $ ((1-(5-7))+((6+2)+7))=18 $ .\n- The fourth sample will be $ ((1+(5+7))-((6-2)-7))=16 $ .",
    "translation": "给出一个算式,由括号和小于$10$ 的正整数和问号组成\n\n问号是算式中的符号,现给出原式中加号的个数$p$ 和减号的个数$m$ \n\n对于所有填放方式对应的结果,求最大值"
}