{
    "description": "Arkady wants to have a dinner. He has just returned from a shop where he has bought a semifinished cutlet. He only needs to fry it. The cutlet should be fried for $ 2n $ seconds, in particular, it should be fried for $ n $ seconds on one side and $ n $ seconds on the other side. Arkady has already got a frying pan and turn on fire, but understood that maybe he won't be able to flip the cutlet exactly after $ n $ seconds after the beginning of cooking.\n\nArkady is too busy with sorting sticker packs in his favorite messenger and can flip the cutlet only in some periods of time. Namely, there are $ k $ periods of time in which he can do it, the $ i $ -th of them is an interval of time from $ l_{i} $ seconds after he starts cooking till $ r_{i} $ seconds, inclusive. Arkady decided that it's not required to flip the cutlet exactly in the middle of cooking, instead, he will flip it several times in such a way that the cutlet will be fried exactly $ n $ seconds on one side and $ n $ seconds on the other side in total.\n\nHelp Arkady and find out if it's possible for him to cook the cutlet, if he is able to flip the cutlet only in given periods of time; and if yes, find the minimum number of flips he needs to cook the cutlet.",
    "inputFormat": "The first line contains two integers $ n $ and $ k $ ( $ 1<=n<=100000 $ , $ 1<=k<=100 $ ) — the number of seconds the cutlet should be cooked on each side and number of periods of time in which Arkady can flip it.\n\nThe next $ k $ lines contain descriptions of these intervals. Each line contains two integers $ l_{i} $ and $ r_{i} $ ( $ 0<=l_{i}<=r_{i}<=2·n $ ), meaning that Arkady can flip the cutlet in any moment starting from $ l_{i} $ seconds after the beginning of cooking and finishing at $ r_{i} $ seconds after beginning of cooking. In particular, if $ l_{i}=r_{i} $ then Arkady can flip the cutlet only in the moment $ l_{i}=r_{i} $ . It's guaranteed that $ l_{i}>r_{i-1} $ for all $ 2<=i<=k $ .",
    "outputFormat": "Output \"Hungry\" if Arkady won't be able to fry the cutlet for exactly $ n $ seconds on one side and exactly $ n $ seconds on the other side.\n\nOtherwise, output \"Full\" in the first line, and the minimum number of times he should flip the cutlet in the second line.",
    "samples": [
        [
            "10 2\n3 5\n11 13\n",
            "Full\n2\n"
        ],
        [
            "10 3\n3 5\n9 10\n11 13\n",
            "Full\n1\n"
        ],
        [
            "20 1\n3 19\n",
            "Hungry\n"
        ]
    ],
    "hint": "In the first example Arkady should flip the cutlet in time moment $ 3 $ seconds after he starts cooking and in time moment $ 13 $ seconds after he starts cooking.\n\nIn the second example, Arkady can flip the cutlet at $ 10 $ seconds after he starts cooking.",
    "translation": "有$2\\times n$ 的时间去煎一块两面的肉\n\n给你$k$ 个不相交时间区间$[l_i,r_i]$ \n\n你可以在这些区间的时间内任意次翻转这块肉\n\n问是否存在合法的方案使得两面恰好都只煎了$n$ 分钟\n\n求最小翻转次数\n\n$n\\le10^5,k\\le100$ \n\n感谢@Kelin 提供的翻译"
}