{
    "description": "Dima has a hamsters farm. Soon $ N $ hamsters will grow up on it and Dima will sell them in a city nearby.\n\nHamsters should be transported in boxes. If some box is not completely full, the hamsters in it are bored, that's why each box should be completely full with hamsters.\n\nDima can buy boxes at a factory. The factory produces boxes of $ K $ kinds, boxes of the $ i $ -th kind can contain in themselves $ a_{i} $ hamsters. Dima can buy any amount of boxes, but he should buy boxes of only one kind to get a wholesale discount.\n\nOf course, Dima would buy boxes in such a way that each box can be completely filled with hamsters and transported to the city. If there is no place for some hamsters, Dima will leave them on the farm.\n\nFind out how many boxes and of which type should Dima buy to transport maximum number of hamsters.",
    "inputFormat": "The first line contains two integers $ N $ and $ K $ ( $ 0<=N<=10^{18} $ , $ 1<=K<=10^{5} $ ) — the number of hamsters that will grow up on Dima's farm and the number of types of boxes that the factory produces.\n\nThe second line contains $ K $ integers $ a_{1} $ , $ a_{2} $ , ..., $ a_{K} $ ( $ 1<=a_{i}<=10^{18} $ for all $ i $ ) — the capacities of boxes.",
    "outputFormat": "Output two integers: the type of boxes that Dima should buy and the number of boxes of that type Dima should buy. Types of boxes are numbered from $ 1 $ to $ K $ in the order they are given in input.\n\nIf there are many correct answers, output any of them.",
    "samples": [
        [
            "19 3\n5 4 10\n",
            "2 4\n"
        ],
        [
            "28 3\n5 6 30\n",
            "1 5\n"
        ]
    ],
    "hint": "",
    "translation": "Dima有$n$ 只仓鼠，有$k$ 种盒子，每种盒子编号为1~k，可以装$a_i$ 只仓鼠，所有盒子都要装满仓鼠，剩下的仓鼠不装，Dima想让剩下的仓鼠最少，求应选盒子和盒子总数，如果有多种情况，输出任意一种。\n\n输入格式：第一行为n和k，第二行为$a_1,a_2,\\ldots,a_k$ 。\n\n输出格式：一行，两个整数，表示应选盒子种类的编号和盒子总数。\n\n感谢 @WDLGZH2017  提供的翻译。"
}