{
    "description": "Arkady and Kirill visited an exhibition of rare coins. The coins were located in a row and enumerated from left to right from $ 1 $ to $ k $ , each coin either was laid with its obverse (front) side up, or with its reverse (back) side up.\n\nArkady and Kirill made some photos of the coins, each photo contained a segment of neighboring coins. Akrady is interested in obverses, so on each photo made by him there is at least one coin with obverse side up. On the contrary, Kirill is interested in reverses, so on each photo made by him there is at least one coin with its reverse side up.\n\nThe photos are lost now, but Arkady and Kirill still remember the bounds of the segments of coins each photo contained. Given this information, compute the remainder of division by $ 10^{9}+7 $ of the number of ways to choose the upper side of each coin in such a way, that on each Arkady's photo there is at least one coin with obverse side up, and on each Kirill's photo there is at least one coin with reverse side up.",
    "inputFormat": "The first line contains three integers $ k $ , $ n $ and $ m $ ( $ 1<=k<=10^{9} $ , $ 0<=n,m<=10^{5} $ ) — the total number of coins, the number of photos made by Arkady, and the number of photos made by Kirill, respectively.\n\nThe next $ n $ lines contain the descriptions of Arkady's photos, one per line. Each of these lines contains two integers $ l $ and $ r $ ( $ 1<=l<=r<=k $ ), meaning that among coins from the $ l $ -th to the $ r $ -th there should be at least one with obverse side up.\n\nThe next $ m $ lines contain the descriptions of Kirill's photos, one per line. Each of these lines contains two integers $ l $ and $ r $ ( $ 1<=l<=r<=k $ ), meaning that among coins from the $ l $ -th to the $ r $ -th there should be at least one with reverse side up.",
    "outputFormat": "Print the only line — the number of ways to choose the side for each coin modulo $ 10^{9}+7=1000000007 $ .",
    "samples": [
        [
            "5 2 2\n1 3\n3 5\n2 2\n4 5\n",
            "8\n"
        ],
        [
            "5 3 2\n1 3\n2 2\n3 5\n2 2\n4 5\n",
            "0\n"
        ],
        [
            "60 5 7\n1 3\n50 60\n1 60\n30 45\n20 40\n4 5\n6 37\n5 18\n50 55\n22 27\n25 31\n44 45\n",
            "732658600\n"
        ]
    ],
    "hint": "In the first example the following ways are possible ('O' — obverse, 'R' — reverse side):\n\n- OROOR,\n- ORORO,\n- ORORR,\n- RROOR,\n- RRORO,\n- RRORR,\n- ORROR,\n- ORRRO.\n\nIn the second example the information is contradictory: the second coin should have obverse and reverse sides up at the same time, that is impossible. So, the answer is $ 0 $ .",
    "translation": "### 题目大意\n\n有$k(1 \\leq k \\leq 10^9)$个硬币，每个硬币有正面朝上和反面朝上两种状态。\n\n现有$n+m(0 \\leq n,m \\leq 10^5)$个限制条件，每个限制条件形如$(l_i,r_i)(1 \\leq l_i \\leq r_i \\leq k)$。前$n$个限制条件限制区间$[l_i,r_i]$内至少有一个硬币正面朝上，后$m$个限制条件限制区间$[l_i,r_i]$内至少有一个硬币反面朝上。\n\n问共有多少种摆放硬币的方案使得所有限制条件都被满足。答案对$10^9+7$取模。\n\n### 输入数据格式\n\n第一行三个整数$k,n,m$\n\n接下来$n+m$行每行两个正整数$l_i,r_i$表示一个限制区间\n\n### 输出数据格式\n\n一行表示方案数"
}