{
    "description": "Consider the following game for two players. There is one white token and some number of black tokens. Each token is placed on a plane in a point with integer coordinates $ x $ and $ y $ .\n\nThe players take turn making moves, white starts. On each turn, a player moves all tokens of their color by $ 1 $ to up, down, left or right. Black player can choose directions for each token independently.\n\nAfter a turn of the white player the white token can not be in a point where a black token is located. There are no other constraints on locations of the tokens: positions of black tokens can coincide, after a turn of the black player and initially the white token can be in the same point with some black point. If at some moment the white player can't make a move, he loses. If the white player makes $ 10^{100500} $ moves, he wins.\n\nYou are to solve the following problem. You are given initial positions of all black tokens. It is guaranteed that initially all these positions are distinct. In how many places can the white token be located initially so that if both players play optimally, the black player wins?",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=10^{5} $ ) — the number of black points.\n\nThe ( $ i+1 $ )-th line contains two integers $ x_{i} $ , $ y_{i} $ ( $ -10^{5}<=x_{i},y_{i},<=10^{5} $ ) — the coordinates of the point where the $ i $ -th black token is initially located.\n\nIt is guaranteed that initial positions of black tokens are distinct.",
    "outputFormat": "Print the number of points where the white token can be located initially, such that if both players play optimally, the black player wins.",
    "samples": [
        [
            "4\n-2 -1\n0 1\n0 -3\n2 -1\n",
            "4\n"
        ],
        [
            "4\n-2 0\n-1 1\n0 -2\n1 -1\n",
            "2\n"
        ],
        [
            "16\n2 1\n1 2\n-1 1\n0 1\n0 0\n1 1\n2 -1\n2 0\n1 0\n-1 -1\n1 -1\n2 2\n0 -1\n-1 0\n0 2\n-1 2\n",
            "4\n"
        ]
    ],
    "hint": "In the first and second examples initial positions of black tokens are shown with black points, possible positions of the white token (such that the black player wins) are shown with white points.\n\nThe first example: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF930D/9cafc5b5a915244f359ed7d639551c9e3e967f72.png)\n\nThe second example: ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF930D/7a4517e8c3fec7bb965f7f3524bb8530614362f2.png)\n\nIn the third example the white tokens should be located in the inner square $ 2×2 $ , to make the black player win. ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF930D/fbaddc982f079c3a3bd9f0328eb525dca749c972.png)"
}