{
    "description": "Igor K. very much likes a multiplayer role playing game WineAge II. Who knows, perhaps, that might be the reason for his poor performance at the university. As any person who plays the game, he is interested in equipping his hero with as good weapon and outfit as possible.\n\nOne day, as he was reading the game's forum yet again, he discovered a very interesting fact. As it turns out, each weapon in the game is characterised with $ k $ different numbers: $ a_{1},...,a_{k} $ . They are called hit indicators and according to the game developers' plan they are pairwise coprime.\n\nThe damage that is inflicted during a hit depends not only on the weapon's characteristics, but also on the hero's strength parameter. Thus, if the hero's strength equals $ n $ , than the inflicted damage will be calculated as the number of numbers on the segment ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF93E/7c9ede55f73532a1d6ca7574887c95534e61c3ff.png), that aren't divisible by any hit indicator $ a_{i} $ .\n\nRecently, having fulfilled another quest, Igor K. found a new Lostborn sword. He wants to know how much damage he will inflict upon his enemies if he uses it.",
    "inputFormat": "The first line contains two integers: $ n $ and $ k $ ( $ 1<=n<=10^{13} $ , $ 1<=k<=100 $ ). They are the indicator of Igor K's hero's strength and the number of hit indicators.\n\nThe next line contains space-separated $ k $ integers $ a_{i} $ ( $ 1<=a_{i}<=1000 $ ). They are Lostborn sword's hit indicators. The given $ k $ numbers are pairwise coprime.",
    "outputFormat": "Print the single number — the damage that will be inflicted by Igor K.'s hero when he uses his new weapon.\n\nPlease, do not use the %lld specificator to read or write 64-bit integers in C++. It is preferred to use the cin, cout streams or the %I64d specificator.",
    "samples": [
        [
            "20 3\n2 3 5\n",
            "6\n"
        ],
        [
            "50 2\n15 8\n",
            "41\n"
        ]
    ],
    "hint": "",
    "translation": "#### 题目描述\n\n小Biu最近喜欢上一款角色扮演游戏，游戏中的每一款武器有 $ k $ 个参数 $ a_{1},...,a_{k} $ ，并且根据游戏说明，这些参数两两互质。\n\n游戏中的主角为英雄，英雄发起攻击时，造成的伤害不仅与武器有关，还与英雄的力量有关。如果英雄的力量为 $ n $ ，那么一次攻击造成的伤害为区间 $[1,n]$ 中不能被武器参数整除的数的个数。\n\n现在小Biu获得了一把新的武器装备，他想知道用某个英雄发起攻击时，造成的伤害值为多少。\n\n\n\n#### 输入格式\n\n第一行包含两个整数 $ n $ 和 $ k $ ( $ 1\\le n\\le 10^{13} $ , $ 1\\le k\\le 100 $ )，表示英雄的力量和装备的参数个数；\n\n第二行包含 $ k $ 个整数 $ a_{i} $ ( $ 1\\le a_{i}\\le 1000 $ )，表示装备的每个参数，这些参数两两互质。\n\n\n\n#### 输出格式\n\n输出一个整数，表示造成的伤害值。"
}