{
    "description": "When Igor K. was a freshman, his professor strictly urged him, as well as all other freshmen, to solve programming Olympiads. One day a problem called \"Flags\" from a website called Timmy's Online Judge caught his attention. In the problem one had to find the number of three-colored flags that would satisfy the condition... actually, it doesn't matter. Igor K. quickly found the formula and got the so passionately desired Accepted.\n\nHowever, the professor wasn't very much impressed. He decided that the problem represented on Timmy's Online Judge was very dull and simple: it only had three possible colors of flag stripes and only two limitations. He suggested a complicated task to Igor K. and the fellow failed to solve it. Of course, we won't tell anybody that the professor couldn't solve it as well.\n\nAnd how about you? Can you solve the problem?\n\nThe flags consist of one or several parallel stripes of similar width. The stripes can be one of the following colors: white, black, red or yellow. You should find the number of different flags with the number of stripes from $ L $ to $ R $ , if:\n\n- a flag cannot have adjacent stripes of one color;\n- a flag cannot have adjacent white and yellow stripes;\n- a flag cannot have adjacent red and black stripes;\n- a flag cannot have the combination of black, white and red stripes following one after another in this or reverse order;\n- symmetrical flags (as, for example, a WB and a BW flag, where W and B stand for the white and black colors) are considered the same.",
    "inputFormat": "The only line contains two integers $ L $ and $ R $ ( $ 1<=L<=R<=10^{9} $ ). They are the lower and upper borders of the number of stripes on the flag.",
    "outputFormat": "Print a single number — the number of different flags that would satisfy the condition of the problem and would have from $ L $ to $ R $ stripes, modulo $ 1000000007 $ .",
    "samples": [
        [
            "3 4\n",
            "23"
        ],
        [
            "5 6\n",
            "64"
        ]
    ],
    "hint": "In the first test the following flags exist (they are listed in the lexicographical order, the letters B, R, W, Y stand for Black, Red, White and Yellow correspondingly):\n\n3 stripes: BWB, BYB, BYR, RWR, RYR, WBW, WBY, WRW, WRY, YBY, YRY (overall 11 flags).\n\n4 stripes: BWBW, BWBY, BYBW, BYBY, BYRW, BYRY, RWRW, RWRY, RYBW, RYBY, RYRW, RYRY (12 flags).\n\nThat's why the answer to test 1 is equal to $ 11+12=23 $ .",
    "translation": "问只由 R、B、W、Y 组成的长度介于 $[L,R]$ 且满足以下四个条件的字符串数量。\n\n1. 相邻两个字符不同。\n\n2. W 和 Y 不能相邻，R 和 B 不能相邻。\n\n3. 不能出现连续三个字符是 B、W、R 的一个排列。\n\n4. 两个字符串互为反序视做同一个。\n\n输出结果模 $10^9+7$。"
}