{
    "description": "Ivan is a student at Berland State University (BSU). There are $ n $ days in Berland week, and each of these days Ivan might have some classes at the university.\n\nThere are $ m $ working hours during each Berland day, and each lesson at the university lasts exactly one hour. If at some day Ivan's first lesson is during $ i $ -th hour, and last lesson is during $ j $ -th hour, then he spends $ j-i+1 $ hours in the university during this day. If there are no lessons during some day, then Ivan stays at home and therefore spends $ 0 $ hours in the university.\n\nIvan doesn't like to spend a lot of time in the university, so he has decided to skip some lessons. He cannot skip more than $ k $ lessons during the week. After deciding which lessons he should skip and which he should attend, every day Ivan will enter the university right before the start of the first lesson he does not skip, and leave it after the end of the last lesson he decides to attend. If Ivan skips all lessons during some day, he doesn't go to the university that day at all.\n\nGiven $ n $ , $ m $ , $ k $ and Ivan's timetable, can you determine the minimum number of hours he has to spend in the university during one week, if he cannot skip more than $ k $ lessons?",
    "inputFormat": "The first line contains three integers $ n $ , $ m $ and $ k $ ( $ 1<=n,m<=500 $ , $ 0<=k<=500 $ ) — the number of days in the Berland week, the number of working hours during each day, and the number of lessons Ivan can skip, respectively.\n\nThen $ n $ lines follow, $ i $ -th line containing a binary string of $ m $ characters. If $ j $ -th character in $ i $ -th line is 1, then Ivan has a lesson on $ i $ -th day during $ j $ -th hour (if it is 0, there is no such lesson).",
    "outputFormat": "Print the minimum number of hours Ivan has to spend in the university during the week if he skips not more than $ k $ lessons.",
    "samples": [
        [
            "2 5 1\n01001\n10110\n",
            "5\n"
        ],
        [
            "2 5 0\n01001\n10110\n",
            "8\n"
        ]
    ],
    "hint": "In the first example Ivan can skip any of two lessons during the first day, so he spends $ 1 $ hour during the first day and $ 4 $ hours during the second day.\n\nIn the second example Ivan can't skip any lessons, so he spends $ 4 $ hours every day.",
    "translation": "题目大意：给出n行m列01串，对于每一行所要花费的代价是行中第一个1和最后一个1之间的距离加一，现在你有魔法可以去除掉k个1，问去掉不多于k个1的情况下，你所能获得的最小代价是多少。\n\n由 @LJC00118 提供翻译"
}