{
    "description": "It is never too late to play the fancy \"Binary Cards\" game!\n\nThere is an infinite amount of cards of positive and negative ranks that are used in the game. The absolute value of any card rank is a power of two, i.e. each card has a rank of either $ 2^{k} $ or $ -2^{k} $ for some integer $ k>=0 $ . There is an infinite amount of cards of any valid rank.\n\nAt the beginning of the game player forms his deck that is some multiset (possibly empty) of cards. It is allowed to pick any number of cards of any rank but the small deck is considered to be a skill indicator. Game consists of $ n $ rounds. In the $ i $ -th round jury tells the player an integer $ a_{i} $ . After that the player is obligated to draw such a subset of his deck that the sum of ranks of the chosen cards is equal to $ a_{i} $ (it is allowed to not draw any cards, in which case the sum is considered to be equal to zero). If player fails to do so, he loses and the game is over. Otherwise, player takes back all of his cards into his deck and the game proceeds to the next round. Player is considered a winner if he is able to draw the suitable set of cards in each of the rounds.\n\nSomebody told you which numbers $ a_{i} $ the jury is going to tell you in each round. Now you want to pick a deck consisting of the minimum number of cards that allows you to win the \"Binary Cards\" game.",
    "inputFormat": "The first line of input contains an integer $ n $ ( $ 1<=n<=100000 $ ), the number of rounds in the game.\n\nThe second line of input contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ -100000<=a_{i}<=100000 $ ), the numbers that jury is going to tell in each round.",
    "outputFormat": "In the first line print the integer $ k $ ( $ 0<=k<=100000 $ ), the minimum number of cards you have to pick in your deck in ordered to win the \"Binary Cards\".\n\nIn the second line print $ k $ integers $ b_{1},b_{2},...,b_{k} $ ( $ -2^{20}<=b_{i}<=2^{20} $ , $ |b_{i}| $ is a power of two), the ranks of the cards in your deck. You may output ranks in any order. If there are several optimum decks, you are allowed to print any of them.\n\nIt is guaranteed that there exists a deck of minimum size satisfying all the requirements above.",
    "samples": [
        [
            "1\n9\n",
            "2\n1 8\n"
        ],
        [
            "5\n-1 3 0 4 7\n",
            "3\n4 -1 4\n"
        ],
        [
            "4\n2 -2 14 18\n",
            "3\n-2 2 16"
        ]
    ],
    "hint": "In the first sample there is the only round in the game, in which you may simply draw both your cards. Note that this sample test is the only one satisfying the first test group constraints.\n\nIn the second sample you may draw the only card $ -1 $ in the first round, cards $ 4 $ and $ -1 $ in the second round, nothing in the third round, the only card $ 4 $ in the fourth round and the whole deck in the fifth round.",
    "translation": "给出$n$个需要表示的数，你需要用最少的$2^k$或$-2^k$，使得能拼出所有需要表示的数。输出方案。\n\n$n,|A_i|\\leq 100000$"
}