{
    "description": "BigData Inc. is a corporation that has $ n $ data centers indexed from $ 1 $ to $ n $ that are located all over the world. These data centers provide storage for client data (you can figure out that client data is really big!).\n\nMain feature of services offered by BigData Inc. is the access availability guarantee even under the circumstances of any data center having an outage. Such a guarantee is ensured by using the two-way replication. Two-way replication is such an approach for data storage that any piece of data is represented by two identical copies that are stored in two different data centers.\n\nFor each of $ m $ company clients, let us denote indices of two different data centers storing this client data as $ c_{i,1} $ and $ c_{i,2} $ .\n\nIn order to keep data centers operational and safe, the software running on data center computers is being updated regularly. Release cycle of BigData Inc. is one day meaning that the new version of software is being deployed to the data center computers each day.\n\nData center software update is a non-trivial long process, that is why there is a special hour-long time frame that is dedicated for data center maintenance. During the maintenance period, data center computers are installing software updates, and thus they may be unavailable. Consider the day to be exactly $ h $ hours long. For each data center there is an integer $ u_{j} $ ( $ 0<=u_{j}<=h-1 $ ) defining the index of an hour of day, such that during this hour data center $ j $ is unavailable due to maintenance.\n\nSumming up everything above, the condition $ u_{ci,1}≠u_{ci,2} $ should hold for each client, or otherwise his data may be unaccessible while data centers that store it are under maintenance.\n\nDue to occasional timezone change in different cities all over the world, the maintenance time in some of the data centers may change by one hour sometimes. Company should be prepared for such situation, that is why they decided to conduct an experiment, choosing some non-empty subset of data centers, and shifting the maintenance time for them by an hour later (i.e. if $ u_{j}=h-1 $ , then the new maintenance hour would become $ 0 $ , otherwise it would become $ u_{j}+1 $ ). Nonetheless, such an experiment should not break the accessibility guarantees, meaning that data of any client should be still available during any hour of a day after the data center maintenance times are changed.\n\nSuch an experiment would provide useful insights, but changing update time is quite an expensive procedure, that is why the company asked you to find out the minimum number of data centers that have to be included in an experiment in order to keep the data accessibility guarantees.",
    "inputFormat": "The first line of input contains three integers $ n $ , $ m $ and $ h $ ( $ 2<=n<=100000 $ , $ 1<=m<=100000 $ , $ 2<=h<=100000 $ ), the number of company data centers, number of clients and the day length of day measured in hours.\n\nThe second line of input contains $ n $ integers $ u_{1},u_{2},...,u_{n} $ ( $ 0<=u_{j}<h $ ), $ j $ -th of these numbers is an index of a maintenance hour for data center $ j $ .\n\nEach of the next $ m $ lines contains two integers $ c_{i,1} $ and $ c_{i,2} $ ( $ 1<=c_{i,1},c_{i,2}<=n $ , $ c_{i,1}≠c_{i,2} $ ), defining the data center indices containing the data of client $ i $ .\n\nIt is guaranteed that the given maintenance schedule allows each client to access at least one copy of his data at any moment of day.",
    "outputFormat": "In the first line print the minimum possible number of data centers $ k $ ( $ 1<=k<=n $ ) that have to be included in an experiment in order to keep the data available for any client.\n\nIn the second line print $ k $ distinct integers $ x_{1},x_{2},...,x_{k} $ ( $ 1<=x_{i}<=n $ ), the indices of data centers whose maintenance time will be shifted by one hour later. Data center indices may be printed in any order.\n\nIf there are several possible answers, it is allowed to print any of them. It is guaranteed that at there is at least one valid choice of data centers.",
    "samples": [
        [
            "3 3 5\n4 4 0\n1 3\n3 2\n3 1\n",
            "1\n3 "
        ],
        [
            "4 5 4\n2 1 0 3\n4 3\n3 2\n1 2\n1 4\n1 3\n",
            "4\n1 2 3 4 "
        ]
    ],
    "hint": "Consider the first sample test. The given answer is the only way to conduct an experiment involving the only data center. In such a scenario the third data center has a maintenance during the hour 1, and no two data centers storing the information of the same client have maintenance at the same hour.\n\nOn the other hand, for example, if we shift the maintenance time on hour later for the first data center, then the data of clients 1 and 3 will be unavailable during the hour 0.",
    "translation": "## 题目描述\n\n给出 $n$ 个数据中心，$m$ 份资料。要把 $m$ 份资料放到其中的两个数据中心备份，需要保证任意时刻都可以至少在一个数据中心进行备份。定义一天有 $h$ 个小时，每个数据中心在一天内有一小时维护时间 $u_i$（$0 \\leq u_i < h$），在这一小时内该数据中心无法进行备份。\n\n由于某种原因，需要把一些数据中心的维护时间向后推迟 1 小时（一个数据中心的维护时间的向后推迟可能导致有的资料无法在任意时刻进行备份 且 若推迟前 $u_i = h - 1$ 那么推迟后 $u_i = 0$），请你求出最少需要向后推迟多少个数据中心，并把这些数据中心的编号输出出来。\n\n## 输入格式\n\n第一行 3 个整数 $n$，$m$，$h$，含义如上。\n\n第二行 $n$ 个整数，为 $u_i$ 到 $u_n$。\n\n接下来 $m$ 行，每行 2 个整数$c_1$，$c_2$（$u_{c_1} \\neq u_{c_2}$），分别表示第 $i$ 份资料可以在哪两个数据中心进行备份。\n\n**注意：输入的 $u_{c_1} \\ne u_{c_2}$，意味着刚开始时任意资料都可以在任意时间进行备份。**\n\n## 输出格式\n\n第一行 1 个整数 $k$，表示最少需要推迟 $k$ 个数据中心。\n\n第二行 $k$ 个整数，分别为 $x_1$ 到 $x_k$，表示需要推迟的数据中心的编号。"
}