{
    "description": "Year 18 AD. Famous astronomer Philon the Berlander publishes a book \"About Sky and Cosmos», in which he describes an incredible picture seen by him on a night sky while observing the skies. He once seen $ 2n $ stars on a clear sky and the Moon. Surprisingly, it was possible to divide all stars in pairs in such way that any line passing through the centers of two paired stars also passed through the center of the Moon, also all such lines were distinct. Philon carefully represented such a situation on a sky map, introducing a coordinate system. While doing that, he noticed that centers of all stars and the center of the Moon are points with integer coordinates. As Philon thought that the Earth and the Moon were flat, his coordinate system was two-dimensional. Coordinate system was chosen by an astronomer in such way that the coordinates of all objects (including the Moon) are no more than $ 10^{6} $ by the absolute value. Moreover, no two objects (two stars or a star and a Moon) were not located at the same point.\n\nApart from the sky map Philon wrote a prediction that in 2000 years stars will take exactly the same places, but the Moon will be replaced by a huge comet which will destroy the Earth.\n\nIt is 2018 AD now. You got a book of Philon the Berlander and you were horrified to discover that the stars on the sky are in exactly the same position as they were 2000 years ago! Unfortunately, some parts of a sky map were lost, so there are only star locations that are visible on it and there are no details about how the stars were divided in pairs. Moreover,, there is no point corresponding to the center of the Moon on this map. In order to find out the possible location of a comet and save the humanity from the terrible end, you should immediately find out some suitable location for the center of the Moon!",
    "inputFormat": "In the first line of input there is an integer $ n $ ( $ 2<=n<=2600 $ ), the number of star pairs seen by an astronomer in the sky.\n\nIn the following $ 2n $ lines there are pairs of integers $ x_{i} $ , $ y_{i} $ ( $ -10^{6}<=x_{i},y_{i}<=10^{6} $ ), the coordinates of star centers in the sky map. Note that the stars are listed in an arbitrary order that has nothing common with the distribution of stars into pairs as found out by Philon the Berlander. Centers of no two stars coincide.",
    "outputFormat": "If astronomer was wrong and there is no way to distribute all points in pairs in such manner that all lines passing through these point pairs are distinct lines intersecting in a single point with integer coordinates, and this intersection point is different from centers of all stars, then print \"No\" (without the quotes) in the only line of input.\n\nOtherwise print \"Yes\" (without the quotes). In the second line print pair of integers $ x $ , $ y $ ( $ |x|,|y|<=10^{6} $ ), the coordinates of a point that contains a center of the Moon in your solution. If there are several possible answers, output any of them. Note that the printed point should be different from all the star centers.",
    "samples": [
        [
            "2\n1 1\n1 3\n3 1\n3 3\n",
            "Yes\n2 2\n"
        ],
        [
            "3\n4 2\n6 2\n2 1\n2 6\n4 4\n6 6\n",
            "Yes\n2 2\n"
        ],
        [
            "2\n1 1\n2 2\n4 4\n5 5\n",
            "No\n"
        ],
        [
            "2\n1 1\n2 1\n1 2\n2 2\n",
            "No\n"
        ],
        [
            "2\n0 0\n1 1\n-1 -1\n-1 1\n",
            "No\n"
        ]
    ],
    "hint": "Pictures for the sample tests are given below.\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF949F/caa774b3884cf747db8a5167c62aa9ce458b55e8.png)\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF949F/03fdf97e99822ba2a71321bac2b04875c5dc3505.png)\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF949F/e0d0649387fd16ce48dece7971baf6160dc7254e.png)\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF949F/289fd3e5aec24f865dfe2769f4522655d03af94f.png)\n\n![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF949F/1cb1593f7920b5ff5652699fdc6b4a7bc01bb71b.png)\n\nIn the fourth sample test the Moon center could not have possibly been in a point $ (1.5,1.5) $ since the coordinates of this point are non-integer.\n\nIn the fifth sample test there are no suitable points that do not coincide with a center of some star.",
    "translation": "## In put\n\n在输入的第一行，有个整数 $n(2\\le n\\le2600)$，以及表述天文学家发现的在太空中一对一对的星星（发亮的星体），下面输入 $n\\times2$ 行，每行两个整数 $x_i,y_i(-10^6\\le x_i,y_i\\le 10^6)$，以表示太空中星星的坐标，**注：这是一堆星星，是随便排列的，没有两个星星的中心重合的情况。**\n\n## Out put\n\n如果所有的点不能成对分配并在一个整数坐标点上相交，则输出 `No`，此外，该交点必须与所有星星的中文点不同，否则输出 `Yes`，在第二行输出一对整数 $x,y(\\left\\vert x\\right\\vert,\\left\\vert y\\right\\vert\\le10^6)$。如果有好几个答案都对，就随便输出一个。**注：输出的点应该与所有星星的中心点不一样。**"
}