{
    "description": "Bob is a farmer. He has a large pasture with many sheep. Recently, he has lost some of them due to wolf attacks. He thus decided to place some shepherd dogs in such a way that all his sheep are protected.\n\nThe pasture is a rectangle consisting of $ R×C $ cells. Each cell is either empty, contains a sheep, a wolf or a dog. Sheep and dogs always stay in place, but wolves can roam freely around the pasture, by repeatedly moving to the left, right, up or down to a neighboring cell. When a wolf enters a cell with a sheep, it consumes it. However, no wolf can enter a cell with a dog.\n\nInitially there are no dogs. Place dogs onto the pasture in such a way that no wolf can reach any sheep, or determine that it is impossible. Note that since you have many dogs, you do not need to minimize their number.",
    "inputFormat": "First line contains two integers $ R $ ( $ 1<=R<=500 $ ) and $ C $ ( $ 1<=C<=500 $ ), denoting the number of rows and the numbers of columns respectively.\n\nEach of the following $ R $ lines is a string consisting of exactly $ C $ characters, representing one row of the pasture. Here, 'S' means a sheep, 'W' a wolf and '.' an empty cell.",
    "outputFormat": "If it is impossible to protect all sheep, output a single line with the word \"No\".\n\nOtherwise, output a line with the word \"Yes\". Then print $ R $ lines, representing the pasture after placing dogs. Again, 'S' means a sheep, 'W' a wolf, 'D' is a dog and '.' an empty space. You are not allowed to move, remove or add a sheep or a wolf.\n\nIf there are multiple solutions, you may print any of them. You don't have to minimize the number of dogs.",
    "samples": [
        [
            "6 6\n..S...\n..S.W.\n.S....\n..W...\n...W..\n......\n",
            "Yes\n..SD..\n..SDW.\n.SD...\n.DW...\nDD.W..\n......\n"
        ],
        [
            "1 2\nSW\n",
            "No\n"
        ],
        [
            "5 5\n.S...\n...S.\nS....\n...S.\n.S...\n",
            "Yes\n.S...\n...S.\nS.D..\n...S.\n.S...\n"
        ]
    ],
    "hint": "In the first example, we can split the pasture into two halves, one containing wolves and one containing sheep. Note that the sheep at (2,1) is safe, as wolves cannot move diagonally.\n\nIn the second example, there are no empty spots to put dogs that would guard the lone sheep.\n\nIn the third example, there are no wolves, so the task is very easy. We put a dog in the center to observe the peacefulness of the meadow, but the solution would be correct even without him.",
    "translation": "## 题目背景：（有少许简化和修改，但依然符合题意）\n\nBob是个农夫，他有一个$R*C$ 的草地。\n\n草地上有许多羊，同时也有许多狼。\n\n羊不会动，但是狼会向上下左右四个方向动。\n\n所以Bob打算在草地上放上狗，使狼和羊完全隔开。\n\n你的任务就是输出一种可行方案，\n放的狗的数量不必最少。\n\t\n## 输入格式：\n第一行两个数$R$ $(1<=R<=500)$ 和$C$ $(1<=C<=500)$ \n\t\n接下来$R$ 行，每行一个长度为C的字符串。来表示这片草地上的东西。\n\n其中'.'是空地，'W'是狼，'S'是羊。\n## 输出格式：\n第一行输出$Yes$或$No$，表示是否可行。\n\n如果可行$Yes$\n接下来输出$R$行，每行一个长度为$C$的字符串。\n来表示放完狗之后的情况。\n狗只能放到空地上，用'D'表示。\n\n感谢@cn：苏卿念 提供的翻译"
}