{
    "description": "The Resistance is trying to take control over as many planets of a particular solar system as possible. Princess Heidi is in charge of the fleet, and she must send ships to some planets in order to maximize the number of controlled planets.\n\nThe Galaxy contains $ N $ planets, connected by bidirectional hyperspace tunnels in such a way that there is a unique path between every pair of the planets.\n\nA planet is controlled by the Resistance if there is a Resistance ship in its orbit, or if the planet lies on the shortest path between some two planets that have Resistance ships in their orbits.\n\nHeidi has not yet made up her mind as to how many ships to use. Therefore, she is asking you to compute, for every $ K=1,2,3,...,N $ , the maximum number of planets that can be controlled with a fleet consisting of $ K $ ships.",
    "inputFormat": "The first line of the input contains an integer $ N $ ( $ 1<=N<=10^{5} $ ) – the number of planets in the galaxy.\n\nThe next $ N-1 $ lines describe the hyperspace tunnels between the planets. Each of the $ N-1 $ lines contains two space-separated integers $ u $ and $ v $ ( $ 1<=u,v<=N $ ) indicating that there is a bidirectional hyperspace tunnel between the planets $ u $ and $ v $ . It is guaranteed that every two planets are connected by a path of tunnels, and that each tunnel connects a different pair of planets.",
    "outputFormat": "On a single line, print $ N $ space-separated integers. The $ K $ -th number should correspond to the maximum number of planets that can be controlled by the Resistance using a fleet of $ K $ ships.",
    "samples": [
        [
            "3\n1 2\n2 3\n",
            "1 3 3 "
        ],
        [
            "4\n1 2\n3 2\n4 2\n",
            "1 3 4 4 "
        ]
    ],
    "hint": "Consider the first example. If $ K=1 $ , then Heidi can only send one ship to some planet and control it. However, for $ K>=2 $ , sending ships to planets 1 and 3 will allow the Resistance to control all planets.",
    "translation": "给你一颗由 $n$ 个点组成的**树**。对于一个点集 $S$,它所**占领**的点为：\n\n+ 点集 $S$ 中的所有点\n+ 对于任意 $u,v\\in S$,$u$ 到 $v$路径上的点。\n\n现在问你当点集的大小分别为 $1$ 到 $n$ 时，\n**占领**的点的数量最大是多少？\n\n$1\\leq n\\leq 10^5$"
}