{
    "description": "Overlooking the captivating blend of myriads of vernal hues, Arkady the painter lays out a long, long canvas.\n\nArkady has a sufficiently large amount of paint of three colours: cyan, magenta, and yellow. On the one-dimensional canvas split into $ n $ consecutive segments, each segment needs to be painted in one of the colours.\n\nArkady has already painted some (possibly none or all) segments and passes the paintbrush to you. You are to determine whether there are at least two ways of colouring all the unpainted segments so that no two adjacent segments are of the same colour. Two ways are considered different if and only if a segment is painted in different colours in them.",
    "inputFormat": "The first line contains a single positive integer $ n $ ( $ 1<=n<=100 $ ) — the length of the canvas.\n\nThe second line contains a string $ s $ of $ n $ characters, the $ i $ -th of which is either 'C' (denoting a segment painted in cyan), 'M' (denoting one painted in magenta), 'Y' (one painted in yellow), or '?' (an unpainted one).",
    "outputFormat": "If there are at least two different ways of painting, output \"Yes\"; otherwise output \"No\" (both without quotes).\n\nYou can print each character in any case (upper or lower).",
    "samples": [
        [
            "5\nCY??Y\n",
            "Yes\n"
        ],
        [
            "5\nC?C?Y\n",
            "Yes\n"
        ],
        [
            "5\n?CYC?\n",
            "Yes\n"
        ],
        [
            "5\nC??MM\n",
            "No\n"
        ],
        [
            "3\nMMY\n",
            "No\n"
        ]
    ],
    "hint": "For the first example, there are exactly two different ways of colouring: CYCMY and CYMCY.\n\nFor the second example, there are also exactly two different ways of colouring: CMCMY and CYCMY.\n\nFor the third example, there are four ways of colouring: MCYCM, MCYCY, YCYCM, and YCYCY.\n\nFor the fourth example, no matter how the unpainted segments are coloured, the existing magenta segments will prevent the painting from satisfying the requirements. The similar is true for the fifth example.",
    "translation": "有C，Y，M三种颜色，给你部分已涂的颜色。在'?'处涂颜色，如果有两种及以上的涂色方案使得相邻颜色不同则输出Yes，否则输出No"
}