{
    "description": "Hacker Zhorik wants to decipher two secret messages he intercepted yesterday. Yeah message is a sequence of encrypted blocks, each of them consists of several bytes of information.\n\nZhorik knows that each of the messages is an archive containing one or more files. Zhorik knows how each of these archives was transferred through the network: if an archive consists of $ k $ files of sizes $ l_{1},l_{2},...,l_{k} $ bytes, then the $ i $ -th file is split to one or more blocks $ b_{i,1},b_{i,2},...,b_{i,mi} $ (here the total length of the blocks $ b_{i,1}+b_{i,2}+...+b_{i,mi} $ is equal to the length of the file $ l_{i} $ ), and after that all blocks are transferred through the network, maintaining the order of files in the archive.\n\nZhorik thinks that the two messages contain the same archive, because their total lengths are equal. However, each file can be split in blocks in different ways in the two messages.\n\nYou are given the lengths of blocks in each of the two messages. Help Zhorik to determine what is the maximum number of files could be in the archive, if the Zhorik's assumption is correct.",
    "inputFormat": "The first line contains two integers $ n $ , $ m $ ( $ 1<=n,m<=10^{5} $ ) — the number of blocks in the first and in the second messages.\n\nThe second line contains $ n $ integers $ x_{1},x_{2},...,x_{n} $ ( $ 1<=x_{i}<=10^{6} $ ) — the length of the blocks that form the first message.\n\nThe third line contains $ m $ integers $ y_{1},y_{2},...,y_{m} $ ( $ 1<=y_{i}<=10^{6} $ ) — the length of the blocks that form the second message.\n\nIt is guaranteed that $ x_{1}+...+x_{n}=y_{1}+...+y_{m} $ . Also, it is guaranteed that $ x_{1}+...+x_{n}<=10^{6} $ .",
    "outputFormat": "Print the maximum number of files the intercepted array could consist of.",
    "samples": [
        [
            "7 6\n2 5 3 1 11 4 4\n7 8 2 4 1 8\n",
            "3\n"
        ],
        [
            "3 3\n1 10 100\n1 100 10\n",
            "2\n"
        ],
        [
            "1 4\n4\n1 1 1 1\n",
            "1\n"
        ]
    ],
    "hint": "In the first example the maximum number of files in the archive is 3. For example, it is possible that in the archive are three files of sizes $ 2+5=7 $ , $ 15=3+1+11=8+2+4+1 $ and $ 4+4=8 $ .\n\nIn the second example it is possible that the archive contains two files of sizes $ 1 $ and $ 110=10+100=100+10 $ . Note that the order of files is kept while transferring archives through the network, so we can't say that there are three files of sizes $ 1 $ , $ 10 $ and $ 100 $ .\n\nIn the third example the only possibility is that the archive contains a single file of size $ 4 $ .",
    "translation": "给出$n$ ,$m$ 和长度为$n$ ,$m$ 的两个数组,把这两个数组都分成若干段连续区间,使得第一个数组的第一段元素之和,第二个数组的第一段元素之和相等,第一个数组的第二段元素之和,第二个数组的第二段元素之和相等,,,第一个数组的第$q$ 段元素之和,第二个数组的第$q$ 段元素之和相等.问最多可以分成多少段\n\n## 输入\n第一行两个整数$n$  ,$m$  \n\n第二行$n$ 个数,为第一个数组中的元素\n\n第三行$m$ 个数,为第二个数组中的元素\n\n第一个数组元素之和等于第二个数组元素之和,且第一个数组元素和<=$1e6$  \n## 输出\n一个整数,表示最多能分的段数\n\n感谢@star_magic_young 提供的翻译\n"
}