{
    "description": "The stardate is 2015, and Death Stars are bigger than ever! This time, two rebel spies have yet again given Heidi two maps with the possible locations of the Death Stars.\n\nHeidi has now received two maps with possible locations of $ N $ Death Stars. She knows that each of the maps is possibly corrupted, and may contain some stars that are not Death Stars. Furthermore, each of the maps was created from a different point of view. Hence, stars that are shown in one of the maps are rotated and translated with respect to the other map. Now Heidi wants to find out which of the stars shown in both maps are actually Death Stars, and the correspondence between the Death Stars on the two maps.",
    "inputFormat": "The first line of the input contains an integer $ N $ ( $ 1000<=N<=50000 $ ) – the number of Death Stars. The second line of the input contains an integer $ N_{1} $ ( $ N<=N_{1}<=1.5·N $ ) – the number of stars in the first map. The next $ N_{1} $ lines specify the coordinates of the stars in the first map. The $ i $ -th line contains two space-separated floating-point numbers $ x_{i} $ and $ y_{i} $ with two decimal digits of precision each, representing the coordinates of the $ i $ -th star in the first map.\n\nThe next line of the input contains an integer $ N_{2} $ ( $ N<=N_{2}<=1.5·N $ ) – the number of stars in the second map. The next $ N_{2} $ lines contain locations of the stars in the second map, given in the same format as for the first map.",
    "outputFormat": "",
    "samples": [],
    "hint": "The tests are generated in the following way:\n\n- The number of Death Stars $ N $ is pre-selected in some way.\n- The numbers of stars on the first and on the second map, $ N_{1} $ and $ N_{2} $ , are selected uniformly at random between $ 1.0×N $ and $ 1.5×N $ .\n- $ N $ Death Stars are generated at random, with coordinates between $ -10000 $ and $ 10000 $ .\n- Additional $ N_{1}-N $ and $ N2-N $ stars for the first and for the second map respectively are generated in the same way.\n- A translation vector $ (dx,dy) $ is generated, with $ dx $ and $ dy $ selected uniformly at random between $ -10000 $ and $ 10000 $ . Each point in the first map is translated by $ (dx,dy) $ .\n- A rotation angle $ θ $ is generated, with $ θ $ selected uniformly at random between $ 0 $ and $ 2π $ . Each point in the first map is rotated by an angle of $ θ $ around the origin.\n- Translations and rotations for the second map are generated and applied in the same way.\n- The order of points is randomly permuted for both maps.\n- The test case is saved, with each point written with two decimal digits of precision."
}