{
    "description": "Mahmoud wants to send a message to his friend Ehab. Their language consists of $ n $ words numbered from $ 1 $ to $ n $ . Some words have the same meaning so there are $ k $ groups of words such that all the words in some group have the same meaning.\n\nMahmoud knows that the $ i $ -th word can be sent with cost $ a_{i} $ . For each word in his message, Mahmoud can either replace it with another word of the same meaning or leave it as it is. Can you help Mahmoud determine the minimum cost of sending the message?\n\nThe cost of sending the message is the sum of the costs of sending every word in it.",
    "inputFormat": "The first line of input contains integers $ n $ , $ k $ and $ m $ $ (1<=k<=n<=10^{5},1<=m<=10^{5}) $ — the number of words in their language, the number of groups of words, and the number of words in Mahmoud's message respectively.\n\nThe second line contains $ n $ strings consisting of lowercase English letters of length not exceeding 20 which represent the words. It's guaranteed that the words are distinct.\n\nThe third line contains $ n $ integers $ a_{1} $ , $ a_{2} $ , $ ... $ , $ a_{n} $ $ (1<=a_{i}<=10^{9}) $ where $ a_{i} $ is the cost of sending the $ i $ -th word.\n\nThe next $ k $ lines describe the groups of words of same meaning. The next $ k $ lines each start with an integer $ x $ $ (1<=x<=n) $ which means that there are $ x $ words in this group, followed by $ x $ integers which represent the indices of words in this group. It's guaranteed that each word appears in exactly one group.\n\nThe next line contains $ m $ space-separated words which represent Mahmoud's message. Each of these words appears in the list of language's words.",
    "outputFormat": "The only line should contain the minimum cost to send the message after replacing some words (maybe none) with some words of the same meaning.",
    "samples": [
        [
            "5 4 4\ni loser am the second\n100 1 1 5 10\n1 1\n1 3\n2 2 5\n1 4\ni am the second\n",
            "107"
        ],
        [
            "5 4 4\ni loser am the second\n100 20 1 5 10\n1 1\n1 3\n2 2 5\n1 4\ni am the second\n",
            "116"
        ]
    ],
    "hint": "In the first sample, Mahmoud should replace the word \"second\" with the word \"loser\" because it has less cost so the cost will be 100+1+5+1=107.\n\nIn the second sample, Mahmoud shouldn't do any replacement so the cost will be 100+1+5+10=116."
}