{
    "description": "There is unrest in the Galactic Senate. Several thousand solar systems have declared their intentions to leave the Republic. Master Heidi needs to select the Jedi Knights who will go on peacekeeping missions throughout the galaxy. It is well-known that the success of any peacekeeping mission depends on the colors of the lightsabers of the Jedi who will go on that mission.\n\nHeidi has $ n $ Jedi Knights standing in front of her, each one with a lightsaber of one of $ m $ possible colors. She knows that for the mission to be the most effective, she needs to select some contiguous interval of knights such that there are exactly $ k_{1} $ knights with lightsabers of the first color, $ k_{2} $ knights with lightsabers of the second color, $ ... $ , $ k_{m} $ knights with lightsabers of the $ m $ -th color.\n\nHowever, since the last time, she has learned that it is not always possible to select such an interval. Therefore, she decided to ask some Jedi Knights to go on an indefinite unpaid vacation leave near certain pits on Tatooine, if you know what I mean. Help Heidi decide what is the minimum number of Jedi Knights that need to be let go before she is able to select the desired interval from the subsequence of remaining knights.",
    "inputFormat": "The first line of the input contains $ n $ ( $ 1<=n<=2·10^{5} $ ) and $ m $ ( $ 1<=m<=n $ ). The second line contains $ n $ integers in the range $ {1,2,...,m} $ representing colors of the lightsabers of the subsequent Jedi Knights. The third line contains $ m $ integers $ k_{1},k_{2},...,k_{m} $ (with ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF958F2/35fb4fe66d9c5af5cfc16ee37846c2adee7f43fd.png)) – the desired counts of Jedi Knights with lightsabers of each color from $ 1 $ to $ m $ .",
    "outputFormat": "Output one number: the minimum number of Jedi Knights that need to be removed from the sequence so that, in what remains, there is an interval with the prescribed counts of lightsaber colors. If this is not possible, output $ -1 $ .",
    "samples": [
        [
            "8 3\n3 3 1 2 2 1 1 3\n3 1 1\n",
            "1\n"
        ]
    ],
    "hint": "",
    "translation": "给你一个 $n$ 长数列 $A$ 与一个 $m$ 长数列 $B$。请你从 $A$ 中找出连续的一段，使得删除最少的元素后，满足——区间中值为 $i$ 的元素刚好有 $B[i]$ 个。\n\n请输出与最少删除的元素数量。\n\n样例解释：\n\n对于 $3,3,1,2,2,1,1,3$ ，我们选取连续段 $1,2,2,1,1,3$ 后，只要删除一个 $2$，即可满足——$1$ 有 $3$ 个、$2\n$ 有 $1$ 个、$3$ 有 $1$ 个。"
}