{
    "description": "Polycarp has created his own training plan to prepare for the programming contests. He will train for $ n $ days, all days are numbered from $ 1 $ to $ n $ , beginning from the first.\n\nOn the $ i $ -th day Polycarp will necessarily solve $ a_i $ problems. One evening Polycarp plans to celebrate the equator. He will celebrate it on the first evening of such a day that from the beginning of the training and to this day inclusive he will solve half or more of all the problems.\n\nDetermine the index of day when Polycarp will celebrate the equator.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\le n \\le 200\\,000 $ ) — the number of days to prepare for the programming contests.\n\nThe second line contains a sequence $ a_1, a_2, \\dots, a_n $ ( $ 1 \\le a_i \\le 10\\,000 $ ), where $ a_i $ equals to the number of problems, which Polycarp will solve on the $ i $ -th day.",
    "outputFormat": "Print the index of the day when Polycarp will celebrate the equator.",
    "samples": [
        [
            "4\n1 3 2 1\n",
            "2\n"
        ],
        [
            "6\n2 2 2 2 2 2\n",
            "3\n"
        ]
    ],
    "hint": "In the first example Polycarp will celebrate the equator on the evening of the second day, because up to this day (inclusive) he will solve $ 4 $ out of $ 7 $ scheduled problems on four days of the training.\n\nIn the second example Polycarp will celebrate the equator on the evening of the third day, because up to this day (inclusive) he will solve $ 6 $ out of $ 12 $ scheduled problems on six days of the training.",
    "translation": "## 题目描述\n已知 Polycarp 共有 $n$ 天准备编程竞赛，他每天预计做的题数为 $a_i$，请问直到第几天能做完所有题目的一半或更多。\n## 输入格式\n第一行，一个整数 $n$。\n\n第二行，$n$ 个整数，表示 $a_i$。\n## 输出格式\n一个整数，表示答案。"
}