{
    "description": "The cities of Byteland and Berland are located on the axis $ Ox $ . In addition, on this axis there are also disputed cities, which belong to each of the countries in their opinion. Thus, on the line $ Ox $ there are three types of cities:\n\n- the cities of Byteland,\n- the cities of Berland,\n- disputed cities.\n\nRecently, the project BNET has been launched — a computer network of a new generation. Now the task of the both countries is to connect the cities so that the network of this country is connected.\n\nThe countries agreed to connect the pairs of cities with BNET cables in such a way that:\n\n- If you look at the only cities of Byteland and the disputed cities, then in the resulting set of cities, any city should be reachable from any other one by one or more cables,\n- If you look at the only cities of Berland and the disputed cities, then in the resulting set of cities, any city should be reachable from any other one by one or more cables.\n\nThus, it is necessary to choose a set of pairs of cities to connect by cables in such a way that both conditions are satisfied simultaneously. Cables allow bi-directional data transfer. Each cable connects exactly two distinct cities.\n\nThe cost of laying a cable from one city to another is equal to the distance between them. Find the minimum total cost of laying a set of cables so that two subsets of cities (Byteland and disputed cities, Berland and disputed cities) are connected.\n\nEach city is a point on the line $ Ox $ . It is technically possible to connect the cities $ a $ and $ b $ with a cable so that the city $ c $ ( $ a < c < b $ ) is not connected to this cable, where $ a $ , $ b $ and $ c $ are simultaneously coordinates of the cities $ a $ , $ b $ and $ c $ .",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 2 \\le n \\le 2 \\cdot 10^{5} $ ) — the number of cities.\n\nThe following $ n $ lines contains an integer $ x_i $ and the letter $ c_i $ ( $ -10^{9} \\le x_i \\le 10^{9} $ ) — the coordinate of the city and its type. If the city belongs to Byteland, $ c_i $ equals to 'B'. If the city belongs to Berland, $ c_i $ equals to «R». If the city is disputed, $ c_i $ equals to 'P'.\n\nAll cities have distinct coordinates. Guaranteed, that the cities are given in the increasing order of their coordinates.",
    "outputFormat": "Print the minimal total length of such set of cables, that if we delete all Berland cities ( $ c_i $ ='R'), it will be possible to find a way from any remaining city to any other remaining city, moving only by cables. Similarly, if we delete all Byteland cities ( $ c_i $ ='B'), it will be possible to find a way from any remaining city to any other remaining city, moving only by cables.",
    "samples": [
        [
            "4\n-5 R\n0 P\n3 P\n7 B\n",
            "12\n"
        ],
        [
            "5\n10 R\n14 B\n16 B\n21 R\n32 R\n",
            "24\n"
        ]
    ],
    "hint": "In the first example, you should connect the first city with the second, the second with the third, and the third with the fourth. The total length of the cables will be $ 5 + 3 + 4 = 12 $ .\n\nIn the second example there are no disputed cities, so you need to connect all the neighboring cities of Byteland and all the neighboring cities of Berland. The cities of Berland have coordinates $ 10, 21, 32 $ , so to connect them you need two cables of length $ 11 $ and $ 11 $ . The cities of Byteland have coordinates $ 14 $ and $ 16 $ , so to connect them you need one cable of length $ 2 $ . Thus, the total length of all cables is $ 11 + 11 + 2 = 24 $ .",
    "translation": "在一维坐标轴上存在$n$个点$(n\\le2\\cdot 10^5)$，分为$PBR$三种。现在可以在任意两点之间连边，代价为两点的距离。求一种连边方法，使得不考虑与$B$点相连的所有的边时，$P$点和$R$点都在同一个联通块，不考虑与$R$点相连的所有的边时，$P$点和$B$点都在同一个联通块。最小化代价。\n\n坐标范围$-10^9\\le x_i\\le 10^9$。\n\n感谢@Great_Influence 提供的翻译"
}