{
    "description": "Magnus decided to play a classic chess game. Though what he saw in his locker shocked him! His favourite chessboard got broken into $ 4 $ pieces, each of size $ n $ by $ n $ , $ n $ is always odd. And what's even worse, some squares were of wrong color. $ j $ -th square of the $ i $ -th row of $ k $ -th piece of the board has color $ a_{k,i,j} $ ; $ 1 $ being black and $ 0 $ being white.\n\nNow Magnus wants to change color of some squares in such a way that he recolors minimum number of squares and obtained pieces form a valid chessboard. Every square has its color different to each of the neightbouring by side squares in a valid board. Its size should be $ 2n $ by $ 2n $ . You are allowed to move pieces but not allowed to rotate or flip them.",
    "inputFormat": "The first line contains odd integer $ n $ $ (1<=n<=100) $ — the size of all pieces of the board.\n\nThen $ 4 $ segments follow, each describes one piece of the board. Each consists of $ n $ lines of $ n $ characters; $ j $ -th one of $ i $ -th line is equal to 1 if the square is black initially and 0 otherwise. Segments are separated by an empty line.",
    "outputFormat": "Print one number — minimum number of squares Magnus should recolor to be able to obtain a valid chessboard.",
    "samples": [
        [
            "1\n0\n\n0\n\n1\n\n0\n",
            "1\n"
        ],
        [
            "3\n101\n010\n101\n\n101\n000\n101\n\n010\n101\n011\n\n010\n101\n010\n",
            "2\n"
        ]
    ],
    "hint": "",
    "translation": "马格纳斯决定玩一个经典的国际象棋游戏。尽管他在储物柜里看到的东西震惊了他！他最喜欢的棋盘被分成了4块，每个棋盘的大小N总是奇数。更糟糕的是，有些正方形的颜色不对。第i排第j个数字为1表示该格子为黑色，0为白色。\r\n\r\n现在马格纳斯想要改变一些方块的颜色，这样他就可以重新给最小的方块编号，使得相邻的方块颜色不同。其边长应为2n。允许移动方块，但不允许旋转或翻转方块。\r\n求他最小需要改变方块的颜色数。"
}