{
    "description": "Japate, while traveling through the forest of Mala, saw $ N $ bags of gold lying in a row. Each bag has some distinct weight of gold between $ 1 $ to $ N $ . Japate can carry only one bag of gold with him, so he uses the following strategy to choose a bag.\n\nInitially, he starts with an empty bag (zero weight). He considers the bags in some order. If the current bag has a higher weight than the bag in his hand, he picks the current bag.\n\nJapate put the bags in some order. Japate realizes that he will pick $ A $ bags, if he starts picking bags from the front, and will pick $ B $ bags, if he starts picking bags from the back. By picking we mean replacing the bag in his hand with the current one.\n\nNow he wonders how many permutations of bags are possible, in which he picks $ A $ bags from the front and $ B $ bags from back using the above strategy.\n\nSince the answer can be very large, output it modulo $ 998244353 $ .",
    "inputFormat": "The only line of input contains three space separated integers $ N $ ( $ 1<=N<=10^{5} $ ), $ A $ and $ B $ ( $ 0<=A,B<=N $ ).",
    "outputFormat": "Output a single integer — the number of valid permutations modulo $ 998244353 $ .",
    "samples": [
        [
            "1 1 1\n",
            "1"
        ],
        [
            "2 1 1\n",
            "0"
        ],
        [
            "2 2 1\n",
            "1"
        ],
        [
            "5 2 2\n",
            "22"
        ]
    ],
    "hint": "In sample case $ 1 $ , the only possible permutation is $ [1] $\n\nIn sample cases $ 2 $ and $ 3 $ , only two permutations of size $ 2 $ are possible: $ {[1,2],[2,1]} $ . The values of $ a $ and $ b $ for first permutation is $ 2 $ and $ 1 $ , and for the second permutation these values are $ 1 $ and $ 2 $ .\n\nIn sample case $ 4 $ , out of 120 permutations of $ [1,2,3,4,5] $ possible, only 22 satisfy the given constraints of $ a $ and $ b $ .",
    "translation": "给你三个正整数 $n$，$a$，$b$，定义 $A$ 为一个排列中是前缀最大值的数的个数，定义 $B$ 为一个排列中是后缀最大值的数的个数，求长度为 $n$ 的排列中满足 $A = a$ 且 $B = b$ 的排列个数。$n \\le 10^5$，答案对 $998244353$ 取模。\n\n感谢@OrangeLee 提供翻译"
}