{
    "description": "Arkady's code contains $ n $ variables. Each variable has a unique name consisting of lowercase English letters only. One day Arkady decided to shorten his code.\n\nHe wants to replace each variable name with its non-empty prefix so that these new names are still unique (however, a new name of some variable can coincide with some old name of another or same variable). Among such possibilities he wants to find the way with the smallest possible total length of the new names.\n\nA string $ a $ is a prefix of a string $ b $ if you can delete some (possibly none) characters from the end of $ b $ and obtain $ a $ .\n\nPlease find this minimum possible total length of new names.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1 \\le n \\le 10^5 $ ) — the number of variables.\n\nThe next $ n $ lines contain variable names, one per line. Each name is non-empty and contains only lowercase English letters. The total length of these strings is not greater than $ 10^5 $ . The variable names are distinct.",
    "outputFormat": "Print a single integer — the minimum possible total length of new variable names.",
    "samples": [
        [
            "3\ncodeforces\ncodehorses\ncode\n",
            "6\n"
        ],
        [
            "5\nabba\nabb\nab\naa\naacada\n",
            "11\n"
        ],
        [
            "3\ntelegram\ndigital\nresistance\n",
            "3\n"
        ]
    ],
    "hint": "In the first example one of the best options is to shorten the names in the given order as \"cod\", \"co\", \"c\".\n\nIn the second example we can shorten the last name to \"aac\" and the first name to \"a\" without changing the other names.",
    "translation": "有n个不同的字符串，你可以把每一个字符串变为它的非空前缀（字符串本身也算一个前缀），要求变化后的字符串依旧互不相同（但可以与原来的字符串相同），求变换后的字符串的最小总长度。\r\n\r\n1≤n≤10^5 , n个字符串总长度不大于10^5，每个字符串非空且仅包含小写字母。"
}