{
    "description": "There are $ n $ consecutive seat places in a railway carriage. Each place is either empty or occupied by a passenger.\n\nThe university team for the Olympiad consists of $ a $ student-programmers and $ b $ student-athletes. Determine the largest number of students from all $ a+b $ students, which you can put in the railway carriage so that:\n\n- no student-programmer is sitting next to the student-programmer;\n- and no student-athlete is sitting next to the student-athlete.\n\nIn the other words, there should not be two consecutive (adjacent) places where two student-athletes or two student-programmers are sitting.\n\nConsider that initially occupied seat places are occupied by jury members (who obviously are not students at all).",
    "inputFormat": "The first line contain three integers $ n $ , $ a $ and $ b $ ( $ 1 \\le n \\le 2\\cdot10^{5} $ , $ 0 \\le a, b \\le 2\\cdot10^{5} $ , $ a + b > 0 $ ) — total number of seat places in the railway carriage, the number of student-programmers and the number of student-athletes.\n\nThe second line contains a string with length $ n $ , consisting of characters \".\" and \"\\*\". The dot means that the corresponding place is empty. The asterisk means that the corresponding place is occupied by the jury member.",
    "outputFormat": "Print the largest number of students, which you can put in the railway carriage so that no student-programmer is sitting next to a student-programmer and no student-athlete is sitting next to a student-athlete.",
    "samples": [
        [
            "5 1 1\n*...*\n",
            "2\n"
        ],
        [
            "6 2 3\n*...*.\n",
            "4\n"
        ],
        [
            "11 3 10\n.*....**.*.\n",
            "7\n"
        ],
        [
            "3 2 3\n***\n",
            "0\n"
        ]
    ],
    "hint": "In the first example you can put all student, for example, in the following way: \\*.AB\\*\n\nIn the second example you can put four students, for example, in the following way: \\*BAB\\*B\n\nIn the third example you can put seven students, for example, in the following way: B\\*ABAB\\*\\*A\\*B\n\nThe letter A means a student-programmer, and the letter B — student-athlete.",
    "translation": "有一个长度为 $n$ 的只含 `*.` 的字符串，你可以把其中的 `.` 换成 `A` 或 `B`，要求 `A` 不超过 $a$ 个， `B` 不超过 $b$ 个，且连续两个字符不能同时是 `A` 或者 `B`，求最多有多少个 `.` 被替换掉。\n\n输入第一行三个整数表示 $n,a,b$，第二行表示给定字符串；输出一个整数表示结果。"
}