{
    "description": "These days Arkady works as an air traffic controller at a large airport. He controls a runway which is usually used for landings only. Thus, he has a schedule of planes that are landing in the nearest future, each landing lasts $ 1 $ minute.\n\nHe was asked to insert one takeoff in the schedule. The takeoff takes $ 1 $ minute itself, but for safety reasons there should be a time space between the takeoff and any landing of at least $ s $ minutes from both sides.\n\nFind the earliest time when Arkady can insert the takeoff.",
    "inputFormat": "The first line of input contains two integers $ n $ and $ s $ ( $ 1 \\le n \\le 100 $ , $ 1 \\le s \\le 60 $ ) — the number of landings on the schedule and the minimum allowed time (in minutes) between a landing and a takeoff.\n\nEach of next $ n $ lines contains two integers $ h $ and $ m $ ( $ 0 \\le h \\le 23 $ , $ 0 \\le m \\le 59 $ ) — the time, in hours and minutes, when a plane will land, starting from current moment (i. e. the current time is $ 0 $ $ 0 $ ). These times are given in increasing order.",
    "outputFormat": "Print two integers $ h $ and $ m $ — the hour and the minute from the current moment of the earliest time Arkady can insert the takeoff.",
    "samples": [
        [
            "6 60\n0 0\n1 20\n3 21\n5 0\n19 30\n23 40\n",
            "6 1\n"
        ],
        [
            "16 50\n0 30\n1 20\n3 0\n4 30\n6 10\n7 50\n9 30\n11 10\n12 50\n14 30\n16 10\n17 50\n19 30\n21 10\n22 50\n23 59\n",
            "24 50\n"
        ],
        [
            "3 17\n0 30\n1 0\n12 0\n",
            "0 0\n"
        ]
    ],
    "hint": "In the first example note that there is not enough time between 1:20 and 3:21, because each landing and the takeoff take one minute.\n\nIn the second example there is no gaps in the schedule, so Arkady can only add takeoff after all landings. Note that it is possible that one should wait more than $ 24 $ hours to insert the takeoff.\n\nIn the third example Arkady can insert the takeoff even between the first landing.",
    "translation": "题目描述：\n\n最近 Arkady 在一个大型机场当空中交通管理员.他管理着一条用于飞机降 落的跑道。因此，他的手中有一份当天的飞机降落时刻表。每架飞机需要一分钟 来降落。（即：从给定的时间持续一分钟）\n\n现在有一架飞机要插队。这架飞机也需要一分钟来降落，但是为了安全，它 的降落前后应该有一段时间的空缺，前后各 s 分钟。\n\n请你找到最早的可以安排插队的时间。\n\n输入格式：\n\n\t第一行输入两个整数 n 和 s。（1<=n<=100,1<=s<=60)。    注：n架飞机；\n\n\t接下来的n行  即为每架飞机降落的时间，以h m形式给出（0<=h<=23,0<=m<=59)。(小时，分钟）\n\n输出格式：\n\n\t最早的时间，同样以h m形式输出；\n注：\n如果在第一架飞机之前就可以加入，输出0 0；\n如果只能在最后加入，h可以大于24；\n\n感谢@shzr 提供的翻译"
}