{
    "description": "Professor Ibrahim has prepared the final homework for his algorithm’s class. He asked his students to implement the Posterization Image Filter.\n\nTheir algorithm will be tested on an array of integers, where the $ i $ -th integer represents the color of the $ i $ -th pixel in the image. The image is in black and white, therefore the color of each pixel will be an integer between 0 and 255 (inclusive).\n\nTo implement the filter, students are required to divide the black and white color range \\[0, 255\\] into groups of consecutive colors, and select one color in each group to be the group’s key. In order to preserve image details, the size of a group must not be greater than $ k $ , and each color should belong to exactly one group.\n\nFinally, the students will replace the color of each pixel in the array with that color’s assigned group key.\n\nTo better understand the effect, here is an image of a basking turtle where the Posterization Filter was applied with increasing $ k $ to the right.\n\n ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF980C/a5e04b9b80b48f601f9e0b203cd8ee3718afd0e4.png)To make the process of checking the final answer easier, Professor Ibrahim wants students to divide the groups and assign the keys in a way that produces the lexicographically smallest possible array.",
    "inputFormat": "The first line of input contains two integers $ n $ and $ k $ ( $ 1 \\leq n \\leq 10^5 $ , $ 1 \\leq k \\leq 256 $ ), the number of pixels in the image, and the maximum size of a group, respectively.\n\nThe second line contains $ n $ integers $ p_1, p_2, \\dots, p_n $ ( $ 0 \\leq p_i \\leq 255 $ ), where $ p_i $ is the color of the $ i $ -th pixel.",
    "outputFormat": "Print $ n $ space-separated integers; the lexicographically smallest possible array that represents the image after applying the Posterization filter.",
    "samples": [
        [
            "4 3\n2 14 3 4\n",
            "0 12 3 3\n"
        ],
        [
            "5 2\n0 2 1 255 254\n",
            "0 1 1 254 254\n"
        ]
    ],
    "hint": "One possible way to group colors and assign keys for the first sample:\n\nColor $ 2 $ belongs to the group $ [0,2] $ , with group key $ 0 $ .\n\nColor $ 14 $ belongs to the group $ [12,14] $ , with group key $ 12 $ .\n\nColors $ 3 $ and $ 4 $ belong to group $ [3, 5] $ , with group key $ 3 $ .\n\nOther groups won't affect the result so they are not listed here.",
    "translation": "给一组数，将这组数分成连续的组，每一组的个数不超过 k,每一组中的所有数赋值成这个组里最小的数，求这组数字典序最小的情况"
}