{
    "description": "You are going to the beach with the idea to build the greatest sand castle ever in your head! The beach is not as three-dimensional as you could have imagined, it can be decribed as a line of spots to pile up sand pillars. Spots are numbered $ 1 $ through infinity from left to right.\n\nObviously, there is not enough sand on the beach, so you brought $ n $ packs of sand with you. Let height $ h_{i} $ of the sand pillar on some spot $ i $ be the number of sand packs you spent on it. You can't split a sand pack to multiple pillars, all the sand from it should go to a single one. There is a fence of height equal to the height of pillar with $ H $ sand packs to the left of the first spot and you should prevent sand from going over it.\n\nFinally you ended up with the following conditions to building the castle:\n\n- $ h_{1}<=H $ : no sand from the leftmost spot should go over the fence;\n- For any ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF985D/77d67b6184b30d84bfc3e3e2794dc8de9b20fcf2.png) $ |h_{i}-h_{i+1}|<=1 $ : large difference in heights of two neighboring pillars can lead sand to fall down from the higher one to the lower, you really don't want this to happen;\n- ![](https://cdn.luogu.com.cn/upload/vjudge_pic/CF985D/7c65b11667de38fcb78de5945051b7b0879e1abf.png): you want to spend all the sand you brought with you.\n\nAs you have infinite spots to build, it is always possible to come up with some valid castle structure. Though you want the castle to be as compact as possible.\n\nYour task is to calculate the minimum number of spots you can occupy so that all the aforementioned conditions hold.",
    "inputFormat": "The only line contains two integer numbers $ n $ and $ H $ ( $ 1<=n,H<=10^{18} $ ) — the number of sand packs you have and the height of the fence, respectively.",
    "outputFormat": "Print the minimum number of spots you can occupy so the all the castle building conditions hold.",
    "samples": [
        [
            "5 2\n",
            "3\n"
        ],
        [
            "6 8\n",
            "3\n"
        ]
    ],
    "hint": "Here are the heights of some valid castles:\n\n- $ n=5,H=2,[2,2,1,0,...],[2,1,1,1,0,...],[1,0,1,2,1,0,...] $\n- $ n=6,H=8,[3,2,1,0,...],[2,2,1,1,0,...],[0,1,0,1,2,1,1,0...] $ (this one has $ 5 $ spots occupied)\n\nThe first list for both cases is the optimal answer, $ 3 $ spots are occupied in them.\n\nAnd here are some invalid ones:\n\n- $ n=5,H=2,[3,2,0,...],[2,3,0,...],[1,0,2,2,...] $\n- $ n=6,H=8,[2,2,2,0,...],[6,0,...],[1,4,1,0...],[2,2,1,0,...] $",
    "translation": "你有 $n$ 个沙袋，你要把它们摆成若干堆，在一条直线上有无限个点，坐标从 $1$ 到 $+\\infty$，你只能把沙袋放在这些点上，要求相邻的堆的高差不能超过 $1$，而且最左边的堆的高度不能超过 $H$，问你最少可以摆多少堆。"
}