{
    "description": "Surely you have seen insane videos by South Korean rapper PSY, such as \"Gangnam Style\", \"Gentleman\" and \"Daddy\". You might also hear that PSY has been recording video \"Oppa Funcan Style\" two years ago (unfortunately we couldn't find it on the internet). We will remind you what this hit looked like (you can find original description [here](http://acm.timus.ru/problem.aspx?space=1&num=2107&locale=en)):\n\nOn the ground there are $ n $ platforms, which are numbered with integers from $ 1 $ to $ n $ , on $ i $ -th platform there is a dancer with number $ i $ . Further, every second all the dancers standing on the platform with number $ i $ jump to the platform with the number $ f(i) $ . The moving rule $ f $ is selected in advance and is not changed throughout the clip.\n\nThe duration of the clip was $ k $ seconds and the rule $ f $ was chosen in such a way that after $ k $ seconds all dancers were in their initial positions (i.e. the $ i $ -th dancer stood on the platform with the number $ i $ ). That allowed to loop the clip and collect even more likes.\n\nPSY knows that enhanced versions of old artworks become more and more popular every day. So he decided to release a remastered-version of his video.\n\nIn his case \"enhanced version\" means even more insanity, so the number of platforms can be up to $ 10^{18} $ ! But the video director said that if some dancer stays on the same platform all the time, then the viewer will get bored and will turn off the video immediately. Therefore, for all $ x $ from $ 1 $ to $ n $ $ f(x) \\neq x $ must hold.\n\nBig part of classic video's success was in that looping, so in the remastered version all dancers should return to their initial positions in the end of the clip as well.\n\nPSY hasn't decided on the exact number of platforms and video duration yet, so he asks you to check if there is a good rule $ f $ for different options.",
    "inputFormat": "In the first line of input there is one integer $ t $ ( $ 1 \\le t \\le 10^{4} $ ) — the number of options for $ n $ and $ k $ to check.\n\nIn the next $ t $ lines the options are given: each option is described with two integers $ n $ and $ k $ ( $ 1 \\le n \\le 10^{18} $ , $ 1 \\le k \\le 10^{15} $ ) — the number of dancers and the duration in seconds.\n\nIt is guaranteed that the number of different values of $ k $ in one test is not greater than $ 50 $ .",
    "outputFormat": "Print $ t $ lines. If the $ i $ -th option of the video is feasible, print \"YES\" (without quotes) in $ i $ -th line, otherwise print \"NO\" (without quotes).",
    "samples": [
        [
            "3\n7 7\n3 8\n5 6\n",
            "YES\nNO\nYES\n"
        ]
    ],
    "hint": "",
    "translation": "给定 $n$ 与 $k$，问是否能将 $n$ 分为若干个 $k$ 的因数（$1$ 除外）之和，每个因数都可以被选多次。\n\n$n\\leq 10^{18}$，$k\\leq 10^{15}$，最多 $50$ 种不同的 $k$。\n\n一共$t$组询问，$t\\leq 10^4$。"
}