{
    "description": "Translator's note: in Russia's most widespread grading system, there are four grades: 5, 4, 3, 2, the higher the better, roughly corresponding to A, B, C and F respectively in American grading system.\n\nThe term is coming to an end and students start thinking about their grades. Today, a professor told his students that the grades for his course would be given out automatically — he would calculate the simple average (arithmetic mean) of all grades given out for lab works this term and round to the nearest integer. The rounding would be done in favour of the student — $ 4.5 $ would be rounded up to $ 5 $ (as in example 3), but $ 4.4 $ would be rounded down to $ 4 $ .\n\nThis does not bode well for Vasya who didn't think those lab works would influence anything, so he may receive a grade worse than $ 5 $ (maybe even the dreaded $ 2 $ ). However, the professor allowed him to redo some of his works of Vasya's choosing to increase his average grade. Vasya wants to redo as as few lab works as possible in order to get $ 5 $ for the course. Of course, Vasya will get $ 5 $ for the lab works he chooses to redo.\n\nHelp Vasya — calculate the minimum amount of lab works Vasya has to redo.",
    "inputFormat": "The first line contains a single integer $ n $ — the number of Vasya's grades ( $ 1 \\leq n \\leq 100 $ ).\n\nThe second line contains $ n $ integers from $ 2 $ to $ 5 $ — Vasya's grades for his lab works.",
    "outputFormat": "Output a single integer — the minimum amount of lab works that Vasya has to redo. It can be shown that Vasya can always redo enough lab works to get a $ 5 $ .",
    "samples": [
        [
            "3\n4 4 4\n",
            "2\n"
        ],
        [
            "4\n5 4 5 5\n",
            "0\n"
        ],
        [
            "4\n5 3 3 5\n",
            "1\n"
        ]
    ],
    "hint": "In the first sample, it is enough to redo two lab works to make two $ 4 $ s into $ 5 $ s.\n\nIn the second sample, Vasya's average is already $ 4.75 $ so he doesn't have to redo anything to get a $ 5 $ .\n\nIn the second sample Vasya has to redo one lab work to get rid of one of the $ 3 $ s, that will make the average exactly $ 4.5 $ so the final grade would be $ 5 $ .",
    "translation": "Vasya做了$n$门实验，得分为$2-5$之间的数。\n\n他想让自己的平均成绩（总得分除以实验次数）四舍五入后为$5$，问最少需要重做几次实验\n\n感谢@attack 提供翻译"
}