{
    "description": "Given three numbers $ n, a, b $ . You need to find an adjacency matrix of such an undirected graph that the number of components in it is equal to $ a $ , and the number of components in its complement is $ b $ . The matrix must be symmetric, and all digits on the main diagonal must be zeroes.\n\nIn an undirected graph loops (edges from a vertex to itself) are not allowed. It can be at most one edge between a pair of vertices.\n\nThe adjacency matrix of an undirected graph is a square matrix of size $ n $ consisting only of \"0\" and \"1\", where $ n $ is the number of vertices of the graph and the $ i $ -th row and the $ i $ -th column correspond to the $ i $ -th vertex of the graph. The cell $ (i,j) $ of the adjacency matrix contains $ 1 $ if and only if the $ i $ -th and $ j $ -th vertices in the graph are connected by an edge.\n\nA connected component is a set of vertices $ X $ such that for every two vertices from this set there exists at least one path in the graph connecting this pair of vertices, but adding any other vertex to $ X $ violates this rule.\n\nThe complement or inverse of a graph $ G $ is a graph $ H $ on the same vertices such that two distinct vertices of $ H $ are adjacent if and only if they are not adjacent in $ G $ .",
    "inputFormat": "In a single line, three numbers are given $ n, a, b \\,(1 \\le n \\le 1000, 1 \\le a, b \\le n) $ : is the number of vertexes of the graph, the required number of connectivity components in it, and the required amount of the connectivity component in it's complement.",
    "outputFormat": "If there is no graph that satisfies these constraints on a single line, print \"NO\" (without quotes).\n\nOtherwise, on the first line, print \"YES\"(without quotes). In each of the next $ n $ lines, output $ n $ digits such that $ j $ -th digit of $ i $ -th line must be $ 1 $ if and only if there is an edge between vertices $ i $ and $ j $ in $ G $ (and $ 0 $ otherwise). Note that the matrix must be symmetric, and all digits on the main diagonal must be zeroes.\n\nIf there are several matrices that satisfy the conditions — output any of them.",
    "samples": [
        [
            "3 1 2\n",
            "YES\n001\n001\n110\n"
        ],
        [
            "3 3 3\n",
            "NO\n"
        ]
    ],
    "hint": "",
    "translation": "一张无向图一共有n个点,a个联通块,它的补图一共有b个联通块,如果能构造出这张图输出'YES'并输出它的邻接矩阵，否则输出'NO'\n\n输入:\n\n三个整数n,a,b\n\n输出：\n\n如果有解输出'YES'和邻接矩阵，否则输出'NO'\n\n感谢@zhaotiensn 提供翻译"
}