{
    "description": "Nastya owns too many arrays now, so she wants to delete the least important of them. However, she discovered that this array is magic! Nastya now knows that the array has the following properties:\n\n- In one second we can add an arbitrary (possibly negative) integer to all elements of the array that are not equal to zero.\n- When all elements of the array become equal to zero, the array explodes.\n\nNastya is always busy, so she wants to explode the array as fast as possible. Compute the minimum time in which the array can be exploded.",
    "inputFormat": "The first line contains a single integer $ n $ ( $ 1<=n<=10^{5} $ ) — the size of the array.\n\nThe second line contains $ n $ integers $ a_{1},a_{2},...,a_{n} $ ( $ -10^{5}<=a_{i}<=10^{5} $ ) — the elements of the array.",
    "outputFormat": "Print a single integer — the minimum number of seconds needed to make all elements of the array equal to zero.",
    "samples": [
        [
            "5\n1 1 1 1 1\n",
            "1\n"
        ],
        [
            "3\n2 0 -1\n",
            "2\n"
        ],
        [
            "4\n5 -6 -5 1\n",
            "4\n"
        ]
    ],
    "hint": "In the first example you can add $ -1 $ to all non-zero elements in one second and make them equal to zero.\n\nIn the second example you can add $ -2 $ on the first second, then the array becomes equal to $ [0,0,-3] $ . On the second second you can add $ 3 $ to the third (the only non-zero) element.",
    "translation": "## 题目描述\n\n $Nastya$  拥有一个大小为  $n$  的数组。一次操作可以将数组中所有非零的数字全部加上一个整数（可以为负）。求至少要多少次操作才能将数组中的数全部变成  $0$ 。\n\n## 输入格式\n\n第  $1$  行，有  $1$  个整数，表示数组的大小  $n$ 。\n\n（数据范围： $1 \\leqslant n \\leqslant 10^5$ ）\n\n第  $2$  行，有  $n$  个整数，表示数组的元素  $a_i$ 。\n\n（数据范围： $-10^5 \\leqslant a_i \\leqslant 10^5$ ）\n\n##输出格式\n\n仅  $1$  个整数，表示至少要进行多少次操作。\n\n##提示与说明\n\n- 第  $1$  组样例的解释：\n\n只要进行一次操作，将所有元素加上  $-1$ ，数组中的数就可以全部变成  $0$ 。\n\n- 第  $2$  组样例的解释：\n\n可以先将所有非零元素加上  $-2$ ，得到  ${0,\\ 0,\\ -3}$ 。接下来只要再将所有非零元素加上  $3$ ，就可以得到  ${0,\\ 0,\\ 0}$ 。\n\n感谢@Sooke 提供翻译"
}