{
    "description": "Berland Football Cup starts really soon! Commentators from all over the world come to the event.\n\nOrganizers have already built $ n $ commentary boxes. $ m $ regional delegations will come to the Cup. Every delegation should get the same number of the commentary boxes. If any box is left unoccupied then the delegations will be upset. So each box should be occupied by exactly one delegation.\n\nIf $ n $ is not divisible by $ m $ , it is impossible to distribute the boxes to the delegations at the moment.\n\nOrganizers can build a new commentary box paying $ a $ burles and demolish a commentary box paying $ b $ burles. They can both build and demolish boxes arbitrary number of times (each time paying a corresponding fee). It is allowed to demolish all the existing boxes.\n\nWhat is the minimal amount of burles organizers should pay to satisfy all the delegations (i.e. to make the number of the boxes be divisible by $ m $ )?",
    "inputFormat": "The only line contains four integer numbers $ n $ , $ m $ , $ a $ and $ b $ ( $ 1 \\le n, m \\le 10^{12} $ , $ 1 \\le a, b \\le 100 $ ), where $ n $ is the initial number of the commentary boxes, $ m $ is the number of delegations to come, $ a $ is the fee to build a box and $ b $ is the fee to demolish a box.",
    "outputFormat": "Output the minimal amount of burles organizers should pay to satisfy all the delegations (i.e. to make the number of the boxes be divisible by $ m $ ). It is allowed that the final number of the boxes is equal to $ 0 $ .",
    "samples": [
        [
            "9 7 3 8\n",
            "15\n"
        ],
        [
            "2 7 3 7\n",
            "14\n"
        ],
        [
            "30 6 17 19\n",
            "0\n"
        ]
    ],
    "hint": "In the first example organizers can build $ 5 $ boxes to make the total of $ 14 $ paying $ 3 $ burles for the each of them.\n\nIn the second example organizers can demolish $ 2 $ boxes to make the total of $ 0 $ paying $ 7 $ burles for the each of them.\n\nIn the third example organizers are already able to distribute all the boxes equally among the delegations, each one get $ 5 $ boxes.",
    "translation": "对于一个数n，每次加一的代价是a，每次减一的代价是b，求被m整除时的最小代价\n\n输入:\n\nn,m,a,b\n\n输出:\n\n最小的代价\n\n感谢@zhaotiensn 提供翻译"
}