{
    "description": "Farmer John has discovered that his cows produce higher quality milk when they are subject to strenuous exercise.  He therefore decides to send his N cows (1 <= N <= 25,000) to climb up and then back down a nearby mountain!\n\nCow i takes U(i) time to climb up the mountain and then D(i) time to climb down the mountain.  Being domesticated cows, each cow needs the help of a farmer for each leg of the climb, but due to the poor economy, there are only two farmers available, Farmer John and his cousin Farmer Don.  FJ plans to guide cows for the upward climb, and FD will then guide the cows for the downward climb.  Since every cow needs a guide, and there is only one farmer for each part of the voyage, at most one cow may be climbing upward at any point in time (assisted by FJ), and at most one cow may be climbing down at any point in time (assisted by FD).  A group of cows may temporarily accumulate at the top of the mountain if they climb up and then need to wait for FD's assistance before climbing down.  Cows may climb down in a different order than they climbed up.\n\nPlease determine the least possible amount of time for all N cows to make the entire journey.\n\n农场主约翰发现他的奶牛剧烈运动后产奶的质量更高，所以他决定让N头(1 <= N <= 25,000)奶牛去附近爬山再返回来。\n\n第i头奶牛用时U(i)爬上山，用时D(i)下山。作为家畜，奶牛们每段路都要有农夫的帮助，可是由于经济疲软，农场里只有两个农夫John和Don。John计划引导奶牛爬山，Don引导奶牛下山。虽然每个奶牛都需要向导，但每段旅途只有一名农夫。所有任何时刻只有一头奶牛爬山也只能有一头奶牛下山，奶牛爬上山后，可以暂时停留在山顶上等待Don的帮助。奶牛上山的顺序和下山的顺序不一定要相同。\n\n请计算出所有N 头牛完成旅程的最短时间。\n",
    "inputFormat": "第一行，一个整数N\n\n第2 到第N+1 行，每行两个用空格隔开的整数U(i)和D(i)。\n\n(1 <= U(i), D(i) <= 50,000).\n",
    "outputFormat": "一行一个整数，表示所有N 头牛完成旅程的最短时间。\n",
    "samples": [
        [
            "3\n6 4\n8 1\n2 3",
            "17"
        ]
    ],
    "hint": ""
}