{
    "description": "Although Farmer John has no problems walking around the fair to collect prizes or see the shows, his cows are not in such good shape; a full day of walking around the fair leaves them exhausted. To help them enjoy the fair, FJ has arranged for a shuttle truck to take the cows from place to place in the fairgrounds.\n\nFJ couldn't afford a really great shuttle, so the shuttle he rented traverses its route only once (!) and makes N (1 <= N <= 20,000) stops (conveniently numbered 1..N) along its path. A total of K (1 <= K <= 50,000) groups of cows conveniently numbered 1..K wish to use the shuttle, each of the M\\_i (1 <= M\\_i <= N) cows in group i wanting to ride from one stop S\\_i (1 <= S\\_i < E\\_i) to another stop E\\_i (S\\_i < E\\_i <= N) farther along the route.\n\nThe shuttle might not be able to pick up an entire group of cows (since it has limited capacity) but can pick up partial groups as appropriate.\n\nGiven the capacity C (1 <= C <= 100) of the shuttle truck and the descriptions of the groups of cows that want to visit various sites at the fair, determine the maximum number of cows that can ride the shuttle during the fair.\n",
    "inputFormat": "第一行：包括三个整数：$K,N$ 和 $C$，彼此用空格隔开。\n\n第二行到 $K+1$ 行：在第 $i+1$ 行，将会告诉你第 $i$ 组奶牛的信息：$S_i,E_i$ 和 $M_i$，彼此用空格隔开。\n",
    "outputFormat": "第一行：可以坐班车的奶牛的最大头数。\n",
    "samples": [
        [
            "8 15 3\n1 5 2\n13 14 1\n5 8 3\n8 14 2\n14 15 1\n9 12 1\n12 15 2\n4 6 1\n",
            "10\n"
        ]
    ],
    "hint": "【样例说明】\n\n班车可以把 $2$ 头奶牛从 $1$ 送到 $5$，$3$ 头奶牛从 $5$ 送到 $8$，$2$ 头奶牛从 $8$ 送到 $14$，$1$ 头奶牛从 $9$ 送到 $12$，$1$ 头奶牛从 $13$ 送到 $14$，$1$ 头奶牛从 $14$ 送到 $15$。\n",
    "translation": "\n逛逛集市，兑兑奖品，看看节目对农夫约翰来说不算什么，可是他的奶牛们非常缺乏锻炼——如果要逛完一整天的集市，他们一定会筋疲力尽的。所以为了让奶牛们也能愉快地逛集市，约翰准备让奶牛们在集市上以车代步。但是，约翰木有钱，他租来的班车只能在集市上沿直线跑一次，而且只能停靠 $N(1 \\leq N\\leq 20000)$ 个地点（所有地点都以 $1$ 到 $N$ 之间的一个数字来表示）。现在奶牛们分成 $K(1\\leq K\\leq 50000)$ 个小组，第i 组有 $M_i(1\\leq M_i\\leq N)$ 头奶牛，他们希望从 $S_i$ 跑到 $E_i(1\\leq S_i< E_i\\leq N)$。\n\n由于班车容量有限，可能载不下所有想乘车的奶牛们，此时也允许小组里的一部分奶牛分开乘坐班车。约翰经过调查得知班车的容量是 $C(1\\leq C\\leq 100)$，请你帮助约翰计划一个尽可能满足更多奶牛愿望的方案。\n"
}