{
    "description": "Bessie is running out of money and is searching for jobs. Farmer John knows this and wants the cows to travel around so he has imposed a rule that his cows can only make D (1 <= D <= 1,000) dollars in a city before they must work in another city. Bessie can, however, return to a city after working elsewhere for a while and again earn the D dollars maximum in that city. There is no limit on the number of times Bessie can do this.\n\nBessie's world comprises P (1 <= P <= 150) one-way paths connecting C (2 <= C <= 220) cities conveniently numbered 1..C. Bessie is currently in city S (1 <= S <= C). Path i runs one-way from city A\\_i to city B\\_i (1 <= A\\_i <= C; 1 <= B\\_i <= C) and costs nothing to traverse.\n\nTo help Bessie, Farmer John will give her access to his private jet service. This service features F (1 <= F <= 350) routes, each of which is a one way flight from one city J\\_i to a another K\\_i (1 <= J\\_i <= C; 1 <= K\\_i <= C) and which costs T\\_i (1 <= T\\_i <= 50,000) dollars. Bessie can pay for the tickets from future earnings if she doesn't have the cash on hand.\n\nBessie can opt to retire whenever and wherever she wants. Given an unlimited amount of time, what is the most money that Bessie can make presuming she can make the full D dollars in each city she can travel to?  Print -1 if there is no limit to this amount.\n\n奶牛们正在找工作。农场主约翰知道后，鼓励奶牛们四处碰碰运气。而且他还加了一条要求：一头牛在一个城市最多只能赚D（1≤D≤1000）美元，然后它必须到另一座城市工作。当然，它可以在别处工作一阵子后又回到原来的城市再最多赚D美元。而且这样的往返次数没有限制。\n\n城市间有P（1≤P≤150）条单向路径连接，共有C（2≤C≤220）座城市，编号从1到C。奶牛贝茜当前处在城市S（1≤S≤C）。路径i从城市A\\_i到城市B\\_i（1≤A\\_i≤C，1≤B\\_i≤C），在路径上行走不用任何花费。\n\n为了帮助贝茜，约翰让它使用他的私人飞机服务。这项服务有F条（1≤F≤350）单向航线，每条航线是从城市J\\_i飞到另一座城市K\\_i（1≤J\\_i≤C，1≤K\\_i≤C），费用是T\\_i（1≤T\\_i≤50000）美元。如果贝茜手中没有现钱，可以用以后赚的钱来付机票钱。\n\n贝茜可以选择在任何时候，在任何城市退休。如果在工作时间上不做限制，贝茜总共可以赚多少钱呢？如果赚的钱也不会出现限制，就输出-1。\n",
    "inputFormat": "第一行：5个用空格分开的整数D，P，C，F，S。\n\n第2到第P+1行：第i+1行包含2个用空格分开的整数，表示一条从城市A\\_i到城市B\\_i的单向路径。\n\n接下来F行，每行3个用空格分开的整数，表示一条从城市J\\_i到城市K\\_i的单向航线，费用是T\\_i。\n",
    "outputFormat": "一个整数，在上述规则下最多可以赚到的钱数。\n",
    "samples": [
        [
            "100 3 5 2 1\n1 5\n2 3\n1 4\n5 2 150\n2 5 120\n",
            "250"
        ]
    ],
    "hint": "This world has five cities, three paths and two jet routes. Bessie starts out in city 1, and she can only make 100 dollars in each city before moving on.\n\n\nBessie can travel from city 1 to city 5 to city 2 to city 3, and make a total of 4\\*100 - 150 = 250 dollars.\n\n\nSource: USACO 2009 November Silver\n\n这个世界上有五个城市，三条单向路径和两条单向航线。贝茜从一号城市开始她的旅行，她在离开一个城市前最多只能在这个城市赚100美元。\n\n\n贝茜可以通过从一号城市-->五号城市-->二号城市-->三号城市的旅行赚到4\\*100-150=250美元。\n\n\n(注:在四个城市各赚100美元,从五号城市飞到二号城市花掉150美元)\n\n\n来源:USACO 2009 十一月银组\n"
}