{
    "description": "Farmer John wants to set up a telephone line at his farm. Unfortunately, the phone company is uncooperative, so he needs to pay for some of the cables required to connect his farm to the phone system.\n\nThere are N (1 ≤ N ≤ 1,000) forlorn telephone poles conveniently numbered 1..N that are scattered around Farmer John's property; no cables connect any them. A total of P (1 ≤ P ≤ 10,000) pairs of poles can be connected by a cable; the rest are too far apart.\n\nThe i-th cable can connect the two distinct poles Ai and Bi, with length Li (1 ≤ Li ≤ 1,000,000) units if used. The input data set never names any {Ai, Bi} pair more than once. Pole 1 is already connected to the phone system, and pole N is at the farm. Poles 1 and N need to be connected by a path of cables; the rest of the poles might be used or might not be used.\n\nAs it turns out, the phone company is willing to provide Farmer John with K (0 ≤ K < N) lengths of cable for free. Beyond that he will have to pay a price equal to the length of the longest remaining cable he requires (each pair of poles is connected with a separate cable), or 0 if he does not need any additional cables.\n\nDetermine the minimum amount that Farmer John must pay.\n\n多年以后，笨笨长大了，成为了电话线布置师。由于地震使得某市的电话线全部损坏，笨笨是负责接到震中市的负责人。该市周围分布着 $1\\le N\\le1000$ 根据 $1\\cdots N$ 顺序编号的废弃的电话线杆，任意两根线杆之间没有电话线连接，一共有 $1\\le p\\le10000$ 对电话杆可以拉电话线。其他的由于地震使得无法连接。\n\n第i对电线杆的两个端点分别是 $a_i$ ，$b_i$，它们的距离为 $1\\le l_i\\le1000000$。数据中每对 $(a_i,b_i)$ 只出现一次。编号为 $1$ 的电话杆已经接入了全国的电话网络，整个市的电话线全都连到了编号 $N$ 的电话线杆上。也就是说，笨笨的任务仅仅是找一条将 $1$ 号和 $N$ 号电线杆连起来的路径，其余的电话杆并不一定要连入电话网络。\n\n电信公司决定支援灾区免费为此市连接 $k$ 对由笨笨指定的电话线杆，对于此外的那些电话线，需要为它们付费，总费用决定于其中最长的电话线的长度（每根电话线仅连接一对电话线杆）。如果需要连接的电话线杆不超过 $k$ 对，那么支出为 $0$。\n\n请你计算一下，将电话线引导震中市最少需要在电话线上花多少钱？\n",
    "inputFormat": "输入文件的第一行包含三个数字 $n,p,k$。\n\n第二行到第 $p+1$ 行，每行分别都为三个整数 $a_i,b_i,l_i$。\n",
    "outputFormat": "一个整数，表示该项工程的最小支出，如果不可能完成则输出 `-1`。\n",
    "samples": [
        [
            "5 7 1\n1 2 5\n3 1 4\n2 4 8\n3 2 3\n5 2 9\n3 4 7\n4 5 6\n",
            "4\n"
        ]
    ],
    "hint": ""
}