{
    "description": "King Byteasar's palace is haunted by a ghost. The spiteful claim it is the ghost of the late Byteasar's wife (who died recently in suspicious circumstances), for it takes great pleasure in looking at itself in the mirror, just as she did. No wonder that Byteasar would gladly get rid of this ghost!\n\nByteasar has decided to plant a special mirror trap in one of the palace's chambers. It is a closed, well lit room whose every interior wall is covered with mirror. Furthermore, in its every corner a laser gun or a laser detector can be set up. As soon as the ghost crosses one of the laser beams an alarm will go off, summoning Byteasar's ghost vanquishers team (as a royal team, they prefer not to be colloquially called 'ghost busters'), who will surely dispose of the ghost in no time.\n\nThe chamber, in which the mirror trap is being installed, is in the shape of a polygon whose consecutive sides are perpendicular. Moreover, the length of every side (measured in metres) is integral. Should a laser gun be installed in some corner, its beam has to be pointed along the bisector of the angle formed by the walls meeting in this corner (in a plane parallel to the floor surface). Obviously, if the laser beam encounters a mirror, it is reflected, obeying the regular reflection law: the angle which the incident ray makes with the normal is equal to the angle which the reflected ray makes to the same normal. This angle, as you may notice, is always 45 degrees due to the chamber's architecture. A beam cast along the bisector into a corner where a detector is placed, is completely absorbed by it. On the other hand, a beam cast along the bisector into corner without a detector (though possibly with a laser gun) is reflected back (by 180 degrees). In all the remaining cases the beam does not change its direction at all.\n\nA maximum number of laser guns complemented with laser detectors should be placed in the room in such a way that each laser beam is eventually absorbed by some detector, no two laser beams are absorbed by the same detector and each detector absorbs some laser beam. Also, a laser gun and a detector may not be placed in the same corner.\n\n\nAn example of a mirror trap with the laser beam going from corner 1 to corner 7:\n\nWrite a programme that:\n\nreads from the standard input the the mirror trap's shape description,\ndetermines the way of setting up the maximum possible number of laser guns and detectors satisfying the aforementioned conditions,\nwrites out the result to the standard output.\n\n\n![](https://cdn.luogu.com.cn/upload/pic/15471.png)",
    "inputFormat": "第一行给出一个数字N,代表有多少个点. 下面N行,用来描述点的坐标.其值在[-1000000,1000000]",
    "outputFormat": "最多可放置多少对发射器和接收器",
    "samples": [
        [
            "10\n1 1\n3 1\n3 -2\n-3 -2\n-3 0\n-1 0\n-1 -1\n2 -1\n2 0\n1 0",
            "5\n10 5\n1 7\n2 9\n3 8\n4 6"
        ]
    ],
    "hint": "",
    "translation": "多边形相邻边垂直，边长为整数，边平行坐标轴。要在多边形的点上放一些激光发射器和接收器。满足下列要求： \n1. 发射器和接收器不能放置在同一点； \n2. 发射器发出激光可以沿壁反射，最终到达一个接收器； \n3. 发射器只能沿角平分线发射激光。求：最多可放置多少对发射器和接收器？点数4<=n<=100000"
}