{
    "description": "Farmer John needs to travel to town to pick up K (1 <= K <= 100) pounds of feed. Driving D miles with K pounds of feed in his truck costs D\\*K cents.\n\nThe county feed lot has N (1 <= N <= 100) stores (conveniently numbered 1..N) that sell feed. Each store is located on a segment of the X axis whose length is E (1 <= E <= 350). Store i is at location X\\_i (0 < X\\_i < E) on the number line and can sell FJ as much as F\\_i (1 <= F\\_i <= 100) pounds of feed at a cost of C\\_i (1 <= C\\_i <= 1,000,000) cents per pound. Amazingly, a given point on the X axis might have more than one store.\n\nFJ starts at location 0 on this number line and can drive only in the positive direction, ultimately arriving at location E, with at least K pounds of feed. He can stop at any of the feed stores along the way and buy any amount of feed up to the the store's limit.\n\nWhat is the minimum amount FJ has to pay to buy and transport the K pounds of feed? FJ knows there is a solution.\n\nConsider a sample where FJ needs two pounds of feed from three stores (locations: 1, 3, and 4) on a number line whose range is 0..5:\n\n```\n0   1   2   3   4   5 \n+---|---+---|---|---+ \n    1       1   1      Available pounds of feed \n    1       2   2      Cents per pound \n```\nIt is best for FJ to buy one pound of feed from both the second and third stores. He must pay two cents to buy each pound of feed for a total cost of 4. When FJ travels from 3 to 4 he is moving 1 unit of length and he has 1 pound of feed so he must pay 1\\*1 = 1 cents.\n\nWhen FJ travels from 4 to 5 he is moving one unit and he has 2 pounds of feed so he must pay 1\\*2 = 2 cents.\n\nThe total cost is 4+1+2 = 7 cents. \n\nFJ 开车去买 $K$ 份食物，如果他的车上有 $X$ 份食物。每走一里就花费 $X$ 元。FJ 的城市是一条线，总共 $E$ 里路，有 $E+1$ 个地方，标号 $0\\sim E$。 FJ 从 $0$ 开始走，到 $E$ 结束（不能往回走），要买 $K$ 份食物。 城里有 $N$ 个商店，每个商店的位置是 $X_i$（一个点上可能有多个商店），有 $F_i$ 份食物，每份 $C_i$ 元。 问到达 $E$ 并买 $K$ 份食物的最小花费。",
    "inputFormat": "![](https://cdn.luogu.com.cn/upload/pic/1718.png)\n",
    "outputFormat": "![](https://cdn.luogu.com.cn/upload/pic/1719.png)\n",
    "samples": [
        [
            "2 5 3\n3 1 2\n4 1 2\n1 1 1",
            "7"
        ]
    ],
    "hint": "![](https://cdn.luogu.com.cn/upload/pic/1720.png)\n"
}