{
    "description": "Farmer John tries to keep the cows sharp by letting them play with intellectual toys. One of the larger toys is the lights in the barn. Each of the N (2 <= N <= 100,000) cow stalls conveniently numbered 1..N has a colorful light above it.\n\nAt the beginning of the evening, all the lights are off. The cows control the lights with a set of N pushbutton switches that toggle the lights; pushing switch i changes the state of light i from off to on or from on to off.\n\nThe cows read and execute a list of M (1 <= M <= 100,000) operations expressed as one of two integers (0 <= operation <= 1).\n\nThe first kind of operation (denoted by a 0 command) includes two subsequent integers S\\_i and E\\_i (1 <= S\\_i <= E\\_i <= N) that indicate a starting switch and ending switch. They execute the operation by pushing each pushbutton from S\\_i through E\\_i inclusive exactly once.\n\nThe second kind of operation (denoted by a 1 command) asks the cows to count how many lights are on in the range given by two integers S\\_i and E\\_i (1 <= S\\_i <= E\\_i <= N) which specify the inclusive range in which the cows should count the number of lights that are on.\n\nHelp FJ ensure the cows are getting the correct answer by processing the list and producing the proper counts.\n\n灯是由高科技——外星人鼠标操控的。你只要左击两个灯所连的鼠标，\n\n这两个灯，以及之间的灯都会由暗变亮，或由亮变暗。右击两个灯所连的鼠\n\n标，你就可以知道这两个灯，以及之间的灯有多少灯是亮的。起初所有灯都是暗的，你的任务是在LZ之前算出灯的亮灭。\n",
    "inputFormat": "第1 行: 用空格隔开的两个整数N 和M，n 是灯数\n\n第2..M+1 行: 每行表示一个操作, 有三个用空格分开的整数: 指令号, S\\_i 和E\\_i\n\n第1 种指令(用0 表示)包含两个数字S\\_i 和E\\_i (1 <= S\\_i <= E\\_i <= N), 它们表示起\n\n始开关和终止开关. 表示左击\n\n第2 种指令(用1 表示)同样包含两个数字S\\_i 和E\\_i (1 <= S\\_i <= E\\_i <= N), 不过这\n\n种指令是询问从S\\_i 到E\\_i 之间的灯有多少是亮着的.\n",
    "outputFormat": "",
    "samples": [
        [
            "4 5\n0 1 2\n0 2 4\n1 2 3\n0 2 4\n1 1 4",
            "1\n2"
        ]
    ],
    "hint": " ![](https://cdn.luogu.com.cn/upload/pic/2448.png) \n\n"
}