{
    "description": "Farmer John's $N$ cows ($1 \\leq N \\leq 1000$) want to organize an emergency \"moo-cast\" system for broadcasting important messages among themselves.\n\nInstead of mooing at each-other over long distances, the cows decide to equip themselves with walkie-talkies, one for each cow. These walkie-talkies each have a limited transmission radius, but cows can relay messages to one-another along a path consisting of several hops, so it is not necessary for every cow to be able to transmit directly to every other cow.\n\nThe cows need to decide how much money to spend on their walkie-talkies. If they spend $X$, they will each get a walkie-talkie capable of transmitting up to a distance of $\\sqrt{X}$. That is, the squared distance between two cows must be at most $X$ for them to be able to communicate.\n\nPlease help the cows determine the minimum integer value of $X$ such that a broadcast from any cow will ultimately be able to reach every other cow.\n\nFJ的N头牛(1≤N≤1000)为了在他们之间传播信息, 想要组织一个\"哞哞广播\"系统. 奶牛们决定去用步话机装备自己而不是在很远的距离之外互相哞哞叫, 所以每一头奶牛都必须有一个步话机. 这些步话机都有一个限制传播半径, 但是奶牛们可以间接地通过中间奶牛传播信息, 所以并不是每头牛都必须直接向其他每一头奶牛连边.\n\n奶牛们需要去决定多少钱花在步话机上, 如果他们花了$X, 那么他们都将会得到sqrt(x)距离的步话机. 所以, 两头牛之间的欧几里得距离平方最多是X. 请帮助奶牛们找到最小的X使得图是强连通的.、\n",
    "inputFormat": "The first line of input contains $N$.\n\nThe next $N$ lines each contain the $x$ and $y$ coordinates of a single cow. These are both integers in the range $0 \\ldots 25,000$.\n",
    "outputFormat": "Write a single line of output containing the integer $X$ giving the minimum amount the cows must spend on walkie-talkies.\n",
    "samples": [
        [
            "4\n1 3\n5 4\n7 2\n6 1",
            "17\n"
        ]
    ],
    "hint": "感谢@MrMorning 提供翻译\n"
}