{
    "description": "Farmer John has gone to town to buy some farm supplies. Being a very efficient man, he always pays for his goods in such a way that the smallest number of coins changes hands, i.e., the number of coins he uses to pay plus the number of coins he receives in change is minimized. Help him to determine what this minimum number is.\n\nFJ wants to buy T (1 ≤ T ≤ 10,000) cents of supplies. The currency system has N (1 ≤ N ≤ 100) different coins, with values V1, V2, ..., VN (1 ≤ Vi ≤ 120). Farmer John is carrying C1 coins of value V1, C2 coins of value V2, ...., and CN coins of value VN (0 ≤ Ci ≤ 10,000). The shopkeeper has an unlimited supply of all the coins, and always makes change in the most efficient manner (although Farmer John must be sure to pay in a way that makes it possible to make the correct change).\n\n农夫John想到镇上买些补给。为了高效地完成任务，他想使硬币的转手次数最少。即使他交付的硬 币数与找零得到的的硬币数最少。 \n\nJohn想要买价值为T的东西。有N(1<=n<=100)种货币参与流通，面值分别为V1,V2..Vn (1<=Vi<=120)。John有Ci个面值为Vi的硬币(0<=Ci<=10000)。\n\n我们假设店主有无限多的硬币， 并总按最优方案找零。**注意无解输出-1。**\n",
    "inputFormat": "Line 1: Two space-separated integers: N and T.\n\n\nLine 2: N space-separated integers, respectively V1, V2, ..., VN coins (V1, ...VN)\n\n\nLine 3: N space-separated integers, respectively C1, C2, ..., CN\n",
    "outputFormat": "Line 1: A line containing a single integer, the minimum number of coins involved in a payment and change-making. If it is impossible for Farmer John to pay and receive exact change, output -1.\n",
    "samples": [
        [
            "3 70\n5 25 50\n5 2 1",
            "3"
        ]
    ],
    "hint": "Farmer John pays 75 cents using a 50 cents and a 25 cents coin, and receives a 5 cents coin in change, for a total of 3 coins used in the transaction.\n"
}