{
    "description": "Oh those picky N (1 <= N <= 50,000) cows! They are so picky that each one will only be milked over some precise time interval A..B (1 <= A <= B <= 1,000,000), which includes both times A and B.  Obviously, FJ must create a reservation system to determine which stall each cow can be assigned for her milking time. Of course, no cow will share such a private moment with other cows.\n\n\nHelp FJ by determining:The minimum number of stalls required in the barn so that each cow can have her private milking periodAn assignment of cows to these stalls over timeMany answers are correct for each test dataset; a program will grade your answer.\n\n约翰的N(l<N< 50000)头奶牛实在是太难伺候了，她们甚至有自己独特的产奶时段.当 然对于某一头奶牛，她每天的产奶时段是固定的，为时间段A到B包括时间段A和时间段B.显然，约翰必须开发一个调控系统来决定每头奶牛应该被安排到哪个牛棚去挤 奶，因为奶牛们显然不希望在挤奶时被其它奶牛看见.\n\n约翰希望你帮他计算一下：如果要满足奶牛们的要求，并且每天每头奶牛都要被挤过奶，至少需要多少牛棚 •每头牛应该在哪个牛棚被挤奶。如果有多种答案，你只需任意一种即可。\n",
    "inputFormat": "Line 1: A single integer, N\n\nLines 2..N+1: Line i+1 describes cow i's milking interval with two space-separated integers.\n",
    "outputFormat": "Line 1: The minimum number of stalls the barn must have.\n\n\n\n\nLines 2..N+1: Line i+1 describes the stall to which cow i will be assigned for her milking period.\n",
    "samples": [
        [
            "5\n1 10\n2 4\n3 6\n5 8\n4 7",
            "4\n1\n2\n3\n2\n4"
        ]
    ],
    "hint": "Explanation of the sample:\n\n\n\n\n\n\n\nHere's a graphical schedule for this output:\n\nTime     1  2  3  4  5  6  7  8  9 10\n\n\nStall 1 c1>>>>>>>>>>>>>>>>>>>>>>>>>>>\n\n\nStall 2 .. c2>>>>>> c4>>>>>>>>> .. ..\n\n\nStall 3 .. .. c3>>>>>>>>> .. .. .. ..\n\n\nStall 4 .. .. .. c5>>>>>>>>> .. .. ..Other outputs using the same number of stalls are possible.\n\n由@FlierKing提供spj\n"
}