{
    "description": "Every year the cows hold an event featuring a peculiar version of hopscotch that involves carefully jumping from rock to rock in a river. The excitement takes place on a long, straight river with a rock at the start and another rock at the end, L units away from the start (1 ≤ L ≤ 1,000,000,000). Along the river between the starting and ending rocks, N (0 ≤ N ≤ 50,000) more rocks appear, each at an integral distance Di from the start (0 < Di < L).\n\nTo play the game, each cow in turn starts at the starting rock and tries to reach the finish at the ending rock, jumping only from rock to rock. Of course, less agile cows never make it to the final rock, ending up instead in the river.\n\nFarmer John is proud of his cows and watches this event each year. But as time goes by, he tires of watching the timid cows of the other farmers limp across the short distances between rocks placed too closely together. He plans to remove several rocks in order to increase the shortest distance a cow will have to jump to reach the end. He knows he cannot remove the starting and ending rocks, but he calculates that he has enough resources to remove up to M rocks (0 ≤ M ≤ N).\n\nFJ wants to know exactly how much he can increase the shortest distance \\*before\\* he starts removing the rocks. Help Farmer John determine the greatest possible shortest distance a cow has to jump after removing the optimal set of M rocks.\n\n奶牛跳房子：从N块石头中移除M块，使得间距最小值最大。\n",
    "inputFormat": "Line 1: Three space-separated integers: L, N, and M\n\n\nLines 2..N+1: Each line contains a single integer indicating how far some rock is away from the starting rock. No two rocks share the same position.\n",
    "outputFormat": "Line 1: A single integer that is the maximum of the shortest distance a cow has to jump after removing M rocks\n",
    "samples": [
        [
            "25 5 2\n2\n14\n11\n21\n17",
            "4"
        ]
    ],
    "hint": "Before removing any rocks, the shortest jump was a jump of 2 from 0 (the start) to 2. After removing the rocks at 2 and 14, the shortest required jump is a jump of 4 (from 17 to 21 or from 21 to 25).\n"
}