{
    "description": "FJ has purchased N (1 <= N <= 2000) yummy treats for the cows who get money for giving vast amounts of milk. FJ sells one treat per day and wants to maximize the money he receives over a given period time.\n\n\nThe treats are interesting for many reasons:The treats are numbered 1..N and stored sequentially in single file in a long box that is open at both ends. On any day, FJ can retrieve one treat from either end of his stash of treats.Like fine wines and delicious cheeses, the treats improve with age and command greater prices.The treats are not uniform: some are better and have higher intrinsic value. Treat i has value v(i) (1 <= v(i) <= 1000).Cows pay more for treats that have aged longer: a cow will pay v(i)\\*a for a treat of age a.Given the values v(i) of each of the treats lined up in order of the index i in their box, what is the greatest value FJ can receive for them if he orders their sale optimally?\n\n\nThe first treat is sold on day 1 and has age a=1. Each subsequent day increases the age by 1.\n\n约翰经常给产奶量高的奶牛发特殊津贴，于是很快奶牛们拥有了大笔不知该怎么花的钱。为此，约翰购置了 $N$（$1 \\leq N \\leq 2000$） 份美味的零食来卖给奶牛们。每天约翰售出一份零食。当然约翰希望这些零食全部售出后能得到最大的收益，这些零食有以下这些有趣的特性：\n+ 零食按照 $1, \\ldots, N$ 编号，它们被排成一列放在一个很长的盒子里。盒子的两端都有开口，约翰每天可以从盒子的任一端取出最外面的一个。\n+ 与美酒与好吃的奶酪相似，这些零食储存得越久就越好吃。当然，这样约翰就可以把它们卖出更高的价钱。\n+ 每份零食的初始价值不一定相同。约翰进货时，第i份零食的初始价值为 $V_i$（$1 \\leq V \\leq 1000$）。\n+ 第i份零食如果在被买进后的第 $a$ 天出售，则它的售价是 $V_i \\times a$。\n\n$V_i$ 的是从盒子顶端往下的第i份零食的初始价值。约翰告诉了你所有零食的初始价值，并希望你能帮他计算一下，在这些零食全被卖出后，他最多能得到多少钱。",
    "inputFormat": "Line 1: A single integer, N\n\nLines 2..N+1: Line i+1 contains the value of treat v(i)\n",
    "outputFormat": "Line 1: The maximum revenue FJ can achieve by selling the treats\n",
    "samples": [
        [
            "5\n1\n3\n1\n5\n2",
            "43"
        ]
    ],
    "hint": "Explanation of the sample:\n\n\n\n\nFive treats. On the first day FJ can sell either treat #1 (value 1) or treat #5 (value 2).\n\n\n\n\nFJ sells the treats (values 1, 3, 1, 5, 2) in the following order of indices: 1, 5, 2, 3, 4, making 1x1 + 2x2 + 3x3 + 4x1 + 5x5 = 43.\n"
}