{
    "description": "The pasture contains a small, contiguous grove of trees that has no 'holes' in the middle of the it.  Bessie wonders: how far is it to walk around that grove and get back to my starting position? She's just sure there is a way to do it by going from her start location to successive locations by walking horizontally, vertically, or diagonally and counting each move as a single step. Just looking at it, she doesn't think you could pass 'through' the grove on a tricky diagonal. Your job is to calculate the minimum number of steps she must take.\n\n\nHappily, Bessie lives on a simple world where the pasture is represented by a grid with R rows and C columns (1 <= R <= 50, 1 <= C <= 50). Here's a typical example where '.' is pasture (which Bessie may traverse), 'X' is the grove of trees, '\\*' represents Bessie's start and end position, and '+' marks one shortest path she can walk to circumnavigate the grove (i.e., the answer):\n\n```cpp\n...+...\n..+X+..\n.+XXX+.\n..+XXX+\n..+X..+\n...+++*\n```\nThe path shown is not the only possible shortest path; Bessie might have taken a diagonal step from her start position and achieved a similar length solution. Bessie is happy that she's starting 'outside' the grove instead of in a sort of 'harbor' that could complicate finding the best path.\n\n牧场里有树林，林子里没有坑，贝茜很想知道，最少几步能绕树林走一圈，最后回到起点.她能上下左右走，也能走对角线格子.\n\n牧场被分成 $R$ 行 $C$ 列 $(1\\leq R\\leq 50,\\ 1\\leq C\\leq 50)$ 。下面是一张样例的地图，其中 `.` 表示贝茜可以走的空地， `X` 表示树林，表示起点.而贝茜走的最近的路已经特别地用 `+` 表示 出来.\n\n题目**保证存在最短路径**，且森林形成一个联通块。",
    "inputFormat": "Line 1: Two space-separated integers: R and C\n\n\n\n\nLines 2..R+1: Line i+1 describes row i with C characters (with no spaces between them).\n",
    "outputFormat": "Line 1: The single line contains a single integer which is the smallest number of steps required to circumnavigate the grove.\n",
    "samples": [
        [
            "6 7\n.......\n...X...\n..XXX..\n...XXX.\n...X...\n...*...",
            "11"
        ]
    ],
    "hint": ""
}