{
    "description": "Bessy is going to school and doing well. She has taken N (1 ≤ N ≤ 5000 -- except one case where 1 ≤ N ≤ 50,000) tests and recorded the scores (Ti points out of Pi points for test i; 0 ≤ Ti ≤ Pi < 40,000; 0 < Pi) as this task's input.\n\nHer teacher will drop the D tests with the lowest percentage (Ti⁄Pi) before calculating Bessie's final grade (which is the sum of the remaining test score points over the sum of the remaining total test points). Bessy is good at math and quickly realizes that this does not benefit her as much as it might.\n\nTo prove her point, Bessy wants to find all values of D for which she could have ended up with a higher grade by choosing to drop different tests than the teacher would have. Help her by finding and printing all values of D for which this is possible.\n\nBessy has noted that, amazingly, she has never scored the same percentage on two different tests.\n\n一个人参加了N场考试，第i场满分为P[i]，其得分为T[i]。现在要删去其中D次考试的成绩，用剩下的总得分除以剩下的满分之和，作为其最终成绩。问对于哪些D而言，删除得分比(即T[i]/P[i])最小的D场得到的最终成绩不是最优的(用其他方法可以得到更高的最终成绩)。\n",
    "inputFormat": "Line 1: A single integer, N\n\n\nLines 2..N+1: Line i+1 contains two space-separated integers: Ti and Pi\n",
    "outputFormat": "Line 1: A single integer K (0 ≤ K ≤ N) that is the number of values of D for which Bessy could have ended up with a higher grade by dropping a different set of D tests than the teacher.\n\n\nLines 2..K+1: The values of D for which this is true, in ascending numerical order.\n",
    "samples": [
        [
            "5\n1 2\n5 9\n3 8\n4 10\n1 3",
            "2\n1\n2"
        ]
    ],
    "hint": ""
}