{
    "description": "Farmer John has arranged his N (1 ≤ N ≤ 5,000) cows in a row and many of them are facing forward, like good cows. Some of them are facing backward, though, and he needs them all to face forward to make his life perfect.\n\nFortunately, FJ recently bought an automatic cow turning machine. Since he purchased the discount model, it must be irrevocably preset to turn K (1 ≤ K ≤ N) cows at once, and it can only turn cows that are all standing next to each other in line. Each time the machine is used, it reverses the facing direction of a contiguous group of K cows in the line (one cannot use it on fewer than K cows, e.g., at the either end of the line of cows). Each cow remains in the same \\*location\\* as before, but ends up facing the \\*opposite direction\\*. A cow that starts out facing forward will be turned backward by the machine and vice-versa.\n\nBecause FJ must pick a single, never-changing value of K, please help him determine the minimum value of K that minimizes the number of operations required by the machine to make all the cows face forward. Also determine M, the minimum number of machine operations required to get all the cows facing forward using that value of K.\n\n$N$ 头牛排成一列 $1 \\le N \\le 5000$。每头牛或者向前或者向后。为了让所有牛都面向前方，农夫每次可以将 $K$ 头连续的牛转向 $1 \\le K \\le N$，求使操作次数最小的相应 $K$ 和最小的操作次数 $M$。$F$ 为朝前，$B$ 为朝后。\n\n请在一行输出两个数字 $K$ 和 $M$，用空格分开。",
    "inputFormat": "Line 1: A single integer: N\n\n\nLines 2..N+1: Line i+1 contains a single character, F or B, indicating whether cow i is facing forward or backward.\n",
    "outputFormat": "Line 1: Two space-separated integers: K and M\n",
    "samples": [
        [
            "7\nB\nB\nF\nB\nF\nB\nB",
            "3 3"
        ]
    ],
    "hint": "For K = 3, the machine must be operated three times: turn cows (1,2,3), (3,4,5), and finally (5,6,7)\n"
}