{
    "description": "To avoid unsightly burns while tanning, each of the C (1 ≤ C ≤ 2500) cows must cover her hide with sunscreen when they're at the beach. Cow i has a minimum and maximum SPF rating (1 ≤ minSPFi ≤ 1,000; minSPFi ≤ maxSPFi ≤ 1,000) that will work. If the SPF rating is too low, the cow suffers sunburn; if the SPF rating is too high, the cow doesn't tan at all........\n\nThe cows have a picnic basket with L (1 ≤ L ≤ 2500) bottles of sunscreen lotion, each bottle i with an SPF rating SPFi (1 ≤ SPFi ≤ 1,000). Lotion bottle i can cover coveri cows with lotion. A cow may lotion from only one bottle.\n\nWhat is the maximum number of cows that can protect themselves while tanning given the available lotions?\n\n有C个奶牛去晒太阳 (1 <=C <= 2500)，每个奶牛各自能够忍受的阳光强度有一个最小值和一个最大值，太大就晒伤了，太小奶牛没感觉。\n\n而刚开始的阳光的强度非常大，奶牛都承受不住，然后奶牛就得涂抹防晒霜，防晒霜的作用是让阳光照在身上的阳光强度固定为某个值。\n\n那么为了不让奶牛烫伤，又不会没有效果。\n\n给出了L种防晒霜。每种的数量和固定的阳光强度也给出来了\n\n每个奶牛只能抹一瓶防晒霜，最后问能够享受晒太阳的奶牛有几个。\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: C and L\n\n\\* Lines 2..C+1: Line i describes cow i's lotion requires with two integers: minSPFi and maxSPFi\n\n\\* Lines C+2..C+L+1: Line i+C+1 describes a sunscreen lotion bottle i with space-separated integers: SPFi and coveri\n",
    "outputFormat": "A single line with an integer that is the maximum number of cows that can be protected while tanning\n",
    "samples": [
        [
            "3 2\n3 10\n2 5\n1 5\n6 2\n4 1",
            "2"
        ]
    ],
    "hint": ""
}