{
    "description": "The cows are journeying north to Thunder Bay in Canada to gain cultural enrichment and enjoy a vacation on the sunny shores of Lake Superior. Bessie, ever the competent travel agent, has named the Bullmoose Hotel on famed Cumberland Street as their vacation residence. This immense hotel has N (1 ≤ N ≤ 50,000) rooms all located on the same side of an extremely long hallway (all the better to see the lake, of course).\n\nThe cows and other visitors arrive in groups of size Di (1 ≤ Di ≤ N) and approach the front desk to check in. Each group i requests a set of Di contiguous rooms from Canmuu, the moose staffing the counter. He assigns them some set of consecutive room numbers r..r+Di-1 if they are available or, if no contiguous set of rooms is available, politely suggests alternate lodging. Canmuu always chooses the value of r to be the smallest possible.\n\nVisitors also depart the hotel from groups of contiguous rooms. Checkout i has the parameters Xi and Di which specify the vacating of rooms Xi ..Xi +Di-1 (1 ≤ Xi ≤ N-Di+1). Some (or all) of those rooms might be empty before the checkout.\n\nYour job is to assist Canmuu by processing M (1 ≤ M < 50,000) checkin/checkout requests. The hotel is initially unoccupied.\n\n第一行输入 $n,m$，$n$ 代表有 $n$ 个房间 $(1\\leq n \\leq 50,000)$，编号为 $1 \\sim n$，开始都为空房，$m$ 表示以下有 $m$ 行操作 $(1\\leq m < 50,000)$，以下每行先输入一个数 $i$ ，表示一种操作：\n\n若 $i$ 为 $1$，表示查询房间，再输入一个数 $x$，表示在 $1,2,...,n$ 房间中找到长度为 $x$ 的连续空房，输出连续 $x$ 个房间中左端的房间号，尽量让这个房间号最小，若找不到长度为 $x$ 的连续空房，输出 $0$。若找得到，在这 $x$ 个空房间中住上人。\n\n若 $i$ 为 $2$，表示退房，再输入两个数 $x,y$ 代表房间号 $x \\sim x+y-1$ 退房，即让房间为空。\n\n你需要对每个输入 $1$ 输出对应的答案。",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and M\n\n\\* Lines 2..M+1: Line i+1 contains request expressed as one of two possible formats: (a) Two space separated integers representing a check-in request: 1 and Di (b) Three space-separated integers representing a check-out: 2, Xi, and Di\n",
    "outputFormat": "\\* Lines 1.....: For each check-in request, output a single line with a single integer r, the first room in the contiguous sequence of rooms to be occupied. If the request cannot be satisfied, output 0.\n",
    "samples": [
        [
            "10 6\n1 3\n1 3\n1 3\n1 3\n2 5 5\n1 6\n",
            "1\n4\n7\n0\n5\n"
        ]
    ],
    "hint": ""
}