{
    "description": "Farmer John has purchased the world's most loathesome hay baler. Instead of having a drive-roller that drives maybe an idler roller that drives the power take-off for the baler, it has N rollers (2 <= N <= 1050) which drive and are driven by various rollers.\n\nFJ has meticulously cataloged data for each roller i: X\\_i,Y\\_i are the center of the roller (-5000 <= X\\_i <= 5000; -5000 <= Y\\_i <= 5000); R\\_i is the roller's radius (3 <= R\\_i <= 800). The drive-roller is located at 0,0; the baler power take-off is located at X\\_t,Y\\_t (numbers supplied in the input).\n\nThe drive-roller turns clockwise at 10,000 revolutions per hour. Your job is to determine the speeds of all the rollers that are in the power-train: from the drive-roller through the power take-off roller. Rollers that do not transfer power to the take-off roller are to be ignored. A roller of radius Rd that is turning at S rph and driving another roller of radius Rx will cause the second roller to turn at the speed -S\\*Rd/Rx (where the sign denotes whether the roller is turning clockwise or counterclockwise (anticlockwise for our British friends)).\n\nDetermine the power-train path and report the sum of the absolute values of all those rollers' speeds. All the rollers in the input set except the driver-roller are driven by some other roller; power is never transferred to a roller from more than one other roller.\n\nReport your answer as an integer that is the truncated value after summing all the speeds.\n\nFarmer John新买的干草打包机的内部结构大概算世界上最混乱的了，它不象普通的机器一样有明确的内部传动装置，而是，N (2 <= N <= 1050)个齿轮互相作用，每个齿轮都可能驱动着多个齿轮。 FJ记录了对于每个齿轮i，记录了它的3个参数：X\\_i，Y\\_i表示齿轮中心的位置坐标(-5000 <= X\\_i <= 5000; -5000 <= Y\\_i <= 5000)；R\\_i表示该齿轮的半径(3 <= R\\_i <= 800)。\n\n驱动齿轮的位置为0,0，并且FJ也知道最终的工作齿轮位于X\\_t,Y\\_t。 驱动齿轮顺时针转动，转速为10,000转/小时。你的任务是，确定传动序列中所有齿轮的转速。传动序列的定义为，能量由驱动齿轮传送到工作齿轮的过程中用到的所有齿轮的集合。对能量传送无意义的齿轮都应当被忽略。\n\n在一个半径为Rd，转速为S转/每小时的齿轮的带动下，与它相接的半径为Rx的齿轮的转速将为-S\\*Rd/Rx转/小时。S前的负号的意思是，一个齿轮带动的另一个齿轮的转向会与它的转向相反。\n\nFJ只对整个传动序列中所有齿轮速度的绝对值之和感兴趣，你的任务也就相应转化成求这个值。机器中除了驱动齿轮以外的所有齿轮都被另外某个齿轮带动，并且不会出现2个不同的齿轮带动同一个齿轮的情况。\n",
    "inputFormat": "\\* Line 1: Three space-separated integers: N, X\\_t, and Y\\_t\n\n\\* Lines 2..N+1: Line i+1 describes roller i's properties: X\\_i, Y\\_i, and R\\_i\n",
    "outputFormat": "\\* Line 1: A single integer that is the truncated version of the sum of the absolute value of the speeds of the rollers in the power-train including the drive-roller, all the driven rollers, and the power take-off roller.\n",
    "samples": [
        [
            "4 32 54 \n0 0 10 \n0 30 20 \n32 54 20 \n-40 30 20 \n",
            "20000 \n"
        ]
    ],
    "hint": "Four rollers: the drive-roller at 0,0 with radius 10. It drives the roller above it at 0,30 with radius 20. That roller drives both the power take-off roller at 32,54 (r=20) and a random roller (not in the power train) at -40,30 (r=20).\n\n\nRoller   Radius   Speed\n\n1 (0,0)     10     10,000 \n\n2 (0,30)    20     -5,000 \n\n3 (32,54)   20      5,000 \n\n------\nSum of abs values: 20,000\n"
}