{
    "description": "Farmer John is on a boat seeking fabled treasure on one of the N (1 <= N <= 100) islands conveniently labeled 1..N in the Cowribbean Sea.\n\nThe treasure map tells him that he must travel through a certain sequence A\\_1, A\\_2, ..., A\\_M of M (2 <= M <= 10,000) islands, starting on island 1 and ending on island N before the treasure will appear to him. He can visit these and other islands out of order and even more than once, but his trip must include the A\\_i sequence in the order specified by the map.\n\nFJ wants to avoid pirates and knows the pirate-danger rating (0 <= danger <= 100,000) between each pair of islands. The total danger rating of his mission is the sum of the danger ratings of all the paths he traverses.\n\nHelp Farmer John find the least dangerous route to the treasure that satisfies the treasure map's requirement.\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and M\n\n\\* Lines 2..M+1: Line i+1 describes the i\\_th island FJ must visit with a single integer: A\\_i\n\n\\* Lines M+2..N+M+1: Line i+M+1 contains N space-separated integers that are the respective danger rating of the path between island i and islands 1, 2, ..., and N, respectively. The ith integer is always zero.\n",
    "outputFormat": "\\* Line 1: The minimum danger that Farmer John can encounter while obtaining the treasure.\n",
    "samples": [
        [
            "3 4 \n1 \n2 \n1 \n3 \n0 5 1 \n5 0 2 \n1 2 0 \n",
            "7 \n"
        ]
    ],
    "hint": "There are 3 islands and the treasure map requires Farmer John to visit a sequence of 4 islands in order: island 1, island 2, island 1 again, and finally island 3. The danger ratings of the paths are given: the paths (1, 2); (2, 3); (3, 1) and the reverse paths have danger ratings of 5, 2, and 1, respectively.\n\n\nHe can get the treasure with a total danger of 7 by traveling in the sequence of islands 1, 3, 2, 3, 1, and 3. The cow map's requirement (1, 2, 1, and 3) is satisfied by this route. We avoid the path between islands 1 and 2 because it has a large danger rating.\n\n输入输出格式\n\n\n输入格式：\n\n\n第一行：两个用空格隔开的正整数N和M\n\n\n第二到第M+1行：第i+1行用一个整数Ai表示FJ必须经过的第i个岛屿\n\n\n第M+2到第N+M+1行：第i+M+1行包含N个用空格隔开的非负整数分别表示i号小岛到第1...N号小岛的航线各自的危险指数。保证第i个数是0。\n\n输出格式\n\n\n第一行：FJ在找到宝藏的前提下经过的航线的危险指数之和的最小值。\n\n说明\n\n这组数据中有三个岛屿，藏宝图要求FJ按顺序经过四个岛屿：1号岛屿、2号岛屿、回到1号岛屿、最后到3号岛屿。每条航线的危险指数也给出了：航路(1，2)、(2，3)、(3，1)和它们的反向路径的危险指数分别是5、2、1。\n\n\nFJ可以通过依次经过1、3、2、3、1、3号岛屿以7的最小总危险指数获得宝藏。这条道路满足了奶牛地图的要求（1，2，1，3）。我们避开了1号和2号岛屿之间的航线，因为它的危险指数太大了。\n\n\n注意：测试数据中a到b的危险指数不一定等于b到a的危险指数！\n",
    "translation": "农夫约翰正驾驶一条小艇在牛勒比海上航行．\n\n海上有 $N(1\\leq N\\leq 100)$ 个岛屿，用 $1$ 到 $N$ 编号．约翰从 $1$ 号小岛出发，最后到达 $N$ 号小岛．\n\n一张藏宝图上说，如果他的路程上经过的小岛依次出现了  $A_1,A_2,\\dots ,A_M(2\\leq M\\leq 10000)$ 这样的序列（不一定相邻），那他最终就能找到古老的宝藏． 但是，由于牛勒比海有海盗出没．约翰知道任意两个岛屿之间的航线上海盗出没的概率，他用一个危险指数 $D_{i,j}(0\\leq D_{i,j}\\leq 100000)$ 来描述．他希望他的寻宝活动经过的航线危险指数之和最小．那么，在找到宝藏的前提下，这个最小的危险指数是多少呢？\n\n输入输出格式\n\n输入格式：\n\n第一行：两个用空格隔开的正整数 $N$ 和 $M$。\n\n第二到第 $M+1$ 行：第 $i+1$ 行用一个整数 $A_i$ 表示 FJ 必须经过的第 $i$ 个岛屿\n\n第 $M+2$ 到第 $N+M+1$ 行：第 $i+M+1$ 行包含 $N$ 个用空格隔开的非负整数分别表示 $i$ 号小岛到第 $1\\dots N$ 号小岛的航线各自的危险指数。保证第 $i$ 个数是 $0$。\n\n输出格式\n第一行：FJ 在找到宝藏的前提下经过的航线的危险指数之和的最小值。\n\n说明\n这组数据中有三个岛屿，藏宝图要求 FJ 按顺序经过四个岛屿：$1$ 号岛屿、$2$ 号岛屿、回到 $1$ 号岛屿、最后到 $3$ 号岛屿。每条航线的危险指数也给出了：航路$(1,2),(2,3),(3,1)$ 和它们的反向路径的危险指数分别是 $5,2,1$。\n\nFJ 可以通过依次经过 $1,3,2,3,1,3$ 号岛屿以 $7$ 的最小总危险指数获得宝藏。这条道路满足了奶牛地图的要求 $(1,2,1,3)$。我们避开了 $1$ 号和 $2$ 号岛屿之间的航线，因为它的危险指数太大了。\n\n注意：测试数据中 $a$ 到 $b$ 的危险指数不一定等于 $b$ 到 $a$ 的危险指数！\n\nTranslated by @LJC00125 "
}