{
    "description": "Wisconsin has had an earthquake that has struck Farmer John's farm! The earthquake has damaged some of the pastures so that they are unpassable. Remarkably, none of the cowpaths was damaged.\n\nAs usual, the farm is modeled as a set of P (1 <= P <= 30,000) pastures conveniently numbered 1..P which are connected by a set of C (1 <= C <= 100,000) non-directional cowpaths conveniently numbered 1..C. Cowpath i connects pastures a\\_i and b\\_i (1 <= a\\_i <= P; 1 <= b\\_i <= P). Cowpaths might connect a\\_i to itself or perhaps might connect two pastures more than once.  The barn is located in pasture 1.\n\nA total of N (1 <= N <= P) cows (in different pastures) sequentially contact Farmer John via moobile phone with an integer message\n\nreport\\_j (2 <= report\\_j <= P) that indicates that pasture report\\_j is undamaged but that the calling cow is unable to return to the barn from pasture report\\_j because she could not find a path that does not go through damaged pastures.\n\nAfter all the cows report in, determine the minimum number of\n\npastures (including ones that are uncrossable) from which it is not possible to return to the barn.\n\nNote: Feedback on some of the test data will be provided on the first 50 submissions\n\n农夫John的农场遭受了一场地震.有一些牛棚遭到了损坏,但幸运地,所有牛棚间的路经都还能使用. FJ的农场有P(1 <= P <= 30,000)个牛棚,编号1..P. C(1 <= C <= 100,000)条双向路经联接这些牛棚,编号为1..C. 路经i连接牛棚a\\_i和b\\_i (1 <= a\\_i<= P;1 <= b\\_i <= P).路经可能连接a\\_i到它自己,两个牛棚之间可能有多条路经.农庄在编号为1的牛棚. N (1 <= N <= P)头在不同牛棚的牛通过手机短信report\\_j(2 <= report\\_j <= P)告诉FJ它们的牛棚(report\\_j)没有损坏,但是它们无法通过路经和没有损坏的牛棚回到到农场. 当FJ接到所有短信之后,找出最小的不可能回到农庄的牛棚数目.这个数目包括损坏的牛棚. 注意:前50次提交将提供在一些测试数据上的运行结果.\n",
    "inputFormat": "\\* Line 1: Three space-separated integers: P, C, and N\n\n\\* Lines 2..C+1: Line i+1 describes cowpath i with two integers: a\\_i and b\\_i\n\n\\* Lines C+2..C+N+1: Line C+1+j contains a single integer: report\\_j\n",
    "outputFormat": "\\* Line 1: A single integer that is the minimum count of pastures from which a cow can not return to the barn (including the damaged pastures themselves)\n",
    "samples": [
        [
            "4 3 1 \n1 2 \n2 3 \n3 4 \n3 \n",
            "3 \n"
        ]
    ],
    "hint": "Pasture 2 is damaged, resulting in cows in pastures 2, 3, 4 not being able to return to the barn.\n"
}