{
    "description": "Farmer John always wants his cows to have enough water and thus has made a map of the N (1 <= N <= 700) water pipes on the farm that connect the well to the barn. He was surprised to find a wild mess of different size pipes connected in an apparently haphazard way. He wants to calculate the flow through the pipes.\n\nTwo pipes connected in a row allow water flow that is the minimum of the values of the two pipe's flow values. The example of a pipe with flow capacity 5 connecting to a pipe of flow capacity 3 can be reduced logically to a single pipe of flow capacity 3:\n\n+---5---+---3---+    ->    +---3---+\n\nSimilarly, pipes in parallel let through water that is the sum of their flow capacities:\n\n+---5---+\n\n---+       +---    ->    +---8---+\n\n+---3---+\n\nFinally, a pipe that connects to nothing else can be removed; it contributes no flow to the final overall capacity:\n\n+---5---+\n\n---+               ->    +---3---+\n\n+---3---+--\n\nAll the pipes in the many mazes of plumbing can be reduced using these ideas into a single total flow capacity.\n\nGiven a map of the pipes, determine the flow capacity between the well (A) and the barn (Z).\n\nConsider this example where node names are labeled with letters:\n\n+-----------6-----------+\n\nA+---3---+B                      +Z\n\n+---3---+---5---+---4---+\n\nC       D\n\nPipe BC and CD can be combined:\n\n+-----------6-----------+\n\nA+---3---+B                      +Z\n\n+-----3-----+-----4-----+\n\nD\nThen BD and DZ can be combined: \n\n+-----------6-----------+\n\nA+---3---+B                      +Z\n\n+-----------3-----------+\n\nThen two legs of BZ can be combined: \n\nB\nA+---3---+---9---+Z\n\nThen AB and BZ can be combined to yield a net capacity of 3:\n\nA+---3---+Z\n\nWrite a program to read in a set of pipes described as two endpoints and then calculate the net flow capacity from 'A' to 'Z'. All\n\nnetworks in the test data can be reduced using the rules here.\n\nPipe i connects two different nodes a\\_i and b\\_i (a\\_i in range\n\n'A-Za-z'; b\\_i in range 'A-Za-z') and has flow F\\_i (1 <= F\\_i <= 1,000). Note that lower- and upper-case node names are intended to be treated as different.\n\nThe system will provide extra test case feedback for your first 50 submissions.\n\n约翰总希望他的奶牛有足够的水喝，因此他找来了农场的水管地图，想算算牛棚得到的水的 总流量.农场里一共有N根水管.约翰发现水管网络混乱不堪，他试图对其进行简 化.他简化的方式是这样的：\n\n两根水管串联，则可以用较小流量的那根水管代替总流量.\n\n两根水管并联，则可以用流量为两根水管流量和的一根水管代替它们\n\n当然，如果存在一根水管一端什么也没有连接，可以将它移除.\n\n\n请写个程序算出从水井A到牛棚Z的总流量.数据保证所有输入的水管网络都可以用上述方法 简化.\n\n## 2019.2.21 管理员注：输入数据中可能含有小写字母。",
    "inputFormat": "\\* Line 1: A single integer: N\n\n\\* Lines 2..N + 1: Line i+1 describes pipe i with two letters and an integer, all space-separated: a\\_i, b\\_i, and F\\_i\n",
    "outputFormat": "\\* Line 1: A single integer that the maximum flow from the well ('A') to the barn ('Z')\n",
    "samples": [
        [
            "5 \nA B 3 \nB C 3 \nC D 5 \nD Z 4 \nB Z 6 \n",
            "3 \n"
        ]
    ],
    "hint": ""
}