{
    "description": "A full moon casts some sort of spell on the cows and, like their cousins the wolves and coyotes, they bay at the moon -- mooing instead of howling, of course.\n\nEach 'moo' lasts a certain amount of time. A short 'moo' might last time 1; a longer one might last time 24 or even 1,000,000,000 or longer (cows can really moo when they want to). No 'moo' will last more than or equal to 2^63.\n\nIt should come as no surprise that the cows have a pattern to their moos.  Bessie will choose an integer c (1 <= c <= 100) that is the initial length of a moo.\n\nAfter Bessie moos for length c, the cows calculate times for\n\nsubsequent moos. They apply two formulae to each moo time to yield even more moo times. The two formulae are:\n\n```cpp\nf1(c)=a1*c/d1+b1 (integer divide, of course) and \nf2(c)=a2*c/d2+b2. \nThey then successively use the two new times created by evaluating f1(c) and f2(c) to create even more mooing times. They keep a sorted list of all the possible mooing times (discarding duplicates). \nThey are allowed to moo a total of N times (1 <= N <= 4,000,000). Please determine the length of the longest moo before they must quit. \nThe constants in the formulae have these constraints: 1 <= d1 < a1; d1 < a1 <= 20; 0 <= b1 <= 20; 1 <= d2 < a2; d2 < a2 <= 20; 0 <= b2 <= 20. \nConsider an example where c=3 and N=10. The constants are: \na1=4    b1=3     d1=3 \na2=17   b2=8     d2=2 \n```\nThe first mooing time is 3, given by the value of c. The total list of mooing times is:\n```cpp\n1. c=3             ->  3       6. f2(3)=17*3/2+8  -> 33 \n2. f1(3)=4*3/3+3   ->  7       7. f1(28)=4*28/3+3 -> 40 \n3. f1(7)=4*7/3+3   -> 12       8. f1(33)=4*33/3+3 -> 47 \n4. f1(12)=4*12/3+3 -> 19       9. f1(40)=4*40/3+3 -> 56 \n5. f1(19)=4*19/3+3 -> 28      10. f1(47)=4*47/3+3 -> 65 \nThe tenth time is 65, which would be the proper answer for this set of inputs. \n```\nPartial feedback will be provided on the first 50 submissions.\nMEMORY LIMIT: 64MB\n\n满月的时候，和狼一样，牛们也在月光下叫.他们从不嚎叫，而是哞叫.\n\n每次哞叫都有一个时长，可能是1秒，可能是；10^9秒或更久，牛们真的非常能叫.当然，没有 哞叫时长会超过或等于2^63.\n\n牛们的哞叫可以找到规律，这并不奇怪.贝茜会选择一个整数100)来作为初始时 长.之后，牛们根据两条公式确定更多的时长.这两条公式\n\nf1(c)=a1\\*c/d1+b1整除\n\nf2(c)=a2\\*c/d2+b2. \n\n牛们用这两条公式不断地迭代、计算，算得大量的时长.然后她们将这些时长排序，剔除重 复的时长，最后取前N(l<N< 4000000)个整数为她们N次哞叫的时长.请你计算，第N次哞叫 的时长是多少.公式中的常量均为整数，满足下列关系： 1 <= d1 < a1; d1 < a1 <= 20; 0 <= b1 <= 20; 1 <= d2 < a2; d2 < a2 <= 20; 0 <= b2 <= 20.\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: c and N\n\n\\* Line 2: Three space-separated integers: a1, b1, and d1\n\n\\* Line 3: Three space-separated integers: a2, b2, and d2\n",
    "outputFormat": "\\* Line 1: A single line which contains a single integer which is the length of the Nth moo\n",
    "samples": [
        [
            "3 10 \n4 3 3 \n17 8 2 \n",
            "65 \n"
        ]
    ],
    "hint": ""
}