{
    "description": "Farmer John has built a sand castle! Like all good castles, the walls have crennelations, that nifty pattern of embrasures (gaps) and merlons (filled spaces); see the diagram below. The N (1 <= N <= 25,000) merlons of his castle wall are conveniently numbered 1..N; merlon i has height M\\_i (1 <= M\\_i <= 100,000); his merlons often have varying heights, unlike so many.\n\nHe wishes to modify the castle design in the following fashion: he has a list of numbers B\\_1 through B\\_N (1 <= B\\_i <= 100,000), and wants to change the merlon heights to those heights B\\_1, ..., B\\_N in some order (not necessarily the order given or any other order derived from the data).\n\nTo do this, he has hired some bovine craftsmen to raise and lower the merlons' heights. Craftsmen, of course, cost a lot of money. In particular, they charge FJ a total X (1 <= X <= 100) money per unit height added and Y (1 <= Y <= 100) money per unit height\n\nreduced.\n\nFJ would like to know the cheapest possible cost of modifying his sand castle if he picks the best permutation of heights. The answer is guaranteed to fit within a 32-bit signed integer.\n\nNote: about 40% of the test data will have N <= 9, and about 60% will have N <= 18.\n\n约翰用沙子建了一座城堡．正如所有城堡的城墙，这城墙也有许多枪眼，两个相邻枪眼中间那部分叫作“城齿”．    城墙上一共有N(1≤N≤25000)个城齿，每一个都有一个高度Mi.(1≤Mi≤100000)．现在约翰想把城齿的高度调成某种顺序下的Bi，B2，…，BN(1≤Bi≤100000). -个城齿每提高一个单位的高度，约翰需要X(1≤X≤100)元；每降低一个单位的高度，约翰需要Y(1≤y≤100)元．    问约翰最少可用多少钱达到目的．数据保证答案不超过2^31-1．\n",
    "inputFormat": "\\* Line 1: Three space-separated integers: N, X, and Y\n\n\\* Lines 2..N+1: Line i+1 contains the two space-separated integers: M\\_i and B\\_i\n",
    "outputFormat": "\\* Line 1: A single integer, the minimum cost needed to rebuild the castle\n",
    "samples": [
        [
            "3 6 5 \n3 1 \n1 2 \n1 2 \n",
            "11 \n"
        ]
    ],
    "hint": "FJ's castle starts with heights of 3, 1, and 1. He would like to change them so that their heights are 1, 2, and 2, in some order. It costs 6 to add a unit of height and 5 to remove a unit of height.\n\n\nFJ reduces the first merlon's height by 1, for a cost of 5 (yielding merlons of heights 2, 1, and 1). He then adds one unit of height to the second merlon for a cost of 6 (yielding merlons of heights 2, 2, and 1).\n"
}