{
    "description": "Bessie is playing a number game against Farmer John, and she wants you to help her achieve victory.\n\nGame i starts with an integer N\\_i (1 <= N\\_i <= 1,000,000). Bessie goes first, and then the two players alternate turns. On each turn, a player can subtract either the largest digit or the smallest non-zero digit from the current number to obtain a new number. For example, from 3014 we may subtract either 1 or 4 to obtain either 3013 or 3010, respectively. The game continues until the number becomes 0, at which point the last player to have taken a turn is the winner.\n\nBessie and FJ play G (1 <= G <= 100) games. Determine, for each game, whether Bessie or FJ will win, assuming that both play perfectly (that is, on each turn, if the current player has a move that will guarantee his or her win, he or she will take it).\n\nConsider a sample game where N\\_i = 13. Bessie goes first and takes 3, leaving 10. FJ is forced to take 1, leaving 9. Bessie takes the remainder and wins the game.\n\n贝茜和约翰在玩一个数字游戏．贝茜需要你帮助她．\n\n游戏一共进行了G(1≤G≤100)场．第i场游戏开始于一个正整数Ni(l≤Ni≤1,000,000)．游\n\n戏规则是这样的：双方轮流操作，将当前的数字减去一个数，这个数可以是当前数字的最大数码，也可以是最小的非0数码．比如当前的数是3014，操作者可以减去1变成3013，也可以减去4变成3010．若干次操作之后，这个数字会变成0．这时候不能再操作的一方为输家．    贝茜总是先开始操作．如果贝茜和约翰都足够聪明，执行最好的策略．请你计算最后的赢家．\n\n比如，一场游戏开始于13.贝茜将13减去3变成10．约翰只能将10减去1变成9．贝茜再将9减去9变成0．最后贝茜赢．\n",
    "inputFormat": "\\* Line 1: A single integer: G\n\n\\* Lines 2..G+1: Line i+1 contains the single integer: N\\_i\n",
    "outputFormat": "\\* Lines 1..G: Line i contains 'YES' if Bessie can win game i, and 'NO' otherwise.\n",
    "samples": [
        [
            "2 \n9 \n10 \n",
            "YES \nNO \n"
        ]
    ],
    "hint": "For the first game, Bessie simply takes the number 9 and wins. For the second game, Bessie must take 1 (since she cannot take 0), and then FJ can win by taking 9.\n"
}