{
    "description": "Bessie is playing hide and seek (a game in which a number of players hide and a single player (the seeker) attempts to find them after which various penalties and rewards are assessed; much fun usually ensues).\n\nShe is trying to figure out in which of N (2 <= N <= 20,000) barns conveniently numbered 1..N she should hide. She knows that FJ (the seeker) starts out in barn 1. All the barns are connected by M (1 <= M <= 50,000) bidirectional paths with endpoints A\\_i and B\\_i (1 <= A\\_i <= N; 1 <= B\\_i <= N; A\\_i != B\\_i); it is possible to reach any barn from any other through the paths.\n\nBessie decides that it will be safest to hide in the barn that has the greatest distance from barn 1 (the distance between two barns is the smallest number of paths that one must traverse to get from one to the other). Help Bessie figure out the best barn in which to hide.\n\n奶牛贝西和农夫约翰（FJ）玩捉迷藏，现在有N个谷仓，FJ开始在第一个谷仓，贝西为了不让FJ找到她，当然要藏在距离第一个谷仓最远的那个谷仓了。现在告诉你N个谷仓，和M个两两谷仓间的“无向边”。每两个仓谷间当然会有最短路径，现在要求距离第一个谷仓（FJ那里）最远的谷仓是哪个（所谓最远就是距离第一个谷仓最大的最短路径）？如有多个则输出编号最小的。以及求这最远距离是多少，和有几个这样的谷仓距离第一个谷仓那么远。\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and M\n\n\\* Lines 2..M+1: Line i+1 contains the endpoints for path i: A\\_i and B\\_i\n\n第一行：两个整数N,M；\n\n\n第2-M+1行：每行两个整数，表示端点A\\_i 和 B\\_i 间有一条无向边。\n",
    "outputFormat": "\\* Line 1: On a single line, print three space-separated integers: the index of the barn farthest from barn 1 (if there are multiple such barns, print the smallest such index), the smallest number of paths needed to reach this barn from barn 1, and the number of barns with this number of paths.\n\n仅一行，三个整数，两两中间空格隔开。表示：距离第一个谷仓最远的谷仓编号（如有多个则输出编号最小的。），以及最远的距离，和有几个谷仓距离第一个谷仓那么远。\n",
    "samples": [
        [
            "6 7 \n3 6 \n4 3 \n3 2 \n1 3 \n1 2 \n2 4 \n5 2 \n",
            "4 2 3 \n"
        ]
    ],
    "hint": "The farm layout is as follows:\n\n ![](https://cdn.luogu.com.cn/upload/pic/2815.png) \n\nBarns 4, 5, and 6 are all a distance of 2 from barn 1. We choose barn 4 because it has the smallest index.\n\n\n\n这里谷仓4，5，6距离1号谷仓都是2，但是4编号最小所以输出4.因此最远距离是2且有3个谷仓，依次输出：2和3。 \n\n感谢 wjcwinmt 的贡献翻译\n"
}