{
    "description": "The cows enjoy mooing at the barn because their moos echo back, although sometimes not completely. Bessie, ever the excellent\n\nsecretary, has been recording the exact wording of the moo as it goes out and returns. She is curious as to just how much overlap there is.\n\nGiven two lines of input (letters from the set a..z, total length in the range 1..80), each of which has the wording of a moo on it, determine the greatest number of characters of overlap between one string and the other. A string is an overlap between two other strings if it is a prefix of one string and a suffix of the other string.\n\nBy way of example, consider two moos:\n\nmoyooyoxyzooo\n\nyzoooqyasdfljkamo\n\nThe last part of the first string overlaps 'yzooo' with the first part of the second string. The last part of the second string\n\noverlaps 'mo' with the first part of the first string. The largest overlap is 'yzooo' whose length is 5.\n\nPOINTS: 50\n\n奶牛们非常享受在牛栏中哞叫，因为她们可以听到她们哞声的回音。虽然有时候并不能完全听到完整的回音。Bessie曾经是一个出色的秘书，所以她精确地纪录了所有的哞叫声及其回声。她很好奇到底两个声音的重复部份有多长。\n\n输入两个字符串（长度为1到80个字母），表示两个哞叫声。你要确定最长的重复部份的长度。两个字符串的重复部份指的是同时是一个字符串的前缀和另一个字符串的后缀的字符串。\n\n我们通过一个例子来理解题目。考虑下面的两个哞声：\n\nmoyooyoxyzooo\n\nyzoooqyasdfljkamo\n\n第一个串的最后的部份\"yzooo\"跟第二个串的第一部份重复。第二个串的最后的部份\"mo\"跟第一个串的第一部份重复。所以\"yzooo\"跟\"mo\"都是这2个串的重复部份。其中，\"yzooo\"比较长，所以最长的重复部份的长度就是5。\n",
    "inputFormat": "\\* Lines 1..2: Each line has the text of a moo or its echo\n",
    "outputFormat": "\\* Line 1: A single line with a single integer that is the length of the longest overlap between the front of one string and end of the other.\n",
    "samples": [
        [
            "abcxxxxabcxabcd \nabcdxabcxxxxabcx \n",
            "11 \n"
        ]
    ],
    "hint": "'abcxxxxabcx' is a prefix of the first string and a suffix of the second string.\n"
}