{
    "description": "Bessie looks out the barn door at the beautiful spring day and thinks to herself, 'I'd really like to enjoy my walk out to the pastures for the tender spring grass.' She knows that once she leaves the barn, she will traverse a path for a while, take one of two choices that lead to other paths, follow one of them, take one of two other choices, and continue on until the path leads to a verdant pasture.\n\nShe decides to make the set of path choices that enables her to walk over the greatest number of cow paths on her way to breakfast. Given the description of these paths, determine how many cow paths she traverses, presuming that she commences choosing various paths as soon as she leaves the barn.\n\nThe farm has P (1 <= P <= 1,000) pastures that are lead to by P-1 choice-nodes (range 1..P-1) connected by paths. From the barn (which is node 1), only one set of path traversals exists to reach any choice-node or pasture.\n\nConsider this set of paths (lines), pastures ('%'), and the highlighted ('#') route to a pasture on the right:\n\n```cpp\n\n                 %                             %\n                /                             /\n      2----%   7----8----%          2----%   7####8----%\n     / \\      /      \\             # #      #      #\n    1   5----6        9----%      1   5####6        9----%\n     \\   \\    \\        \\           \\   \\    \\        #\n      \\   %    %        %           \\   %    %        %\n       \\                             \\\n        3-----%                       3-----%\n         \\                             \\\n          4----%                        4----%\n           \\                             \\\n            %                             %\n```\nThe pasture reached from choice-node 9 is one of two that enable Bessie to traverse seven different cowpaths on the way to breakfast. These are the 'furthest' pastures from node 1, the barn.\n\nThree integers describe each node: Cn, D1, and D2. Cn is the\n\nnodenumber (1 <= Cn <= P-1); D1 and D2 are the destinations from that node (0 <= D1 <= P-1; 0 <= D2 <= P-1). If D1 is 0, the node leads to a pasture in that direction; D2 has the same property.\n\nPOINTS: 100\n\nBessie透过牛棚的大门向外望去。发现今天是一个美丽的春季早晨。她想，“我真的好想好想沐浴着春风，走在草地之中，感受嫩草温柔地抚摸四蹄地的感觉。”她知道一旦她离开了牛棚，她将沿着一条小径走一段路，然后就会出现一个三岔路口，她必须在两条小径中选择一条继续走下去。然后她又会遇到更多的三岔路口，进行更多的选择，知道她到达一个青翠的牧场为止。\n\n她决定作一个选择使得她在去吃早草的路途中可以走过最多的小径。给你这些小径的描述，求出Bessie最多可以走过多少条小径。假定Bessie一出牛棚就有2条路径，Bessie需要从中选择一条。\n\n农场中有P-1 (1 <= P <= 1,000) 个分岔节点（范围是1..P），引向P片草地，它们之间由小径连接。对任意一个节点来说，只有一条从牛棚（被标记为节点1）开始的路径可以到达。\n\n考虑下面的图。线段表示小径，\"%\"表示草地。右边的图中的\"#\"表示一条到达草地的高亮的路径。\n\n从分岔节点9到达的草地是两个可以让Bessie走过最多小径的草地之一。在去吃早草的路上Bessie将走过7条不同的小径。这些草地是离牛棚也就是节点1最“远”的。\n\n由3个整数来表示每一个节点：Cn, D1和D2，Cn是节点的编号(1 <= Cn <= P-1); D1和D2是由该节点引出的两条小径的终点(0 <= D1 <= P-1; 0 <= D2 <= P-1)。如果D1为0，表示这条小径引向的是一片牧草地；D2也一样。\n",
    "inputFormat": "\\* Line 1: A single integer: P\n\n\\* Lines 2..P: Line i+1 contains three space-separated integeres that describe a choice-node: Cn, D1, and D2\n",
    "outputFormat": "\\* Line 1: A single integer that is the largest number of paths Bessie can traverse on the way to the furthest pasture.\n",
    "samples": [
        [
            "10 \n7 8 0 \n5 0 6 \n9 0 0 \n6 0 7 \n3 4 0 \n2 5 0 \n8 0 9 \n4 0 0 \n1 2 3 \n",
            "7 \n"
        ]
    ],
    "hint": "This input describes the example farm layout in the task description.\n\n\n1-2-5-6-7-8-9-P is one of the longest routes.\n"
}