{
    "description": "Farmer John has always done his best to keep the pastures full of luscious, delicious healthy grass for the cows. He has lost the battle, though, as the evil milkweed has attained a foothold in the northwest part of his farm.\n\nThe pasture, as usual, is partitioned into a rectilinear grid of height Y (1 <= Y <= 100) and width X (1 <= X <= 100) with (1,1) being in the lower left corner (i.e., arranged as a normal X,Y coordinate grid). The milkweed has initially begun growing at square (Mx,My). Each week the milkweed propagates to all non-rocky squares that surround any square it already occupies, as many as eight more squares (both the rectilinear squares and the diagonals). After only one week in those squares, it is ready to move on to more squares.\n\nBessie wants to enjoy all the grass she can before the pastures are taken over by milkweed. She wonders how long it can last. If the milkweed is in square (Mx,My) at time zero, at what time does it complete its invasion of the pasture (which, for the given input data, will always happen)?\n\nThe pasture is described by a picture with '.'s for grass and '\\*'s for boulders, like this example with X=4 and Y=3:\n\n```\n....\n..*.\n.**.\n```\n\nIf the milkweed started in the lower left corner (row=1, column=1), then the map would progress like this:\n\n```\n    ....  ....  MMM.  MMMM  MMMM\n    ..*.  MM*.  MM*.  MM*M  MM*M\n    M**.  M**.  M**.  M**.  M**M\nweek  0    1    2    3    4\n```\n\nThe milkweed has taken over the entire field after 4 weeks.\n\nPOINTS: 125\n\nFarmer John一直努力让他的草地充满鲜美多汁的而又健康的牧草。可惜天不从人愿，他在植物大战人类中败下阵来。邪恶的乳草已经在他的农场的西北部份占领了一片立足之地。\n\n草地像往常一样，被分割成一个高度为Y(1 <= Y <= 100), 宽度为X(1 <= X <= 100)的直角网格。(1,1)是左下角的格（也就是说坐标排布跟一般的X,Y坐标相同）。乳草一开始占领了格(Mx,My)。每个星期，乳草传播到已被乳草占领的格子四面八方的每一个没有很多石头的格（包括垂直与水平相邻的和对角在线相邻的格）。1周之后，这些新占领的格又可以把乳草传播到更多的格里面了。\n\nBessie想要在草地被乳草完全占领之前尽可能的享用所有的牧草。她很好奇到底乳草要多久才能占领整个草地。如果乳草在0时刻处于格(Mx,My)，那么会在哪个时刻它们可以完全占领入侵整片草地呢？对给定的数据总是会发生。\n",
    "inputFormat": "\\* Line 1: Four space-separated integers: X, Y, Mx, and My\n\n\\* Lines 2..Y+1: Line y+1 describes row (Y+2-y) of the field with X characters ('.' for grass and '\\*' for a boulder)\n",
    "outputFormat": "\\* Line 1: A single integer that is the week number when the milkweed takes over the last remaining non-boulder square of the pasture.\n",
    "samples": [
        [
            "4 3 1 1 \n.... \n..*. \n.**. \n",
            "4 \n"
        ]
    ],
    "hint": ""
}