{
    "description": "Bessie has entered a bobsled competition because she hopes her hefty weight will give her an advantage over the L meter course (2 <= L <= 1,000,000,000).\n\nBessie will push off the starting line at 1 meter per second, but her speed can change while she rides along the course. Near the middle of every meter Bessie travels, she can change her speed either by using gravity to accelerate by one meter per second or by braking to stay at the same speed or decrease her speed by one meter per second.\n\nNaturally, Bessie must negotiate N (1 <= N <= 100,000) turns on the way down the hill. Turn i is located T\\_i meters from the course start (1 <= T\\_i <= L-1), and she must be enter the corner meter at a speed of at most S\\_i meters per second (1 <= S\\_i <= 1,000,000,000). Bessie can cross the finish line at any speed she likes.\n\nHelp Bessie learn the fastest speed she can attain without exceeding the speed limits on the turns.\n\nConsider this course with the meter markers as integers and the turn speed limits in brackets (e.g., '[3]'):\n\n```cpp\n\n|   1   2   3   4   5   6   7[3]\n|---+---+---+---+---+---+---+\n|                            \\\nStart                         + 8    \n                               \\\n                                + 9    \n                                 \\\n                                  + 10       +++ 14 (finish)\n                                   \\         /\n                              11[1] +---+---+\n                                        12  13[8]\n```\nBelow is a chart of Bessie's speeds at the beginning of each meter length of the course:\n\n````\nMax:                              3               1       8 \nMtrs: 0   1   2   3   4   5   6   7   8   9  10  11  12  13  14 Spd:  1   2   3   4   5   5   4   3   4   3   2   1   2   3   4 \n```\nHer maximum speed was 5 near the beginning of meter 4. \n\n贝茜从山顶滑雪到山脚，山顶到山脚距离是L(2<L<10^9)米.贝茜在起点的速度是1米每 秒，但是他的速度是可以改变的，在每一米的速度可以是前一米的速度加1、减1，或者等于前一米 的速度.在滑行的过程中，贝茜会遇到N<=100000)个转弯处，第i个转弯处位于距离出发 Ti米处，为了安全，贝茜到达第i个转弯处的速度不能超过Si(1<Si<10^9)米 每秒.当然贝茜到达终点时的速度没有最大限制.请你计算贝茜在滑雪过程中最大的速度可以是多 少？\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: L and N\n\n\\* Lines 2..N+1: Line i+1 describes turn i with two space-separated integers: T\\_i and S\\_i\n",
    "outputFormat": "\\* Line 1: A single integer, representing the maximum speed which Bessie can attain between the start and the finish line, inclusive.\n",
    "samples": [
        [
            "14 3 \n7 3 \n11 1 \n13 8 \n",
            "5 \n"
        ]
    ],
    "hint": ""
}