{
    "description": "Bessie has received N (1 <= N <= 50,000) chocolates from the bulls, but doesn't want to eat them too quickly, so she wants to plan out her chocolate eating schedule for the next D (1 <= D <= 50,000) days in order to maximize her minimum happiness level over the set of those days.\n\nBessie's happiness level is an integer that starts at 0 and halves (rounding down if necessary) over night as she sleeps. However, when she eats chocolate i, her happiness level increases by integer H\\_i (1 <= H\\_i <= 1,000,000). If she eats chocolates on a day, her happiness for that day is considered the happiness level after she eats the chocolates. Bessie insists that she eat the chocolates in the order that she received them.\n\nIf more than one optimal solution exists, print any one of them.\n\nConsider a sequence of 5 chocolates to be eaten over a period of 5 days; they respectively bring happiness (10, 40, 13, 22, 7).\n\nIf Bessie eats the first chocolate (10 happiness) on the first day and then waits to eat the others, her happiness level is 10 after the first day.\n\nHere is the complete schedule which turns out to maximize her minimum happiness:\n\nDay  Wakeup happiness   Happiness from eating   Bedtime happiness 1            0                10+40                  50\n\n2           25                 ---                   25\n\n3           12                  13                   25\n\n4           12                  22                   34\n\n5           17                   7                   24\n\nThe minimum bedtime happiness is 24, which turns out to be the best Bessie can do.\n\nBessie 拿到了 $N$（$1 \\leq N \\leq 5\\times 10 ^ 4$）块巧克力。她决定想个办法吃掉这些巧克力，使得它在吃巧克力的这段时间里，最不开心的一天尽可能的开心。并且一共吃 $D$（$1 \\leq D \\leq 5\\times 10 ^ 4$）天。\n\n每块巧克力有一个开心值 $H_i$（$1 \\leq H_i \\leq 10 ^ 6$），当某天你吃下那块巧克力时，你将获得那块巧克力的开心值。每一天的开心值是所有当天吃掉的巧克力的总开心值之和。每天晚上 Bessie 睡觉之后，它的开心值会减半。也就是说，比如昨天 Bessie 的开心值为 $50$，那么今天早上一醒来就会有 $25$ 点的开心值，舍去小数点后数字。另外，Bessie 还有一个怪癖，她喜欢按照巧克力本来的排列顺序吃。\n\nBessie 第一天的开心值为 $0$，求一个每天吃巧克力的方案，使得 Bessie 最不开心的一天尽可能的开心。\n",
    "inputFormat": "\\* Line 1: Two space separated integers: N and D\n\n\\* Lines 2..N+1: Line i+1 contains a single integer: H\\_i\n\n第一行：两个整数 $N$ 和 $D$，中间用空格分隔。\n\n第 $2$ 行至第 $N + 1$ 行：每行一个整数，第 $i + 1$ 行表示 $H_i$ 的值。",
    "outputFormat": "\\* Line 1: A single integer, the highest Bessie's minimum happiness can be over the next D days\n\n\\* Lines 2..N+1: Line i+1 contains an integer that is the day on which Bessie eats chocolate i\n\n\n第一行：一个整数，表示 Bessie 在 $D$ 天中最不开心的一天最大可能的开心值。\n\n第 $2$ 至第 $n + 1$ 行，每行一个整数，第 $i + 1$ 行表示 Bessie 吃第 $i$ 块巧克力的日期。",
    "samples": [
        [
            "5 5 \n10 \n40 \n13 \n22 \n7 \n",
            "24 \n1 \n1 \n3 \n4 \n5 \n"
        ]
    ],
    "hint": ""
}