{
    "description": "Farmer John wants to take a picture of his entire herd of N (1 <= N <= 100,000) cows conveniently numbered 1..N so he can show off to his friends.\n\nOn picture day, the cows run to form a single line in some arbitrary order with position i containing cow c\\_i (1 <= c\\_i <= N). Farmer John has his own ideas about how the cows should line up.\n\nFJ thinks cow i may stand only to the left of cow i+1 (for all i, 1 <= i <= N-1) and that cow N may only stand to the left of Cow 1. Of course, no cow will stand to the left of the first (leftmost) cow in the line.\n\nThe cows are hungry for the promised post-photo dinner, so Farmer John wants to take the picture as quickly as possible. Cows are not great at following directions, so he will only choose a pair of adjacent cows and have them switch places once per minute. How quickly is Farmer John able to get them into some acceptable order?\n\nConsider a set of 5 cows whose initial lineup looks like this:\n\nLeft           Right\n\n3  5  4  2  1\n\nHe can first swap the second pair of cows:\n\n3  4  5  2 1\n\nand then swap the rightmost pair: \n\n3  4  5  1  2\n\nto yield an acceptable lineup that required but two minutes of cow swapping.\n\nFarmer John希望给他的N(1<=N<=100,000)只奶牛拍照片,这样他就可以向他的朋友炫耀他的奶牛.这N只奶牛被标号为1..N. 在照相的那一天,奶牛们排成了一排.其中第i个位置上是标号为c\\_i(1<=c\\_i<=N)的奶牛.对于奶牛的站位,Farmer John有他自己的想法.\n\nFJ是这么想的,标号为i(1<=i<=n-1)的奶牛只能站在标号为i+1的奶牛的左边,而标号为N的奶牛只能站在标号为1的奶牛的左边.当然,没有牛可以站在队列中最左边的奶牛的左边了.也就是说,最左边的奶牛编号是随意的. 这些奶牛都非常的饿,急切的希望吃到FJ承诺的在拍照后的大餐,所以FJ想尽快的拍照.奶牛们的方向感非常的不好,所以FJ每一分钟只可以选择相邻的两只奶牛然后让他们交换位置.\n\nFJ最小需要多少时间就能使奶牛站成一个可以接受的序列?\n",
    "inputFormat": "\\* Line 1: A single integer: N\n\n\\* Lines 2..N+1: Line i+1 contains the number of the i-th cow in line: c\\_i\n",
    "outputFormat": "\\* Line 1: The minimum amount of time, in minutes, that it takes Farmer John to get the cows into some appropriate order.\n",
    "samples": [
        [
            "5 \n3 \n5 \n4 \n2 \n1 \n",
            "2 \n"
        ]
    ],
    "hint": ""
}