{
    "description": "Bessie has two crisp red apples to deliver to two of her friends in the herd. Of course, she travels the C (1 <= C <= 200,000)\n\ncowpaths which are arranged as the usual graph which connects P (1 <= P <= 100,000) pastures conveniently numbered from 1..P: no cowpath leads from a pasture to itself, cowpaths are bidirectional, each cowpath has an associated distance, and, best of all, it is always possible to get from any pasture to any other pasture. Each cowpath connects two differing pastures P1\\_i (1 <= P1\\_i <= P) and P2\\_i (1 <= P2\\_i <= P) with a distance between them of D\\_i. The sum of all the distances D\\_i does not exceed 2,000,000,000.\n\nWhat is the minimum total distance Bessie must travel to deliver both apples by starting at pasture PB (1 <= PB <= P) and visiting pastures PA1 (1 <= PA1 <= P) and PA2 (1 <= PA2 <= P) in any order. All three of these pastures are distinct, of course.\n\nConsider this map of bracketed pasture numbers and cowpaths with distances:\n\n```cpp\n               3        2       2\n           [1]-----[2]------[3]-----[4]\n             \\     / \\              /\n             7\\   /4  \\3           /2\n               \\ /     \\          /\n               [5]-----[6]------[7]\n                    1       2\n```\nIf Bessie starts at pasture [5] and delivers apples to pastures [1] and [4], her best path is:\n\n5 -> 6-> 7 -> 4\\* -> 3 -> 2 -> 1\\*\n\nwith a total distance of 12.",
    "inputFormat": "\\* Line 1: Line 1 contains five space-separated integers: C, P, PB, PA1, and PA2\n\n\\* Lines 2..C+1: Line i+1 describes cowpath i by naming two pastures it connects and the distance between them: P1\\_i, P2\\_i, D\\_i\n",
    "outputFormat": "\\* Line 1: The shortest distance Bessie must travel to deliver both apples\n",
    "samples": [
        [
            "9 7 5 1 4 \n5 1 7 \n6 7 2 \n4 7 2 \n5 6 1 \n5 2 4 \n4 3 2 \n1 2 3 \n3 2 2 \n2 6 3 \n",
            "12 \n"
        ]
    ],
    "hint": "",
    "translation": "贝西有两个又香又脆的红苹果要送给她的两个朋友。当然她可以走的 $C(1 \\le C \\le 200000)$ 条“牛路”都被包含在一种常用的图中。这张图同时包含了$P(1 \\le P \\le 100000)$ 个牧场，分别被标为 $1 \\cdots P$。没有“牛路”会从一个牧场又走回它自己。“牛路”是双向的，每条牛路都会被标上一个距离。最重要的是，每个牧场都可以通向另一个牧场。每条牛路都连接着两个不同的牧场 $P1\\_i$和$P2\\_i$（$1 \\le P1\\_i,P2\\_i \\le P$)，距离为$D\\_i$。所有“牛路”的距离之和不大于 $2000000000$。\n\n现在，贝西要从牧场 $PB$ 开始给 $PA\\_1$ 和 $PA\\_2$ 牧场各送一个苹果（$PA\\_1$ 和 $PA\\_2$ 顺序可以调换），那么最短的距离是多少呢？当然，$PB$、$PA\\_1$ 和 $PA\\_2$ 各不相同。\n"
}