{
    "description": "Bessie is studying her favorite subject, Macroeconomics, in cowllege. For her final project, she will be presenting research on exchange rates between countries around the world.\n\n\nIn order to make her presentation more lively, she would like to show the relative prices of Big Macs around the world, despite their rather unsavory contents. To illustrate, suppose that Bessie would like to find smallest value of a Big Mac in a country given its value in some initial country and exchange rates from which other country's values can be calculated (as illustrated below):\n\n\n\n\n```cpp\n* A Big Mac is worth 60 dollars in the United States \n* The exchange rate from US dollars to Canadian dollars is 0.2 Canadian dollars per US dollar \n* The exchange rate from US dollars to British Pounds is 5.00 British Pounds per US Dollar \n* The exchange rate from British Pounds to Canadian dollars is 0.5 Canadian dollars per British Pound \n* The exchange rate between Canadian dollars to US dollars is 5.00 US dollars per Canadian dollar and Bessie would like to find the smallest possible value of a Big Mac in Canada that can be obtained by exchanging currencies. There are two ways: \n* Going from US dollars directly to Canada dollars would yield a burger worth 60.00 US dollars * 0.2 Canadian dollars / US dollar = 12.00 Canadian dollars \n* Going from US dollars to British Pounds to Canadian dollars would yield a burger worth 60.00 US$ * 5.00 GBP / 1 US$ * 0.5 C$ / 1 GBP = 150.00 C$ (Canadian dollars). \nBessie would choose the former option, since she would much rather pay 12.00 Canadian dollars instead of 150.00 Canadian dollars for a Big Mac in Canada. \nBessie has N (1 <= N <= 2,000) countries conveniently labeled 1 to N that she would like to consider along with a list of M (1 <= M <= 25,000) exchange rates e_ij (0.1 < e_ij <= 10), each between countries i and j (1 <= i <= N; 1 <= j <= N). \nGiven the value V (1 <= V <= 1,000,000,000,000), which is not \nnecessarily an integer, of the Big Mac in her starting country A (1 <= A <= N), help her find the smallest possible value of a Big Mac in country B (1 <= B <= N; B != A) after a series of currency conversions. If there is no minimum, output 0. \n```\nIt is guaranteed that the answer is, if not 0, between 1 and 10^15.\nIt is also guaranteed that, for any country's currency, it is\n\npossible to get to any other country's currency.\n\n\n\n为了让她的演讲更加生动，她会展示一个叫做“BM”的商品在全世界的相对价格。举个例子，Bessie会通过其他国家的汇率去找到一件BM在一个国家的最小价值（如下所示）\n\n\n一件BM在美国值60美元；\n\n\n美元与加拿大元的汇率为一美元换0.2加拿大元（1：0.2）\n\n\n美元与英镑的汇率为一美元换五英镑（1：5）\n\n\n英镑与加拿大元的汇率为一英镑换0.5加拿大元（1：0.5）\n\n\n加拿大元与美元的汇率是五美元换一加拿大元（5：1[通过上面的可以换算得出]），Bessis有两种方法通过货币兑换在加拿大这个国家找到一件BM的最低价值：\n\n\n一：拿着美元直接去加拿大，通过汇率得出一件BM只要十二加拿大元\n\n\n二：拿着美元去英国，兑换为英镑后再去加拿大，得出一件BM要一百五十加拿大元\n\n\n（由于长度，剩下…\n",
    "inputFormat": "（续）\n\nBessie会选择前一种方案因为她更乐意为在加拿大买一件BM支付十二加元而不是一百五十加元。\n\n\nBessie有N(1<=N<=2000)个国家的信息和M种汇率(1<=M<=25000)，在i，j国间的汇率表示为e\\_ij(0.1<=e\\_ij<=10)。\n\n\n给你一个值V(1<=V<=1000000000000),但V不一定是一个整数。V是BM在Bessie起始国家A的价格，帮助她寻找到在B国BM最低的价格，如果不存在，则输出0。\n\n\n数据保证答案小于十的十五次方，也保证所有国家都可以通过汇率将钱币转为别的国家的。\n\n\\* Line 1: Five space-separated numbers: N, M, V, A, B\n\n\\* Lines 2..M+1: Three space-separated numbers: i, j, e\\_ij\n\n第一行：五个数：N,M,V,A,B 分别一个空格隔开\n\n\n第2到M+1行：三个数i,j,e\\_ij 分别一个空格隔开\n",
    "outputFormat": "\\* Line 1: A single positive number, the price of the Big Mac, with absolute or relative error at most 10^-6. If there is no minimum, output 0.\n\n一行：BM在B国的最低价格，精确到10^-6。如果没有最小值，输出0\n",
    "samples": [
        [
            "3 4 60 1 2 \n1 2 0.2 \n1 3 5 \n3 2 0.5 \n2 1 5 \n",
            "12.00 \n"
        ]
    ],
    "hint": "**注意  这里的汇率是单向的**\n\n感谢@JJYZ\\_cbh 的耐心翻译\n"
}