{
    "description": "FJ has had a terrible fight with his neighbor and wants to send him a nasty letter, but wants to remain anonymous. As so many before him have done, he plans to cut out printed letters and paste them onto a sheet of paper. He has an infinite number of the most recent issue of the Moo York Times that has N (1 <= N <= 50,000) uppercase letters laid out in a long string (though read in as a series of shorter strings). Likewise, he has a message he'd like to compose that is a single long string of letters but that is read in as a set of shorter strings.\n\nBeing lazy, he wants to make the smallest possible number of cuts. FJ has a really great set of scissors that enables him to remove any single-line snippet from the Moo York Times with one cut. He notices that he can cut entire words or phrases with a single cut, thus reducing his total number of cuts.\n\nWhat is the minimum amount of cuts he has to make to construct his letter of M (1 <= M <= 50,000) letters?\n\nIt is guaranteed that it is possible for FJ to complete his task.\n\nConsider a 38 letter Moo York Times:\n\n```cpp\nTHEQUICKBROWNFOXDO \nGJUMPSOVERTHELAZYDOG \nfrom which FJ wants to construct a 9 letter message: \nFOXDOG \nDOG \n```\nThese input lines represent a pair of strings:\nTHEQUICKBROWNFOXDOGJUMPSOVERTHELAZYDOG \n\nFOXDOGDOG \n\nSince 'FOXDOG' exists in the newspaper, FJ can cut this piece out and then get the last 'DOG' by cutting out either instance of the word 'DOG'. \n\nThus, he requires but two cuts.\n\nFJ 刚刚和邻居发生了一场可怕的争吵，他咽不下这口气，于是决定佚名发给他的邻居一封脏话连篇的信。他有无限张完全相同的已经打印好的纸张，都包含 $N$ 个字母。他有一把举世无双的剪刀，可以从某张纸中通过一刀剪出连续的一段（也可以通过一刀获得整个字符串）。他想知道获得这封 $M$ 个字母的长信最少需要剪多少刀。保证这总是可能的。",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and M\n\n\\* Lines 2..?: N letters laid out on several input lines; this is the text of the one copy of the Moo York Times. Each line will have no more than 80 characters.\n\n\\* Lines ?..?: M letters that are the text of FJ's letter. Each line will have no more than 80 characters.\n",
    "outputFormat": "\\* Line 1: The minimum number of cuts FJ has to make to create his message\n",
    "samples": [
        [
            "38 9 \nTHEQUICKBROWNFOXDO \nGJUMPSOVERTHELAZYDOG \nFOXDOG \nDOG \n",
            "2 \n"
        ]
    ],
    "hint": ""
}