{
    "description": "Farmer John continues his never-ending quest to keep the cows fit by having them exercise on various cow paths that run through the pastures. These cow paths can be represented as a set of vertices connected with bidirectional edges so that each pair of vertices has exactly one simple path between them. In the abstract, their layout bears a remarkable resemblance to a tree. Surprisingly, each edge (as it winds its way through the pastures) has the same length.\n\nFor any given set of cow paths, the canny cows calculate the longest possible distance between any pair of vertices on the set of cowpaths and call it the pathlength. If they think this pathlength is too large, they simply refuse to exercise at all.\n\nFarmer John has mapped the paths and found V (2 <= V <= 100,000) vertices, conveniently numbered from 1..V. In order to make shorter cowpaths, he can block the path between any two vertices, thus creating more sets of cow paths while reducing the pathlength of both cowpath sets.\n\nStarting from a single completely connected set of paths (which have the properties of a tree), FJ can block S (1 <= S <= V-1) paths, creating S+1 sets of paths. Your goal is to compute the best paths he can create so that the largest pathlength of all those sets is minimized.\n\nFarmer John has a list of all V-1 edges in his tree, each described by the two vertices A\\_i (1 <= A\\_i <= V) and B\\_i (1 <= B\\_i <= V; A\\_i != B\\_i) that it connects.\n\nConsider this rather linear cowpath set (a tree with 7 vertices):\n\n1---2---3---4---5---6---7\n\nIf FJ can block two paths, he might choose them to make a map like this:\n\n1---2 | 3---4 | 5---6---7 \nwhere the longest pathlength is 2, which would be the answer in this case. He can do no better than this.\n\nTIME LIMIT: 2 seconds\n\nMEMORY LIMIT: 32 MB\n\n \nFarmer John为了保持奶牛们的健康，让可怜的奶牛们不停在牧场之间 的小路上奔跑。这些奶牛的路径集合可以被表示成一个点集和一些连接 两个顶点的双向路，使得每对点之间恰好有一条简单路径。简单的说来， 这些点的布局就是一棵树，且每条边等长，都为1。 对于给定的一个奶牛路径集合，精明的奶牛们会计算出任意点对路径的最大值， 我们称之为这个路径集合的直径。如果直径太大，奶牛们就会拒绝锻炼。 Farmer John把每个点标记为1..V (2 <= V <= 100,000)。为了获得更加短 的直径，他可以选择封锁一些已经存在的道路，这样就可以得到更多的路径集合， 从而减小一些路径集合的直径。 我们从一棵树开始，FJ可以选择封锁S (1 <= S <= V-1)条双向路，从而获得 S+1个路径集合。你要做的是计算出最佳的封锁方案，使得他得到的所有路径集合 直径的最大值尽可能小。 Farmer John告诉你所有V-1条双向道路，每条表述为：顶点A\\_i (1 <= A\\_i <= V) 和 B\\_i (1 <= B\\_i <= V; A\\_i!= B\\_i)连接。\n",
    "inputFormat": "\\* Line 1: Two space separated integers: V and S\n\n\\* Lines 2..V: Two space separated integers: A\\_i and B\\_i\n",
    "outputFormat": "\\* Line 1: A single integer that is the best maximum pathlength FJ can achieve with S blocks\n",
    "samples": [
        [
            "7 2 \n6 7 \n3 4 \n6 5 \n1 2 \n3 2 \n4 5 \n",
            "2 \n"
        ]
    ],
    "hint": ""
}