{
    "description": "The N (1 <= N <= 20) cows conveniently numbered 1...N are playing yet another one of their crazy games with Farmer John. The cows will arrange themselves in a line and ask Farmer John what their line number is. In return, Farmer John can give them a line number and the cows must rearrange themselves into that line.\n\nA line number is assigned by numbering all the permutations of the line in lexicographic order.\n\nConsider this example:\n\nFarmer John has 5 cows and gives them the line number of 3.\n\nThe permutations of the line in ascending lexicographic order: 1st: 1 2 3 4 5\n\n2nd: 1 2 3 5 4\n\n3rd: 1 2 4 3 5\n\nTherefore, the cows will line themselves in the cow line 1 2 4 3 5.\n\nThe cows, in return, line themselves in the configuration '1 2 5 3 4' and ask Farmer John what their line number is.\n\nContinuing with the list:\n\n4th : 1 2 4 5 3\n\n5th : 1 2 5 3 4\n\nFarmer John can see the answer here is 5\n\nFarmer John and the cows would like your help to play their game. They have K (1 <= K <= 10,000) queries that they need help with. Query i has two parts: C\\_i will be the command, which is either 'P' or 'Q'.\n\nIf C\\_i is 'P', then the second part of the query will be one integer A\\_i (1 <= A\\_i <= N!), which is a line number. This is Farmer John challenging the cows to line up in the correct cow line.\n\nIf C\\_i is 'Q', then the second part of the query will be N distinct integers B\\_ij (1 <= B\\_ij <= N). This will denote a cow line. These are the cows challenging Farmer John to find their line number.\n\nN(1<=N<=20)头牛，编号为1...N，正在与FJ玩一个疯狂的游戏。奶牛会排成一行（牛线），问FJ此时的行号是多少。之后，FJ会给牛一个行号，牛必须按照新行号排列成线。\n\n\n行号是通过以字典序对行的所有排列进行编号来分配的。比如说：FJ有5头牛，让他们排为行号3，排列顺序为：\n\n\n1：1 2 3 4 5\n\n\n2：1 2 3 5 4\n\n\n3：1 2 4 3 5\n\n\n因此，牛将在牛线1 2 4 3 5中。\n\n\n之后，奶牛排列为“1 2 5 3 4”，并向FJ问他们的行号。继续列表：\n\n\n4：1 2 4 5 3\n\n\n5：1 2 5 3 4\n\n\nFJ可以看到这里的答案是5。\n\n\nFJ和奶牛希望你的帮助玩他们的游戏。他们需要K(1<=K<=10000)组查询，查询有两个部分：C\\_i将是“P”或“Q”的命令。\n\n\n如果C\\_i是'P'，则查询的第二部分将是一个整数A\\_i（1 <= A\\_i <= N！），它是行号。此时，你需要回答正确的牛线。\n\n\n如果C\\_i是“Q”，则查询的第二部分将是N个不同的整数B\\_ij（1 <= B\\_ij <= N）。这将表示一条牛线，此时你需要输出正确的行号。\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and K\n\n\\* Lines 2..2\\*K+1: Line 2\\*i and 2\\*i+1 will contain a single query.\n\nLine 2\\*i will contain just one character: 'Q' if the cows are lining up and asking Farmer John for their line number or 'P' if Farmer John gives the cows a line number.\n\nIf the line 2\\*i is 'Q', then line 2\\*i+1 will contain N space-separated integers B\\_ij which represent the cow line. If the line 2\\*i is 'P', then line 2\\*i+1 will contain a single integer A\\_i which is the line number to solve for.\n",
    "outputFormat": "\\* Lines 1..K: Line i will contain the answer to query i.\n\nIf line 2\\*i of the input was 'Q', then this line will contain a single integer, which is the line number of the cow line in line 2\\*i+1.\n\nIf line 2\\*i of the input was 'P', then this line will contain N space separated integers giving the cow line of the number in line 2\\*i+1.\n",
    "samples": [
        [
            "5 2 \nP \n3 \nQ \n1 2 5 3 4 \n",
            "1 2 4 3 5 \n5 \n"
        ]
    ],
    "hint": "感谢@prcups 提供翻译\n"
}