{
    "description": "Bessie and Jonell are great friends. Since Farmer John scrambles where the cows graze every day, they are sometimes quite far from each other and can't talk.\n\nThe pastures and paths on FJ's farm form a 'tree' structure.  Each pasture has exactly one distinct path to any other pasture, and each pasture (except pasture #1, the 'root') also has a single parent node.\n\nBessie and Jonell have decided that they will always meet at the closest pasture that that is both an ancestor of Jonell's pasture and of Bessie's pasture.\n\nFJ created a map of his N (1 <= N <= 1,000) pastures (conveniently numbered 1..N) that tells the parent P\\_i (1 <= P\\_i <= N) of each pasture except pasture 1, which has no parent.\n\nFJ has released his daily grazing schedule for the next M (1 <= M <= 1,000) days, so Bessie and Jonell are deciding where they should meet each day for gossip. On day k, Bessie is in pasture B\\_k (1 <= B\\_k <= N) and Jonell is in pasture J\\_k (1 <= J\\_k <= N).\n\nGiven a map and schedule, help Bessie and Jonell find their meeting places.\n\n```cpp\nConsider, for example, the following farm layout:\n\n                            Pasture      Parent Pasture\n             [1]           ---------    ----------------\n            / | \\              1              ---\n           /  |  \\             2               1 \n         [2] [3] [6]           3               1\n         /        | \\          4               2\n        /         |  \\         5               8\n      [4]        [8]  [9]      6               1\n                /   \\          7               8\n               /     \\         8               6\n             [5]     [7]       9               6\n\nHere are the meeting places that Bessie and Jonell would choose\ngiven a six day schedule of their initial grazing locations:\n\n              Bessie      Jonell       Meeting Place\n             --------    --------     ---------------\n                 2           7               1\n                 4           2               2\n                 1           1               1\n                 4           1               1\n                 7           5               8\n                 9           5               6\n```\n\n\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and M\n\n\\* Lines 2..N: Line i contains a single integer that describes the parent of pasture i:  P\\_i\n\n\\* Lines N+1..N+M: Line k+N describes Bessie and Jonell's respective pastures with two space-separated integers: B\\_k and J\\_k\n\n\n",
    "outputFormat": "\\* Lines 1..M: Line j contains the meeting place Bessie and Jonell would use for line j+N of the input\n",
    "samples": [
        [
            "9 6 \n1 \n1 \n2 \n8 \n1 \n8 \n6 \n6 \n2 7 \n4 2 \n3 3 \n4 1 \n7 5 \n9 5 \n",
            "1 \n2 \n3 \n1 \n8 \n6 \n"
        ]
    ],
    "hint": "",
    "translation": "农场是由N（1≤N≤1000）个节点组成的一棵树，1是树的根。有两头奶牛分别在两个节点，他们有M（1≤M≤1000）天要见面，见面地点在她们所在两个节点的路径上离根节点最近的节点。求出每天她们见面的节点编号。\n输入：第一行两个整数N, M，接下来N-1行（这里的 i 是从 2 ~ n），第i行表示第i个节点的父亲编号，接下来M行每行两个整数表示当天两头奶牛所在的节点编号。\n输出：输出M行，回答每个询问。\n\n感谢@x咫尺天涯x 提供的翻译和ROY1994 提供的建议"
}