{
    "description": "One day, Bessie decides to challenge Farmer John to a game of 'Cow Checkers'. The game is played on an M\\*N (1 <= M <= 1,000,000; 1 <= N <= 1,000,000) checkerboard that initially contains a single checker piece on the checkboard square coordinates (X, Y) (0 <= X < M; 0 <= Y < N). The bottom leftmost square of the checkerboard has\n\ncoordinates (0, 0), and the top rightmost square has coordinates (M-1, N-1). Bessie always moves first, and then the two players alternate turns.  Each turn comprises one of three types of moves:\n\n1) Move the checker piece to any square on the same row to the left of its current position.\n\n2) Move the checker piece to any square on the same column below its current position.\n\n3) Move the checker piece to any spot k squares below and k squares to the left of the current square (where k is any positive integer such that this new spot is still on the checkerboard).\n\nThe first player unable to make a move (i.e., because the checker is at (0, 0)) loses. Given that Bessie always goes first, determine who will win the game if both play optimally.\n\nPlay and report the winner for T games (1 <= T <= 1,000) reading in a new X,Y starting value for each new game.\n\n有一天，Bessie准备玩一个叫做奶牛跳棋的游戏，来挑战Farmer John。\n\n\n这个游戏的棋盘大小为 M\\*N (1 <= M <= 1,000,000; 1 <= N <= 1,000,000) 。最初棋盘上只有一个棋子在（x,y），棋盘的左下角坐标是（0,0），右上角的坐标是（M-1，N-1）。\n\n\n每次游戏Bessie都是第一个开始，之后两个人轮流。\n\n\n每次下棋的时候都有三种走法：\n\n\n1.向左走任意步\n\n\n2.向下走任意步\n\n\n3.向左走k步然后向下走k步（k可随便取值，只要不走出棋盘）\n\n\n首先走到（0,0）的人为胜利者。\n\n\n游戏共有T次，每次都会给出一个新的坐标（x,y），请输出每一轮赢家的名字。\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: M and N\n\n\\* Line 2: A single integer: T\n\n\\* Lines 3..T+2: Two space-separated integers: X and Y\n\n第一行：M N\n\n\n第二行：T\n\n\n第三行到第T+2行:这一轮的X Y\n",
    "outputFormat": "\\* Lines 1..T: Should contain either 'Farmer John' or 'Bessie' depending on who wins each  game.\n\n共T行，每一行输出那一轮的赢家\n",
    "samples": [
        [
            "3 3 \n1 \n1 1 \n",
            "Bessie \n"
        ]
    ],
    "hint": "Farmer John and Bessie are playing one game on a 3\\*3 checkerboard with the checker piece initially at (1, 1) (i.e. at the center of the board).\n\n\nBessie initially can only move the checker piece to either (1, 0) or (0, 1), or (0, 0). Bessie can immediately win by moving the piece to (0, 0).\n\n\n起点在（1,1），一开始有三种选择（1,0）,（0,1），（0,0）只要Bessie在开始时将棋子移到（1,0）或（0,1），就必胜无疑。\n\n\n感谢@ 2014nhc  提供的翻译\n"
}