{
    "description": "Farmer John has N barren pastures (2 <= N <= 100,000) connected by N-1 bidirectional roads, such that there is exactly one path between any two pastures.  Bessie, a cow who loves her grazing time, often complains about how there is no grass on the roads between pastures.  Farmer John loves Bessie very much, and today he is finally going to plant grass on the roads.  He will do so using a procedure consisting of M steps (1 <= M <= 100,000).\n\nAt each step one of two things will happen:\n\n- FJ will choose two pastures, and plant a patch of grass along each road in between the two pastures, or,\n\n- Bessie will ask about how many patches of grass on a particular road, and Farmer John must answer her question.\n\nFarmer John is a very poor counter -- help him answer Bessie's questions!\n",
    "inputFormat": "\\* Line 1: Two space-separated integers N and M\n\n\\* Lines 2..N: Two space-separated integers describing the endpoints of a road.\n\n\\* Lines N+1..N+M: Line i+1 describes step i. The first character of the line is either P or Q, which describes whether or not FJ is planting grass or simply querying. This is followed by two space-separated integers A\\_i and B\\_i (1 <= A\\_i, B\\_i <= N) which describe FJ's action or query.\n",
    "outputFormat": "\\* Lines 1..???: Each line has the answer to a query, appearing in the same order as the queries appear in the input.\n",
    "samples": [
        [
            "4 6 \n1 4 \n2 4 \n3 4 \nP 2 3 \nP 1 3 \nQ 3 4 \nP 1 4 \nQ 2 4 \nQ 1 4 \n",
            "2 \n1 \n2 \n\n"
        ]
    ],
    "hint": "",
    "translation": "给出一棵有 $n$ 个节点的树，有 $m$ 个如下所示的操作：\n\n- 将两个节点之间的 **路径上的边** 的权值均加一。\n\n- 查询两个节点之间的 **那一条边** 的权值，保证两个节点直接相连。\n\n初始边权均为 0。\n\n**【输入格式】**\n\n第一行两个整数 $n,m$，含义如上。\n\n接下来 $n-1$ 行，每行两个整数 $u,v$，表示 $u,v$ 之间有一条边。\n\n接下来 $m$ 行，每行格式为 `op u v`，$op=\\texttt{P}$ 代表第一个操作，$op=\\texttt{Q}$ 代表第二个操作。\n\n**【输出格式】**\n\n若干行。对于每个查询操作，输出一行整数，代表查询的答案。\n\n**【数据范围】**\n\n对于 $100\\%$ 的数据，$2\\le n\\le 10^5$，$1\\le m\\le 10^5$。"
}