{
    "description": "Bessie and her bovine pals from nearby farms have finally decided that they are going to start connecting their farms together by trails in an effort to form an alliance against the farmers.  The cows in each of the N (1 <= N <= 100,000) farms were initially instructed to build a trail to exactly one other farm, for a total of N trails.  However months into the project only M (1 <= M < N) of these trails had actually been built.\n\nArguments between the farms over which farms already built a trail now threaten to split apart the cow alliance.  To ease tension, Bessie wishes to calculate how many ways the M trails that exist so far could have been built.  For example, if there is a trail connecting farms 3 and 4, then one possibility is that farm 3 built the trail, and the other possibility is that farm 4 built the trail.  Help Bessie by calculating the number of different assignments of trails to the farms that built them, modulo 1,000,000,007.  Two assignments are considered different if there is at least one trail built by a different farm in each assignment.\n\n给出n个点m条边的图，现把点和边分组，每条边只能和相邻两点之一分在一组，点可以单独一组，问分组方案数。\n",
    "inputFormat": "\\* Line 1: Two space-separated integers N and M\n\n\\* Lines 2..1+M: Line i+1 describes the ith trail.  Each line contains two space-separated integers u\\_i and v\\_i (1 <= u\\_i, v\\_i <= N, u\\_i != v\\_i) describing the pair of farms connected by the trail.\n",
    "outputFormat": "\\* Line 1: A single line containing the number of assignments of trails to farms, taken modulo 1,000,000,007.  If no assignment satisfies the above conditions output 0.\n",
    "samples": [
        [
            "5 4 \n1 2 \n3 2 \n4 5 \n4 5 \n",
            "6 \n"
        ],
        [
            "6 5\n1 2\n2 3\n3 4\n1 4\n2 4",
            "0"
        ]
    ],
    "hint": "Note that there can be two trails between the same pair of farms.\n\n\nThere are 6 possible assignments.  Letting {a,b,c,d} mean that farm 1 builds trail a, farm 2 builds trail b, farm 3 builds trail c, and farm 4 builds trail d, the assignments are:\n\n```cpp\n{2, 3, 4, 5} \n{2, 3, 5, 4} \n{1, 3, 4, 5} \n{1, 3, 5, 4} \n{1, 2, 4, 5} \n{1, 2, 5, 4} \n\n```"
}