{
    "description": "Bessie has been playing with strings again. She found that by\n\nchanging the order of the alphabet she could make some strings come before all the others lexicographically (dictionary ordering).\n\nFor instance Bessie found that for the strings \"omm\", \"moo\", \"mom\", and \"ommnom\" she could make \"mom\" appear first using the standard alphabet and that she could make \"omm\" appear first using the alphabet\n\n\"abcdefghijklonmpqrstuvwxyz\".  However, Bessie couldn't figure out any way to make \"moo\" or \"ommnom\" appear first.\n\nHelp Bessie by computing which strings in the input could be\n\nlexicographically first by rearranging the order of the alphabet.  To compute if string X is lexicographically before string Y find the index of the first character in which they differ, j.  If no such index exists then X is lexicographically before Y if X is shorter than Y.  Otherwise X is lexicographically before Y if X[j] occurs earlier in the alphabet than Y[j].\n\nBessie一直在研究字符串。她发现，通过改变字母表的顺序，她可以按改变后的字母表来排列字符串（字典序大小排列）。\n\n例如，Bessie发现，对于字符串串“omm”，“moo”，“mom”和“ommnom”，她可以使用标准字母表使“mom”排在第一个（即字典序最小），她也可以使用字母表“abcdefghijklonmpqrstuvwxyz”使得“omm”排在第一个。然而，Bessie想不出任何方法（改变字母表顺序）使得“moo”或“ommnom”排在第一个。\n\n接下来让我们通过重新排列字母表的顺序来计算输入中有哪些字符串可以排在第一个（即字典序最小），从而帮助Bessie。\n\n要计算字符串X和字符串Y按照重新排列过的字母表顺序来排列的顺序，先找到它们第一个不同的字母X[i]与Y[i]，按重排后的字母表顺序比较，若X[i]比Y[i]先，则X的字典序比Y小，即X排在Y前；若没有不同的字母，则比较X与Y长度，若X比Y短，则X的字典序比Y小，即X排在Y前。\n",
    "inputFormat": "\\* Line 1: A single line containing N (1 <= N <= 30,000), the number of strings Bessie is playing with.\n\n\\* Lines 2..1+N: Each line contains a non-empty string.  The total number of characters in all strings will be no more than 300,000.  All characters in input will be lowercase characters 'a' through 'z'.  Input will contain no duplicate strings.\n\n第1行：一个数字N（1 <= N <= 30,000），Bessie正在研究的字符串的数量。\n\n第2~N+1行：每行包含一个非空字符串。所有字符串包含的字符总数不会超过300,000。 输入中的所有字符都是小写字母，即a~z。 输入不包含重复的字符串。\n",
    "outputFormat": "\\* Line 1: A single line containing K, the number of strings that could be lexicographically first.\n\n\\* Lines 2..1+K: The (1+i)th line should contain the ith string that could be lexicographically first.  Strings should be output in the same order they were given in the input.\n\n第1行：一个数字K，表示按重排后的字母表顺序排列的字符串有多少可以排在第一个数量。\n\n第2~K+1行：第i+1行包含第i个按重排后的字母表顺序排列后可以排在第一个的字符串。字符串应该按照它们在输入中的顺序来输出。\n",
    "samples": [
        [
            "4\nomm\nmoo\nmom\nommnom\n",
            "2\nomm\nmom\n"
        ]
    ],
    "hint": "The example from the problem statement.\n\n\nOnly \"omm\" and \"mom\" can be ordered first.\n\n\n样例即是题目描述中的例子，只有“omm”和“mom”在各自特定的字典序下可以被排列在第一个。"
}