{
    "description": "Farmer John's N cows (1 <= N <= 100,000) are lined up in a row.  Each cow is identified by an integer \"breed ID\" in the range 0...1,000,000,000; the breed ID of the ith cow in the lineup is B(i).  Multiple cows can share the same breed ID.\n\nFJ thinks that his line of cows will look much more impressive if there is a large contiguous block of cows that all have the same breed ID.  In order to create such a block, FJ chooses up to K breed IDs and removes from his lineup all the cows having those IDs.  Please help FJ figure out the length of the largest consecutive block of cows with the same breed ID that he can create by doing this.\n\n农夫约翰的N(1 <= N <= 100,000)只奶牛排成了一队，每只牛都用编上了一个“血统编号”，该编号为范围0...1,000,000,000的整数。血统相同的奶牛有相同的编号，也就是可能有多头奶牛是相同的\"血统编号\"。\n\n约翰觉得如果连续排列的一段奶牛有相同的血统编号的话，奶牛们看起来会更具有威猛。为了创造这样的连续段，约翰最多能选出k种血统的奶牛，并把他们全部从队列中赶走。\n\n\n请帮助约翰计算这样做能得到的由相同血统编号的牛构成的连续段的长度最大是多少？\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and K.\n\n\\* Lines 2..1+N: Line i+1 contains the breed ID B(i). \n\n",
    "outputFormat": "\\* Line 1: The largest size of a contiguous block of cows with\n\nidentical breed IDs that FJ can create.\n",
    "samples": [
        [
            "9 1 \n2 \n7 \n3 \n7 \n7 \n3 \n7 \n5 \n7 \n",
            "4 \n"
        ]
    ],
    "hint": "There are 9 cows in the lineup, with breed IDs 2, 7, 3, 7, 7, 3, 7, 5, 7. FJ would like to remove up to 1 breed ID from this lineup.\n\n\nBy removing all cows with breed ID 3, the lineup reduces to 2, 7, 7, 7, 7, 5, 7.  In this new lineup, there is a contiguous block of 4 cows with the same breed ID (7).\n"
}