{
    "description": "Farmer John's N cows (1 <= N <= 2000) are all standing at various positions along the straight path from the barn to the pasture, which we can think of as a one-dimensional number line.  Since his cows like to stay in email contact with each-other, FJ wants to install Wifi base stations at various positions so that all of the cows have wireless coverage.\n\nAfter shopping around, FJ learns that the cost of a Wifi base station depends on distance it can transmit: a base station of power r costs A + B\\*r, where A is a fixed cost for installing the base station and B is a cost per unit of transmission distance.  If FJ installs such a device at position x, then it can transmit data to any cow located in the range x-r ... x+r.  A base station with transmission power of r=0 is allowed, but this only provides coverage to a cow located at the same position as the transmitter.\n\nGiven the values of A and B, as well as the locations of FJ's cows, please determine the least expensive way FJ can provide wireless coverage for all his cows.\n\n给出在同一条直线上的n个点和两个数A，B，现在要在这条直线上放置若干个信号塔，每个信号塔有一个r值，假设它的位置是x，则它能覆盖的范围是x-r~x+r，放置一个信号塔的花费是A+B\\*r，问要覆盖所有的点最小的花费是多少。\n",
    "inputFormat": "\\* Line 1: Three space-separated integers: N A B (0 <= A, B <= 1000).\n\n\\* Lines 2..1+N: Each line contains an integer in the range\n\n0..1,000,000 describing the location of one of FJ's cows.\n",
    "outputFormat": "\\* Line 1: The minimum cost of providing wireless coverage to all cows.\n",
    "samples": [
        [
            "3 20 5 \n7 \n0 \n100 \n",
            "57.5 \n"
        ]
    ],
    "hint": "There are 3 cows at positions 7, 0, and 100.  Installation of a base station of power r costs 20 + 5\\*r.\n\n\nThe optimal solution is to build a base station at position 3.5 (with power 3.5) and another at position 100 (with power 0).  The first base station covers cows 1 and 2, and the second covers cow 3.\n"
}