{
    "description": "Farmer John has arranged N hay bales (1 <= N <= 50,000) in the middle of one of his fields.  If we think of the field as a 1,000,000 x 1,000,000 grid of 1 x 1 square cells, each hay bale occupies exactly one of these cells (no two hay bales occupy the same cell, of course).\n\nFJ notices that his hay bales all form one large connected region, meaning that starting from any bale, one can reach any other bale by taking a series of steps either north, south, east, or west onto directly adjacent bales.  The connected region of hay bales may however contain \"holes\" -- empty regions that are completely surrounded by hay bales.\n\nPlease help FJ determine the perimeter of the region formed by his hay bales.  Note that holes do not contribute to the perimeter.\n",
    "inputFormat": "\\* Line 1: The number of hay bales, N.\n\n\\* Lines 2..1+N: Each line contains the (x,y) location of a single hay bale, where x and y are integers both in the range\n\n1..1,000,000. Position (1,1) is the lower-left cell in FJ's field, and position (1000000,1000000) is the upper-right cell.\n",
    "outputFormat": "\\* Line 1: The perimeter of the connected region of hay bales.\n",
    "samples": [
        [
            "8 \n10005 200003 \n10005 200004 \n10008 200004 \n10005 200005 \n10006 200003 \n10007 200003 \n10007 200004 \n10006 200005 \n",
            "14 \n"
        ]
    ],
    "hint": "The connected region consisting of hay bales looks like this:\n\nXX\nX XX\nXXX\n\nThe length of the perimeter of the connected region is 14 (for example, the left side of the region contributes a length of 3 to this total).  Observe that the hole in the middle does not contribute to this number.\n",
    "translation": "农夫约翰已经在他的一片田地中间放置了n（1<=n<=50000）个干草堆。我们可以认为这片田地是由1000000*1000000 个小方格组成的矩阵，每个干草堆占据一个小方格（当然，没有两堆干草占据同一个格子）\n\nFJ 注意到他的干草堆组成了一个大的连通块，这就意味着从任何一个草堆走起，可以通过相邻草堆走若干步到达其他任意的草堆。这个连通块的内部可能包含若干个“洞”——被干草堆完全包围的空白格子。\n\n请帮助FJ计算整个连通块的周长。计算周长时请不要考虑“洞”。\n\n##   输入格式\n\n第一行：干草堆的数量 n\n\n第2~n+1行：每行两个数，表示干草堆的坐标（x，y），满足1<=x,y<=1000000 \n\n## 输出格式\n连通块的周长p\n "
}