{
    "description": "Farmer John has recently purchased a new barn containing N milking machines (1 <= N <= 40,000), conveniently numbered 1..N and arranged in a row.\n\nMilking machine i is capable of extracting M(i) units of milk per day (1 <= M(i) <= 100,000).  Unfortunately, the machines were installed so close together that if a machine i is in use on a particular day, its two neighboring machines cannot be used that day (endpoint machines have only one neighbor, of course).  Farmer John is free to select different subsets of machines to operate on different days.\n\nFarmer John is interested in computing the maximum amount of milk he can extract over a series of D days (1 <= D <= 50,000).  At the beginning of each day, he has enough time to perform maintenance on one selected milking machine i, thereby changing its daily milk output M(i) from that day forward. Given a list of these daily modifications, please tell Farmer John how much milk he can produce over D days (note that this number might not fit into a 32-bit integer).\n\nFJ最近买了1个新仓库, 内含N 个挤奶机,1 到N 编号并排成一行。\n\n\n挤奶机i 每天能产出M(i) 单位的奶。不幸的是, 机器装得太近以至于如果一台机器i 在某天被使用, 那与它相邻的两台机器那一天不能被使用\n\n\n(当然, 两端点处的机器分别只有一个与之相邻的机器)。\n\n\nFJ 可自由选择不同的机器在不同的日子工作。\n\n\nFJ感兴趣于计算在D 天内他能产出奶的最大值。在每天开始时, 他有足够的时间维护一个选中的挤奶机i, 从而改变它从那天起的每日产奶量M(i)。\n\n\n给出这些每日的修改,请告诉FJ他D 天中能产多少奶。\n",
    "inputFormat": "\\* Line 1: The values of N and D.\n\n\\* Lines 2..1+N: Line i+1 contains the initial value of M(i).\n\n\\* Lines 2+N..1+N+D: Line 1+N+d contains two integers i and m,\n\nindicating that Farmer John updates the value of M(i) to m at the beginning of day d.\n",
    "outputFormat": "\\* Line 1: The maximum total amount of milk FJ can produce over D days.\n",
    "samples": [
        [
            "5 3 \n1 \n2 \n3 \n4 \n5 \n5 2 \n2 7 \n1 10 \n",
            "32 \n"
        ]
    ],
    "hint": "There are 5 machines, with initial milk outputs 1,2,3,4,5.  On day 1, machine 5 is updated to output 2 unit of milk, and so on.\n\n\nOn day one, the optimal amount of milk is 2+4 = 6 (also achievable as 1+3+2).  On day two, the optimal amount is 7+4 = 11.  On day three, the optimal amount is 10+3+2=15.\n\n题意简述：给定n个点排成一排，每个点有一个点权，多次改变某个点的点权并将最大点独立集计入答案，输出最终的答案\n\n感谢@zht467 提供翻译\n"
}