{
    "description": "Cow curling is a popular cold-weather sport played in the Moolympics.\n\nLike regular curling, the sport involves two teams, each of which slides N heavy stones (3 <= N <= 50,000) across a sheet of ice.  At the end of the game, there are 2N stones on the ice, each located at a distinct 2D point.\n\nScoring in the cow version of curling is a bit curious, however.  A stone is said to be \"captured\" if it is contained inside a triangle whose corners are stones owned by the opponent (a stone on the boundary of such a triangle also counts as being captured).  The score for a team is the number of opponent stones that are captured.\n\nPlease help compute the final score of a cow curling match, given the locations of all 2N stones.\n\n有两支队伍在比赛，一队可以一次取出3个点来，所围成的三角形覆盖的区域可以“捕获”对方的点，问两支队伍各能够捕获对方多少个点。\n",
    "inputFormat": "\\* Line 1: The integer N.\n\n\\* Lines 2..1+N: Each line contains 2 integers specifying the x and y coordinates of a stone for team A (each coordinate lies in the range -40,000 .. +40,000).\n\n\\* Lines 2+N..1+2N: Each line contains 2 integers specifying the x and y coordinates of a stone for team B (each coordinate lies in the range -40,000 .. +40,000).\n",
    "outputFormat": "\\* Line 1: Two space-separated integers, giving the scores for teams A and B.\n",
    "samples": [
        [
            "4 \n0 0 \n0 2 \n2 0 \n2 2 \n1 1 \n1 10 \n-10 3 \n10 3 \n",
            "1 2 \n"
        ]
    ],
    "hint": "Each team owns 4 stones.  Team A has stones at (0,0), (0,2), (2,0), and (2,2), and team B has stones at (1,1), (1,10), (-10,3), and (10,3).\n\n\nTeam A captures their opponent's stone at (1,1).  Team B captures their opponent's stones at (0,2) and (2,2).\n"
}