{
    "description": "Farmer John's new barn consists of a huge circle of N stalls (2 <= N <= 3,000,000), numbered 0..N-1, with stall N-1 being adjacent to stall 0.\n\nAt the end of each day, FJ's cows arrive back at the barn one by one, each with a preferred stall they would like to occupy.  However, if a cow's preferred stall is already occupied by another cow, she scans forward sequentially from this stall until she finds the first unoccupied stall, which she then claims.  If she scans past stall N-1, she continues scanning from stall 0.\n\nGiven the preferred stall of each cow, please determine the smallest index of a stall that remains unoccupied after all the cows have returned to the barn.  Notice that the answer to this question does not depend on the order in which the cows return to the barn.\n\nIn order to avoid issues with reading huge amounts of input, the input to this problem is specified in a concise format using K lines (1 <= K <= 10,000) each of the form:\n\nX Y A B\n\nOne of these lines specifies the preferred stall for XY total cows: X cows prefer each of the stalls f(1) .. f(Y), where f(i) = (Ai + B) mod N.  The values of A and B lie in the range 0...1,000,000,000.\n\nDo not forget the standard memory limit of 64MB for all problems.\n\n约翰的谷仓中有N(2 <= N <=3,000,000)个房间，编号0到N-1，这些房间排布成环状,编号0的和编号N-1的相邻。\n\n每天傍晚，奶牛们一只一只排队回到谷仓，每头奶牛都有一个喜欢的房间，但是，如果它喜欢的房间已被其他奶牛占了，它会向前挨个探索其他房间（如果它探索过了N-1号房间，它会继续探索0号房间，以此继续下去）直到探到第一个没有被占用的房间，这时它会宣布占用这个房间。\n\n告诉你每头奶牛喜欢的房间，当所有奶牛都找到房间后，剩下的没被占用的房间中，编号最小的是哪个。很明显，问题的答案与奶牛进入谷仓的顺序无关。\n\n\n为避免输入内容过多。本题的输入数据采用一种简洁的方式：一共K(1 <= K <=10,000)行，每行格式如下：\n\nX Y A B\n\n表示有Y批奶牛，每批X头，也就是总共X\\*Y只奶牛喜欢的房间号。Y批奶牛编号1到Y，第i批X头奶牛喜欢的房间号为(A\\*i+B) Mod N.\n\nA和B的取值范围为0...1,000,000,000\n\n注意，只有64M的空间。\n",
    "inputFormat": "\\* Line 1: Two space-separated integers: N and K.\n\n\\* Lines 2..1+K: Each line contains integers X Y A B, interpreted as above.  The total number of cows specified by all these lines will be at most N-1.  Cows can be added to the same stall by several of these lines.\n",
    "outputFormat": "\\* Line 1: The minimum index of an unoccupied stall.\n",
    "samples": [
        [
            "10 3 \n3 2 2 4 \n2 1 0 1 \n1 1 1 7 \n",
            "5 \n"
        ]
    ],
    "hint": "There are 10 stalls in the barn, numbered 0..9.  The second line of input states that 3 cows prefer stall (2\\*1+4) mod 10 = 6, and 3 cows prefer stall (2\\*2+4) mod 10 = 8.  The third line states that 2 cows prefer stall (0\\*1+1) mod 10 = 1.  Line four specifies that 1 cow prefers stall (1\\*1+7) mod 10 = 8 (so a total of 4 cows prefer this stall).\n\n\nAll stalls will end up occupied except stall 5. \n\n"
}