{
    "description": " \n\nThe cows are out exercising their hooves again!  There are N cows\n\njogging on an infinitely-long single-lane track (1 <= N <= 100,000).\n\nEach cow starts at a distinct position on the track, and some cows jog\n\nat different speeds.\n\n\n \n\nWith only one lane in the track, cows cannot pass each other.  When a\n\nfaster cow catches up to another cow, she has to slow down to avoid\n\nrunning into the other cow, becoming part of the same running group.\n\n \n\nThe cows will run for T minutes (1 <= T <= 1,000,000,000).  Please\n\nhelp Farmer John determine how many groups will be left at this time.\n\nTwo cows should be considered part of the same group if they are at\n\n\nthe same position at the end of T minutes. \n\n有N (1 <= N <= 100,000)头奶牛在一个单人的超长跑道上慢跑，每头牛的起点位置都不同。由于是单人跑道，所有他们之间不能相互超越。当一头速度快的奶牛追上另外一头奶牛的时候，他必须降速成同等速度。我们把这些跑走同一个位置而且同等速度的牛看成一个小组。\n\n\n请计算T (1 <= T <= 1,000,000,000)时间后，奶牛们将分为多少小组。\n\n",
    "inputFormat": "INPUT: (file cowjog.in) \n\nThe first line of input contains the two integers N and T.\n\n\nThe following N lines each contain the initial position and speed of a\n\nsingle cow.  Position is a nonnegative integer and speed is a positive\n\ninteger; both numbers are at most 1 billion.  All cows start at\n\ndistinct positions, and these will be given in increasing order in\n\nthe input.\n\n\n ",
    "outputFormat": "OUTPUT: (file cowjog.out) \n\nA single integer indicating how many groups remain after T minutes.\n\n",
    "samples": [
        [
            "5 3 \n0 1 \n1 2 \n2 3 \n3 2 \n6 1 \n\n \n\n",
            " \n\n3 \n\n \n"
        ]
    ],
    "hint": ""
}