{
    "description": " Farmer John and his herd are playing frisbee.  Bessie throws thefrisbee down the field, but it's going straight to Mark the field handon the other team!  Mark has height H (1 <= H <= 1,000,000,000), butthere are N cows on Bessie's team gathered around Mark (2 <= N <= 20).They can only catch the frisbee if they can stack up to be at least ashigh as Mark.  Each of the N cows has a height, weight, and strength.A cow's strength indicates the maximum amount of total weight of thecows that can be stacked above her. \n \n Given these constraints, Bessie wants to know if it is possible forher team to build a tall enough stack to catch the frisbee, and if so,what is the maximum safety factor of such a stack.  The safety factorof a stack is the amount of weight that can be added to the top of thestack without exceeding any cow's strength.\n\n\n",
    "inputFormat": "INPUT: (file guard.in) \n\nThe first line of input contains N and H.\n\nThe next N lines of input each describe a cow, giving its height,weight, and strength.  All are positive integers at most 1 billion.\n\n ",
    "outputFormat": "OUTPUT: (file guard.out) \n\n If Bessie's team can build a stack tall enough to catch the frisbee, please output the maximum achievable safety factor for such a stack. \n\nOtherwise output \"Mark is too tall\" (without the quotes). \n\n",
    "samples": [
        [
            "4 10 \n9 4 1 \n3 3 5 \n5 5 10 \n4 4 5 ",
            "2 "
        ]
    ],
    "hint": "",
    "translation": "FJ将飞盘抛向身高为H(1 <= H <= 1,000,000,000)的Mark，但是Mark被N(2 <= N <= 20)头牛包围。牛们可以叠成一个牛塔，如果叠好后的高度大于或者等于Mark的高度，那牛们将抢到飞盘。\n\n每头牛都一个身高，体重和耐力值三个指标。耐力指的是一头牛最大能承受的叠在他上方的牛的重量和。请计算牛们是否能够抢到飞盘。若是可以，请计算牛塔的最大稳定强度，稳定强度是指，在每头牛的耐力都可以承受的前提下，还能够在牛塔最上方添加的最大重量。\n\n"
}