{
    "description": "Farmer John has lost his favorite cow bell, and Bessie the cow has agreed to help him find it!  They both fan out and search the farm along different paths, but stay in contact via radio so they can keep in touch with each-other. Unfortunately, the batteries in their radios are running low, so they want to plan their movements so as to conserve power, by trying to stay always within a short distance apart.\n\n\nFarmer John starts at location ($f_x, f_y$) and plans to follow a path consisting of  $N$ steps, each of which is either 'N' (north), 'E' (east), 'S' (south), or 'W' west.  Bessie starts at location ($b_x, b_y$) and follows a similar path consisting of $M$ steps.  Both paths may share points in common.  At each time step, Farmer John can either stay put at his current location, or take one step forward along his path, in whichever direction happens to be next (assuming he has not yet reached the final location in his path). Bessie can make a similar choice.  At each time step (excluding the first step where they start at their initial locations), their radios consume energy equal to the square of the distance between them.\n\n\nPlease help FJ and Bessie plan a joint movement strategy  that will minimize the total amount of energy consumed up to and including the final step where both of them first reach the final locations on their respective paths.\n\nFJ失去了他最喜欢的牛铃，而Bessie已经同意帮助他找到它！他们用不同的路径搜索农场，通过无线电保持联系。不幸的是，无线电中的电池电量不足，所以他们设法尽可能保持两者位置的距离最小，以节省电量。\n\n\nFJ从位置（fx，fy）开始，并计划遵循由N步骤组成的路径，每个步骤都是“N”（北），“E”（东），“S”（南），或“W”（西）。Bessie从位置（bx，by）开始，并遵循由M步骤组成的类似路径。两个路径可以经过相同的点。在每个时间段，FJ可以保持在他现在的位置，或沿着他的道路前进一步，无论哪个方向恰好在下一个（假设他还没有到达他的路径的最后位置）。Bessie可以做出类似的选择。在每个时间步（不包括从初始位置开始的第一步），他们的无线电消耗的能量等于它们之间距离的平方。\n\n\n请帮助FJ和Bessie计划行动策略，最大限度地减少消耗的能量总量。总量包括最终步骤，这时两者首先到达各自路径上的最终位置。\n",
    "inputFormat": "The first line of input contains $N$ and $M$ ($1 \\leq N, M \\leq 1000$).   The\n\nsecond line contains integers $f_x$ and $f_y$, and the third line contains $b_x$\n\nand $b_y$ ($0 \\leq f_x, f_y, b_x, b_y \\leq 1000$). The next line contains  a\n\nstring of length $N$ describing FJ's path, and the final line contains a string\n\nof  length $M$ describing Bessie's path.\n\n\nIt is guranteed that Farmer John and Bessie's coordinates are always in the\n\nrange ($0 \\leq x,y \\leq 1000$) throughout their journey.  Note that East points in the positive x direction and North points in the positive y direction.\n\n第一行输入N和M（1≤N，M≤1000）。\n\n\n第二行输入整数fx和fy，第三行输入bx和by（0≤fx，fy，bx，≤1000）。下一行包含一个长度为N的字符串描述FJ的路径，最后一行包含一个字符串的长度M描述Bessie的路径。\n\n\n数据满足（0≤x，y≤1000）。注意，东方向为正X方向，北方向为正Y方向。\n",
    "outputFormat": "Output a single integer specifying the minimum energy FJ and Bessie can use\n\nduring their travels.\n\n输出一个整数，表示最小能量。\n",
    "samples": [
        [
            "2 7\n3 0\n5 0\nNN\nNWWWWWN",
            "28"
        ]
    ],
    "hint": "感谢@ prcups 改进翻译\n"
}