{
    "description": "Farmer John has installed a fancy new milking machine in his barn, but it draws so much power that it occasionally causes the power to go out! This happens so often that Bessie has memorized a map of the barn, making it easier for her to find the exit of the barn in the dark. She is curious though about the impact of power loss on her ability to exit the barn quickly. For example, she wonders how much farther she might need to walk find the exit in the dark.\n\n\nThe barn is described by a simple (non self-intersecting) polygon with integer  vertices $(x_1, y_1) \\ldots (x_n, y_n)$ listed in clockwise order.  Its edges alternate between horizontal (parallel to the x-axis) and vertical (parallel to the y-axis); the first edge can be of either type. The exit is located at\n\n$(x_1, y_1)$.  Bessie starts inside the barn located at some vertex  $(x_i, y_i)$ for $i > 1$.  She can walk only around the perimeter of the barn, either clockwise or counterclockwise, Her goal is to travel a minimum distance to reach the exit. This is relatively easy to do with the lights on, of course, since she will travel either  clockwise or counterclockwise from her current location to the  exit -- whichever direction is shorter.\n\n\nOne day, the lights go out, causing Bessie to panic and forget which vertex she is standing at.  Fortunately, she still remembers the exact map of the barn, so she can possibly figure out her position by walking around and using her sense of touch.  Whenever she is standing at a vertex (including at her initial vertex), she can feel the exact interior angle at that vertex, and she can tell if that vertex is the exit.  When she walks along an edge of the barn, she can determine the exact length of the edge after walking along the entire edge.  Bessie decides on the following strategy: she will move clockwise around the perimeter of the barn until she has felt enough angles and edges to deduce the vertex at which she is currently located.  At that point, she can easily figure out how to get to the exit by traveling a minimum amount of remaining distance, either by continuing to move clockwise or by switching direction and moving counter-clockwise.\n\n\nPlease help Bessie determine the largest amount by which her travel distance will increase in the worst case (over all possibilities for her starting vertex) for travel in the dark versus in a lit barn.\n",
    "inputFormat": "The first line of the input contains $N$ ($4 \\leq N \\leq 200$).  Each of the\n\nnext $N$ lines contains two integers, describing the points $(x_i, y_i)$ in\n\nclockwise order around the barn.  These integers are in the range\n\n$-100,000 \\ldots 100,000$.\n",
    "outputFormat": "Output the largest amount that Bessie's travel distance will increase in the\n\nworst case starting position using the strategy in the problem statement.\n",
    "samples": [
        [
            "4\n0 0\n0 10\n1 10\n1 0",
            "2"
        ]
    ],
    "hint": "In this example, Bessie can feel that she is initially standing at a 90-degree\n\nangle, but she cannot tell if she is initially standing at vertex 2, 3, or 4.\n\nAfter taking a step along one edge in the clockwise direction, Bessie either\n\nreaches the exit or can uniquely determine her location based on the length of\n\nthis edge.  The distances she obtains are:\n\nIf starting at vertex 2: she travels 12 units in the dark (1 unit to reach\n\nvertex 3, then 11 units to continue to the exit).  She only needs to travel 10\n\nunits in a lit barn.  This is an extra distance of 2 for this vertex.\n\nIf starting at vertex 3: she travels 11 units in both cases.\n\nIf starting at vertex 4: she travels 1 unit in both cases.\n\nThe worst-case difference over all starting points is therefore 12 - 10 = 2.  That\n\nis, Bessie can guarantee that using her strategy, no matter where she starts,\n\nshe will travel at most 2 extra units of distance farther in the dark than in the light.\n",
    "translation": "### 题目描述\n\nFarmer John 在他的谷仓里安装了一个非常不错的新挤奶机，但是这台挤奶机耗电太多了，有时候会让谷仓直接停电！这种事发生的太频繁了，以至于 Bessie 直接把谷仓的地图背过了，以便于可以在黑暗中找到谷仓的出口。她对于停电对于她快速离开谷仓的能力的影响非常好奇。比如说，她想知道她在黑暗中需要走多远来找到谷仓的出口。\n\n谷仓里的路可以被描述为是一个简单的用几个顶点来表示的多边形，这些顶点可以按照顺时针被表示为 $(x_1, y_1) \\cdots (x_n, y_n)$（保证这些顶点连成的线没有交叉的情况）。这些点构成的边在水平轴（平行于 $x$ 轴）和竖直轴（平行于 $y$ 轴）之间交替出现。第一条边可以是任意一种类型。谷仓出口在坐标 $(x_1, y_1)$ 。Bessie 从谷仓内任意一个点 $(x_i, y_i)$ 开始走。她只可以沿着这些边走，要不然是顺时针，要不然就是逆时针，她的目标就是以最短距离抵达出口。当然，如果灯亮着的话这个事还算相对简单，因为她要不然顺时针要不然逆时针走，无所谓哪个方向的路程更短一点。\n\n一天，谷仓突然停电了，导致 Bessie 受到惊吓、忘记了她站在哪个顶点。幸亏她还记得谷仓的准确地图，所以她可以四处走走，用她的触觉来弄清楚她的位置。不管什么时候，只要她站在一个顶点，那么她就可以感受到她在这个点的朝向角度，弄清楚这个点是不是出口。当她沿着谷仓的一个边走完的时候，她可以算出精确的边长。Bessie 决定用这么一个策略：她会顺时针沿着谷仓周围的边走，直到她知道了足够的角度和边、可以推断出她目前在的是哪个顶点。在那个顶点，她就可以轻易地弄清楚怎样以最短距离到达出口（要不然继续沿着顺时针走，要不然倒回去沿着逆时针走）。\n\n请帮助 Bessie 算出在起点可以是任何一个顶点情况下，在最坏的情况下，她在黑暗中和亮着灯的时候到达出口的距离的差值（即找到差值的最大值）。\n\n### 输入格式\n\n第一行包括一个数字 $N (4 \\leqslant N \\leqslant 200)$ ，接下来 $N$ 行，每行包括两个数字，沿着顺时针表示顶点 $(x_i, y_i)$ &nbsp; $x_i, y_i \\in [-10^5, 10^5]$ 。\n\n### 输出格式\n\n输出 Bessie 在最坏的情况下，她在黑暗中和亮着灯的时候到达出口的距离的差值（即找到差值的最大值）。\n\n### 说明/提示\n\n在这个样例中，Bessie 开始可以感觉到她沿着 $90 \\degree$ 角站着，但是她辨别不出来她是在 $2, 3, 4$ 中的哪一个顶点。\n\n在走了一条边以后，Bessie 要不然到了出口要不然就可以根据她走过的距离推断出她的位置。情况如下：\n\n如果她从 $2$ 号点开始走，她需要在黑暗中走 $12$ 个单位，包括一个单位到达第三个点、十一个单位离开谷仓。同时，如果亮着灯，她可以只走 $10$ 个单位就离开谷仓。差值是 $2$ 。\n\n如果从 $3$ 号点开始，她两种情况都要走 $11$ 个单位。\n\n如果从 $4$ 号点开始，她两种情况都要走 $1$ 个单位。\n\n所以最坏情况差值是 $2$ 。"
}