{
    "description": "Farmer John has received an order for exactly $M$ units of milk ($1 \\leq M \\leq 200$) that he needs to fill right away.  Unfortunately, his fancy milking machine has just become broken, and all he has are two milk pails of integer sizes $X$ and $Y$ ($1 \\leq X, Y \\leq 100$) with which he can measure milk.  Both pails are initially empty.  Using these two pails, he can perform up to $K$ of the following types of operations ($1 \\leq K \\leq 100$):\n\n\n- He can fill either pail completely to the top.\n\n- He can empty either pail.\n\n- He can pour the contents of one pail into the other, stopping when the former becomes empty or the latter becomes full (whichever of these happens first).\n\n\nAlthough FJ realizes he may not be able to end up with exactly $M$ total units of milk in the two pails, please help him compute the minimum amount of error between $M$ and the total amount of milk in the two pails.  That is, please compute the minimum value of $|M-M'|$ such that FJ can construct $M'$ units of milk collectively between the two  pails.\nFJ最近刚收到了解决M（1<=m<=200)个单位牛奶的指令。他有三个桶，大小分别为X，Y(1<=X，Y<=100)。\n\n他可以选择执行如下操作k（1<=k<=100）次：\n\n他可以在任意一个桶中装满牛奶。\n\n他可以倒空任意一个桶\n\n他可以将一个桶里的奶倒入另一个桶中，直到倒空或另一个桶被倒满\n\n尽管FJ意识到他可能不能在两个桶中刚好装下M个单位的牛奶，但请你算出他经过操作后，两桶牛奶的和同M的差值最小是多少。\n",
    "inputFormat": "The first, and only line of input, contains $X$, $Y$, $K$, and $M$.\n",
    "outputFormat": "Output the smallest distance from $M$ to an amount of milk FJ can produce.\n",
    "samples": [
        [
            "14 50 2 32",
            "18"
        ]
    ],
    "hint": "In two steps FJ can be left with the following quanities in his pails\n\n\n```cpp\n(0, 0) = 0 units\n(14, 0) = 14 units\n(0, 50) = 50 units\n(0, 14) = 14 units\n(14, 36) = 50 units\n(14, 50) = 64 units\n```\n\nThe closest we can come to 32 units is 14 for a difference of 18.  Note that it\n\nwould require an extra step to pour out the first pail to end up with (0, 36).\n"
}