{
    "description": "Farmer John is trying to hire contractors to help rearrange his farm, but so far all of them have quit when they saw the complicated sequence of instructions FJ wanted them to follow.  Left to complete the project by himself, he realizes that indeed, he has made the project perhaps more  complicated than necessary.  Please help him follow his instructions to  complete the farm upgrade.\n\n\nFJ's farm consists of $N$ fields in a row, conveniently numbered $1 \\ldots N$. In each field there can be any number of haybales.  Farmer John's instructions contain three types of entries:\n\n1) Given a contiguous interval of fields, add a new haybale to each field.\n\n2) Given a contiguous interval of fields, determine the minimum number of haybales in a field within that interval.\n\n3) Given a contiguous interval of fields, count the total number of haybales  inside that interval.\n\n\nFJ像雇佣几个人在他的农场里帮忙，他需要进行很多种操作，请你帮他搞定。\n\nFJ的农场有N块田地排长一行，编号是从1到N的。每一块田地都有很多草包。FJ要进行下面几种操作：\n\n1)给定一段连续的田地，给每一个田地都增加一些新的草包。\n\n2)给定一段连续的田地，找出草包最少的田地有多少草包。\n\n3)给定一段连续的田地，统计一共有多少草包。\n",
    "inputFormat": "The first line contains two positive integers, $N$ ($1 \\leq N \\leq 200,000$) and\n\n$Q$ ($1 \\leq Q \\leq 100,000$).\n\n\nThe next line contains $N$ nonnegative integers, each at most 100,000,\n\nindicating how many haybales are initially in each field.\n\n\nEach of the next $Q$ lines contains a single uppercase letter, either M, P or S,\n\nfollowed by either two positive integers $A$ and $B$ ($1 \\leq A \\leq B \\leq N$),\n\nor three positive integers $A$, $B$, and $C$ ($1 \\leq A \\leq B \\leq N$;\n\n$1 \\leq C \\leq 100,000$).  There will be three positive integers if and only if\n\n\nthe uppercase letter is P.\n\nIf the letter is M, print the minimum number of haybales in the interval of fields\n\nfrom $A \\ldots B$.\n\n\nIf the letter is P, put $C$ new haybales in each field in the interval of fields\n\nfrom $A \\ldots B$.\n\n\nIf the letter is S, print the total number of haybales found within interval of\n\nfields from $A \\ldots B$.\n",
    "outputFormat": "A line in the output should appear in response to every 'M' or 'S' entry in FJ's\n\ninstructions.\n",
    "samples": [
        [
            "4 5\n3 1 2 4\nM 3 4\nS 1 3\nP 2 3 1\nM 3 4\nS 1 3",
            "2\n6\n3\n8"
        ]
    ],
    "hint": ""
}