{
    "description": "After the last debacle involving Farmer John's circular barn, one would think he had learned his lesson about non-traditional architecture.  However, he thinks he can still make his circular barn (from the preceding problem) function properly by allowing multiple cows into each room.  To recap, the barn consists of a ring of $n$ rooms,  numbered clockwise from $1 \\ldots n$ around the perimeter of the barn ($3 \\leq n \\leq 100$).  Each room has doors to its two neighboring rooms, and also a door opening to the exterior of the barn.\n\nFarmer John wants exactly $r_i$ cows to end up in room $i$ ($1 \\leq r_i \\leq 1,000,000$). To herd the cows into the barn in an orderly fashion, he plans to unlock $k$ exterior doors ($1 \\leq k \\leq 7$), allowing the cows to enter through only those doors. Each cow then walks clockwise through the rooms until she reaches a suitable destination.  Farmer John wants to unlock the exterior doors that will cause his cows to collectively walk a minimum total amount of distance after entering the barn (they can initially line up however they like outside the $k$ unlocked doors; this does not contribute to the total distance in question).  Please determine the minimum total distance his cows will need to walk, if he chooses the best $k$ such doors to unlock.\n\n还是这个谷仓，有n(3<=n<=100)个房间。当然，奶牛可能不止n头了。奶牛都在谷仓外面。现在约翰想要让第i个房间关ri（1<=ri<=1000000）头奶牛按顺时针方向走，直到到达合适的房间。这k(1<=k<=7)个门开在哪里，才能使得奶牛们走的路程最少。奶牛在谷仓外可以随意移动，可以随意选择k个门中的任意一个排队，这不计入最终的路程。\n",
    "inputFormat": "The first line of input contains $n$ and $k$.  Each of the remaining $n$ lines\n\ncontain $r_1 \\ldots r_n$.\n",
    "outputFormat": "Please write out the minimum amount of distance the cows need to travel.\n",
    "samples": [
        [
            "6 2\n2\n5\n4\n2\n6\n2",
            "14"
        ]
    ],
    "hint": "Farmer John can unlock doors 2 and 5.  11 cows enter at door 2 and walk a total\n\ndistance of 8 to get to rooms 2, 3, and 4.  10 cows enter at door 5 and walk a\n\ntotal distance of 6 to get to rooms 5, 6 and 1.\n"
}