{
    "description": "Johnny is a little boy - he is only three years old and enjoys playing with toy cars very much. Johnny has $n$ different cars. They are kept on a shelf so high, that Johnny cannot reach it by himself. As there is little space in his room, at no moment may there be more than $k$ toy cars on the floor.\n\nJohnny plays with one of the cars on the floor. Johnny's mother remains in the room with her son all the time. When Johnny wants to play with another car that is on the floor, he reaches it by himself. But when the toy is on the shelf, his mummy has to hand it to him. When she gives Johnny one car, she can at the same time pick any car from the floor and put it back on the shelf (so that there remains sufficient space on the floor).\n\nThe mother knows her child very well and therefore can predict perfectly which cars Johnny will want to play with. Having this knowledge, she wants to minimize the number of times she has to hand Johnny a toy from the shelf. Keeping that in mind, she has to put the toys off on the shelf extremely thoughtfully.\n\nTaskWrite a programme that:\n\nreads from the standard input the sequence of toy cars in order in which Johnny will want to play with them,calculates the minimal number of times the mother has to pick cars from the shelf,writes the result to the standard output.\n\nJasio 是一个只有三岁的小男孩，他喜欢玩玩具车。他有 $n$ 辆玩具车被保存在书架上。\n\n架子上的玩具车 Jasio 拿不到，但地板上的他可以拿到。Jasio 的母亲会帮 Jasio 拿架子上的玩具车到地板上。\n\n地板最多只能放 $k$ 辆玩具车。\n\n当地板已经放了 $k$ 辆玩具车时，Jasio 的母亲都会从地板上先拿走一个玩具车放回书架，再拿来 Jasio 想要的玩具车。\n\n现在 Jasio 一共想依次玩 $p$ 个玩具车，问 Jasio 的母亲最少需要拿几次玩具车。（只算拿下来的，不算拿上去的）",
    "inputFormat": "In the first line of the standard input there are three integers: $n$,$k$,$p$ ($1\\le k\\le n\\le 100\\ 000$, $1\\le p\\le 500\\ 000$), separated by single spaces. These denote respectively: the total number of cars, the number of cars that can remain on the floor at once and the length of the sequence of cars which Johnny will want to play with. Each of the following $p$ lines contains one integer. These integers are the numbers of cars Johnny will want to play with (the cars are numbered from $1$ to $n$).\n\n第一行三个整数 $n,k$ 和 $p$。\n\n接下来 $p$ 行，每一行有且仅有一个整数 $a_i$，表示 Jasio 想玩的玩具玩家车编号。",
    "outputFormat": "In the first and only line of the standard output one integer should be written - the minimal number of times his mother has to pick a car from the shelf.\n\n输出一行一个整数，表示最少 Jasio 的母亲最少需要拿玩家车的次数。",
    "samples": [
        [
            "3 2 7\n1\n2\n3\n1\n3\n1\n2",
            "4"
        ]
    ],
    "hint": "对于 $100\\%$ 的数据：$1\\le k\\le n\\le 10^5$，$1\\le p\\le 5\\times 10^5$，$1\\le a_i\\le n$。"
}