{
    "description": "Farmer John's $N$ cows ($1 \\leq N \\leq 200$) want to organize an emergency\"moo-cast\" system for broadcasting important messages among themselves.\n\n\nInstead of mooing at each-other over long distances, the cows decide to equip themselves with walkie-talkies, one for each cow.  These walkie-talkies each have a limited transmission radius -- a walkie-talkie of power $P$ can only transmit to other cows up to a distance of $P$ away (note that cow A might be able to transmit to cow B even if cow B cannot transmit back, due to cow A's power being larger than that of cow B).  Fortunately, cows can relay messages to one-another along a path consisting of several hops, so it is not necessary for every cow to be able to transmit directly to every other cow.\n\n\nDue to the asymmetrical nature of the walkie-talkie transmission, broadcasts from some cows may be more effective than from other cows in their ability toreach large numbers of recipients (taking relaying into account).  Please  help the cows determine the maximum number of cows that can be reached by a broadcast originating from a single cow.\n\n\n\n约翰农场主的 $N$ 头奶牛想建立一个紧急情况下的“哞哞广播”系统，这样它们就可以在自己中间广播重要信息。\n\n\n奶牛们想让每头牛装备上一个对讲机，而不是在长距离中向另一头奶牛“哞哞”乱叫。这些对讲机每台都有各自的有效传输半径——一个拥有 $P$ 能量的对讲机只能向距离在 $P$ 以内的牛发送信息（注意可能出现 $A$ 牛对讲机的能量比 $B$ 牛的大，而 $A$ 牛可以给 $B$ 牛发送信息，但 $B$ 牛不能传回信息）。幸运的是，奶牛们可以通过其他奶牛中继，沿着一条跳跃的路径传递信息，因此每个奶牛不必要直接向每个其他奶牛传播。\n\n\n由于对讲机的费堆成性质，来自一些奶牛的广播可能比其他奶牛的广播能够达到更多的接受者（考虑中继的情况）的能力更有效。请帮助奶牛确定来自单个奶牛的广播可以达到的奶牛的最大数量。\n\n",
    "inputFormat": "The first line of input contains $N$.\n\n\nThe next $N$ lines each contain the $x$ and $y$ coordinates of a single cow ( integers in the range $0 \\ldots 25,000$) followed by $p$, the power of the walkie-talkie held by this cow.\n\n第一行，一个整数 $N$。\n\n\n接下来 $N$ 行，第 $i$ 行包括第 $i$ 只牛的坐标 $(x_i,y_i)$，\n以及这只牛所持有对讲机的能量 $P_i$。",
    "outputFormat": "Write a single line of output containing the maximum number of cows a broadcast from a single cow can reach.  The originating cow is included in this number.\n\n\n一行，一个整数，表示从来自单个奶牛的广播可以达到的奶牛的最大数量。\n\n开始的牛也包括在这个数量中。",
    "samples": [
        [
            "4\n1 3 5\n5 4 3\n7 2 1\n6 1 1",
            "3"
        ]
    ],
    "hint": "对于 $100\\%$ 的数据，$N\\le200$，$\\forall i \\in [1,N]$，$0\\le x_i,y_i\\le25000$。"
}