{
    "description": "A knight moves on an infinite chessboard. Each move it can perform is described by a pair of integers - a pair $(a,b)$ indicates that a move from the square (with coordinates) $(x,y)$ to the square $(x+a,y+b)$ or $(x-a,y-b)$ is possible. Each knight has a prescribed set of such pairs, describing the moves this knight can make. For each knight we assume that not all squares this knight can move to from square $(0,0)$ are collinear.\n\n一个骑士在一个无限的棋盘上移动。它可以执行的每一个动作都必须由一对整数$(a,b)$来描述——表示这个骑士可以从$(x,y)$移动到$(x+a,y+b)$或者$(x-a,y-b)$。每个骑士都有一组这样的移动描述，表示了骑士可以做出的移动。我们假设每一个骑士从(0,0)出发移动到的所有位置不共线\n\nWe say two knights are equivalent, if they can reach exactly the same squares starting from the square $(0,0)$ (by making many moves, perhaps). (Let us point out that equivalent knights may reach these squares in different number of moves). It can be shown that for every knight there exists an equivalent one whose moves are described by only two pairs of numbers.\n\n如果他们能从广场(0,0)到达完全相同的坐标(也许走了好几步)，我们就说两个骑士是等价的。(让我们指出，相同的骑士可以在不同的动作中到达这些方块)。可以看出，对于每一个骑士，都存在一对$(a,b)$，其移动仅由两对数字来描述。\n\nTask Write a programme that:\n\n你的任务是写一个程序:\n\n- reads from the standard input the pairs denoting the knight's moves,\n\n- determines two pairs of integers denoting the moves of an equivalent knight,\n\n- writes these two pairs of integers to the standard output.\n\n从标准输入流读入对骑士移动的表示，确定两对表示等价的骑士移动的整数，并输出这两对整数。\n",
    "inputFormat": "In the first line of the standard input one integer  is written, denoting the number of pairs describing the knight's moves, $3\\le n\\le 100$. In the following  $n$ lines pairs of integers representing the knight's moves are written, one pair per line. In each of these lines two integers $a_i$ and $b_i$ separated by a single space are written,$-100\\le a_i,b_i\\le 100$. We assume that $(a_i,b_i)\\neq (0,0)$\n\n第一行读入一个整数n，表示有几个骑士($3\\le n\\le 100$)。在以下$n$行为表示骑士移动的整数对，每一行是一对整数。在这两行中，有两个整数$a_i$和$b_i$，并由一个空格分隔开，$-100\\le a_i,b_i\\le 100$，我们假设$(a_i,b_i)\\neq (0,0)$。\n",
    "outputFormat": "In the first line of the standard output two integers $a$ and $b$ separated by a single space should be written,$-10\\ 000\\le a,b\\le 10\\ 000$. In the second line two integers $c$ and $d$ separated by a single space should be written,$-10\\ 000\\le c,d\\le 10\\ 000$.The above integers should satisfy the condition that a knight whose moves are described by pairs $(a,b)$ and $(c,d)$ is equivalent to the knight described in the input data.\n\n第一行输出两个整数$a$和$b$，并由一个空格分隔,$-10\\ 000\\le a,b\\le 10\\ 000$。在第二行应该输出两个整数$c$和$d$，并由一个空格分隔,$-10\\ 000\\le c,d\\le 10\\ 000$。运动由对描述，上述整数应满足以下条件：输出应满足两对整数描述的骑士和输入数据中描述的骑士是等价的\n",
    "samples": [
        [
            "3\n24 28\n15 50\n12 21",
            "468 1561\n2805 9356\nor:\n3 0\n0 1"
        ]
    ],
    "hint": "感谢@CREEPER\\_提供翻译\n\n感谢@oscar 更正并提供spj\n"
}