{
    "description": "A certain city has been coping with subway construction for a long time. The finances have been mismanaged and the costs have been underestimated to such extent that no funds were foreseen for the purchase of trains. As a result, too many stations and only some of the planned tunnels have been built - barely enough to allow a connection between any two stations to exist. The number of tunnels (each of them is bidirectional) is one less than the number of stations built. From the remaining funds only a handful of trains have been acquired.\n\nTo save their face, the board of directors have asked you to plan subway routes in such a way as to allow maximal number of stations to be connected. Each train travels on a specified route. The routes cannot branch (no three tunnels starting at a single station may belong to the same route). Distinct routes may comprise the same station or tunnel.\n\nTaskWrite a programme which:\n\nreads a description of the tunnel system and the number of subway lines, which are to be planned from the standard input,calculates the maximal number of stations which can be covered by the specified number of subway lines,writes the outcome to the standard output.\n\n给定一棵树，选择l条路径覆盖最多的点的个数是多少。\n",
    "inputFormat": "The first line of the standard input contains two integers $n$ and $l$ ($2 \\le n \\le 1\\ 000\\ 000, 0 \\le l \\le n$) separated by a single space. $n$ denotes the number of stations and $l$ denotes the number of subway lines, which are to be planned. The stations are numbered from $1$ to $n$.\n\nEach of the following $n-1$ lines contains two distinct integers separated by a single space.\n\nThe numbers $1 \\le a_i, b_i \\le n$ in the $(i+1)$'th line denote the numbers of stations connected by $i$'th tunnel.\n",
    "outputFormat": "The first and only line of the standard output should contain a single integer denoting the maximal number of stations which can be covered by train routes.\n",
    "samples": [
        [
            "17 3\n1 2\n3 2\n2 4\n5 2\n5 6\n5 8\n7 8\n9 8\n5 10\n10 13\n13 14\n10 12\n12 11\n15 17\n15 16\n15 10",
            "13"
        ]
    ],
    "hint": ""
}