{
    "description": "Byteasar, the farmer, wants to plough his rectangular field. He can begin with ploughing a slice from any of the field's edges, then he can plough a slice from any unploughed field's edges, and so on, until the whole field is ploughed. After the ploughing of every successive slice, the yet-unploughed field has a rectangular shape. Each slice has a span of $1$, and the length and width of the field are the integers $n$ and $m$.\n\nUnfortunately, Byteasar has only one puny and frail nag (horse) at his disposal for the ploughing. Once the nag starts to plough a slice, it won't stop until the slice is completely ploughed. However, if the slice is to much for the nag to bear, it will die of exhaustion, so Byteasar has to be careful. After every ploughed slice, the nag can rest and gather strength. The difficulty of certain parts of the field varies, but Byteasar is a good farmer and knows his field well, hence he knows every part's ploughing-difficulty.\n\nLet us divide the field into $m\\times n$ unitary squares - these are called tiles in short.\n\nWe identify them by their coordinates $(i,j)$, for $1\\le i\\le m$ and $1\\le j\\le n$.\n\nEach tile has its ploughing-difficulty - a non-negative integer.\n\nLet $t_{i,j}$ denote the difficulty of the tile which coordinates are $(i,j)$.\n\n\nFor every slice, the sum of ploughing-difficulties of the tiles forming it up cannot exceed a certain constant $k$ - lest the nag dies.\n\nA difficult task awaits Byteasar: before ploughing each subsequent slice he has to decide which edge of the field he'll plough, so that the nag won't die. On the other hand, he'd like to plough as few slices as possible.\n\nTaskWrite a programme that:\n\nreads the numbers $k$,$m$ and $n$ from the input file, as well as the ploughing-difficulty coefficients,     determines the best way to plough Byteasar's field,     writes the result to the output file.\n\nByteasar想耕种他那块矩形的田，他每次能耕种矩形的一边（上下左右都行），在他每次耕完后，剩下的田也一定是矩形，每块小区域边长为$1$，耕地的长宽分别为$m$和$n$，不幸的是Byteasar只有一匹老弱的马，从马开始耕地开始，只有当它耕完了一边才会停下休息。但有些地会非常难耕以至于马会非常的累，因此Byteasar需要特别小心。当耕完了一边之后，马可以停下来休息恢复体力。每块地耕种的难度不一，但是Byteasar都非常清楚。我们将地分成$m\\times n$块单位矩形——我们用坐标$(i,j)$来定义它们。每块地都有一个整数$t_{i,j}$,来定义$(i,j)$的耕种难度。所以每次马耕一边地时的难度就是所有它耕种的地的难度总和，对于这匹虚弱的马而言，这个值不能超过他的体力值。Byteasar想知道在马不死掉的情况下最少需要耕多少次才能把地耕完。\n",
    "inputFormat": "There are three positive integers in the first line of the input file: $k$,$m$ and $n$,separated by single spaces, $1\\le k\\le 200\\ 000\\ 000$,$1\\le m,n\\le 2000$.\n\nIn the following $n$ lines there are the ploughing-difficulty coefficients.\n\nThe line no. $j+1$ contains the coefficients $t_{1,j},t_{2,j}...,t_{n,m}$, separated by single spaces,$0\\le t_{i,j}\\le 100\\ 000$.\n",
    "outputFormat": "Your programme should write one integer to the output file: the minimum number of slices required to plough the field while satisfying the given conditions. Since we care for animals, we guarantee that the field can be ploughed according to the above rules. But remember, saving the nag is up to you!\n",
    "samples": [
        [
            "12 6 4\n6 0 4 8 0 5\n0 4 5 4 6 0\n0 5 6 5 6 0\n5 4 0 0 5 4",
            "8"
        ]
    ],
    "hint": "感谢@NaVi\\_Awson 提供翻译\n"
}