{
    "description": "Bytel is a mobile telephony potentate. Each employee has been issued a company phone, the memory ofwhich holds the numbers of some of his co-workers (all of them have his number in their phones as well).\n\nDue to dynamic growth of their operations the board of directors intends to move company headquaters tonew office buildings. It has been decided - in order to boost work efficiency - that every pair of employeesworking in different buildings should know (reciprocally) each others phone number i.e. the memory of theircompany phone ought to hold necessary phone numbers.\n\nSimultaneously, the board have decided to rent as many office buildings as possible to ensure good workingconditions. Help the board of Bytel to plan the number of office buildings and their size in accordancewith the aforementioned requirements.\n\n## Task\n\nWrite a programme which:\n\nreads the description of employees' phone number lists from the standard input        calculates the maximal number of office buildings and their sizes, satisfying board's conditions        writes the outcome to the standard output.",
    "inputFormat": "The first line of the standard input consists of two integers: $n$ and $m$ ($2 \\le n \\le 100\\ 000$, $1 \\le m \\le 2\\ 000\\ 000$),separated by single spaces, denoting the number of Bytel employees and the number of pairs of employeeswho have their numbers in company phones, respectively. The employees are numbered from $1$ to $n$.\n\nEach of the following $m$ lines contains a single pair of integers $a_i$ and $b_i$ ($1 \\le a_i < b_i \\le n$ for $1 \\le i \\le m$), separated by a single space, denoting that employees $a_i$ and $b_i$ have their numbers (reciprocally) in company phones' memory. Each pair of integers denoting a pair of employees shall occur once at the most in the standard input.\n",
    "outputFormat": "The first line of the standard output should contain a single integer: the maximal number of office buildingsthat Bytel should rent. The second should contain a non-decreasing sequence of positive integers, separatedby singe spaces, denoting the sizes of the office buildings (i.e. the numbers of employees working there).\n\nShould there exist more than one correct answer - write out any one of them.\n",
    "samples": [
        [
            "7 16\n1 3\n1 4\n1 5\n2 3\n3 4\n4 5\n4 7\n4 6\n5 6\n6 7\n2 4\n2 7\n2 5\n3 5\n3 7\n1 7",
            "3\n1 2 4"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\n\nBytel 是一家移动通信公司。该公司的每位员工都收到了一部公司生产的电话，电话的通讯录中存储着一些同事的电话号码（每部手机中也都有该手机本身的电话号码）。\n\n由于业务扩张，公司总部需要迁移至新的办公区。为了提高工作效率，董事会决定在不同栋楼工作的每一对员工需要**相互**知道对方的电话号码。即如果 $u$ 和 $v$ 在不同的楼工作，则 $u$ 的通讯录里需要存储 $v$ 的电话号，$v$ 的通讯录里也要存储 $u$ 的电话号码。\n\n同时，董事会决定租用尽可能多的楼，以确保良好的工作条件。现在你需要帮助 Bytel 公司计算出他们需要租用多少栋楼。\n\n## 输入格式\n\n输入第一行包含两个整数 $n,m$，分别代表公司的员工数和通讯录的信息数，员工从 $1$ 到 $n$ 编号。\n\n接下来 $m$ 行，每行两个整数 $a_i,b_i$，表示 $a_i$ 和 $b_i$ **相互**知道对方的电话号码，保证任意两条信息不重复。\n\n## 输出格式\n\n输出第一行包含一个整数 $t$：董事会需要租用多少栋办公楼。\n\n第二行包含 $t$ 个整数，第 $i$ 个整数 $c_i$ 表示在第 $i$ 栋建筑工作的员工数量。你的输出需要保证 $c_i$ 是单调不下降的。\n\n如果有多种合法方案，你可以输出任意一种。\n\n## 数据范围\n\n$2 \\leq n \\leq 10^5$，$1 \\leq m \\leq 2 \\times 10^6$，$1 \\leq a_i \\lt b_i \\leq n$。"
}