{
    "description": "King Byteasar has yielded under pressure of Byteotian merchants and  hence decided to settle the issue of toll paid by them.\n\nByteotia consists of $n$ towns connected with $m$ bidirectional roads.\n\nEach road connects directly two different towns and no two towns are  connected by more than one direct road.\n\nNote that the roads may lead through tunnels or flyovers.\n\nUntil now each town in Byteotia imposed duty on everyone who  either entered or left the town.\n\nThe merchants, discontented with such situation, lodged a protest  against multiple taxation.\n\nKing Byteasar ruled that the town privileges are now restricted.\n\nAccording to the new royal edict, each town can only charge toll on  merchants travelling by exact one road leading into the town,  regardless of the direction they are travelling in.\n\nFurthermore, for each road, those who travel it cannot be made to pay  the duty to both towns the road connects.\n\nIt remains to determine which town should collect toll from which road.\n\nSolving this problem His Highness has commissioned to you.\n\n## Task\n\nWrite a programme that:\n\n- reads the Byteotian road system's description from the standard input,\n\n- for each town determines on which road it should impose toll, or claims it is impossible,\n\n- writes out the result to the standard output.\n",
    "inputFormat": "There are two integers in the first line of the standard input: $n$ and $m$ ($1 \\le n \\le 100\\ 000$, $1 \\le n \\le 200\\ 000$), denoting the number of towns and roads in Byteotia, respectively. The towns are numbered from $1$ to $n$. In next $m$ lines descriptions of the roads follow. In line No. $i$ there are two integers $a_i$ and $b_i$ () meaning that towns $a_i$ and $b_i$ are directly connected by a road.\n",
    "outputFormat": "If collecting the toll in accordance with the royal edict is impossible, your programme should write the word NIE ('no' in Polish) in the first and only line of the standard output. Otherwise, it should write the word TAK ('yes' in Polish) in the first line, while in the following $n$ lines should tell which city collects toll from which road. Line no. $(i+1)$ should tell on which road the town no. $i$ imposes toll. Since town no. $i$ is obviously one endpoint of this road, it is enough to tell what is the other endpoint. Thus if the town no. $i$ imposes toll on the road connecting it with the town no.$j$ , the line no. $(i+1)$ should contain the number $j$. If more than one solution exists, write out one chosen arbitrarily.\n",
    "samples": [
        [
            "4 5\n1 2\n2 3\n1 3\n3 4\n1 4",
            "TAK\n3\n3\n4\n1"
        ],
        [
            "4 3\n1 3\n3 4\n2 3",
            "NIE"
        ]
    ],
    "hint": "样例1：\n\n\n ![](https://cdn.luogu.com.cn/upload/pic/6984.png) \n\n样例2：\n\n![](https://cdn.luogu.com.cn/upload/pic/6985.png)\n",
    "translation": "### 题目描述\n\n给你 $n$ 个点和 $m$ 条双向边，问能否将其中的一些边改成有向边，使得只考虑有向边的情况下每个点的入度都为 $1$ 。\n\n### 输入格式\n\n第一行输入 $n,m(1≤n≤100000,1≤m≤200000)$ ，接下来 $m$ 行每行两个数 $a,b$ 表示点 $a$ 和点 $b$ 之间有一条双向边。输入保证没有重边与自环。\n\n### 输出格式\n\n若没有合法方案，输出 $\\verb!NIE!$，否则先在第一行输出 $\\verb!TAK!$，然后在第 $i+1$ 行输出点 $i$ 的入度是由哪个点出发的边所得到的。\n\n感谢@hdxrie 提供的翻译。"
}