{
    "description": "All the buildings in the east district of Byteburg were built    in accordance with the old arbitecture:\n\nthey stand next to each other with no spacing inbetween.\n\nTogether they form a very long chain of buildings of diverse    height, extending from east to west.\n\nThe mayor of Byteburg, Byteasar, has decided to have the north face    of the chain covered with posters.\n\nByteasar ponders over the minimum number of posters sufficient to    cover the whole north face.\n\nThe posters have rectangular shape with vertical and horizontal sides.\n\nThey cannot overlap, but may touch each other, i.e. have common points    on the sides.\n\nEvery poster has to entirely adjoin the walls of certain buildings    and the whole surface of the north face has to be covered.\n\nTask      Write a programme that:\n\nreads the description of buildings from the standard input,                      determines the minimum number of posters needed to entirely cover their north faces,                      writes out the outcome to the standard output.\n\nByteburg市东边的建筑都是以旧结构形式建造的:建筑互相紧挨着,之间没有空间.它们共同形成了一条长长的,从东向西延伸的建筑物链(建筑物的高度不一).Byteburg市的市长Byteasar,决定将这个建筑物链的一侧用海报覆盖住.并且想用最少的海报数量,海报是矩形的.海报与海报之间不能重叠,但是可以相互挨着(即它们具有公共边),每一个海报都必须贴近墙并且建筑物链的整个一侧必须被覆盖(意思是:海报需要将一侧全部覆盖,并且不能超出建筑物链)\n",
    "inputFormat": "The first line of the standard input contains one integer $n$ ($1\\le n\\le 250\\ 000$), denoting the number of buildings the chain      comprises of.\n\nEach of the following $n$ lines contains two integers $d_i$ and $w_i$ ($1\\le d_i,w_i\\le 1\\ 000\\ 000\\ 000$),      separated by a single space, denoting respectively the length and height      of the $i^{th}$ building in the row.\n\n第一行为一个整数n(1≤n≤250000),表示有n个建筑,接下来n行中,第i行表示第i个建筑物的宽di与高wi(1≤di,wi≤1 000 000 000),中间由一个空格隔开\n",
    "outputFormat": "The first and only line of the standard output should contain one integer,      the minimum number of rectangular posters that suffice to cover the north faces      of the buildings.\n\n第一个为一个整数,表示最少需要几张海报.\n",
    "samples": [
        [
            "5\n1 2\n1 3\n2 2\n2 5\n1 4",
            "4"
        ]
    ],
    "hint": "题目简述：N个矩形,排成一排. 现在希望用尽量少的矩形海报Cover住它们.\n\n感谢@\\_\\_乱世魇华 提供翻译\n"
}