{
    "description": "Mob feud rages in Equatorial Byteotia. The mob bosses have come to    the country's capital, Byteburg, to settle the dispute.\n\nNegotiations were very tense, and at one point the trigger-happy    participants drew their guns.\n\nEach participant aims at another with a pistol.\n\nShould they go on a killing spree, the shooting will go in    accordance with the following code of honour:\n\nthe participants shoot in a certain order, and at any moment        at most one of them is shooting,                  no shooter misses, his target dies instantly, hence he may not        shoot afterwards,                  everyone shoots once, provided he had not been shot before he has        a chance to shoot,                  no participant may change his first target of choice, even        if the target is already dead (then the shot causes no further        casualties).\n\nAn undertaker watches from afar, as he usually does. After all,    the mobsters have never failed to stimulate his business.\n\nHe sees potential profit in the shooting, but he would like    to know tight estimations. Precisely he would like to know the minimum    and maximum possible death rate.\n\nThe undertaker sees who aims at whom, but does not know the order of    shooting.\n\nYou are to write a programme that determines the numbers he is    so keen to know.\n\nTask      Write a programme that:\n\nreads from the standard input what target each mobster has          chosen,                        determines the minimum and maximum number of casualties,                      writes out the result to the standard output.\n\n有 $n$ 个参赛者，对于第 $i$ 个参赛者，他在初始时刻用手枪瞄准了一个参赛者 $\\mathit{aim}_i$，（$\\mathit{aim}_i$ 可以是 $i$）。然后他们按某个顺序开枪，且任意时刻只有一个人开枪。所以，对于不同的开枪顺序，最后被击中的人数也不同。\n\n你需要求出：在所有的开枪顺序中，最少和最多的被击中人数。",
    "inputFormat": "The first line of the standard input contains the number of participants ![](http://main.edu.pl/images/OI15/maf-en-tex.1.png) (![](http://main.edu.pl/images/OI15/maf-en-tex.2.png)).\n\nThey are numbered from ![](http://main.edu.pl/images/OI15/maf-en-tex.3.png) to ![](http://main.edu.pl/images/OI15/maf-en-tex.4.png).\n\nThe second line contains ![](http://main.edu.pl/images/OI15/maf-en-tex.5.png) integers ![](http://main.edu.pl/images/OI15/maf-en-tex.6.png),      separated by single spaces, ![](http://main.edu.pl/images/OI15/maf-en-tex.7.png).\n\n![](http://main.edu.pl/images/OI15/maf-en-tex.8.png) denotes the number of ![](http://main.edu.pl/images/OI15/maf-en-tex.9.png) participant's target.\n\nNote that it is possible that ![](http://main.edu.pl/images/OI15/maf-en-tex.10.png) for some ![](http://main.edu.pl/images/OI15/maf-en-tex.11.png) (the nerves, you      know).\n",
    "outputFormat": "Your programme should write out two integers separated by a single      space in the first and only line of the standard output. These numbers      should be, respectively, the minimum and maximum number of casualties resulting from the shooting.\n",
    "samples": [
        [
            "8\n2 3 2 2 6 7 8 5\n",
            "3 5\n"
        ]
    ],
    "hint": "对于 $100\\%$ 的数据，$1\\leq n \\leq 10^6$，$1\\leq \\mathit{aim}_i \\leq n$。"
}