{
    "description": "Byteasar works as a ticket inspector in a Byteotian National Railways (BNR)    express train that connects Byteburg with Bitwise.\\n\\nThe third stage of the BNR reform (The never ending saga of BNR reforms and the Bitwise hub was presented in the problems Railway from the third stage of XIV Polish OI and Station from the third stage of XV Polish OI. Their        knowledge, however, is not required at all in order to solve this        problem.) has begun. In particular, the salaries system has already been changed.\\n\\nFor example, to encourage Byteasar and other ticket inspectors to    efficient work,    their salaries now depend on the number of tickets (passengers) they    inspect. Byteasar is able to control all the passengers on the train in the    time between two successive stations, but he is not eager to waste his    energy in doing so. Eventually he decided he would check the tickets exactly    ![](//static.oiinhand.info/e8b9244e-111d-4c70-b92c-27c7eb2ad3ea) times per ride.\\n\\nBefore setting out, Byteasar is given a detailed summary from which he knows    exactly how many passengers will travel from each station to another. Based    on that he would like to choose the moments of control in such a way that    the number of passengers checked is maximal. Obviously, Byteasar is not    paid extra for checking someone multiple times - that would be pointless,    and would only disturb the passengers. Write a programme that will determine    for Byteasar when he should check the tickets in order to maximise his    revenue.\n\n有n个车站，现在有一辆火车从1到n驶过，给出aij代表从i站上车j站下车的人的个数。列车行驶过程中你有K次检票 机会，所有当前在车上的人会被检票，问最多能检多少个不同的人的票",
    "inputFormat": "第一行正整数 N K (1≤K＜N≤600， K≤50). 接下来N-1行，第i行第j个数描述第i站上，到第i+j站下的乘客个数。总乘客数≤2*10^9.\n\n\nIn the first line of the standard input two positive integers ![](//static.oiinhand.info/ebf0ddbd-25b7-4d57-a7d8-f4249875ecfb) and ![](//static.oiinhand.info/6bbc962a-864a-4aa1-92ee-2208897796f6)      (![](//static.oiinhand.info/fc29c6dd-d332-4f23-9b3b-57d4db55b499), ![](//static.oiinhand.info/c97105ae-4f4d-4b33-985d-93073d9bc3b4)) are given. These are separated by a      single space and denote, respectively, the number of stations en route and      the number of controls Byteasar intends to make. The stations are numbered      from ![](//static.oiinhand.info/7b3ac15c-c1b8-4712-8055-4e99c6294ede) to ![](//static.oiinhand.info/3c868316-1470-46ed-8e52-7c71cc795374) in the order of appearance on the route.\\n\\nIn the next ![](//static.oiinhand.info/4f2ef4f0-57f3-439e-a84a-d30841760f27) lines the summary on passengers is given. The ![](//static.oiinhand.info/c8c792f9-621d-42bc-bf2c-cb583d15ef55)-th      line contains information on the passengers who enter the train on the      station ![](//static.oiinhand.info/06e81d72-9c08-4b8d-8e81-397e135f43a8) - it is a sequence of",
    "outputFormat": "单调增的K个整数，用空格隔开，表示经过哪些站以后查票。\n\nYour programme should print out (in a single line) an increasing sequence      of ![](//static.oiinhand.info/2dc72628-e1ed-499a-b297-d5702c0f49a5) integers from the interval from ![](//static.oiinhand.info/1e182854-7dcc-424f-b38a-a4a9306eb0dc) to ![](//static.oiinhand.info/1ea486c6-05e1-41c0-93fb-c1423ad5ec0d) separated by single      spaces to the standard output. These numbers should be the numbers of      stations upon leaving which Byteasar should control the tickets.",
    "samples": [
        [
            "7 2\n2 1 8 2 1 0\n3 5 1 0 1\n3 1 2 2\n3 5 6\n3 2\n1\n",
            "2 5\n"
        ]
    ],
    "hint": ""
}