{
    "description": "Johny and Margaret are playing \"pebbles\".\n\nInitially there is a certain number of pebbles on a table, grouped in n piles.\n\n The piles are next to each other, forming a single row.\n\n The arrangement of stones satisfies an additional property that each pile consists of at least as many pebbles as the one to the left (with the obvious exception of the leftmost pile).\n\nThe players alternately remove any number of pebbles from a single pile of their choice.\n\nThey have to take care, though, not to make any pile smaller than the one left to it.\n\nIn other words, the piles have to satisfy the initial property after the move as well.\n\nWhen one of the players cannot make a move (i.e. before his move there are no more pebbles on the table), he loses.\n\nJohny always starts, to compensate for Margaret's mastery in this game.\n\nIn fact Margaret is so good that she always makes the best move, and wins the game whenever she has a chance.\n\nTherefore Johny asks your help - he would like to know if he stands a chance of beating Margaret with a particular initial arrangement.\n\nWrite a programme that determines answers to Johny's inquiries.\n\n有N堆石子，除了第一堆外，每堆石子个数都不少于前一堆的石子个数。两人轮流操作每次操作可以从一堆石子中移走任意多石子，但是要保证操作后仍然满足初始时的条件谁没有石子可移时输掉游戏。问先手是否必胜。\n",
    "inputFormat": "In the first line of the standard input there is a single integer u (1<=u<=10) denoting the number of initial pebble arrangements to analyse.\n\n\nThe following 2u lines contain descriptions of these arrangements; each one takes exactly two lines.\n\n\nThe first line of each description contains a single integer n,1<=n<=1000  - the number of piles.\n\n\nThe second line of description holds  non-negative integers  separated by single spaces and denoting the numbers of pebbles in successive piles, left to right.\n\n\nThese numbers satisfy the following inequality a1<=a2...<=an.\n\n\nThe total number of pebbles in any arrangement does not exceed 1000.\n\n多组输入，第一行一个整数u代表数据组数（1<=u<=10）\n\n\n接下来共2\\*u行，每两行代表一组数据：\n\n\n第一行只有一个整数n（1<=n<=1000），表示石子堆数；\n\n\n第二行有n个整数用空格隔开，第i个整数ai表示第i堆的石子个数，保证a1<=a2<=a3...<=an。\n\n\n对于每组数据，保证石子总数不超过10000。\n",
    "outputFormat": "Precisely ![](http://main.edu.pl/images/OI16/kam-en-tex.11.png) lines should be printed out on the standard output.\n\nThe ![](http://main.edu.pl/images/OI16/kam-en-tex.12.png)-th of these lines (for ![](http://main.edu.pl/images/OI16/kam-en-tex.13.png)) should hold the word TAK (yes in Polish), if Johny can win starting with the ![](http://main.edu.pl/images/OI16/kam-en-tex.14.png)-th initial arrangement given in the input, or the word NIE (no in Polish), if Johny is bound to lose that game, assuming optimal play of Margaret.\n\n输出u行，如果第i组数据先手必胜，输出“TAK”，否则输出“NIE”。\n",
    "samples": [
        [
            "2\n2\n2 2\n3\n1 2 4\n",
            "NIE\nTAK\n"
        ]
    ],
    "hint": ""
}