{
    "description": "King Byteasar faces a serious matter.\n\nTwo competing trade organisations, The Tailors Guild and The Sewers Guild asked,    at the same time, for permissions to open their offices in each town of the kingdom.\n\nThere are ![](http://main.edu.pl/images/OI17/gil-en-tex.1.png) towns in Byteotia.\n\nSome of them are connected with bidirectional roads.\n\nEach of the guilds postulate that every town should:\n\nhave an office of the guild, or           be directly connected to another town that does.\n\nThe king, however, suspects foul play. He fears that if there is just a single    town holding the offices of both guilds, it could lead to a clothing cartel.\n\nFor this reason he asks your help.\n\n\n给一张无向图，要求你用黑白灰给点染色，且满足对于任意一个黑点，至少有一个白点和他相邻；对于任意一个白点，至少有一个黑点与他相邻，对于任意一个灰点，至少同时有一个黑点和白点和灰点与他相邻，问能否成功\n",
    "inputFormat": "Two integers, n(<=200000) and m(<=500000),      are given in the first line of the standard input. These denote the number      of towns and roads in Byteotia, respectively.\n\nThe towns are numbered from 1 to n.\n\nThen the roads are given as follows: the input line no. i+1 describes      the i-th road;",
    "outputFormat": "Your program should print out one word in the first line of the standard output:\n\nTAK (yes in Polish) - if the offices can be placed in towns according to these rules, or      NIE (no in Polish) - in the opposite case.\n\nIf the answers is TAK, then the following nlines should give an      exemplary placement of the offices. Thus the line no. i+1 should hold:\n\nthe letter K if there should be an office of The Tailors Guild in the town i, or the letter S if there should be an office of The Sewers Guild in the town i, or                      the letter N if there should be no office in the town i.\n",
    "samples": [
        [
            "7 8\n1 2\n3 4\n5 4\n6 4\n7 4\n5 6\n5 7\n6 7",
            "TAK\nK\nS\nK\nS\nK\nK\nN"
        ]
    ],
    "hint": "题目spj贡献者@mengbierr"
}