{
    "description": "Byteasar is the king of Byteotia, an island in The Ocean of Happiness.\n\nThe island is a convex shape, and all the towns of Byteotia are located on the shore.\n\nOne of these towns is Byteburg, the famous capital of Byteotia.\n\nEvery pair of towns is connected by a road that goes along the line segment between the towns.\n\nSome roads that connect different pairs of towns intersect - there is a crossroad at each such intersection.\n\nBitratio, Byteasar's rival to the throne, had hatched a sordid plot.\n\nWhile Byteasar was travelling from the capital to an adjacent town, Bitratio's people seized Byteburg.\n\nNow Byteasar has to return to Byteburg as soon as possible in order to restore his rule.\n\nUnfortunately, some of the roads are controlled by Bitratio's guerrilla.\n\nByteasar cannot risk the use of such roads, he can however cross them at the crossroads.\n\nNeedless to say, he has to travel along the roads and hence turn only at the crossroads, for otherwise the journey would take far too long.\n\nByteasar's loyal servants have informed him which roads are safe.\n\nByteasar believes your loyalty, and thus entrusts you with a task to find the shortest safe route from the town he is currently in to Byteburg.\n\nByteotia岛屿是一个凸多边形。城市全都在海岸上。按顺时针编号1到n。任意两个城市之间都有一条笔直的道路相连。道路相交处可以自由穿行。有一些道路被游击队控制了，不能走，但是可以经过这条道路与未被控制的道路的交点。问从城市1到n的最短距离。\n",
    "inputFormat": "In the first line of the standard input two integers ![](http://main.edu.pl/images/OI16/wsp-en-tex.1.png) and ![](http://main.edu.pl/images/OI16/wsp-en-tex.2.png) are given     (![](http://main.edu.pl/images/OI16/wsp-en-tex.3.png), ![](http://main.edu.pl/images/OI16/wsp-en-tex.4.png)),     separated by a single space,     that denote respectively: the number of towns and      the number of roads controlled by Bitratio's guerrilla.\n\nLet us number the towns from ![](http://main.edu.pl/images/OI16/wsp-en-tex.5.png) to ![](http://main.edu.pl/images/OI16/wsp-en-tex.6.png) starting from Byteburg      and moving clockwise along the shore.\n\nBytesar is currently in the town no. ![](http://main.edu.pl/images/OI16/wsp-en-tex.7.png).\n\nEach of the following ![](http://main.edu.pl/images/OI16/wsp-en-tex.8.png) lines holds a pair of integers ![](http://main.edu.pl/images/OI16/wsp-en-tex.9.png) and ![](http://main.edu.pl/images/OI16/wsp-en-tex.10.png)      (![](http://main.edu.pl/images/O…\n",
    "outputFormat": "Your programme is to print out one floating point number     to the standard output:\n\nthe length of the shortest safe route leading from the town no. ![](http://main.edu.pl/images/OI16/wsp-en-tex.19.png)     to Byteburg.\n\nThe absolute difference between the number returned and the correct one  has to be at most ![](http://main.edu.pl/images/OI16/wsp-en-tex.20.png).\n",
    "samples": [
        [
            "6 9\n-12 -10\n-11 6\n-4 12\n6 14\n16 6\n18 -2\n3 4\n1 5\n2 6\n2 3\n4 5\n3 5\n1 3\n3 6\n1 6\n",
            "42.0000000000\n"
        ]
    ],
    "hint": "spj-",
    "translation": "### 题目大意\n\nByteotia岛屿是一个凸多边形,城市全都在海岸上,按顺时针编号  $1$ 到  $n$ 。\n\n任意两个城市之间都有一条笔直的道路相连。道路相交处可以自由穿行。\n\n有一些道路被游击队控制了，不能走，但是可以经过这条道路与未被控制的道路的交点。\n\n问从城市  $1$ 到  $n$ 的最短距离。\n\n### 输入格式\n\n第一行两个正整数  $n$ 和  $m$ 表示城市数和被控制的道路数。\n\n接下来  $n$ 行，每行两个整数  $x,y$ 表示每个城市的坐标。\n\n接下来  $m$ 行，每行两个整数  $u,v$ 。表示城市  $u$ 和  $v$ 之间的道路不能走，数据保证有解。\n\n### 输入格式\n\n输出一个实数，表示从  $1$ 到  $n$ 最短道路距离，误差在  $10^{-5}$ 以内均算正确。\n\n### 数据范围和提示\n\n $3 \\le n \\le 10^5,1 \\le m \\le 10^6,|x|,|y| \\le 10^6$\n\nby Rainy7 & Piwry"
}