{
    "description": "Byteasar bought his son Bytie a set of blocks numbered from $1$ to $n$ and arranged them in a row in a certain order.\n\nBytie's goal is to rearrange the blocks so that they are ordered naturally, from the smallest number to the largest.\n\nHowever, the only moves Bytie is allowed to make are:\n\nputting the last block at the very beginning (move a), and                  putting the third block at the very beginning (move b).\n\nHelp Bytie by writing a program that tells whether a given arrangement of    blocks can be properly reordered, and tells the right sequence of moves if it is.\n\n有一个1..n的排列，有两种操作：\n\n(a) 将最后一个数移到最前面 \n\n(b) 把第三个数移到最前面 \n\n我们将连续进行k次同一个操作称为“一块操作”，表示为ka或kb。\n\n找到一个操作序列使得进行这些操作后，排列变为1,2,3,…,n。\n\n无解的话输出“NIE”\n",
    "inputFormat": "In the first line of the standard input there is a single integer $n$, $1\\le n\\le 2\\ 000$.\n\nIn the second line there are $n$ integers from the range $1$ to $n$, separated by single spaces.\n\nNo number appears twice, and thus they represent the initial arrangement of the blocks.\n",
    "outputFormat": "If there is no sequence of moves leading to an arrangement with increasing blocks' numbers, your program should print out \"NIE DA SIE\" (there is no way in Polish), without the quotation marks.\n\nOtherwise there should be a single integer $m$ ($m\\le n^2$), denoting the number of operations, in the first line.\n\nAn operation is a $k$-fold execution of either a or b move.\n\nIf $m>0$, then there should be a sequence of $m$ integers with either a or b appended in the second line.\n\nThus $k$a (for $0<k<n$) denotes the $k$-fold execution of the move a.\n\nAnalogously, $k$b (for $0<k<n$) denotes the $k$-fold execution of the move b.\n\nFurthermore, the characters appended to the numbers in the second line have to alternate.\n\nShould there be more than one solution, your program is free to pick one arbitrarily.\n",
    "samples": [
        [
            "4\n1 3 2 4",
            "4\n3a 2b 2a 2b"
        ]
    ],
    "hint": "有一个1..n的排列，有两种操作：\n\n(a) 将最后一个数移到最前面 \n\n(b) 把第三个数移到最前面 \n\n我们将连续进行k次同一个操作称为“一块操作”，表示为ka或kb。\n\n找到一个操作序列使得进行这些操作后，排列变为1,2,3,…,n。\n\n感谢cn：苏卿念 提供spj\n"
}