{
    "description": "```plain\nByteasar intends to throw up a party.\n```\nNaturally, he would like it to be a success.  Furthermore, Byteasar is quite certain that to make it so it suffices if all invited guests  know each other.  He is currently trying to come up with a list of his friends he would like to invite.\n\nByteasar has $n$ friends, where $n$ is divisible by 3.\n\n```plain\nFortunately, most of Byteasar's friends know one another.\n```\nFurthermore, Byteasar recalls that he once attended a party where there were $\\frac{2}{3}n$ of his friends, and where everyone knew everyone else.\n\nUnfortunately, Byteasar does not quite remember anything else from that    party.\n\n\nIn particular, he has no idea which of his friends attended it.\n\nByteasar does not feel obliged to throw a huge party, but he would like to    invite at least \\frac{n}{3} of his friends.\n\n\n\nHe has no idea how to choose them, so he asks you for help.\n\n给定一张n个点m条边的图$n\\equiv 0(mod\\ 3)$，保证存在一个大小为$\\frac{2}{3}n$的团，要求输出一个大小为$\\frac{n}{3}$的团\n",
    "inputFormat": "In the first line of the standard input two integers, $n$ and $m$ ($3\\le n\\le 3\\ 000$, $\\frac{\\frac{2}{3}n(\\frac{2}{3}n-1)}{2}\\leq m\\leq \\frac{n(n-1)}{2}$), are given,separated by a single space.  These denote the number of Byteasar's friends and the number of pairs of his friends who know each other, respectively.\n\nByteasar's friends are numbered from 1 to $n$.\n\nEach of the following $m$ lines holds two integers separated by a single      space.\n\nThe numbers in line no. $i+1$ (for $i=1,2,...,m$) are $a_i$ and $b_i$($1\\le a_i<b_i\\le n$), separated by a single space, which denote that the persons $a_i$ and $b_i$ know each other. Every pair of numbers appears at most once on the input.\n",
    "outputFormat": "In the first and only line of the standard output your program should      print $\\frac{n}{3}$ numbers, separated by single spaces, in increasing      order.  These number should specify the numbers of Byteasar's friends whom      he should invite to the party.  As there are multiple solutions, pick one      arbitrarily.\n",
    "samples": [
        [
            "6 10\n2 5\n1 4\n1 5\n2 4\n1 3\n4 5\n4 6\n3 5\n3 4\n3 6",
            "2 4"
        ]
    ],
    "hint": "给定一张n个点m条边的图$n\\equiv 0(mod\\ 3)$，保证存在一个大小为$\\frac{2}{3}n$的团，要求输出一个大小为$\\frac{n}{3}$的团\n\n样例图：\n\n\n![](http://main.edu.pl/images/OI18/impzad1.gif)\n\n由@zhouyonglong提供SPJ\n"
}