{
    "description": "Bartie and his friends compete in the Team Programming Contest.\n\nThere are $n$ contestants on each team, and each team has access to $n$ computers.\n\nThe contest lasts $t$ minutes, during which the contestants are to solve $m$ programming problems.\n\nFurthermore, penalties are imposed on the teams: solving a problem $s$ minutes since the beginning of the contest amounts to $s$ penal points.\n\nThe team that solved the most problems wins the contest, with ties broken in    favour of the team with smaller penalty.\n\nOn the contest day Bartie quickly glances over the problem statements and    distributes them among his teammates.\n\nHe knows his team so well that he can exactly assess who is able to solve    which problem.\n\nSolving any problem takes any contestant that is able to solve it exactly $r$ minutes of using the computer.\n\nBartie's team did not fare well in this year's contest.\n\nBartie is obsessed with the thought that it might be his fault, due to wrong    decisions regarding the distribution of problems.\n\nHe asks you to write a program that, given what Bartie knew at the beginning    of the contest, determines the best possible result of Bytie's team, together    with the assignment of problems to team members that attains the result.\n\nn个人m个题目，每个题要r分钟完成。比赛有t分钟。给出每个人会做哪些题目，请你安排一个每个人在什么时候做什么题目，使得做出来的题目数最多。在做题数一样多的情况下，罚时尽量小。\n",
    "inputFormat": "Five integers $n$, $m$, $r$, $t$, and $k$ ($1\\le n,m\\le 500$, $1\\le r,t\\le 1\\ 000\\ 000$) are given in the first line of the standard input, separated by single spaces.\n\nThese denote, respectively:\n\nthe number of contestants on a team, the number of problems, the time it      takes a contestant to solve a problem, the duration of the contest,and the number of contestant-problem pairs given on the input.\n\nEach of the following $k$ lines holds two integers $a$ and $b$($1\\le a\\le n$,$1\\le b\\le m$), separated by a single space, denoting that the contestant $a$ is able to solve the problem $b$.Each such pair appears at most once in the input.\n\nIn tests worth at least 30% of the points it additionally holds that $n,m\\le 100$.\n",
    "outputFormat": "In the first line of the standard output the best possible result of Bytie's      team should be printed as two numbers separated by a single space:\n\nthe number of solved problems $z$ and the total penal points.\n\nAn exemplary assignment of problems that attains this result should be given in the following $z$ lines.\n\nEach of those should hold three integers $a$, $b$ and $c$ ($1\\le a\\le n$,$1\\le b\\le m$, $0\\le c\\le t-r$),separated by single spaces, signifying that the contestant $a$ should start solving the problem $b$ at time $c$(the contest starts at time $0$).No contestant should be assigned a problem that they cannot solve. If more that one optimal assignment exists, your program can output any of them.\n",
    "samples": [
        [
            "2 4 3 15 4\n1 1\n2 3\n1 4\n1 3",
            "3 12\n1 4 0\n2 3 0\n1 1 3"
        ]
    ],
    "hint": "n个人m个题目，每个题要r分钟完成。比赛有t分钟。给出每个人会做哪些题目，请你安排一个每个人在什么时候做什么题目，使得做出来的题目数最多。在做题数一样多的情况下，罚时尽量小。\n"
}