{
    "description": "Little Johnny was given a birthday present by his grandparents.\n\nThis present is a box of sticks of various lengths and colours.\n\nJohnny wonders if there are three sticks in the set he has been given    that would form a triangle with different-coloured sides.\n\nLet us note that Johnny is interested in non-degenerate triangles only, i.e.,    those with positive area.\n\n给你每根木棍的长度和颜色，求一个能拼成三角形且木棍颜色互不相同的方案\n",
    "inputFormat": "In the first line of the standard input an integer $k$ ($3\\le k\\le 50$) is given, which is the number of different colours of sticks.\n\nThe colours themselves are numbered from $1$ to $k$.\n\nThe following $k$ lines contain descriptions of the sticks of particular      colours.\n\nThe line no. $i+1$ holds integers that describe the sticks of colour $i$,separated by single spaces.\n\nThe first of these numbers, $n_i$ ($1\\le n_i\\le 1\\ 000\\ 000$), denotes the number of sticks of colour $i$.\n\nIt is followed, in the same line, by $n_i$ integers denoting the lengths of the sticks of colour $i$.All lengths are positive and do not exceed $1\\ 000\\ 000\\ 000$.Furthermore, the total number of all sticks does not exceed $1\\ 000\\ 000$.\n",
    "outputFormat": "Your program should print (on the first and only line of the standard output) either:\n\nsix integers, separated by single spaces, that describe the construction          of a triangle with different-coloured sides as follows:\n\nthe colour and the length of the first stick, the colour and the length          of the second stick, and the colour and the length of the third stick,                      or the word NIE (Polish for no) if no such triple of          sticks exists.\n\nIf there are multiple triples of different-coloured sticks that give rise      to a triangle, your program may pick one such triple arbitrarily.\n",
    "samples": [
        [
            "4\n1 42\n2 6 9\n3 8 4 8\n1 12",
            "3 8 4 12 2 9"
        ]
    ],
    "hint": "给你每根木棍的长度和颜色，求一个能拼成三角形且木棍颜色互不相同的方案\n\n由@zhouyonglong提供SPJ\n"
}