{
    "description": "The annual rich citizen's reunion is taking place in Byteotia.\n\nThey meet to boast about their incomes, Lebytene's shoes and other luxuries.\n\nNaturally, not all these objects of pride are carried into the banquet - coats,  jackets, umbrellas and such are left in the cloakroom, and picked up upon leave.\n\nUnfortunately for the well off, a gang of Byteotian thieves plans to break into  the cloakroom and steal part of the items stored therein.\n\nAt this very moment the gang's leader is examining the plans of the robbery put  forward by other gang members (they are a democratic lot!).\n\nA plan typically looks as follows: the thieves break into the cloakroom at time $m_j$,  take items worth exactly $k_j$ and escape, where the whole heist takes them $s_j$ time.\n\nThe gang leader would first of all like to know which of these plans are feasible and which are not.\n\nA plan is feasible if at time $m_j$ it is possible to collect items of total value $k_j$ in such a way  that up to the very $m_j+s_j$ moment no one shows up to retrieve any of the stolen goods  (in such event, they would notify security, and the robbery would fail).\n\nIn particular, if at time $m_j$ it is impossible to select items of exact total worth $k_j$,  then the plan is infeasible and consequently rejected.\n\nKnowing the drop off and retrieval times for each item, determine which plans are feasible and which are not.\n\nWe assume that an item left in the cloakroom the moment a robbery starts can already be stolen (see the example).\n",
    "inputFormat": "In the first line of the standard input there is a single integer $n$($1\\le n\\le 1\\ 000$) denoting the number of items that will be left in the cloakroom.\n\nThose items are described in the $n$ lines that follow.\n\nEach of those lines consists of three integers $c_i$, $a_i$, and $b_i$ ($1\\le c_i\\le 1\\ 000$, $1\\le a_i<b_i\\le 10^9$),  separated by single spaces, that denote respectively: the item's value, the moment it is left in the cloakroom,  and the moment it will be retrieved by the owner.\n\nThe next line holds an integer $p$ ($1\\le p\\le 1\\ 000\\ 000$),the number of plans the gang came up with. Each is specified in a separate line by three integers,$m_j$,$k_j$ and $s_j$($1\\le m_j\\le 10^9$,$1\\le k_j\\le 100\\ 000$,$0\\le s_j\\le 10^9$), separated by single spaces, that denote respectively: the moment the thieves would enter the cloakroom, the value of goods they would like to steal, and the time the robbery would take them.\n\nIn test worth 16% of the total points $p\\le 10$ holds in addition.\n\nn some other tests, also worth 16% of the points, all the items have the same $a_i$ values.\n\nIn yet other tests, worth 24% of the points, all the queries share the same $s_j$ value.\n",
    "outputFormat": "For each plan put forward by the gang determine if it is feasible, i.e., whether it is possible  to steal items of total worth exactly $k_j$ and escape before anyone asks for their belongings.\n\nIf the plan is feasible, your program should print the word TAK (Polish for yes) on the  standard output, otherwise it should print NIE (Polish for no).\n",
    "samples": [
        [
            "5\n6 2 7\n5 4 9\n1 2 4\n2 5 8\n1 3 9\n5\n2 7 1\n2 7 2\n3 2 0\n5 7 2\n4 1 5",
            "TAK\nNIE\nTAK\nTAK\nNIE"
        ]
    ],
    "hint": "",
    "translation": "\n有 $n$ 件物品，每件物品有三个属性 $a_i, b_i, c_i\\ (a_i<b_i)$。\n\n再给出 $q$ 个询问，每个询问由非负整数 $m, k, s$ 组成，问是否能够选出某些物品使得：\n\n1. 对于每个选的物品 $i$，满足 $a_i\\le m$ 且 $b_i>m+s$。\n2. 所有选出物品的 $c_i$ 的和正好是 $k$。\n"
}