{
    "description": "Byteasar has set off on a journey along the Dry River, which crosses the Byteotian Desert.\n\nUnfortunately, the Dry River has dried out, and Byteasar has run out of water.\n\nHis only hope is to dig a deep enough well in the dried river bed.\n\nRealising the graveness of his situation, Byteasar decides to plan everything carefully before he actually starts digging.\n\nThe danger is that he drains his strength before he reaches the water level - in such case he is unlikely to survive.\n\nHe managed to determine the depth of the water level.  He also knows how much he can dig before losing strength.\n\nHis only worry is a possible landslide, which might bury him alive.\n\nHe sends you (via a satellite telephone) a topographic map of the river bed.\n\nAnd, of course, he asks you to help him determine where he should dig so that he reaches water before draining his strength    while keeping the slope of his excavation as gentle as possible.\n\nHe is waiting for your advice!\n\n",
    "inputFormat": "In the first line of the standard input two positive integers are given, $n$ and $m$ ($1\\le n\\le 1\\ 000\\ 000$, $1\\le m\\le 10^{18}$), separated by a single space.\n\nThe second line holds $n$ positive integers $x_1,x_2,\\cdots,x_n$ ($1\\le x_i\\le 10^9$), also separated by single spaces.\n\nByteasar has enough energy to perform $m$ swings of the shovel.\n\nThe numbers $x_1,x_2,\\cdots,x_n$ describe the topography of the Dry River's bed.\n\nThey represent the depth of the sand layer above the ground water level in successive one meter spaced spots along the river bed.\n\nWith a single swing of the shovel Byteasar can extract an amount of the sand that decreases any of the numbers $x_i$ by 1.If any of these numbers, say $x_k$, drops to 0, this means that Byteasar has dug down to the water. But Byteasar has a secondary goal as well. He wants the following number $z$, characterising the slope of the sand hill, minimised:\n\n$z=max_{i=1,2,\\cdots,n-1}|x_i-x_{i+1}|$\nIf there are multiple correct values of the number $k$,representing the spot where Byteasar is to dig down to reach the water, your program can pick one arbitrarily. The spots $1,2,\\cdots,n$ are the only ones suitable for digging - elsewhere there is rock rather than sand. You may assume that Byteasar has enough energy to reach water at one of the spots.\n",
    "outputFormat": "Your program should print two integers to the standard output, separated by a single space:\n\nthe spot $k$, where Byteasar should dig for water, and the minimum value of the number $z$.\n",
    "samples": [
        [
            "16 15\n8 7 6 5 5 5 5 5 6 6 7 8 9 7 5 5",
            "1 2"
        ]
    ],
    "hint": "",
    "translation": "给定一个非负整数序列 $A$，每次操作可以选择一个数然后减掉 $1$，要求进行不超过 $m$ 次操作使得存在一个 $A_k=0$ 且 $\\max(|x_i-x_{i-1}|)$ 最小，输出使其最小的 $k$ 与这个最小值。\n"
}