{
    "description": "Young Bytensson loves to hang out in the port tavern, where he often    listens to the sea dogs telling their tales of seafaring.\n\nInitially, he believed them all, however incredible they sounded.\n\nOver time though, he became suspicious.\n\nHe has decided to write a program that will verify if there may be    any grain of truth in those tall stories.\n\nBytensson reasoned that while he cannot tell if the sailors indeed    weathered all those storms, he can at least find out if their travel    itineraries make sense.\n\nThis is a task for a programmer, which Bytensson, unfortunately, is not.\n\nHelp him out!\n\nThere are $n$ ports and $m$ waterways connecting them in the waters    frequented by the sailors Bytensson listened to.\n\nIf there is a waterway between two ports, then sailing from one to the    other is possible.  Any waterway can be sailed in both    directions.\n\nBytensson got to know $k$ seafaring tales.\n\nEach tells of a sailor who began his journey in one port,    sailed a number of waterways, and ended up in another port,    which may have been the one he initially set sail from.\n\nThe sailor in question may have sailed through the same waterway    many times, each time in any direction.\n\n给n个点m条边无向图，每次询问两个点之间是否有长度为d的路径（不一定是简单路径）\n",
    "inputFormat": "In the first line of the standard input, there are three integers, $n$,$m$ and $k$ ($2\\le n\\le 5\\ 000$, $1\\le m\\le 5\\ 000$, $1\\le k\\le 1\\ 000\\ 000$).\n\nThese denote, respectively: the number of ports in the waters      frequented by the sailors who told Bytensson their stories,the number of waterways, and the number of tales.\n\nThe $m$ lines that follow specify the waterways.\n\nA single waterway's description consists of a single line that contains two integers, $a$ and $b$ ($1\\le a,b\\le n$,$a\\ne b$), separated by a single space; these specify the numbers of ports at the two ends of this particular waterway.\n\nThe $k$ lines that follow specify the tales that Bytensson has heard. A single tale's description consists of a single line with three integers,$s$,$t$,and $d$ ($1\\le s,t\\le n$,$1\\le d\\le 1\\ 000\\ 000\\ 000$ ), separated by single spaces. These indicate that the tale's protagonist set sail from port no. $s$ , ended the journey in port no. $t$ , and sailed exactly $d$ times through various waterways.\n",
    "outputFormat": "Your program should print exactly $k$ lines to the standard output; the $i$-th of them should contain the word TAK (Polish for yes) if the journey described in the $i$-th tale(in input order) could have taken place.\n\nIf it could not, then the line should contain the word NIE (Polish for no).\n",
    "samples": [
        [
            "8 7 4\n1 2\n2 3\n3 4\n5 6\n6 7\n7 8\n8 5\n2 3 1\n1 4 1\n5 5 8\n1 8 10\n",
            "TAK\nNIE\nTAK\nNIE\n"
        ]
    ],
    "hint": "给n个点m条边无向图，每次询问两个点之间是否有长度为d的路径（不一定是简单路径）\n"
}