{
    "description": "Bytie is playing the computer game Tower Defense.\n\nHis aim is to construct guard towers, so that they protect all of his domain.\n\nThere are multiple towns in Bytie's domain, some of which are linked by  bidirectional roads.\n\nIf Bytie erects a guard tower in a city, then the tower protects its city and  all the cities directly linked with it by roads.\n\nJust as Bytie was pondering over the placement of guard towers in his domain,  his elder sister Bytea entered the room.  She glanced at the map displayed on  the screen, and after a moment exclaimed:\n\n\"Oi, what is there to think about, clearly $k$ towers suffice!\".\n\nAngered by his sister spoiling the fun, Bytie showed his sister the door,  and began wondering what to do next.\n\nPride will not let him construct more than $k$ towers.\n\nHe has an up his sleeve though:\n\nhe can research a technology that will allow him to construct improved guard towers.\n\nAn improved guard tower protects not only the town it was erected in and its  immediate neighbors but also the towns that are further away.\n\nFormally, an improved guard tower built in the town $u$ protects the town $v$ if either of the following holds:\n\n- $u=v$;\n\n- there is a direct road from $u$ to $v$;\n\n- or there is such a town $w$ that there are direct roads from $u$ to $w$ and from $w$ to $v$.\n\nOf course, Bytie still strives to erect at most $k$ towers,  but he has no qualms about making these the improved guard towers.\n\n有一个n个点m条边的图，每条边距离是1，已知用k个攻击距离为1的塔可以打到整个地图，让构造一个方案使得用小于等于k个攻击距离为2的塔打到整个地图\n",
    "inputFormat": "In the first line of the standard input, there are three integers,  $n$, $m$, and $k$ ($2\\le n\\le 500\\ 000$,  $0\\le m\\le 1\\ 000\\ 000$, $1\\le k\\le n$), separated by single spaces,  that specify, respectively, the number of towns and roads in Bytie's domain,  and the number $k$ given by Bytea.\n\nThe towns in Bytie's domain are numbered from 1 to $n$.\n\nNext,$m$ lines describing the roads follow.\n\nEach of those lines holds two integers, $a_i$ and $b_i$ ($1\\le a_i,b_i\\le n$,$a_i\\ne b_i$), indicating that the towns no. $a_i$ and $b_i$ are directly linked by a bidirectional road. Each pair of towns is linked by at most a single road.\n",
    "outputFormat": "Your program is to print two lines, describing the placement of improved  guard towers in Bytie's domain, to the standard output.\n\nThe first line is to hold an integer $r$ ($1\\le r\\le k$), the number of  improved guard towers that Bytie should construct.\n\nThe second line is to specify the placement of these by providing $r$ pairwise disjoint integers that are the numbers of town where the improved  guard towers are to be built.\n\nThe town numbers can be given in an arbitrary order.\n\nIf more than one solution exists, any solution can be printed.\n\nLet us remind that any placement of no more than $k$ improved towers will do  - you need not minimize their number.\n\nYou may assume that Bytea was correct, i.e., that the whole domain of Bytie  can indeed be protected by $k$ plain (not improved) guard towers. Thus a solution always exists.\n",
    "samples": [
        [
            "9 8 3\n1 2\n2 3\n3 4\n1 4\n3 5\n4 6\n7 8\n8 9\n",
            "3\n1 5 7 \n"
        ]
    ],
    "hint": "有一个n个点m条边的图，每条边距离是1，已知用k个攻击距离为1的塔可以打到整个地图，让构造一个方案使得用小于等于k个攻击距离为2的塔打到整个地图\n"
}