{
    "description": "The names of towns in Byteotia are unique sequences of exactly $n$ bits.\n\nThere are $2^n-k$ towns in Byteotia, and thus,only $k$ sequences of $n$ bits do not correspond to any town.\n\nSome pairs of towns are connected with roads.\n\nSpecifically, two towns are directly linked by a road if and only if their names differ in a single bit.\n\nThe roads do not cross outside of towns.\n\nByteasar intends to take a stroll - he intends to walk from the town $x$ to the town $y$, taking the existing roads.\n\nYour task is to write a program that will determine if such a walk is possible.\n\n有2^n个长度为n的01串，两个01串之间有边当且仅当这两个01串只有一位不同，现在从这2n个串中拿掉k个，问指定两个串之间能否到达\n",
    "inputFormat": "In the first line of the standard input, there are two integers,$n$ and $k$($1\\le n\\le 60$, $0\\le k\\le 1\\ 000\\ 000$, $k\\le 2^n-1$, $n\\times k\\le 5\\ 000\\ 000$),      separated by a single space.\n\nThese are the length of town names in bits and the the number of $n$-bit sequences that do not correspond to any town, respectively.\n\nIn the second line, there are two strings, separated by a single space,      each consisting of $n$ characters 0 and/or 1.\n\nThese are the names of the towns $x$ and $y$.\n\nIn the $k$ lines that follow, all the sequences of $n$ bits that do not correspond to any town are given, one sequence per line.In the $k$ lines that follow, all the sequences of $n$ bits that do not correspond to any town are given, one sequence per line.Each such sequence is a string of $n$ characters 0 and/or 1.You may assume that $x$ and $y$ are not among those $k$ sequences.\n",
    "outputFormat": "Your program should print to the standard output the word TAK (Polish for yes) if walking from the town x to the town y is possible, and the word NIE (Polish for no) otherwise.\n",
    "samples": [
        [
            "4 6\n0000 1011\n0110\n0111\n0011\n1101\n1010\n1001\n",
            "TAK\n"
        ]
    ],
    "hint": "有2^n个长度为n的01串，两个01串之间有边当且仅当这两个01串只有一位不同，现在从这2n个串中拿掉k个，问指定两个串之间能否到达\n"
}