{
    "description": "Note:\nDuring the contest, you can ask for the score of three arbitrarily chosen submissions for this problem.\n\nByteasar read an interesting story recently.\n\nIts protagonist was some Greek crown princewho defeated a monster with a wool yarn,or something like that.\n\nBut something else fascinated Byteasar about the story.\n\nWhat he liked most was the fact that the climax took place in a maze.\n\nFrom then on Byteasar is crazy about mazes.\n\nByteasar sketches mazes on a squared sheet of paper.\n\nEach sketch is a polygon with sides (representing the walls of the maze)parallel to either of the sheet's edges (i.e., the axes of the Carthesiancoordinate system), and every two successive sides are perpendicular.\n\nByteasar observed that if the entrance is placed on one of the sides of sucha maze, then one can traverse the whole maze and return to the entrance byalways keeping the right hand to the wall as one goes.\n\nMoreover, throughout the maze traversal we can note the turns we take.\n\nWe shall write the letter L if we turn left when we move alongone wall to another, and P if we turn right in such case.\n\nByteasar wonders for which words composed of the letters L and Pthere exists a maze whose traversal results in writing this very word.\n\n用L和P描述一个边与坐标轴平行的简单多边形，其中L表示往左拐，P表示往右拐。给定L，P的描述，请输出这个多边形。\n",
    "inputFormat": "The first line of the standard input gives a single ![](http://main.edu.pl/images/OI20/lab-en-tex.1.png)-letter word(![](http://main.edu.pl/images/OI20/lab-en-tex.2.png))composed of the letters L and P, describingthe sequence of successive turns made during the maze's traversal.\n\nIn tests worth 50% of the total points an additional constraint ![](http://main.edu.pl/images/OI20/lab-en-tex.3.png) holds.\n",
    "outputFormat": "If no maze corresponds to the description given as input,then the word NIE (Polish for no) is to be printedon the standard output.\n\nOtherwise, exactly ![](http://main.edu.pl/images/OI20/lab-en-tex.4.png) lines should be printed, specifying any maze(consistent with the input) as follows.\n\nThe ![](http://main.edu.pl/images/OI20/lab-en-tex.5.png)-th of these lines is to hold two integers, ![](http://main.edu.pl/images/OI20/lab-en-tex.6.png) and ![](http://main.edu.pl/images/OI20/lab-en-tex.7.png)(![](http://main.edu.pl/images/OI20/lab-en-tex.8.png)), separated by a single space,that are the coordinates of the ![](http://main.edu.pl/images/OI20/lab-en-tex.9.png)-th vertex of the maze's sketch.\n\nThe vertices are to be printed in their counterclockwise order on the polygon's perimeter;an arbitrary vertex can be chosen as the first one, and the position of the entrance need not be indicated.\n",
    "samples": [
        [
            "LLLLPPLL\n",
            "0 0\n2 0\n2 2\n-1 2\n-1 -2\n1 -2\n1 -1\n0 -1\n"
        ]
    ],
    "hint": "用L和P描述一个边与坐标轴平行的简单多边形，其中L表示往左拐，P表示往右拐。给定L，P的描述，请输出这个多边形。\n"
}