{
    "description": "Little Edna has received the take-out game as a present.\n\nTake-out is a single player game, in which the player is given a sequence of $n$ adjacent blocks, numbered from $1$ to $n$.\n\nEach block is either black or white, and there are $k$ times as many white    blocks as there are black ones.\n\nThe player's goal is to remove all the blocks by certain permissible moves.\n\nA single move consists in removing exactly $k$ white blocks and a single    black block without changing the positions of other blocks.\n\nThe move is permissible if there is no \"gap\" (a space left by    a previously taken out block) between any two blocks being removed.\n\nHelp poor little Edna in finding any sequence of permissible moves that    remove all the blocks.\n\n有n块砖，其中白色是黑色的k倍，求一个消除序列，满足以下条件：\n\n每次消除k+1个砖，其中k块白色，1块黑色，并且这k+1块砖从开始到结束，中间不能路过已经消除过的砖\n\n数据保证有解\n",
    "inputFormat": "In the first line of the standard input there are two integers, $n$ and $k$ ($2\\le n\\le 1\\ 000\\ 000$, $1\\le k\\le n-1$), separated by a single space, that denote the total number of blocks used in the gameand the number of white blocks per black node (to be removed in every move).  In all the tests the condition $k+1|n$ holds.\n\nIn the second line there is a string of $n$ letters b      or c.  These tell the colours of successive blocks (in Polish):\n\nb (for biały) - white, c (for czarny)      - black.  You may assume that in all the tests there exists a sequence      of permissible moves that takes out all the blocks.\n",
    "outputFormat": "Your program should print $\\frac{n}{k+1}$ lines to the standard output.\n\nSuccessive lines should describe successive moves.\n\nEach line should contain $k+1$ integers, in increasing order,separated by single spaces, that denote the numbers of blocks to be removed in the move.\n",
    "samples": [
        [
            "12 2\nccbcbbbbbbcb\n",
            "1 8 12\n2 6 7\n3 4 5\n9 10 11\n"
        ]
    ],
    "hint": "有n块砖，其中白色是黑色的k倍，求一个消除序列，满足以下条件：\n\n每次消除k+1个砖，其中k块白色，1块黑色，并且这k+1块砖从开始到结束，中间不能路过已经消除过的砖\n\n数据保证有解\n\n\n返回`TAT1`：同一个位置输出$2$次\n\n返回`TAT2`：输出的$k+1$个位置不满足白色是黑色$k$倍\n\n返回`TAT3`：未按照升序输出或者中间路过已经消除的砖\n\nSPJ provided by @colazcy"
}