{
    "description": "In the Byteotian Line Forest there are $n$ trees in a row.\n\nOn top of the first one, there is a little bird who would like to fly over to the top of the last tree.\n\nBeing in fact very little, the bird might lack the strength to fly there without any stop.\n\nIf the bird is sitting on top of the tree no. i, then in a single flight leg it can fly toany of the trees no. $i+1,i+2,\\cdots,i+k$, and then has to rest afterward.\n\nMoreover, flying up is far harder to flying down.  A flight leg is tiresome if it ends in a tree at leastas high as the one where is started.  Otherwise the flight leg is not tiresome.\n\nThe goal is to select the trees on which the little bird will land so that the overall flight is leasttiresome, i.e., it has the minimum number of tiresome legs.\n\nWe note that birds are social creatures, and our bird has a few bird-friends who would also like to getfrom the first tree to the last one.  The stamina of all the birds varies,so the bird's friends may have different values of the parameter $k$.\n\nHelp all the birds, little and big!",
    "inputFormat": "There is a single integer $n$ ($2\\le n\\le 1\\ 000\\ 000$) in the first line of the standard input:\n\nthe number of trees in the Byteotian Line Forest.\n\nThe second line of input holds $n$ integers $d_1,d_2,\\cdots,d_n$ ($1\\le d_i\\le 10^9$)separated by single spaces: $d_i$ is the height of the i-th tree.\n\nThe third line of the input holds a single integer $q$ ($1\\le q\\le 25$): the number of birds whoseflights need to be planned.\n\nThe following $q$ lines describe these birds: in the $i$-th of these lines, there is an integer $k_i$ ($1\\le k_i\\le n-1$) specifying the $i$-th bird's stamina. In other words, the maximum number of trees that the $i$-th bird can pass before it has to rest is $k_i-1$.\n",
    "outputFormat": "Your program should print exactly $q$ lines to the standard output.\n\nIn the $i$-th line, it should specify the minimum number of tiresome flight legs of the $i$-th bird.\n",
    "samples": [
        [
            "9\n4 6 3 6 3 7 2 6 5\n2\n2\n5\n",
            "2\n1\n"
        ]
    ],
    "hint": "",
    "translation": "有 $n$ 棵树排成一排，第 $i$ 棵树的高度是 $d_i$。\n\n有 $q$ 只鸟要从第 $1$ 棵树到第 $n$ 棵树。\n\n当第 $i$ 只鸟在第 $j$ 棵树时，它可以飞到第 $j+1, j+2, \\cdots, j+k_i$ 棵树。\n\n如果一只鸟飞到一颗高度大于等于当前树的树，那么它的劳累值会增加 $1$，否则不会。\n\n由于这些鸟已经体力不支，所以它们想要最小化劳累值。\n\n### 输入格式\n\n第一行输入 $n$。\n\n第二行 $n$ 个数，第 $i$ 个数表示 $d_i$。\n\n第三行输入 $q$。\n\n接下来 $q$ 行，每一行一个整数，第 $i$ 行的整数为 $k_i$。\n\n### 输出格式\n\n共 $q$ 行，每一行输出第 $i$ 只鸟的最小劳累值。\n\n### 数据范围\n\n$1 \\le n \\le 10^6$，$1 \\le d_i \\le 10^9$，$1 \\le q \\le 25$，$1 \\le k_i \\le n - 1$。\n"
}