{
    "description": "After several months of rehearsal, the cows are just about ready to put on their annual dance performance; this year they are performing the famous bovine ballet \"Cowpelia\".\n\nThe only aspect of the show that remains to be determined is the size of the stage. A stage of size $K$ can support $K$ cows dancing simultaneously. The $N$ cows in the herd ($1 \\leq N \\leq 10,000$) are conveniently numbered $1 \\ldots N$ in the order in which they must appear in the dance. Each cow $i$ plans to dance for a specific duration of time $d(i)$. Initially, cows $1 \\ldots K$ appear on stage and start dancing. When the first of these cows completes her part, she leaves the stage and cow $K+1$ immediately starts dancing, and so on, so there are always $K$ cows dancing (until the end of the show, when we start to run out of cows). The show ends when the last cow completes her dancing part, at time $T$.\n\nClearly, the larger the value of $K$, the smaller the value of $T$. Since the show cannot last too long, you are given as input an upper bound $T_{max}$ specifying the largest possible value of $T$. Subject to this constraint, please determine the smallest possible value of $K$.\n\n经过几个月的排练，奶牛们基本准备好展出她们的年度舞蹈表演。今年她们要表演的是著名的奶牛芭蕾——“cowpelia”。\n\n表演唯一有待决定的是舞台的尺寸。一个大小为 $K$ 的舞台可以支持 $K$ 头牛同时在舞台上跳舞。在牛群中的 $N$ 头牛按照她们必须出现在舞蹈中的顺序方便地编号为 $1,2,...N$。第 $i$ 头牛计划跳 $d_i$ 的特定持续时间。\n一开始，第 $1,2,...K$ 头牛出现在舞台上并开始跳舞。当这些牛中的某一头牛首先完成了她的部分，她会马上离开舞台并且第 $K+1$ 头牛会出现在舞台上并开始跳舞。所以，舞台上总有 $K$ 头奶牛在跳舞（直到表演的尾声，奶牛不够的时候）。当最后一头奶牛完成了她的舞蹈部分，表演结束，共花了 $T$ 个单位时间。\n\n显然，$K$ 的值越大，$T$ 就越小。由于表演不能拖太长，你得知了指定 $T$ 的最大可能值的上限 $T_{max}$。请根据这个约束，确定 $K$ 的最小值。",
    "inputFormat": "The first line of input contains $N$ and $T_{max}$, where $T_{max}$ is an integer of value at most 1 million.\n\nThe next $N$ lines give the durations $d(1) \\ldots d(N)$ of the dancing parts for cows $1 \\ldots N$. Each $d(i)$ value is an integer in the range $1 \\ldots 100,000$.\n\nIt is guaranteed that if $K=N$, the show will finish in time.\n\n第一行包括 $N$ 和 $T_{max}$ 两个整数。\n\n接下来的 $N$ 行，第 $i$ 行给出了第 $i$ 头牛跳舞的持续时间 $d_i$。第 $i$ 行包括一个整数 $d_i$。\n\n保证 $K=N$ 时表演会按时完成。",
    "outputFormat": "Print out the smallest possible value of $K$ such that the dance performance will take no more than $T_{max}$ units of time.\n\n输出在表演时间不大于 $T_{max}$ 时的 $K$ 的最小可能值。",
    "samples": [
        [
            "5 8\n4\n7\n8\n6\n4",
            "4\n"
        ]
    ],
    "hint": "于 $100\\%$ 的数据，$1 \\le N \\le 10^4$，$T_{max} \\le 10^6$，$1 \\le d_i \\le 10^5$。\n\n感谢@XY星系质量PK 提供的翻译\n"
}