{
    "description": "Bessie has invented a new programming language, but since there is no compiler yet, she needs your help to actually run her programs.\n\n\nCOWBASIC is a simple, elegant language. It has two key features: addition and MOO loops. Bessie has devised a clever solution to overflow: all addition is done modulo $10^9+7$. But Bessie's real achievement is the MOO loop, which runs a block of code a fixed number of times. MOO loops and addition can, of course, be nested.\n\n\nGiven a COWBASIC program, please help Bessie determine what number it returns.\n\nBessie研制出了一种新的编程语言，但是因为还没有设计编译器的缘故，她需要你的帮助来运行她编的程序。\n\nCOWBASIC语言是一种简单的、优美的语言。它有两个关键功能：变量相加和MOO循环。对于可能的溢出问题，Bessie想出了一个很好的方法，**所有的变量加法都要以10^9+7为模**。但是Bessie设计的COWBASIC语言中真正成功之处是可以运行一段固定数量的代码的MOO循环。**MOO循环和加法是可以嵌套的**。\n\n给你一段COWBASIC程序，请你帮助Bessie确定这个程序段将会返回什么数值。\n",
    "inputFormat": "You are given a COWBASIC program at most 100 lines long, with each line being at most 350 characters long. A COWBASIC program is a list of statements.\n\n\n```cpp\n<variable> = <expression>\n\n<literal> MOO {\n<list of statements>\n}\n\nRETURN <variable>\n```\n\n```cpp\n<literal>\n\n<variable>\n\n( <expression> ) + ( <expression> )\n```\n\nThere are three types of statements:\n\nThere are three types of expressions:\n\nA literal is a positive integer at most 100,000.\n\n\nA variable is a string of at most 10 lowercase English letters.\n\n\nIt is guaranteed that no variable will be used or RETURNed before it is defined. It is guaranteed that RETURN will happen exactly once, on the last line of the program.\n\n\n\n你将会得到一段**最长为100行的COWBASIC程序，每行的长度最长为350个字符**。COWBASIC语言的结构和类型如下所述：\n\n\n这是COWBASIC语言的三种主要结构：\n\n\n<变量>=<表达式>          //赋值结构\n\n\n<数字（循环次数）>MOO{          //循环结构\n\n<一系列的表达式（也就是循环部分）>\n\n\n\n}\nRETURN <变量>           //输出结构 把return的变量输出就行了\n\n这是COWBASIC语言的三种类型（我是这么理解的）\n\n<数字> 这些数字是**小于100,000正整数**\n\n<变量> 这些变量名字是**一串10个以内的小写英文字母**\n\n(<表达式>)+(<表达式>) //**注意：这是COWBASIC中变量加法的表达方法，详见样例**\n\n我们保证返回的变量是已定义的，**RETURN（输出结构）将只会出现一次且在程序的最后一行**。\n",
    "outputFormat": "Output a single positive integer, giving the value of the RETURNed variable.\n\n输出返回的变量值（有符号的整形数字）\n\n说明：\n",
    "samples": [
        [
            "x = 1\n10 MOO {\nx = ( x ) + ( x )\n}\nRETURN x",
            "1024"
        ],
        [
            "n = 1\nnsq = 1\n100000 MOO {\n100000 MOO {\nnsq = ( nsq ) + ( ( n ) + ( ( n ) + ( 1 ) ) )\nn = ( n ) + ( 1 )\n}\n}\nRETURN nsq",
            "4761"
        ]
    ],
    "hint": "Scoring\n\n\n\n\nIn 20 percent of all test cases - MOO loops are not nested.\n\nIn another 20 percent of all test cases - The program only has 1 variable. MOO loops can be nested.\n\nIn the remaining test cases, there are no further restrictions.\n\n评分标准\n\n20%数据：MOO循环不嵌套\n\n另外20%数据：程序只有一个变量，MOO循环可嵌套\n\n其他数据没有多余限制（即最长100行，每行最长350字符）\n\n\n感谢@psk2016  提供的翻译\n"
}