{
    "description": "Farmer John has recently been experimenting with cultivating different types of grass on his farm, realizing that different types of cows like different types of grass. However, he must be careful to ensure that different types of grass are planted sufficiently far away from each-other, in order to prevent them from being inextricably mixed.\n\n\nFJ's farm consists of $N$ fields ($1 \\leq N \\leq 200,000$), where $M$ pairs of  fields are connected by bi-directional pathways ($1 \\leq M \\leq 200,000$).  Using these pathways, it is possible to walk from any field to any other field. Each pathway has an integer length in the range $1 \\ldots 1,000,000$. Any pair of fields will be linked by at most one direct pathway.\n\n\nIn each field, FJ initially plants one of $K$ types of grass ($1 \\leq K \\leq N$). Over time, however, he might decide to switch the grass in some field to a different type. He calls this an \"update\"  peration. He might perform several updates over the course of time, which are all cumulative in nature.\n\n\nAfter each update, FJ would like to know the length of the shortest path between two fields having different grass types. That is, among all pairs of fields having different grass types, he wants to know which two are closest. Ideally,\n\nthis number is large, so he can prevent grass of one type from mixing with grass of another type. It is guaranteed that the farm will always have at least two fields with different grass types.\n\n\nIn 30 percent of the input cases, each field will be directly connected to at most 10 pathways.\n\n\n",
    "inputFormat": "The first line of input contains four integers, $N$, $M$, $K$, and $Q$, where $Q$ is the number of updates ($1 \\leq Q \\leq 200,000$).\n\nThe next $M$ lines describe the paths; each one contains three integers $A$, $B$, and $L$, indicating a path from field $A$ to field $B$ (both integers in the range $1 \\ldots N$) of length $L$.\n\nThe next line indicates the initial type of grass growing in each field ($N$ integers in the range $1 \\ldots K$).\n\nFinally, the last $Q$ lines each describe an update, specified by two integers $A$ and $B$, where the grass in field $A$ is to be updated to type $B$.\n",
    "outputFormat": "For each update, print the length of the shortest path between two fields with different types of grass, after the update is applied.\n",
    "samples": [
        [
            "3 2 3 4\n1 2 3\n2 3 1\n1 1 2\n3 3\n2 3\n1 2\n2 2",
            "1\n3\n3\n1"
        ]
    ],
    "hint": "感谢 @∑∵∴∷  的翻译。\n\n简介翻译by cc123321 :\n\n给定一张带权无向图，每个点有一个颜色，每次改变一个点的颜色，要求你在操作后输出这个图中最近异色点对之间的距离最近异色点对定义为：一对点颜色不同，且距离最小\n",
    "translation": "农夫约翰最近一直在在他的农场试种各种类型的草，他发现不同类型的牛，喜欢不同类型的草。 然而，他必须注意，在种草时，不同类型的草，要保持足够远的距离，以防止它们混合。\n\n\n他的农场由N（1≤N≤200,200）块田地组成，其中有M（1≤M≤200,000）对田地中用小路连接。使用这些小路，可以从任何田地走到任何其他田地。每条路的长度在1~1,000，000范围内。 任何田地对将由顶多一条小路连接。\n\n\n在每个领域，他最初都是种植K柱草（1≤K≤N）。 然而，随着时间的推移，他可能决定在某些领域将草转变为不同品种。 他称之为“更新”。 他可能会在一段时间内执行多个更新，这些都是累积的。\n\n\n在每次更新之后，他想知道具有不同草品种的两个田地之间的最短路径的长度。 也就是说，在具有不同草品种的所有田地中，他想知道哪两个是最接近的。 理想情况下，这个数量很大，所以他可以防止一种品种的草与另一品种草的混合。 保证农场将总是具有至少两个具有不同草品种的田地。\n\n\n在30％的输入数据中，每个田地将连接到最多10条小路。"
}