{
    "description": "Why did the cow cross the road? Well, one reason is that Farmer John's farm simply has a lot of roads, making it impossible for his cows to travel around without crossing many of them.\n\n为什么牛过马路？ 其中一个简单的原因就是农民约翰的农场有很多道路，使得他的母牛不得不穿越许多道路。\n\nFJ's farm is arranged as an $N \\times N$ square grid of fields ($2 \\leq N \\leq 100$), Certain pairs of adjacent fields (e.g., north-south or east-west) are separated by roads, and a tall fence runs around the external perimeter of the entire grid, preventing cows from leaving the farm. Cows can move freely from any field to any other adjacent field (north, east, south, or west), although they prefer not to cross roads unless absolutely necessary.\n\nFJ的农场在 $N\\times N$的网格中（ $2\\le N\\le 100$），某些相邻的区域（例如，南北或东西）由道路分隔，高大的围栏围绕着整个格栅的外围，防止牛离开农场。 牛可以从任何场地自由移动到任何其他相邻的区域（北，东，南或西），不过除非不得已，她们并不愿意穿越道路。\n\nThere are $K$ cows ($1 \\leq K \\leq 100, K \\leq N^2$) on FJ's farm, each located in a different field. A pair of cows is said to be \"distant\" if, in order for one cow to visit the other, it is necessary to cross at least one road. Please help FJ count the number of distant pairs of cows.\n\n在FJ的农场有 $K$ 头牛（$1\\le K\\le 100,K\\le N^{2}$)，每个位于不同的区域。 定义一对牛是“遥远的”，是指让一头牛访问另一头牛时，必须至少穿过一条路。 请帮助FJ计算有多少对牛是“遥远的”。\n",
    "inputFormat": "The first line of input contains $N$, $K$, and $R$. The next $R$ lines describe $R$ roads that exist between pairs of adjacent fields. Each line is of the form $r$ $c$ $r'$ $c'$ (integers in the range $1 \\ldots N$), indicating a road between the field in (row $r$, column $c$) and the adjacent field in (row $r'$, column $c'$). The final $K$ lines indicate the locations of the $K$ cows, each specified in terms of a row and column.\n\n第一行输入包含 $N$， $K$和 $R$。 接下来的 $R$ 行描述存在于相邻区域对之间的 $R$ 条路。 每行的格式为 $r$ ; $c$ ; $r'$ ; $c'$（都是在 $1...N$中的整数），表示在两个相邻的区域（第$r$行第$c$列，和第$r​'$ ​​ 行第$c​'$ ​​ 列）之间的路。 最终的$K$行表示 $K$ 头牛的位置，也用行列来表示。\n",
    "outputFormat": "Print the number of pairs of cows that are distant.\n\n输出遥远的牛数量对。\n",
    "samples": [
        [
            "3 3 3\n2 2 2 3\n3 3 3 2\n3 3 2 3\n3 3\n2 2\n2 3",
            "2"
        ]
    ],
    "hint": "感谢@太阳之神2015 提供翻译\n"
}