{
    "description": "Just like humans, cows often appreciate feeling they are unique in some way. Since Farmer John's cows all come from the same breed and look quite similar, they want to measure uniqueness in their names.\n\nEach cow's name has some number of substrings. For example, \"amy\" has substrings {a, m, y, am, my, amy}, and \"tommy\" would have the following substrings: {t, o, m, y, to, om, mm, my, tom, omm, mmy, tomm, ommy, tommy}.\n\n\nA cow name has a \"uniqueness factor\" which is the number of substrings of that name not shared with any other cow. For example, If amy was in a herd by herself, her uniqueness factor would be 6. If tommy was in a herd by himself, his uniqueness factor would be 14. If they were in a herd together, however, amy's uniqueness factor would be 3 and tommy's would be 11.\n\n\nGiven a herd of cows, please determine each cow's uniqueness factor.\n\n\n定义一个字符串的「独特值」为只属于该字符串的本质不同的非空子串的个数。如 \"amy\" 与 “tommy” 两个串，只属于 \"amy\" 的本质不同的子串为 \"a\" \"am\" \"amy\" 共 3 个。只属于 \"tommy\" 的本质不同的子串为 \"t\" \"to\" \"tom\" \"tomm\" \"tommy\" \"o\" \"om\" \"omm\" \"ommy\" \"mm\" \"mmy\" 共 11 个。 所以 \"amy\" 的「独特值」为 3 ，\"tommy\" 的「独特值」为 11 。\n\n给定 N ($N \\leq 10^5$) 个字符集为小写英文字母的字符串，所有字符串的长度和小于 $10^5$，求出每个字符串「独特值」。\n",
    "inputFormat": "The first line of input will contain $N$ ($1 \\le N \\le 10^5$). The following $N$ lines will each contain the name of a cow in the herd. Each name will contain only lowercase characters a-z. The total length of all names will not exceed $10^5$.\n",
    "outputFormat": "Output $N$ numbers, one per line, describing the uniqueness factor of each cow.\n",
    "samples": [
        [
            "3\namy\ntommy\nbessie",
            "3\n11\n19"
        ]
    ],
    "hint": ""
}