{
    "description": "Farmer John has opened a swimming pool for his cows, figuring it will help them relax and produce more milk.\n\nTo ensure safety, he hires $N$ cows as lifeguards, each of which has a shift that covers some contiguous interval of time during the day. For simplicity, the pool is open from time $t=0$ until time $t = 1,000,000,000$ on a daily basis, so each shift can be described by two integers, giving the time at which a cow starts and ends her shift. For example, a lifeguard starting at time $t = 4$ and ending at time $t = 7$ covers three units of time (note that the endpoints are \"points\" in time).\n\n\nUnfortunately, Farmer John hired 1 more lifeguard than he has the funds to support. Given that he must fire exactly one lifeguard, what is the maximum amount of time that can still be covered by the shifts of the remaining lifeguards? An interval of time is covered if at least one lifeguard is present.\n",
    "inputFormat": "The first line of input contains $N$ ($1 \\leq N \\leq 100,000$). Each of the next $N$ lines describes a lifeguard in terms of two integers in the range $0 \\ldots 1,000,000,000$, giving the starting and ending point of a lifeguard's shift. All such endpoints are distinct. Shifts of different lifeguards might overlap.\n",
    "outputFormat": "Please write a single number, giving the maximum amount of time that can still be covered if Farmer John fires 1 lifeguard.\n",
    "samples": [
        [
            "3\n5 9\n1 4\n3 7",
            "7"
        ]
    ],
    "hint": "",
    "translation": "FJ为他的奶牛们建造了一个游泳池，FJ认为这将有助于他们放松身心以及生产更多牛奶。\n\n为了确保奶牛们的安全，FJ雇佣了N头牛，作为泳池的救生员，每一个救生员在一天内都会有一定的事情，并且这些事情都会覆盖一天内的一段时间。为了简单起见，泳池从时间t=0时开门，直到时间t=1000000000关门，所以每个事情都可以用两个整数来描述，给出奶牛救生员开始以及结束事情的时间。例如，一个救生员在时间t=4时开始事情并且在时间t=7时结束事情，那么这件事情就覆盖了3个单位时间。（注意：结束时间是“点”的时间）\n\n不幸的是，FJ多雇佣了一名的救生员，但他没有足够的资金来雇佣这些救生员。因此他必须解雇一名救生员，求可以覆盖剩余救生员的轮班时间的最大总量是多少？如果当时至少有一名救生员的事情已经开始，则这个时段被覆盖。\n\n输入格式\n\n输入的第一行包括一个整数N（1≤N≤100000）。接下来N行中，每行告诉了我们一个救生员在0~10000000000范围内的开始以及结束时间。所有的结束时间都是不同的。不同的救生员的事情覆盖的时间可能会重叠。\n\n输出格式\n\n如果FJ解雇一名救生员仍能覆盖的最大时间。\n\n感谢@Shan_Xian 提供的翻译"
}