{
    "description": "Cornered at last, Bessie has gone to ground in a remote farm. The farm consists of $N$ barns ($2 \\leq N \\leq 10^5$) and $N-1$ bidirectional tunnels between barns, so that there is a unique path between every pair of barns. Every barn which has only one tunnel is an exit. When morning comes, Bessie will surface at some barn and attempt to reach an exit.\n\nBut the moment Bessie surfaces, the law will be able to pinpoint her location. Some farmers will then start at various exit barns, and attempt to catch Bessie. The farmers move at the same speed as Bessie (so in each time step, each farmer can move from one barn to an adjacent barn). The farmers know where Bessie is at all times, and Bessie knows where the farmers are at all times. The farmers catch Bessie if at any instant a farmer is in the same barn as Bessie, or crossing the same tunnel as Bessie. Conversely, Bessie escapes if she reaches an exit barn before any farms catch her.\n\n\nBessie is unsure about her chances of success, which depends on the number of farmers that the law is able to deploy. Given that Bessie surfaces at barn $K$, help Bessie determine the minimum number of farmers who would be needed to catch Bessie, assuming that the farmers distribute themselves optimally among the exit barns.\n",
    "inputFormat": "The first line of the input contains $N$ and $K$. Each of the following $N-1$ lines specify two integers, each in the range $1 \\ldots N$, describing a tunnel between two barns.\n",
    "outputFormat": "Please output the minimum number of farmers needed to ensure catching Bessie.\n",
    "samples": [
        [
            "7 1\n1 2\n1 3\n3 4\n3 5\n4 6\n5 7",
            "3"
        ]
    ],
    "hint": "",
    "translation": "## 题目描述\n最后，Bessie 被迫去了一个远方的农场。这个农场包含 $N$ 个谷仓（$2 \\le N \\le 10^5$）和 $N-1$ 条连接两个谷仓的双向隧道，所以每两个谷仓之间都有唯一的路径。每个只与一条隧道相连的谷仓都是农场的出口。当早晨来临的时候，Bessie 将在某个谷仓露面，然后试图到达一个出口。\n\n但当 Bessie 露面的时候，她的位置就会暴露。一些农民在那时将从不同的出口谷仓出发尝试抓住 Bessie。农民和 Bessie 的移动速度相同（在每个单位时间内，每个农民都可以从一个谷仓移动到相邻的一个谷仓，同时 Bessie 也可以这么做）。农民们和Bessie 总是知道对方在哪里。如果在任意时刻，某个农民和 Bessie 处于同一个谷仓或在穿过同一个隧道，农民就可以抓住 Bessie。反过来，如果 Bessie 在农民们抓住她之前到达一个出口谷仓，Bessie 就可以逃走。\n\nBessie 不确定她成功的机会，这取决于被雇佣的农民的数量。给定 Bessie 露面的谷仓K，帮助 Bessie 确定为了抓住她所需要的农民的最小数量。假定农民们会自己选择最佳的方案来安排他们出发的出口谷仓。\n\n## 输入格式\n\n输入的第一行包含 $N$ 和 $K$。接下来的 $N – 1$ 行，每行有两个整数（在 $1\\sim N$ 范围内）描述连接两个谷仓的一条隧道。\n\n## 输出格式\n\n输出为了确保抓住 Bessie 所需的农民的最小数量。\n\n由 @Marser 提供翻译"
}