{
    "description": "The evil emperor Cactus has in his possession the Magic Keg and has flooded the Enchanted Forest! The Painter and the three little hedgehogs now have to return to the Beaver's den where they will be safe from the water as quickly as possible!\nThe map of the Enchanted Forest consists of R rows and C columns. Empty fields are represented by '.' characters, flooded fields by '*' and rocks by 'X'. Additionally, the Beaver's den is represented by 'D' and the Painter and the three little hedgehogs are shown as 'S'.\nEvery minute the Painter and the three little hedgehogs can move to 4 neighbouring fields (up, down, left or right). Every minute the flood expands as well so that all empty fields that have at least one common side with a flooded field become flooded as well. Neither water nor the Painter and the three little hedgehogs can pass through rocks. Naturally, the Painter and the three little hedgehogs cannot pass through flooded fields, and water cannot flood the Beaver's den.\nWrite a program that will, given a map of the Enchanted Forest, output the shortest time needed for the Painter and the three little hedgehogs to safely reach the Beaver's den.\nNote: The Painter and the three little hedgehogs cannot move into a field that is about to be flooded (in the same minute).",
    "inputFormat": "The first line of input will contain two integers, R and C, smaller than or equal to 50.\nThe following R lines will each contain C characters ('.', '*', 'X', 'D' or 'S'). The map will contain exactly one 'D' character and exactly one 'S' character.",
    "outputFormat": "Output the shortest possible time needed for the Painter and the three little hedgehogs to safely reach the Beaver's den. If this is impossible output the word “KAKTUS” on a line by itself.",
    "samples": [
        [
            "3 3\nD.*\n...\n.S.",
            "3"
        ],
        [
            "3 3\nD.*\n...\n..S",
            "KAKTUS"
        ],
        [
            "3 6\nD...*.\n.X.X..\n....S.",
            "6"
        ]
    ],
    "hint": "Clarification of the second sample test: The best they can do is to go along the lower border and then the left border, and get flooded one minute before reaching the den.",
    "translation": "给你一个$R*C$ 的矩阵，这个矩阵由 $*$  , $.$ (点) , $D$  , $S$  , $X$ 组成，会有洪水从$*$ 处涌出，每单位时间都会淹没和其四联通的平地，$.$ (点)表示平地，$X$ 是障碍，不可通行，也不会没淹没，$S$ 是出发点，三只刺猬(?)从这里出发前往庇护所，它们只能在没有被洪水淹没的平地上移动，并且每单位时间只能移动到周围一个四联通的格子，$D$ 表示庇护所，庇护所不会被洪水淹没。\n\n输入第一行两个整数$R,C$ （$R,C\\leq 50$ ），接下来使这个矩阵。\n\n输出到达庇护所的最短时间，或者输出“KAKTUS”，表示根本不可能到。\n\n感谢@Khassar 提供的翻译"
}