{
    "description": "To help capture criminals on the run, the police are introducing a new computer system. The area covered by the police contains N cities and E bidirectional roads connecting them. The cities are labelled 1 to N.\n\n为了帮助抓捕逃犯，警方引进了一套新的电脑系统。警察的辖区包含N座城市和E条双向道路，城市的编号是1~N。\n\nThe police often want to catch criminals trying to get from one city to another. Inspectors, looking at a map, try to determine where to set up barricades and roadblocks. The new computer system should answer the following two types of queries:\n\n警察常常要抓住那些逃往另一个城市的罪犯。侦查员看着地图，试着确定在哪里设置路障。新的计算机系统要回答以下两种问题：\n\n1. Consider two cities A and B, and a road connecting cities G1 and G2. Can the criminals get\nfrom city A to city B if that one road is blocked and the criminals can't use it?\n\n1.考虑城市$A$和$B$，以及连接城市$G_1$和$G_2$的道路。罪犯能否在那条路不通的情况下从$A$到逃到$B$？\n\n2. Consider three cities A, B and C. Can the criminals get from city A to city B if the entire city\nC is cut off and the criminals can't enter that city?\n\n2.考虑三个城市$A$、$B$、$C$。罪犯能否在$C$被切断的情况下从$A$逃到$B$?\n\nWrite a program that implements the described system.\n\n写一个程序实现上述系统。\n",
    "inputFormat": "The first line contains two integers N and E (2 ≤ N ≤ 100 000, 1 ≤ E ≤ 500 000), the number of cities and roads.\n\nEach of the following E lines contains two distinct integers between 1 and N – the labels of two cities connected by a road. There will be at most one road between any pair of cities.\n\nThe following line contains the integer Q (1 ≤ Q ≤ 300 000), the number of queries the system is being tested on.\n\nEach of the following Q lines contains either four or five integers. The first of these integers is the type of the query – 1 or 2.\n\nIf the query is of type 1, then the same line contains four more integers A, B, G1 and G2 as described earlier. A and B will be different. G1 and G2 will represent an existing road.\n\nIf the query is of type 2, then the same line contains three more integers A, B and C. A, B and C will be distinct integers.\n\nThe test data will be such that it is initially possible to get from each city to every other city.\n\n保证图中每两个点相互连通。",
    "outputFormat": "Output the answers to all Q queries, one per line. The answer to a query can be \"yes\" or \"no\".",
    "samples": [
        [
            "13 15\n1 2\n2 3\n3 5\n2 4\n4 6\n2 6\n1 4\n1 7\n7 8\n7 9\n7 10\n8 11\n8 12\n9 12\n12 13\n5\n1 5 13 1 2\n1 6 2 1 4\n1 13 6 7 8\n2 13 6 7\n2 13 6 8",
            "yes\nyes\nyes\nno\nyes"
        ]
    ],
    "hint": "Croatian Olympiad in Informatics 2007\nTask 2"
}