{
    "description": "While debugging a program Mirko noticed that a bug in the program may be linked with the existence of so called square killers in the program memory. The program memory is a matrix composed of R rows and C columns consisting only of zeroes and ones. A square killer is a square submatrix in memory, consisting of more than one character, that, when rotated 180 degrees looks exactly the same. For example, the following matrix contains 3 square killers:\n\n![](https://cdn.luogu.com.cn/upload/pic/15764.png)\n\nMirko is wondering if there is a connection between the size of the largest square killer and the bug in the program. Help Mirko by writing a program that, given the layout of the memory, outputs the size of the largest square killer. The size of the square killer is the number of rows (or columns) that the killer consists of. In the example above the killer sizes are 2, 2 and 3, respectively.",
    "inputFormat": "The first will contain two integers, R and C, smaller than or equal to 300.\nThe next R lines will each contain C characters ('0' or '1') with no spaces.",
    "outputFormat": "Output the size of the largest killer on a single line, or output -1 if there are no square killers.",
    "samples": [
        [
            "3 6\n101010\n111001\n101001",
            "3"
        ],
        [
            "4 5\n10010\n01010\n10101\n01001",
            "3"
        ],
        [
            "3 3\n101\n111\n100",
            "-1"
        ]
    ],
    "hint": "",
    "translation": "Mirko在写bug的时候，注意到这样一个问题：程序中的bug可能与内存中的”square killer”有关。程序的内存是一个r行c列的01矩阵。”square killer”是其中包含一个**以上**字符的一个正方形子矩阵，而且”square killer”旋转180°后与原来相同。例如，下面的矩阵中含有三个”square killer”:\n\nMirko想知道程序中最大的”square killer”与bug的联系。帮助他写一个程序，求出最大的”square killer”的大小。”square killer”的大小是指它含有的行数或列数。图中的”square killer”的大小分别是2、2、3。\n\nTranslated by @ACdreamer "
}