{
    "description": "You are switching from computer science to agriculture and your new job involves growing sunﬂowers in an underground greenhouse. The greenhouse contains n sunﬂower plants arranged in a straight line and numbered with integers 1 through n, from left to right. Two lamps provide the light and heat the sunﬂowers need to grow: the lamp A is positioned at the left end, while the lamp B is positioned at the right end of the line. \n\nEvery day exactly one of the lamps is on, causing all of the sunﬂowers to turn towards the light and some of them to grow. The sunﬂower will grow if and only if the sunﬂower directly in front of it (towards the light) is higher. The growth is continuous with a uniform rate of exactly 1 centimeter per day. Notice that, when a sunﬂower starts to grow, it may cause the sunﬂower directly behind it to start to grow instantaneously.\n\n![](https://cdn.luogu.com.cn/upload/pic/16238.png )\n\nYou are given initial heights of the sunﬂowers and the lamp schedule for the following m day period, ﬁnd the ﬁnal heights of all the sunﬂowers.",
    "inputFormat": "The ﬁrst line contains two integers n and m (1≤n, m≤300000) – the number of sunﬂowers and the number of days in the period. The following line contains n integers h1,h2,...,hn (1≤ hk ≤$10^9$) – the initial heights (in centimeters) of the sunﬂowers, from left to right. \n\nThe following line contains a string consisting of exactly m characters A or B – the lamp schedule starting from the ﬁrst day of the period.",
    "outputFormat": "Output a single line containing n integers – the ﬁnal heights of the sunﬂowers, from left to right.\n",
    "samples": [
        [
            "6 5 \n4 3 5 3 6 6 \nBABAA\n",
            "5 5 6 6 6 6"
        ]
    ],
    "hint": "Central Europe Regional Contest 2015 Problem G",
    "translation": "有两盏灯在最左边和最右边。有 $n$ 盏向日葵在中间。\n\n每一天都一定会有一个灯开着。向日葵仅仅当它前面的（朝向灯的方向）向日葵比它高时它才会成长，成长速度为 $1$。注意，当一个向日葵开始成长时，它还可能使得在它后面的向日葵瞬间成长。\n\n给你每株向日葵的高度，还有每天开灯的时间表，求出最后所有的向日葵的高度。\n\n$n,m\\le 3\\times 10^5$，$h \\leq 10^9$。"
}