{
    "description": "City map is an undirected graph consisting of n intersections denoted with integers from 1 to n and m two-way streets. Each street is assigned a priority – a non-negative integer. When requesting a map, the client selects a threshold priority p. The original map is then copied and converted to the exported map using the following procedure:\n\n1. All streets whose priority is lower than p are deleted. \n\n2. For each intersection i from 1,2,...,n (processed in that order): \n\n(a) If the intersection i is not connected to any streets it is deleted. \n\n(b) If the intersection i is connected to exactly two different streets x and y leading to intersections a and b both different from i then the intersection i is contracted using the following procedure: \n\ni. Streets x and y are deleted. \n\nii. Intersection i is deleted. \n\niii. New street z connecting intersections a and b is added.\n\n![](https://cdn.luogu.com.cn/upload/pic/16236.png )\n\nInitially, the map does not contain loops (loop is a street that connects an intersection to itself) or parallel edges (more than one street between the same pair of intersections), but the loops and parallel edges may form during the contraction procedure. Notice that, in the step 2. (b) above, neither x nor y can be a loop (both a and b have to be different from i), but the newly added street z could be a loop (it is possible that a and b are same). \n\nGiven a map and a sequence of incoming export requests, for each request ﬁnd the number of intersections and the number of streets in the exported map.",
    "inputFormat": "The ﬁrst line contains two integers n (1 ≤ n ≤ 300000) and m (1 ≤ m ≤ 300000) – the number of intersections and the number of streets, respectively. Each of the following m lines contains three integers a, b and p (1≤ a,b≤n,0≤ p≤300000) which describe a street with priority p connecting intersections a and b. No street connects an intersection to itself. There is at most one street between every two intersections. \n\nThe following line contains an integer q (1 ≤ q ≤ 300000) – the number of export requests. The following line contains q integers. The k-th integer tk (0≤tk ≤300000) is the threshold priority of the k-th request.",
    "outputFormat": "Output should consist of q lines. The k-th line should contain two integers–the number of intersections and the number of streets, respectively, in the exported map for the k-th request.",
    "samples": [
        [
            "6 7 \n1 2 20 \n2 3 80 \n2 5 100 \n3 5 50 \n3 4 100 \n5 6 90 \n4 6 100 \n4 \n25 75 85 95",
            "2 3 \n1 1 \n2 1 \n4 2\n"
        ],
        [
            "10 14 \n2 7 150 \n1 2 100 \n2 3 150 \n3 1 200 \n1 4 60 \n4 5 20 \n2 5 100 \n5 6 90 \n6 7 120 \n7 5 130 \n6 8 50 \n8 9 200 \n9 10 200 \n10 7 200 \n5 \n300 50 95 100 110",
            "0 0 \n6 9 \n4 5 \n4 5 \n5 4"
        ]
    ],
    "hint": "Central Europe Regional Contest 2015 Problem E",
    "translation": "#### 题意翻译：\n\nLuka 拥有一个地理数据公司保持着详细的城市地图和出口相关的数据。但是通常客户不想要完整的地图。相反，他们更想要一个只包含主要街道的简单地图：\n\n1. 所有优先级小于 $p$ 的街道被删除\n\n1. 对于每一个路口点 $i$ 从 $1$ 到 $n$（按照这个顺序处理）：\n\n   (a)如果这个路口没有连接到任何街道，它就会被删除。\n\n   (b)如果路口 $i$ 正好连接到两个不同的街道 $x$ 和 $y$，导致 $a$ 和 $b$ 两个路口都与路口 $i$ 不同，那么 $i$ 就会根据下面的过程进行收缩：\n\n   i.删除道路 $x$ 和道路 $y$；\n\n   ii.删除路口 $i$；\n\n   iii.加入一个连接路口 $a$ 和 $b$ 的新道路 $z$；\n\n最初，图中没有环（即一条连接到自身的边）或者平行的边（即在同一对交点之间有一条以上的边），但在收缩的过程中可能会形成环和平行边。\n\n请注意，在步骤2.（b）之前，$x$ 和 $y$ 都不能是环（即 $a$ 和 $b$ 必须和 $i$ 不同），但是新增的 $z$ 可以是一个环（即 $a$ 和 $b$ 可能是相同的）。\n\n给定一个地图和一系列的出口的询问,每个询问找到路口的数量和街道地图出口的数量。\n\n#### 输入格式：\n第一行包含两个整数 $n(1 \\le n\\le3\\times10^5)$ 和 $m(1\\le m\\le 3\\times10^5)$ 分别是点和边的数量。\n\n后面 $m$ 行包含三个整数分别是 $a,b$ 和 $p(1\\le a,b \\le n,0\\le p\\le 3\\times10^5)$ 用来描述 $a,b$ 之间边的优先级 $p$，没有一条边只连接一个点，两个点之间最多有一条边。\n\n第 $m+2$ 行包含一个整数 $q(1\\le q\\le 3\\times10^5)$ 表示询问的个数，下一行有 $q$ 个整数，第 $k$ 个整数 $t_k(0\\le tk\\le 3\\times10^5)$ 是第 $k$ 次询问的优先级。\n\n#### 输出格式：\n输出包括 $q$ 行。第 $k$ 行包含两个整数，分别是第 $k$ 次询问的点和边的个数。"
}