{
    "description": "Jousting is a medieval contest that involves people on horseback trying to strike each other with wooden lances while riding at high speed. A total of 2n knights have entered a jousting tournament – n knights from each of the two great rival houses. Upon arrival, each knight has challenged a single knight from the other house to a duel. \n\nA kernel is deﬁned as some subset S of knights with the following two properties:\n\n• No knight in S was challenged by another knight in S. \n\n• Every knight not in S was challenged by some knight in S.\n\nGiven the set of the challenges issued, ﬁnd one kernel. It is guaranteed that a kernel always exists.",
    "inputFormat": "The ﬁrst line contains an integer n (1 ≤ n ≤ 100000) – the number of knights of each house. The knights from the ﬁrst house are denoted with integers 1 through n, knights from the second house with integers n+1 through 2n. \n\nThe following line contains integers $f_1$, $f_2$,..., $f_n$ – the k-th integer fk is the index of the knight challenged by knight k $(n+1≤ f_k ≤2n)$. \n\nThe following line contains integers $s_1$,$s_2$,...,$s_n$ – the k-th integer sk is the index of the knight challenged by knight n+k $(1≤s_k ≤n)$. ",
    "outputFormat": "Output the indices of the knights in the kernel on a single line. If there is more than one solution, you may output any one.\n\nSPJ的格式校验较为严格，请在每个数字后面都输出一个空格，且在最后一个空格输出后请不要输出任何符号。",
    "samples": [
        [
            "4 \n5 6 7 7 \n1 3 2 3",
            "1 2 4 8"
        ]
    ],
    "hint": "Central Europe Regional Contest 2015 Problem K\n\n",
    "translation": "骑术是一项中世纪的比赛，人们骑在马背上，在高速骑行时，试图用木制长矛互相攻击。总共有2n个骑士参加了一个激战锦标赛——来自两个主要竞争对手的N个骑士。到达后，每一个骑士都从另一个房间挑战一个骑士进行决斗。\n\n内核被定义为骑士的一些子集，具有以下两个属性：\n\n•S中没有骑士受到S中另一个骑士的挑战。\n\n每一个不在S中的骑士都会受到一些S中的骑士的挑战。\n\n考虑到所面临的一系列挑战，确定一个内核。可以保证内核始终存在。"
}