{
    "description": "Lately, Slavko’s been studying sequences of natural numbers. He finds a sequence\ninteresting if the greatest common divisor of all the elements from the sequence is greater\nthan 1.\n\nYesterday, he found a sequence consisting of N natural numbers in his garage. Since he\nwas really bored, he decided to keep himself occupied by asking simple queries. Each query\ncan be one of the two types:\n\n1. Change the value at position X in the sequence to V.\n\n2. Determine the number of interesting contiguous subarrays contained in the interval\n[L, R] of the sequence.\n",
    "inputFormat": "The first line of input contains the numbers N and Q (1 ≤ N, Q ≤ $10^5$\n), representing the\nnumber of elements in the sequence and the number of queries, respectively.\n\nThe following line contains N natural numbers $A_i$\n(1 ≤ $A_i$ ≤ $10^9$\n) that represent the numbers in\nthe initial sequence.\n\nEach of the following Q lines contains a query of the following form:\n\n - The first number in the line can be 1 or 2 and represents the type of the query.\n - If the query is of type 1, two numbers follow, X (1 ≤ X ≤ N) and V (1 ≤ V ≤ $10^9$\n) from\nthe task.\n - If the query is of type 2, two numbers follow, L and R (1 ≤ L ≤ R ≤ N) that represent\nthe left and right interval boundary.\n",
    "outputFormat": "For each query of type 2, output the number of interesting contiguous subarrays from the\ntask.\n",
    "samples": [
        [
            "5 1\n8 4 3 9 1\n2 2 5\n",
            "4"
        ],
        [
            "5 3\n2 3 6 4 1\n2 1 4\n1 3 1\n2 3 5\n",
            "6\n1\n"
        ],
        [
            "4 3\n2 2 2 2\n2 1 4\n1 2 3\n2 1 4\n",
            "10\n5"
        ]
    ],
    "hint": "**Clarification​ ​of​ ​the​ ​first​ ​test​ ​case:**\n\nThe interval from the $2_{nd}$ to the $5_{th}$ position consists of numbers (4, 3, 9, 1). In it, the following are\ninteresting contiguous subarrays (denoted with square brackets):\n**[4]**​ 3 9 1, 4 **[3]​** ​9 1, 4 3 **[9]**​ 1, 4 **[3​ ​9]​** 1",
    "translation": "最近，斯科拉夫一直在研究自然数的序列。如果序列中所有数的最大公约数大于1，他会认为序列很有趣。昨天，他在车库里发现了一个由N个自然数组成的序列。由于他真的很无聊，他决定通过做两种操作使自己有事做 1:将序列中位置X的值更改为V    2：确定序列的区间[L，R]中包含的有趣的连续子阵列的数量\n"
}