{
    "description": "We are given a tree with N nodes denoted with different positive integers from 1 to N.\nAdditionally, you are given M node pairs from the tree in the form of ($a_1$\n, $b_1$\n), ($a_2$\n, $b_2$\n), …, ($a_M$\n,\n$b_M$\n).\n\nWe need to direct each edge of the tree so that for each given node pair ($a_i$\n, $b_i$\n) there is a\npath from $a_i$\nto $b_i$ or from $b_i$\nto $a_i$\n. How many different ways are there to achieve this?\nSince the solution can be quite large, determine it modulo $10^{9}+7$.\n",
    "inputFormat": "The first line of input contains the positive integers N and M (1 ≤ N, M ≤ $3*10^5$), the number of\nnodes in the tree and the number of given node pairs, respectively.\n\nEach of the following N - 1 lines contains two positive integers, the labels of the nodes\nconnected with an edge.\n\nThe $i_{th}$ of the following M lines contains two different positive integers $a_{i}$ and $b_{i}$\n, the labels of\nthe nodes from the $i_{th}$ node pair. All node pairs will be mutually different.\n",
    "outputFormat": "You must output a single line containing the total number of different ways to direct the\nedges of the tree that meet the requirement from the task, modulo $10^{9}+7$.\n",
    "samples": [
        [
            "4 1\n1 2\n2 3\n3 4\n2 4",
            "4"
        ],
        [
            "7 2\n1 2\n1 3\n4 2\n2 5\n6 5\n5 7\n1 7\n2 6\n",
            "8"
        ],
        [
            "4 3\n1 2\n1 3\n1 4\n2 3\n2 4\n3 4\n",
            "0"
        ]
    ],
    "hint": "In test cases worth 20% of total points, the given tree will be a chain. In other words, node i\nwill be connected with an edge to node i + 1 for all i < N.\n\nIn additional test cases worth 40% of total points, it will hold N, M ≤ $5*10^3$.\n\nA tree is a graph that consists of N nodes and N - 1 edges such that there exists a path from each\nnode to each other node.",
    "translation": "给定一颗从1到n编号的n个结点的树\n\n同时给定m个约束，诸如$(a_i,b_i)$\n\n给每一条边定向，使得对于每一对约束对存在一条从$a_i$到$b_i$或从$b_i$到$a_i$的路径。\n\n求可行的方案数，答案对$10^9 + 7$取模\n\n$1 \\le n,m \\le 3 \\times 10^5$\n\n```\n给定一颗从1到n编号的n个结点的树\n\n同时给定m个约束，诸如$(a_i,b_i)$\n\n给每一条边定向，使得每一对约束对存在一条从$a_i$到$b_i$或从$b_i$到$a_i$的路径。\n\n求可行的方案数，答案对$10^9 + 7$取模\n\n$1 \\le n,m \\le 3 \\times 10^5$\n```"
}