{
    "description": "The protagonist of this task, Chell, must solve a new puzzle GLaDOS has come up with.\n\nChell is in a room whose layout that can be represented as a matrix of dimensions N rows and M columns. Each field can be one of the following:\n\n- Obstructed field - there is a wall in it (denoted as ‘#’),\n- The field where Chell is initially (denoted as ‘C’),\n- The field where Chell must get to in order to solve the puzzle (denoted as ‘F’), or\n- An empty field (denoted as ‘.’).\n\nChell is carrying a so-called portal gun, a gun with which you can create portals in the walls.\n\nIn each move, she can do one of the following:\n- Move to an adjacent field using one move up, down, left or right (she cannot move to the field with a wall in it). This move lasts one unit of time.\n- Create a portal in the wall by turning towards a wall, not necessarily an adjacent one, in the direction up, down, left or right and shooting. The portal will be created only on the side of the wall it was hit from. In each moment, **at most two portals can be active**​. If a new portal is being created in the moment when two portals are already active, the one that was created earlier will disappear. It is not possible to create a new portal at the position of another existing portal. This move lasts a negligible\namount of time, i.e. zero amounts of time.\n- If she’s at a field that is adjacent to a wall and there’s a portal on her side of the wall, she can step into the portal and exit to a non-obstructed field with another portal. This move is possible if there are two active portals and lasts one unit of time.\n\nChell wants to know the minimal amount of time it takes for her to solve the puzzle, i.e. to reach the field denoted as ‘F’.\n\n**Please note**: The room will always have walls on the sides, and letters ‘C’ and ‘F’ will appear only once in the matrix.\n",
    "inputFormat": "The first line of input contains the positive integers N and M (4 ≤ N, M ≤ 500), the numbers from the task.\n\nEach of the following N lines contains M characters that describe the layout of the room.\n",
    "outputFormat": "You must output the minimal amount of time it takes to solve the puzzle, or “nemoguce” (without quotation marks, Croatian for impossible) if it is not possible to solve it.\n",
    "samples": [
        [
            "4 4\n####\n#.F#\n#C.#\n####\n",
            "2"
        ],
        [
            "6 8\n########\n#.##..F#\n#C.##..#\n#..#...#\n#.....##\n########\n",
            "4"
        ],
        [
            "4 5\n#####\n#C#.#\n###F#\n#####\n",
            "nemoguce\n"
        ]
    ],
    "hint": "In test cases worth 50% of total points, it will hold 4 ≤ N, M ≤ 15.\n\n**Clarification​ ​of​ ​the​ ​second​ ​test​ ​case:**\n\nThe puzzle can be solved in 8 moves, illustrated in the pictures below.\n\nIn the first move, we turn towards the left wall, shoot and create a portal that appears on the wall in the $3^{rd}$ row and $1^{st}$ column (coordinates (3,1)) from the right side.\n\nIn the second move, we create a portal from the upper side of the wall at coordinates (6,2).\n\nIn the third move, we step into the portal at coordinates (3,1) and exit at coordinates (5,2) - a\nnon-obstructed field with the second portal.\n\nIn the fourth move, we turn right and create a portal from the left side of the wall at coordinates (5,7).\nSince there are already two portals, the one at field (3,1) disappears.\n\nIn the fifth move, we step into the portal at coordinates (6,2) and exit at coordinates (5,6) with the\nsecond portal.\n\nIn the sixth move, we create a new portal from the lower side of the wall at coordinates (1,6), making\nthe portal at coordinates (6,2) disappear.\n\nIn the seventh move, we step into the portal at coordinates (5,7) and exit at coordinates (2,6).\nFinally, in the eighth move, we move one place to the right to end the game.\n\nThe portal creation in moves 1, 2, 4 and 6 lasts zero amounts of time, whereas the rest of the move\nlast one unit of time, so the total time needed to solve the puzzle is 4 units of time.\n\n![](https://cdn.luogu.com.cn/upload/pic/17512.png)",
    "translation": "题目大意:\n\n给定一个矩阵，每个格子由下列字母表示：\n\n●有障碍的区域表示为‘#’\n\n● 初始位置表示为‘C’\n\n● 目标位置表示为 ‘F’\n\n● 空白区域表示为‘.’\n\n可以进行三种操作：\n●走到上下左右相邻的格子，不能走到有墙的区域上，消耗一个单位时间。\n\n●在墙壁上创建传送门，用枪向上、向下、向左，向右直射向着墙壁。传送门会在被击中的墙的一侧产生。在每一时刻，最多两个传送门可以是活动的。如果在已有两个传送门的基础上再射击创建了一个新的，那么较早创建的门将消失。这个射击消耗的时间可忽略。\n\n●如果她在一个靠近墙的地方，墙上有一个传送门，她可以进入，到达另一个门外的无障碍区域出来，需要消耗一个单位时间。\n\n求到达目的地“F”所需的最少时间"
}