{
    "description": "坐标系下有若干个等腰直角三角形，且每个等腰直角三角形的直角顶点都在左下方，两腰与坐标轴平行。被奇数个三角形覆盖的面积部分为灰色，被偶数个三角形覆盖的面积部分为白色，如下图所示。\n![](https://cdn.luogu.com.cn/upload/pic/18669.png)\n已知 $N$个等腰直角三角形的顶点坐标及腰长，求灰色部分面积。\n\nMirko and Slavko have built their own LED display. The display is initially\nwhite. During each of the $N$ parts of the testing phase, Mirko attached three\nelectrodes to the display in such way that they formed a right isosceles\ntriangle. He noticed that, after attaching the electrodes, all pixels in the\nenclosing triangle are inverted (white pixels become black, and black pixels\nbecome white).\n\nWatching Mirko play with the electrodes, Slavko observed interesting shapes\nemerging on the screen. Mathematically inclined as he is, first thing that\ncrossed his mind was how to calculate total area covered by black pixels. Help\nhim by writing a program to do just that!",
    "inputFormat": "输入第一行包含一个整数 $N$，表示等腰直角三角形数量。\n\n接下来 $N$行，每行三个整数 $X, Y, R$，分别表示等腰直角三角形的顶点坐标 $(X, Y)$与腰长 $R$。\n\nFirst line of input contains an integer $N(1 \\leq N \\leq 10)$, number of triangles\nformed by Mirko's fiddling with electrodes. Each of the following $N$ lines\ncontains three integers $X, Y$ and $R (1 \\leq X, Y, R \\leq 10^6\n)$, describing a triangle. $(X, Y)$ are the coordinates of the lower left corner of the triangle, while $R$ represents the length of the two sides of the triangle.",
    "outputFormat": "输出包含一个实数，表示灰色部分面积。保留1位小数。\n\nThe first and only line of output should contain the area covered by black\npixels, rounded to one decimal place.",
    "samples": [
        [
            "3\n1 1 2\n7 1 6\n5 3 4",
            "24.0"
        ],
        [
            "5\n5 5 99\n5 5 99\n5 5 99\n5 5 99\n5 5 99",
            "4900.5"
        ],
        [
            "4\n5 5 99\n5 5 99\n5 5 99\n5 5 99",
            "0.0"
        ]
    ],
    "hint": "$1 \\leq N \\leq 10, 1 \\leq X, Y, R \\leq 10^6$"
}