{
    "description": "In a land with developed democracy far, far away, presidential elections for the football\nassociation are taking place. This land consists of N counties, and each county has its own\nfootball association. There are M presidential candidates labeled with 1, 2, … M. Each of the\nfootball associations will select exactly one candidate to cast their vote for. The winner of the\nelection is the candidate with the most votes. If multiple candidates get the most amount of\nvotes, the winner is the one with the smallest label.\n\nDuring the election campaign, candidates visited the counties and tried to gain their\nsympathies. After having met all the candidates, each county’s football association\ndetermined the order in which they would cast their vote for each candidate.\n\nFor example, let’s assume that there are four candidates in the election and that one\ncounty’s order is 2, 1, 4, 3. This means that, unless they revoke their candidacy, the\ncandidate with label 2 will get the county’s vote. If candidate 2 revokes their candidacy, and\ncandidate 1 is still in the race, then they will get the vote, and so on.\n\nZdravko is a passionate football fan, and also a close friend of candidate with label K. He\nwants to know which candidate will win if neither of the candidates revokes their candidacy.\n\nHe also wants to know what is the minimal number of candidates he must persuade to\nrevoke their candidacy in order for his friend, candidate K, to become the president of the\nfootball association.\n\nZdravko is currently dealing with other problems, so he is hoping that you will answer these\nquestions.\n",
    "inputFormat": "The first line of input contains the numbers N (1 ≤ N ≤ 100), M (1 ≤ M ≤ 15) and K (1 ≤ K ≤\nM) from the task.\n\nEach of the following N lines contains the orders given by the counties’ football associations,\ni.e. a permutation of the first M natural numbers.",
    "outputFormat": "You must output the answers to the questions from the task, each in its own line.",
    "samples": [
        [
            "3 4 1\n3 4 1 2\n4 2 3 1\n3 4 2 1",
            "3\n3"
        ],
        [
            "4 1 1\n1\n1\n1\n1",
            "1\n0"
        ],
        [
            "4 4 4\n2 3 1 4\n2 3 1 4\n1 3 2 4\n4 3 2 1",
            "2\n3"
        ]
    ],
    "hint": "The output must consist of two non-empty lines, each containing a single integer. ~~The correct answer to each of the questions is worth 50% of points for that test case.(不会做spj没用)~~\n\n**Clarification of the first test case:**\n\nThe land where the elections are being held consists of 3 counties, and there are 4 candidates for the\npresident of the association. If neither of the candidates revoke their candidacy, candidate 3 will win\nthe elections with two votes. Candidate 1 will only win if all the other candidates revoke their\ncandidacy.\n\n**Clarification of the second test case:**\n\nThere is only one candidate, Zdravko’s friend, so they will surely win."
}