{
    "description": "As we all very well know, goats and sheep have been fighting for years about the fields\nthey’re grazing. After many fierce fights, the goat leader and the sheep leader decided to\nmeet to try to find a peaceful solution to their problem. After many hours of discussion, they\nagreed that they will play a game for each field and that the winner will get to graze that field.\n\nThe game is played such that a total of N animals (that can be goats or sheep) form a circle\n(the exact order of goats and sheep is an agreement between their leaders). After animal i (1\n≤ i ≤ N-1), the game is continued by animal i+1, and after animal N, the game is continued by\nanimal 1. The animal starting the game can say any positive integer from the interval [1, K],\nbut only if that number is not greater than M. If the animal that started the game said the\nnumber j, then the next animal can say a number in interval [j+1, j+K], but only if that number\nis not greater than M. In other words, each animal can say a number that is greater by\nminimally 1, and maximally by K than the number said by the animal before, but only if the\nnew number is not greater than M. If an animal must say number M, its team (goats or\nsheep) loses.\n\nIf both the goats and the sheep are playing optimally, for each i (1 ≤ i ≤ N), determine who\nwill win the field if the game is started by the $i^{th}$ animal.\n",
    "inputFormat": "The first line of input contains N, M and K (1 ≤ N, M, K ≤ 5000), the numbers from the task.\nThe following line contains N numbers, 0 if the $i^{th}$  animal is a sheep, and 1 if it’s a goat.",
    "outputFormat": "Output N space-separated numbers. For each animal i (1 ≤ i ≤ N) output 0 if the sheep will\nwin the field, and 1 if the goats will win, if the $i^{th}$   animal is starting the game.\n",
    "samples": [
        [
            "2 9 2\n0 1",
            "0 1"
        ],
        [
            "6 499 5\n1 0 0 1 1 0",
            "0 1 1 1 1 0"
        ],
        [
            "10 100 10\n0 0 0 1 1 1 1 0 1 1",
            "1 1 1 1 1 1 1 1 1 1"
        ]
    ],
    "hint": "In test cases worth a total of 60% of points, it will hold 1 ≤ N, M, K ≤ 500.\n\n**Clarification of the first test case:**\n\nWhen a sheep is playing first, it can play like this:\n\nThe sheep starts with number 2, after which the goat can say 3 or 4. In both cases, the sheep can say\n5, after which the goat can say either 6 or 7. In both cases, the sheep can say 8, after which the goat\ndoesn’t have any other choice but 9 and thus losing the game and the field.",
    "translation": "给n个人每个人有个团队（0或1），每个人可以报一个数，第一个人的范围为[1,k]，上一个人报的数x下一个人为[x+1,x+1+k]，报数超过m的人输，1-n按顺序报数，n的下一个为1直到游戏结束。每个人都会选择最优策略，问以每个人为起始点玩这个游戏，那个团队会赢。\n\n由 @Unknown_Error  提供翻译"
}