{
    "description": "Little Stjepan often likes to go out with his friends and have fun in a popular nightclub in\nZagreb. However, Stjepan sometimes drinks too much soda and gets light headed from all\nthe sugar. Last night was an example of this, which is why Stjepan had the same image in\nhis mind the whole time. It was a scribble of number spirals of some sort. Since he can’t\nquite remember what the image looked like, but can describe it, he is asking you to\nreconstruct it for him.\n\nStjepan recalls that the image was of the shape of a table consisting of numbers written in ​N\nrows and ​M columns. Also, he recalls that there were ​K spirals in that table. For each spiral,\nthe starting position is known, as well as the direction it’s moving in, which can be clockwise\nand counter-clockwise. An example is shown in the images below. The spirals created\nStjepan’s image in exactly $10^{100}$ steps in the following way:\n1. Initially, the table is empty, and each spiral is in its own starting position.\n2. In each following step, each spiral moves to its next position. It is possible that, at\ntimes, the spirals leave the boundaries of the table, but also to return within it.\n3. After exactly $10^{100}$ steps, for each field in the table, the final value is the value of the\nearliest step in which one of the spirals touched that field.\n\n![](https://cdn.luogu.com.cn/upload/pic/19205.png)",
    "inputFormat": "The first line of input contains positive integers ​N\n, ​M\n(1 ≤ ​N\n, ​M\n≤ 50) and ​K\n(1 ≤ ​K\n≤ ​N\n*​M\n).\nEach of the following ​K lines contains three positive integers ​$X_i$\n, ​$Y_i$ and ​$T_i$ (1 ≤ ​X ≤ ​N\n, 1 ≤ ​Y ≤\nM\n, 0 ≤ ​T ≤ 1), the starting position of the $i^{th}$\nspiral and its direction (0 - clockwise, 1 -\ncounter-clockwise). No two spirals will begin in the same field.",
    "outputFormat": "You must output ​N lines with ​M numbers, representing the table after each spiral makes\n$10^{100}$ steps.",
    "samples": [
        [
            "3 3 1\n2 2 0",
            "9 2 3\n8 1 4\n7 6 5"
        ],
        [
            "3 3 1\n2 2 1",
            "3 2 9\n4 1 8\n5 6 7"
        ],
        [
            "3 3 2\n1 1 0\n1 2 0",
            "1 1 4\n6 5 5\n19 18 17"
        ]
    ],
    "hint": "In test cases worth 50% of total points, it will hold: ​N\n=​M\ni ​K\n=1 and ​$X_i$\n=​$Y_i$\n=$\\lfloor\\frac{N+1}{2}\\rfloor$, i.e. ​$X_i$\nand ​$Y_i$ \nwill be equal to the integer division of ​N\n+1 with 2.\n\n![](https://cdn.luogu.com.cn/upload/pic/19206.png)\n\nFor simplicity’s sake, the letter A was added to the numbers from the first spiral, and the letter B to the\nnumbers from the second spiral. Only the first 20 steps of the first spiral are shown, and 21 steps of\nthe second spiral. The fields in gray are the fields from the table we’re interested in, all other fields are\nout of the table’s bounds, but are shown to illustrate the way the spirals move outside of the table."
}