{
    "description": "Mirko and Slavko like to hike together. Mirko likes mountain peaks, and Slavko likes valleys.\nBecause of this, every time they climb to a peak, Slavko decides which valley they are going\nto descend to, given that a trail exists to it. Similarly, in each valley, Mirko decides which\npeak they are going to climb up to. It will never be possible to directly climb from one peak to\nanother, or to get from one valley to another valley. In order to make the hiking as fun as\npossible, they never visit the same spot twice (whether it’s a peak or a valley). Once they\nreach a spot that only leads to spots they’ve visited before, they call the mountain rangers to\npick them up. If the final spot is a peak, Mirko wins, and if it is a valley, Slavko wins.\n\nNaturally, you must already know what your task is: If we assume that both of them play\noptimally, who wins? Answer this question for all initial peaks.",
    "inputFormat": "The first line contains two positive integers, ​N and ​M (1 ≤ ​N ≤ 5000, 1 ≤ ​M ≤ min(5000, ​N\n·​N\n)).\nHere ​N denotes the number of peaks and valleys (therefore, there are ​N peaks and ​N\nvalleys), and ​M\ndenotes the number of hiking trails.\n\nEach of the following ​M lines contains two positive integers: ​$v_i$ and ​​$d_i$ (1 ≤ ​​$v_i$ , ​​$d_i$ ≤ ​N) that\ndenote there is a trail between peak ​​$v_i$ and valley ​$d_i$.\nBetween each peak and valley, there will exist at most one trail.",
    "outputFormat": "You must output ​N\nlines. The ​$i^{th}$ line denotes the winner if the starting point is peak ​i\n.",
    "samples": [
        [
            "2 3\n1 2\n2 2\n2 1",
            "Slavko\nSlavko"
        ],
        [
            "4 5\n2 2\n1 2\n1 1\n1 3\n4 2",
            "Slavko\nMirko\nMirko\nMirko"
        ],
        [
            "4 5\n1 2\n1 3\n2 2\n2 3\n4 1",
            "Slavko\nSlavko\nMirko\nSlavko"
        ]
    ],
    "hint": "In test cases worth 30% of total points, it will hold 1 ≤ ​N\n≤ 10 and 1 ≤ ​M\n≤ ​N\n·​N\n.\n\nIn test cases worth an additional 20% of total points, for each two connected spots, there will\nexist a unique path between them. In other words, the graph will be a forest.\n\n**Clarification of the second test case:**\n\nStarting from the first peak, Slavko can choose to go to the first valley, so Slavko wins.\n\nStarting from the second peak, Slavko can choose to go to the second valley, after which Mirko wins\nby choosing to go to the fourth peak.\n\nStarting from the third peak, there are no trails, so Mirko wins.\n\nStarting from the fourth peak, Slavko must choose to go to the second valley, after which Mirko wins\nby choosing the second peak.",
    "translation": "米尔科$(Mirko)$和斯拉夫科$(Slavko)$喜欢一起远足。米尔科喜欢山峰，斯拉夫科喜欢山谷。正因为如此，每当他们爬上一个山峰，若有连向山谷的路，则斯拉夫科就决定他们要去哪一个山谷。同样地，在每个山谷中，若有连向山峰的路，米尔科就决定他们将爬到哪一个山峰。不可能出现从一个山峰直接攀登到另一个山峰的情况，也不可能出现从一个山谷到另一个山谷的情况。为了使徒步旅行尽可能有趣，他们从不去同一地点两次（无论是一个山峰或一个山谷）。一旦他们到达一个地点，没有其它的地方可去，他们会叫登山者来接他们。如果最后一个点是一个山峰，则米尔科获胜，如果是一个山谷，则斯拉夫科获胜。\n\n现在你的任务是，对于每一个山峰，如果他们从这里出发，并且都采用最优策略，谁会赢？\n\n第一行两个正整数 $N,M$ $(1 ≤ N ≤ 5000, 1 ≤ M ≤ min(5000, N^2))$。$N$ 表示共有 $N$ 个山峰和 $N$ 个山谷。$M$ 表示共有 $M$ 条双向道路。\n\n接下来 $M$ 行，每行两个正整数$v_i,d_i$ $(1 ≤ v_i,d_i≤ N)$ 表示第 $v_i$ 个山峰与第 $d_i$ 个山谷有路相连。\n\n共 $N$ 行，每行一个字符串，第 $i$ 行表示从第 $i$ 个山峰出发的胜利者。\n\n$30\\%$的数据 $1 ≤ N≤ 10$\n\n另有$20\\%$的数据是森林。"
}