{
    "description": "Byteasar the hacker has qualified for this year’s IHO, the International Hacking Olympiad. One of the tasks in the Olympiad involves competing against a system operator. There are $n$ computers numbered from $1$ to $n$,connected in a ring topology, i.e. computers $i$ and $i+1$ are connected $(for \\ i = 1,...,n-1)$, and also computers $n$ and $1$ are connected.\nThe competition is performed as a game between the hacker and the system operator:\n   - Byteasar moves first. Afterwards, the operator and Byteasar move alternately.\n   - In his first move, Byteasar chooses any computer and hacks it (for instance,by exploiting some operating system vulnerabilities).\n   - In his first move, the operator chooses any non-hacked computer and protects it (for instance, by installing latest security upgrades).\n   - In all his following moves, Byteasar either (a) does nothing or (b) chooses any computer that is neither hacked nor protected and is directly linked to any hacked computer, and hacks it.\n   - In all his following moves, the operator either (a) does nothing or (b) chooses any computer that is neither hacked nor protected and is directly linked to any protected computer, and protects it.\n   - The game ends as soon as both have done nothing in two subsequent moves.\n\nAt the beginning of the game none of the computers are hacked or protected.\nEvery computer $i$ has a certain value viwhich specifies the value of the data which is stored on it. For each hacked computer $i$, Byteasar scores its value $v_i$. Byteasar is quite a good hacker, but has no idea of algorithms.\nThat is why he asks you to write a program that computes his maximum possible score, assuming that the operator plays optimally.",
    "inputFormat": "The first line of input contains a positive integer $n(n \\ge 2)$, specifying the number of computers. The second line contains a sequence of $n$ integers $v_1,v_2,...,v_n(1 \\le v_i \\le 2000)$; number vispecifies the value of the data\nstored on computer $i$.",
    "outputFormat": "In the first and only line of output your program should write one integer: Byteasar’s maximum possible score against an optimally playing operator.",
    "samples": [
        [
            "4\n7 6 8 4",
            "13"
        ],
        [
            "5\n1 1 1 1 1",
            "3"
        ]
    ],
    "hint": "**Explanation to the examples:** In the first example, Byteasar in his first move should hack computer $2$(scoring $6$). The operator’s response will be protecting computer $3$. In the next move Byteasar can hack computer $1$ (scoring $7$). Finally, the operator will protect computer $4$.\n\n以下子任务与评测无关，仅供参考。\n\n![PVIZHx.png](https://s1.ax1x.com/2018/07/05/PVIZHx.png)"
}