{
    "description": "A satellite is surveying a possible rover landing area on the moon. The landing area is modeled as a square grid embedded in the standard coordinate system.\n\nThe satellite has taken $n$ photos, each capturing a square area of the surface. Careful camera calibration has ensured that all photos are aligned with the grid — all four vertices have integer coordinates. Due to the satellite’s changing orbit there are two types of photos:\n   - Photos of type ``A`` have sides that are parallel to coordinate axes. Such a photo is specified by giving the integer coordinates $(x, y)$ of the square’s middle point and the length of its side $a$ — always an even integer.\n   - Photos of type ``B`` have sides at a $45^{\\circ}$ angle to the coordinate axes. Such a photo is specified by giving the integer coordinates $(x, y)$ of the square’s middle point and the length of its diagonal $d$ — always an even integer.\n\nFind the total surface area captured in the satellite photos.\n",
    "inputFormat": "The first line contains an integer $n(1 \\le n \\le 200 000)$ — the number of photos. The $j-th$ of the following $n$ lines is either of the form “$A \\ x_j \\ y_j  \\ a_j$” or “$B \\ x_j \\ y_j \\ d_j$” representing a photo of type ``A`` or ``B``,respectively.\n\nThe $x_j$ and $y_j$ are the integer coordinates of the middle point of the photo $(-1 000 \\le x_j, y_j \\le 1 000)$. The $a_j$ and $d_j$ are even integers $(2 \\le a_j, d_j \\le 1 000)$ — the side length and the diagonal length, respectively.",
    "outputFormat": "Output a number with exactly two digits after the decimal point — the total area of the surface. The answer has to exactly correspond to the judge’s solution (no rounding errors are tolerated).",
    "samples": [
        [
            "2\nA 0 0 2\nB 1 0 2",
            "5.00"
        ],
        [
            "8\nA -7 10 4\nB 3 10 8\nA -6 6 6\nA -2 5 8\nB 3 -1 8\nB -7 -4 8\nA 3 9 2\nB 8 6 6\n",
            "205.50"
        ]
    ],
    "hint": "",
    "translation": "（具体字母格式懒得操作）\n\n月球的景观\n\n题目描述\n\n一个卫星正在为探测车在月球上寻找一个合适的降落区。降落区被看做在平面直角坐标系中的一个方形区域。\n\n这颗卫星已经照了n张照片，每张照片都涵盖了月球表面的一块正方形区域。经过对相机的精细校准，可以保证所有照片涵盖的区域都和坐标对齐——正方形四个角的坐标都为整数。由于卫星的轨道一直在变化，所以照片有两种形式：\n·A类照片的边缘和坐标轴平行。对于这样的照片，题目将会给出它中心的坐标(x,y)和它的边长a（a为偶数）。\n·B类照片的边缘和坐标轴呈45°角。对于这样的照片，题目将会给出它中心的坐标(x,y)和它对角线的长度d（d为偶数）。\n\n求出卫星图片拍摄到平面的总大小。\n\n输入输出格式\n\n输入格式：\n\n第一行有一个整数n(1≤n≤200000)表示照片的数量。接下来n行中第j行的格式是\"A xj yj aj\"或\"B xj yj dj\" ，分别表示这张照片的类型是A或B。\n\nxj和yj是这张图片中心的坐标(1000≤xj,yj≤1000)。aj和dj为偶数(2≤aj,dj≤1000)，分别表示正方形的边长和对角线长度。\n\n输出格式：\n\n输出平面总的大小，保留两位小数。答案必须和标准答案严格相等（精度问题零容忍↖(^ω^)↗）。"
}