{
    "description": "The aliens from outer space have (finally!) invaded Earth. Defend yourself, or be disintegrated!\n\nOr assimilated. Or eaten. We are not yet sure.\n\nThe aliens follow a known attack pattern. There are $n$ attackers, the $i-th$ one appears at time $a_i$, at distance $d_i$ from you. He must be destroyed no later than at time $b_i$, or else he will fire his weapon, which will definitely end the fight.\n\nYour weapon is an area-blaster, which can be set to any given power. If fired with power $R$,it momentarily destroys all aliens at distance $R$ or smaller. It also consumes $R$ fuel cells.\n\nDetermine the minimal cost (measured in fuel cells) of destroying all the aliens, without being killed.",
    "inputFormat": "The first line of input contains the number of test cases $T$. The descriptions of the test cases follow:\n\nEach test case starts with a line containing the number of aliens $n(1 \\le n \\le 300)$. Of the next $n$ lines, the $i-th$ one contains three integers $a_i, b_i, d_i, (1 \\le a_i < b_i \\le 10 000, 1 \\le d_i \\le 10 000)$.\n\nThe $i-th$ alien appears at time $a_i$, is idle until $b_i$, and his distance from you is $d_i$.\n",
    "outputFormat": "For each test case, output one line containing the minimum number of cells needed to destroy all the aliens.\n",
    "samples": [
        [
            "1\n3\n1 4 4\n4 7 5\n3 4 7\n",
            "7"
        ]
    ],
    "hint": "",
    "translation": "### 题目描述\n来自外太空的外星人（最终）入侵了地球。保卫自己，或者解体，被他们同化，或者成为食物。迄今为止，我们无法确定。\n\n外星人遵循已知的攻击模式。有 $N$ 个外星人进攻，第 $i$ 个进攻的外星人会在时间 $a_i$ 出现，距离你的距离为 $d_i$，它必须在时间 $b_i$ 前被消灭，否则被消灭的会是你。\n\n你的武器是一个区域冲击波器，可以设置任何给定的功率。如果被设置了功率 $R$，它会瞬间摧毁与你的距离在 $R$ 以内的所有外星人（可以等于），同时它也会消耗 $R$ 单位的燃料电池。\n\n求摧毁所有外星人的最低成本（消耗多少燃料电池），同时保证自己的生命安全。\n\n### 输入格式\n\n第一行输入一个数 $T$,表示有 $T$ 组数据。\n\n每组数据的第一行为外星人的数量 $n$（$1\\leq n\\leq 300$）。\n\n接下来 $n$ 行，每行有三个数 $a_i,b_i,d_i$，表示这个外星人在时间 $a_i$ 出现，距离你 $d_i$，在 $b_i$ 前时刻死亡。\n\n### 输出格式\n\n共 $T$ 行，每行输出摧毁所有外星人的最低成本。"
}