{
    "description": "You are given a permutation p1, …, pn of the numbers 1 through n. In each step you can choose two numbers x < y and swap px with py.  \n\nLet m be the minimum number of such swaps needed to sort the given permutation. Compute the number of different sequences of exactly m swaps that sort the given permutation. Since this number may be large, compute it modulo 10^9 + 9.  ",
    "inputFormat": "The first line of the input file contains an integer t specifying the number of test cases. Each test case is preceded by a blank line.  \n\nEach test case consists of two lines. The first line contains the integer n. The second line contains the sequence p1, …, pn: a permutation of 1, …, n.  \n\nIn the easy subproblem C1, 1 ≤ n ≤ 10.  \n\nIn the hard subproblem C2, 1 ≤ n ≤ 105.  ",
    "outputFormat": "For each test case, output a single line with a single integer: x%(10^9+9), where x is the number of ways to sort the given sequence using as few swaps as possible.  ",
    "samples": [
        [
            "3\n\n3\n2 3 1\n\n4\n2 1 4 3\n\n2\n1 2",
            "3\n2\n1"
        ]
    ],
    "hint": "In the first test case, we can sort the permutation in two swaps. We can make the first swap arbitrarily; for each of them, there’s exactly one optimal second swap. For example, one of the three shortest solutions is “swap p1 with p2 and then swap p1 with p3”.  \n\nIn the second test case, the optimal solution involves swapping p1 with p2 and swapping p3 with p4. We can do these two swaps in either order.  \n\nThe third sequence is already sorted. The optimal number of swaps is 0, and thus the only optimal solution is an empty sequence of swaps.  \n题目来源：[IPSC2016](https://ipsc.ksp.sk/2016/real/problems/c.html)",
    "translation": "给定你一个 $ 1∼n $ 的排列 $p$，可进行若干次操作，每次选择两个整数 $x,y$，交换 $px,py$。\n\n请你告诉穰子，用最少的操作次数将给定排列变成单调上升的序列 $1,2,…,n$，有多少种方式呢？请输出方式数对 $10^9+9$ 取模的结果。\n\nTranslated by @LJC00118 "
}