{
    "description": "After eating too much fruit in Farmer John's kitchen, Bessie the cow is getting some very strange dreams! In her most recent dream, she is trapped in a maze in the shape of an $N×M$ grid of tiles $(1≤N,M≤1,000)$. She starts on the top-left tile and wants to get to the bottom-right tile. When she is standing on a tile, she can potentially move to the adjacent tiles in any of the four cardinal directions.\n\nBut wait! Each tile has a color, and each color has a different property! Bessie's head hurts just thinking about it:\n\n- If a tile is **red**, then it is impassable.\n\n- If a tile is **pink**, then it can be walked on normally.\n\n- If a tile is **orange**, then it can be walked on normally, but will make Bessie smell like oranges.\n\n- If a tile is **blue**, then it contains piranhas that will only let Bessie pass if she smells like oranges.\n\n- If a tile is **purple**, then Bessie will slide to the next tile in that direction (unless she is unable to cross it). If this tile is also a purple tile, then Bessie will continue to slide until she lands on a non-purple tile or hits an impassable tile. Sliding through a tile counts as a move. **Purple tiles will also remove Bessie's smell.**\n\n(If you're confused about purple tiles, the example will illustrate their use.)\n\nPlease help Bessie get from the top-left to the bottom-right in as few moves as possible. ",
    "inputFormat": " The first line has two integers $N$ and $M$, representing the number of rows and columns of the maze.\n\nThe next $N$ lines have $M$ integers each, representing the maze:\n\n- The integer '0' is a red tile\n\n- The integer '1' is a pink tile\n\n- The integer '2' is an orange tile\n\n- The integer '3' is a blue tile\n\n- The integer '4' is a purple tile \n\nThe top-left and bottom-right integers will always be '1'. ",
    "outputFormat": "A single integer, representing the minimum number of moves Bessie must use to cross the maze, or -1 if it is impossible to do so. ",
    "samples": [
        [
            "4 4\n1 0 2 1\n1 1 4 1\n1 0 4 0\n1 3 1 1",
            "10"
        ]
    ],
    "hint": "In this example, Bessie walks one square down and two squares to the right (and then slides one more square to the right). She walks one square up, one square left, and one square down (sliding two more squares down) and finishes by walking one more square right. This is a total of 10 moves (DRRRULDDDR).\n\nProblem credits: Nathan Pinsker, inspired by the game \"Undertale\". ",
    "translation": "有一个 $N\\times M$ 的棋盘，Bessie 开始时在左上角的格子，她要移动到右下角的格子上。当 Bessie 位于一个格子上时，她只能移动到与之有公共边的相邻格子。棋盘上的格子按照颜色可分为红、粉、橙、绿、紫五类。\n\n- 红色格子：不能通过。\n- 粉色格子：可以自由通过。\n- 橙色格子：可以自由通过，但 Bessie 通过橙色格子后会沾上橙子味。\n- 绿色格子：当且仅当 Bessie 身上有橙子味时，Bessie才能通过绿色格子。\n- 紫色格子：Bessie 会在上面漂移（除非她漂移的方向上有一个不能通过的格子），并且 Bessie 身上的橙子味会消失。举个例子，如果 Bessie 从紫色格子左边的格子移动到紫色格子上，\n * 如果右边是粉/橙色格子：Bessie 会滑到右边。\n * 如果右边是红/绿色格子，或者右边是边界：Bessie 会停在当前紫色格子上。\n * 如果右边仍然是紫色格子：Bessie 会滑到右边，然后继续根据这一规定来漂移。\n\n请问 Bessie 最少需要移动多少步。\n\nTranslated by @Planet6174 "
}