{
    "description": "Bessie the cow is a huge fan of card games, which is quite surprising, given her lack of opposable thumbs. Unfortunately, none of the other cows in the herd are good opponents. They are so bad, in fact, that they always play in a completely predictable fashion! Nonetheless, it can still be a challenge for Bessie to figure out how to win.\n\nBessie and her friend Elsie are currently playing a simple card game where they take a deck of $2N$ cards, conveniently numbered $1…2N$, and divide them into $N$ cards for Bessie and $N$ cards for Elsie. The two then play $N$ rounds, where in each round Bessie and Elsie both play a single card. In the first $N/2$ rounds, the player with the highest card earns a point, and in the last $N/2$ rounds, the rules switch and the player who plays the lowest card wins a point.\n\nGiven that Bessie can predict the order in which Elsie will play her cards, please determine the maximum number of points Bessie can win. ",
    "inputFormat": "The first line of input contains the value of $N$ ($2 ≤ N ≤ 50,000$; N will be even).\n\nThe next $N$ lines contain the cards that Elsie will play in each of the successive rounds of the game. Note that it is easy to determine Bessie's cards from this information. ",
    "outputFormat": " Output a single line giving the maximum number of points Bessie can score. ",
    "samples": [
        [
            "4\n1\n8\n4\n3\n",
            "2"
        ]
    ],
    "hint": "Here, Bessie must have cards 2, 5, and 6, and 7 in her hand, and she can use these to win at most 2 points, by saving her '2' card until one of the hands in the second half of the game.\n\nProblem credits: Brian Dean ",
    "translation": "有  $2N$  张牌，它们的点数分别为  $1$  到  $2N$ 。Bessie 拿了其中的  $N$  张，Elsie 拿了剩下的  $N$  张。  \nBessie 和 Elsie 会进行  $N$  轮游戏，在每轮游戏中，Bessie 和 Elsie 各出一张牌。出了的牌不能收回。  \n在前  $N/2$  轮中，谁的牌点数大谁就赢；在后  $N/2$  轮中，谁的牌点数小谁就赢。  \n已知 Elsie 每一轮会出什么牌，试求 Bessie 最多能赢多少轮。\n $2≤N≤50000,$  保证  $N$  是偶数。\n\nTranslated by @Planet6174 "
}