{
    "description": "Farmer John has purchased a subscription to Good Hooveskeeping magazine for his cows, so they have plenty of material to read while waiting around in the barn during milking sessions. Unfortunately, the latest issue contains a rather inappropriate article on how to cook the perfect steak, which FJ would rather his cows not see (clearly, the magazine is in need of better editorial oversight).\n\nFJ has taken all of the text from the magazine to create the string $S$ of length at most 10^6 characters. From this, he would like to remove occurrences of a substring $T$ to censor the inappropriate content. To do this, Farmer John finds the **_first_** occurrence of $T$ in $S$ and deletes it. He then repeats the process again, deleting the first occurrence of $T$ again, continuing until there are no more occurrences of $T$ in $S$. Note that the deletion of one occurrence might create a new occurrence of $T$ that didn't exist before.\n\nPlease help FJ determine the final contents of $S$ after censoring is complete.",
    "inputFormat": "The first line will contain $S$. The second line will contain $T$. The length of $T$ will be at most that of $S$, and all characters of $S$ and $T$ will be lower-case alphabet characters (in the range a..z). ",
    "outputFormat": "The string $S$ after all deletions are complete. It is guaranteed that $S$ will not become empty during the deletion process. ",
    "samples": [
        [
            "whatthemomooofun\nmoo",
            "whatthefun"
        ]
    ],
    "hint": "",
    "translation": "Farmer John为他的奶牛们订阅了Good Hooveskeeping杂志，因此他们在谷仓等待挤奶期间，可以有足够的文章可供阅读。不幸的是，最新一期的文章包含一篇关于如何烹制完美牛排的不恰当的文章，FJ不愿让他的奶牛们看到这些内容。\n\nFJ已经根据杂志的所有文字，创建了一个字符串  $ S $  ( $ S $  的长度保证不超过  $ 10^6 $  )，他想删除其中的子串  $ T $  ,他将删去  $ S $ 中第一次出现的子串  $ T $  ，然后不断重复这一过程，直到  $ S $  中不存在子串  $ T $ 。\n\n注意：每次删除一个子串后，可能会出现一个新的子串  $ T $ （说白了就是删除之后，两端的字符串有可能会拼接出来一个新的子串  $ T $ ）。\n\n输入格式：第一行是字符串  $ S $  ，第二行输入字符串  $ T $ ，保证  $ S $  的长度大于等于  $ T $  的长度， $ S $  和  $ T $  都只由小写字母组成。\n\n输出格式：输出经过处理后的字符串，保证处理后的字符串不会为空串。\n\nTranslated by @StudyingFather "
}