{
    "description": "It's a hot summer day, and Bessie the cow is feeling quite lazy. She wants to locate herself at a position in her field so that she can reach as much delicious grass as possible within only a short distance.\n\nThere are $N$ patches of grass $(1 <= N <= 100,000)$ in Bessie's field. The $ith$ such patch contains $g_i$ units of grass $(1 <= g_i <= 10,000)$ and is located at a distinct point $(x_i, y_i)$ in the field $(0 <= x_i,$ $y_i <= $ $1,000,000)$.  Bessie would like to choose a point in the field as her initial location (possibly the same point as a patch of grass, and possibly even a point with non-integer coordinates) so that a maximum amount of grass is within a distance of $K$ steps from this location $(1 <= K <= 2,000,000)$.\n\nWhen Bessie takes a step, she moves 1 unit north, south, east, or west of her current position.  For example, to move from $(0,0)$ to $(3,2)$, this requires 5 total steps.  Bessie does not need to take integer-sized steps -- for example, 1 total step could be divided up as half a unit north and half a unit east.\n\nPlease help Bessie determine the maximum amount of grass she can reach, if she chooses the best possible initial location.\n",
    "inputFormat": "* Line 1: The integers $N$ and $K$.\n\n* Lines 2..1+N: Line $i+1$ describes the $ith$ patch of grass using 3 integers: $g_i, x_i, y_i.$\n",
    "outputFormat": "* Line 1: The maximum amount of grass Bessie can reach within $K$ steps, if she locates herself at the best possible initial position.",
    "samples": [
        [
            "4 3\n7 8 6\n3 0 0\n4 6 0\n1 4 2",
            "8"
        ]
    ],
    "hint": "INPUT DETAILS:\n\nBessie is willing to take at most 3 steps from her initial position.  There\nare 4 patches of grass.  The first contains 7 units of grass and is located\nat position $(8,6)$, and so on.\n\nOUTPUT DETAILS:\n\nBy locating herself at $(3,0)$, the grass at positions $(0,0)$, $(6,0)$, and\n$(4,2)$ is all within $K$ units of distance.",
    "translation": "```\n  Bessie的田里有N(1<=N<=100,000)块草地，每块草地的坐标是 (xi, yi) (0<=xi,yi<=1,000,000),上面长着gi(1<=gi<=10,000)个单位的牧草。 \n  Bessie可以向东南西北方向走，一次走一步（一个单位长度）。如她从（0,0）走到（3,2）需要5步。她最多可以一次走k (1<=k<=2,000,000) 步。\n  现在她想找一个位置，使她从该位置出发可以得到最多单位的牧草(她可以走多次，但每次都从该位置出发)。 \n  输入格式： \n  第1行：两个整数N和K \n  第2~N+1行：三个整数gi，xi，yi \n  输出格式： \n  第1行：Bessie所能获得的最多单位牧草数\n```"
}