{
    "description": "Like everyone else, cows like to stand close to their friends when queuing for feed. FJ has N (2 <= N <= 1,000) cows numbered 1..N standing along a straight line waiting for feed. The cows are standing in the same order as they are numbered, and since they can be rather pushy, it is possible that two or more cows can line up at exactly the same location (that is, if we think of each cow as being located at some coordinate on a number line, then it is possible for two or more cows to share the same coordinate). \n\nSome cows like each other and want to be within a certain distance of each other in line. Some really dislike each other and want to be separated by at least a certain distance. A list of ML (1 <= ML <= 10,000) constraints describes which cows like each other and the maximum distance by which they may be separated; a subsequent list of MD constraints (1 <= MD <= 10,000) tells which cows dislike each other and the minimum distance by which they must be separated. \n\nYour job is to compute, if possible, the maximum possible distance between cow 1 and cow N that satisfies the distance constraints.",
    "inputFormat": "Line 1: Three space-separated integers: N, ML, and MD. \n\nLines 2..ML+1: Each line contains three space-separated positive integers: A, B, and D, with 1 <= A < B <= N. Cows A and B must be at most D (1 <= D <= 1,000,000) apart. \n\nLines ML+2..ML+MD+1: Each line contains three space-separated positive integers: A, B, and D, with 1 <= A < B <= N. Cows A and B must be at least D (1 <= D <= 1,000,000) apart.",
    "outputFormat": "Line 1: A single integer. If no line-up is possible, output -1. If cows 1 and N can be arbitrarily far apart, output -2. Otherwise output the greatest possible distance between cows 1 and N.\n",
    "samples": [
        [
            "4 2 1\n1 3 10\n2 4 20\n2 3 3",
            "27"
        ]
    ],
    "hint": "Explanation of the sample: \n\nThere are 4 cows. Cows #1 and #3 must be no more than 10 units apart, cows #2 and #4 must be no more than 20 units apart, and cows #2 and #3 dislike each other and must be no fewer than 3 units apart. \n\nThe best layout, in terms of coordinates on a number line, is to put cow #1 at 0, cow #2 at 7, cow #3 at 10, and cow #4 at 27.",
    "translation": "正如其他物种一样，奶牛们也喜欢在排队打饭时与它们的朋友挨在一起。FJ 有编号为 $1\\dots N$ 的 $N$ 头奶牛 $(2\\le N\\le 1000)$。开始时，奶牛们按照编号顺序来排队。奶牛们很笨拙，因此可能有多头奶牛在同一位置上。\n\n有些奶牛是好基友，它们希望彼此之间的距离小于等于某个数。有些奶牛是情敌，它们希望彼此之间的距离大于等于某个数。\n\n给出 $M_L$ 对好基友的编号，以及它们希望彼此之间的距离小于等于多少；又给出 $M_D$ 对情敌的编号，以及它们希望彼此之间的距离大于等于多少 $(1\\le M_L,$ $M_D\\le 10^4)$。\n\n请计算：如果满足上述所有条件，$1$ 号奶牛和 $N$ 号奶牛之间的距离最大为多少。\n\n## 输入输出格式\n\n### 输入格式\n\n第一行：三个整数 $N, M_L, M_D$，用空格分隔。\n\n第 $2\\dots M_L+1$ 行：每行三个整数 $A, B, D$，用空格分隔，表示 $A$ 号奶牛与 $B$ 号奶牛之间的距离须 $\\le D$。保证 $1\\le A<B\\le N,$ $1\\le D\\le 10^6$. \n\n第 $M_L+2\\dots M_L+M_D+1$ 行：每行三个整数 $A, B, D$，用空格分隔，表示 $A$ 号奶牛与 $B$ 号奶牛之间的距离须 $\\ge D$。保证 $1\\le A<B\\le N,$ $1\\le D\\le 10^6$. \n\n### 输出格式\n\n一行，一个整数。如果没有合法方案，输出 `-1`. 如果有合法方案，但 $1$ 号奶牛可以与 $N$ 号奶牛相距无穷远，输出 `-2`. 否则，输出 $1$ 号奶牛与 $N$ 号奶牛间的最大距离。"
}