{
    "description": "Ever since Krešo started growing chili peppers, N restaurants all over Croatia showed\ninterest in his peppers so they could enrich their dishes with real spice. Because of high\ndemand, Krešo decided to start working as a delivery guy of chili peppers.\n\nThe restaurants are denoted with numbers from 1 to N and are mutually connected with N -\n1 roads such that traveling between any two restaurants is possible. Krešo begins his\njourney in the restaurant denoted with 1. In one unit of time, he can either drive to the\nadjacent restaurant or deliver the peppers to the current restaurant. For each restaurant, we\nknow the required amount of peppers $A_i$.\n\nSince delivering goods is tiring, Krešo decided to spend a total of M units of time on delivery\nand travel, after which he plans to take a break.\n\nDetermine the maximal amount of peppers Krešo can deliver in the given timeframe. You\ncan assume that Krešo always carries an unlimited supply of peppers.",
    "inputFormat": "The first line of input contains two integers N and M (1 ≤ N, M ≤ 500), the number of\nrestaurants and the time Krešo plans to spend delivering peppers.\n\nThe second line of input contains N integers $A_i$\n(1 ≤ $A_i$ ≤ $10^6$\n), the required amount of peppers\nfor restaurants denoted with i (1 ≤ i ≤ N).\n\nEach of the following N - 1 lines contains two integers U and V (1 ≤ U, V ≤ N, U ≠ V) that\nrepresent the road between restaurants U and V.",
    "outputFormat": "You must output the maximal amount of peppers Krešo can deliver in the given timeframe.\n",
    "samples": [
        [
            "3 5\n9 2 5\n1 2\n1 3\n",
            "14"
        ],
        [
            "4 5\n1 1 1 2\n1 2\n2 3\n3 4\n",
            "3"
        ],
        [
            "5 10\n1 3 5 2 4\n5 2\n3 1\n2 3\n4 2",
            "15"
        ]
    ],
    "hint": "**Clarification of the first test case:**\n\nIn the first step, Krešo will deliver the peppers to restaurant 1.\n\nIn the second step, Krešo will travel to restaurant 3.\n\nIn the third step, Krešo will deliver the peppers to restaurant 3.\n\nHe is left with 2 units of time, in which he can drive to restaurant 2, but he lacks one unit of time to\ndeliver the peppers to that restaurant.",
    "translation": "题目描述\r\n自从Krešo开始种植辣椒以来，克罗地亚各地的N家餐馆都对他的辣椒感兴趣，因此他们可以用真正的香料来丰富他们的菜肴。由于需求量很大，Krešo决定开始作为辣椒的送货员。\r\n餐馆用从1到N的数字表示，并且与N-1个道路相互连接，使得可以在任何两个餐馆之间旅行。Krešo在1号餐厅开始他的旅程。在一个单位的时间里，他可以开车到相邻的餐厅或将辣椒送到现在的餐馆。对于每家餐厅，我们都知道所需的辣椒数量Ai\r\n由于交付货物很累，Krešo决定在交付和旅行上花费总共M个单位的时间，之后他计划休息一下。\r\n确定Krešo在给定时间范围内可以提供的最大辣椒数量。你可以假设Krešo总是带有无限量的辣椒。\r\n输入输出格式\r\n输入格式：\r\n第一行输入包含两个整数N和M（1≤N，M≤500），餐馆数量和Krešo计划用于交付辣椒的时间。\r\n第二行输入包含N个整数 Ai\r\n（1≤ Ai\r\n≤ 10 ^ 6\r\n），用i表示的餐馆所需的辣椒数量（1≤i≤N）。\r\n以下N-1行中的每一行包含两个整数U和V（1≤U，V≤N，U≠V），其表示餐馆U和V之间的道路。\r\n输出格式：\r\n您必须输出Krešo在给定时间范围内可以提供的最大量的辣椒。"
}