{
    "description": "If you are an average football fan, you probably know that obtaining tickets for this year's World Cup in\nGermany was an almost impossible task. Greedy organizers and football federations grabbed the majority of\navailable tickets and divided them among sponsors, friends and family members. As a result, jet setters have\nflooded the venues, while die-hard fans sit at home enjoying the games between advertisements featuring crappy\nbeer and sugar-free chewing gum.\n\nA couple of tickets are left for the final game and a huge queue has formed in front of the ticket office. As fans\nwere arriving, they were labeled with successive integers. The first person in queue was labeled with number one,\nthe second with number two, etc.\n\nSince the fans arrived the night before, they had to wait for a long time before the ticket counter was open and,\nnaturally, some of them had to use the restroom. Each time a person needs to use the restroom, he/she steps\nout of the queue and, after completing the task, steps back into the queue, though not necessarily at the same\nposition as before. Since there is only one restroom available, no person leaves the queue before the previous\nperson has returned (hence, at any moment there is at most one person missing from the queue).\n\nDuring the course of the night, a total of N restroom visits have occurred. Each visit is described by two positive\nintegers A and B, denoting that the person labeled **A stepped out of the queue** and then stepped back into the\nqueue **immediately in front of the person labeled B**. Now that all the visits have completed, the officials have\nto answer a series of questions. Each question is either of the form 'P X', asking for **the position of the person\nlabeled X**, or of the form 'L X', asking for **the label of the person at position X**.\n\nThe first person in queue is considered to be at position one, the second at position two, etc.\n\nWrite a program that, given the description of the visits and a number of questions, **answers all of the\nquestions**. ",
    "inputFormat": "The first line of input contains an integer N (2 ≤ N ≤ 50 000) – the total number of restroom visits.\n\nEach of the following N lines contains two different integers A and B (1 ≤ A, B ≤ 109), describing one restroom\nvisit. The next line contains an integer Q (1 ≤ Q ≤ 50 000) – the total number of questions.\n\nEach of the following Q lines contains a single character (either the uppercase letter 'P' or the uppercase letter\n'L') and an integer X (1 ≤ X ≤ 109), describing one question. ",
    "outputFormat": "The output should consist of a total of Q lines.\n\nThe ith line of output should contain a single integer R – the answer to the ith question.\n\nIf the corresponding question is of the form 'P Xi' then R should be the final position of the person labeled Xi.\n\nIf the corresponding question is of the form 'L Xi' then R should be the label of the person at position Xi. ",
    "samples": [
        [
            "2\n6 3\n9 6\n8\nL 1\nL 2\nL 3\nL 4\nP 1\nP 2\nP 3\nP 4 ",
            "1\n2\n9\n6\n1\n2\n5\n6 "
        ],
        [
            "5\n7 2\n2 7\n9 7\n10 1\n100005 99995\n9\nL 1\nP 2\nL 2\nP 7\nL 7\nP 9\nP 10\nP 99999\nL 100000 ",
            "10\n3\n1\n5\n4\n4\n1\n100000\n99999 "
        ]
    ],
    "hint": "Partial credit is awarded for incorrect solutions that correctly answer all questions of one type. If all questions of\nthe form 'P X' are answered correctly or if all questions of the form 'L X' are answered correctly, you will receive\n50% of the points for the corresponding test case.\n\nIn order to receive partial credit, the output should be formatted according to the specifications. Therefore, even\nif you choose to answer only one type of questions, you should still produce output for all questions of the other\ntype. ",
    "translation": "翻译经过简化，但不是结论。\n\n一开始将一列人按编号从 $1$ 开始顺序排列，然后进行 $N$ 次操作，每次将编号为 $A$ 的人拿出，放在编号为 $B$ 的人前面，所有操作进行完后有 $Q$ 个问题，询问编号为 $X$ 的人的位置，或者询问在 $X$ 号位置上的人的编号。"
}