{
    "description": "You are buying lunch at a buffet. A number of different dishes are available, and you can mix and match them to your heart’s desire. Some of the dishes, such as dumplings and roasted potatoes, consist of pieces of roughly equal size, and you can pick an integral number of such pieces (no splitting is allowed). Refer to these as “discrete dishes.” Other dishes, such as tzatziki or mashed potatoes, are fluid and you can pick an arbitrary real-valued amount of them. Refer to this second type as “continuous dishes.”\n\nOf course, you like some of the dishes more than others, but how much you like a dish also depends on how much of it you have already eaten. For instance, even if you generally prefer dumplings to potatoes, you might prefer a potato over a dumpling if you have already eaten ten dumplings. To model this, each dish $i$ has an initial tastiness $t_ i$, and a rate of decay of the tastiness $\\Delta t_ i$. For discrete dishes, the tastiness you experience when eating the $n^{th}$ item of the dish is $t_ i - (n-1)\\Delta t_ i$. For continuous dishes, the tastiness you experience when eating an infinitesimal amount $d x$ grams of the dish after already having eaten $x$ grams is $(t_ i - x \\Delta t_ i) d x$. In other words, the respective total amounts of tastiness you experience when eating $N$ items of a discrete dish or $X$ grams of a continuous dish are as follows:\n\n$$\\begin{aligned} \\sum _{n=1}^{N} (t_ i - (n-1)\\Delta t_ i) & &  \\text {and} & & \\int _{0}^ X (t_ i - x\\Delta t_ i) dx  \\end{aligned} $$\n\nFor simplicity, do not take into account that different dishes may or may not go well together, so define the total tastiness that you experience from a meal as the sum of the total tastinesses of the individual dishes in the meal (and the same goes for the weight of a meal – there are no food antiparticles in the buffet!).\n\nYou have spent days of painstaking research determining the numbers $t_ i$ and $\\Delta t_ i$ for each of the dishes in the buffet. All that remains is to compute the maximum possible total tastiness that can be achieved in a meal of weight $w$. Better hurry up, lunch is going to be served soon!",
    "inputFormat": "The input consists of a single test case. The first line of input consists of two integers $d$ and $w$ ($1 \\le d \\le {250}$ and $1 \\le w \\le {10\\, 000}$), where $d$ is the number of different dishes at the buffet and $w$ is the desired total weight of your meal in grams.\n\nThen follow $d$ lines, the $i^{th}$ of which describes the $i^{th}$ dish. Each dish description is in one of the following two forms:\n\nA description of the form “D $w_ i$ $t_ i$ $\\Delta t_ i$” indicates that this is a discrete dish where each item weighs $w_ i$ grams, with initial tastiness $t_ i$ and decay of tastiness $\\Delta t_ i$.\n\nA description of the form “C $t_ i$ $\\Delta t_ i$” indicates that this is a continuous dish with initial tastiness $t_ i$ and decay of tastiness $\\Delta t_ i$.\n\nThe numbers $w_ i$, $t_ i$, and $\\Delta t_ i$ are integers satisfying $1 \\le w_ i \\le {10\\, 000}$ and $0 \\le t_ i, \\Delta t_ i \\le {10\\, 000}$.",
    "outputFormat": "Display the maximum possible total tastiness of a meal of weight $w$ based on the available dishes. Give the answer with a relative or absolute error of at most $10^{-6}$. If it is impossible to make a meal of total weight exactly $w$ based on the available dishes, display impossible.",
    "samples": [
        [
            "2 15\nD 4 10 1\nC 6 1\n",
            "40.500000000\n"
        ],
        [
            "3 15\nD 4 10 1\nC 6 1\nC 9 3\n",
            "49.000000000\n"
        ],
        [
            "2 19\nD 4 5 1\nD 6 3 2\n",
            "impossible\n"
        ]
    ],
    "hint": "Time limit: 3000 ms, Memory limit: 1048576 kB. \n\n International Collegiate Programming Contest (ACM-ICPC) World Finals 2014",
    "translation": "### 题目描述\n\n自助餐厅里有 $n$ 种食物，分为两大类，为 “离散食物”和“连续食物”。你可以通过吃食物来获得收益。\n\n离散食物用 $(w,t_0,\\Delta t)$ 描述。对于这种食物，你只能吃整数个，每个重为 $w$。吃的第一个收益为 $t_0$，后面每吃一个收益减少 $\\Delta t$。具体的，吃的第 $i$ 个这种食物 （从 $1$ 开始标号），收益为 $t_0-(i-1)\\Delta t$。\n\n连续食物用 $(t_0,\\Delta t)$ 描述。对于这种食物，你可以吃任意食物的重量。如果你吃的重量为 $w$，获得的收益是 $t_0w-\\dfrac{1}{2}\\Delta t w^2$。\n\n你现在要吃重量和 **恰好** 为 $W$ 的食物。最大化你的收益。\n\n### 数据范围\n\n$n\\le 250,W\\le 10000$。\n\n对于离散食物，满足 $1\\le w\\le 10000$。\n\n对于所有食物，满足 $0\\le t_0,t\\le 10000$。\n\n### 输入格式\n\n第一行是 $n,W$，接下来每行先来一个字母，如果是 C 表示连续食物，后面跟两个数表示 $t_0,\\Delta t$；如果是 D 表示离散食物，后面跟三个数，表示 $w,t_0,\\Delta t$。\n\n### 输出格式\n\n一行一个数表示答案。相对或绝对误差不超过 $1e-6$。"
}