{
    "description": "Misha needs to send packages to his friend Nadia. Both of them often travel across Russia, which is very large. So they decide to hire a messenger. Since the cost of the messenger service depends on the time it takes to deliver the package, they need your help to optimize a little bit.\n\nAssume Misha and Nadia move on a two-dimensional plane, each visiting a sequence of places and moving along straight line segments from place to place. Your task is to find the shortest possible delivery time given their two paths.\n\nMisha hands the package to the messenger at some point along his path. The messenger moves without delay along a straight line from the pick-up to intercept Nadia, who is traveling along her path. Misha, Nadia and the messenger move with a constant speed of $1$ distance unit per time unit. The delivery time is the time between Misha handing over the package and Nadia receiving it.",
    "inputFormat": "The input consists of a single test case. The test case contains two path descriptions, the first for Misha and the second for Nadia. Each path description starts with a line containing an integer $n$, the number of places visited ($2 \\leq n \\leq 50\\, 000$). This is followed by $n$ lines, each with two integers $x_ i$ and $y_ i$ specifying the coordinates of a place ($0 \\leq x_ i, y_ i \\leq 30\\, 000$). Coordinates of the places are listed in the order in which they are to be visited, and successive places do not have the same coordinates.\n\nMisha and Nadia start their journeys at the same time, visiting the places along their paths without stopping. The length of each path is at most $10^6$. The package must be picked up at the latest when Misha reaches his final place and it must be delivered at the latest when Nadia reaches her final place.",
    "outputFormat": "Display the minimal time needed for delivery. Give the answer with an absolute error of at most $10^{-3}$ or a relative error of at most $10^{-5}$. If the package cannot be delivered, display impossible instead.",
    "samples": [
        [
            "2\n0 0\n0 10\n2\n4 10\n4 0\n",
            "4.00000\n"
        ],
        [
            "2\n0 0\n1 0\n3\n2 0\n3 0\n3 10\n",
            "5.00000\n"
        ]
    ],
    "hint": "Time limit: 3000 ms, Memory limit: 1048576 kB. \n\n International Collegiate Programming Contest (ACM-ICPC) World Finals 2014",
    "translation": "题目描述：  \n平面上有两个移动的点 A,B，其中 A 想要向 B 发送一条信息。两个点会同时出发，各自沿着一个折线移动到终点为止。A 会在移动的途中发送一条信息，这条信息可以视作一个点 C，它会沿一条射线匀速运动，当 C 与 B 重合时，B 即可收到该信息。\n\nA,B,C 的移动速度都是 1 单位长度每秒，A 最晚在它到达终点时发出信息，B 最晚需要在它到达终点时收到信息。令 $t_A$ 代表发送信息的时间，$t_B$ 代表接收信息的时间，那么你需要最小化 $t_B-t_A$ 的值。特别地，如果 B 无论如何都无法收到信息，你需要输出 `impossible`。\n\n输入格式：\n\n第一行包含一个整数 $n$，代表 A 经过折线的点数；  \n下面 $n$ 行，每行输入两个整数 $x_i,y_i$，依次描述 A 所走折线的点。  \n下面一行包含一个整数 $m$，B 过折线的点数；  \n下面 $m$ 行，每行输入两个整数 $u_i,v_i$，描述 B 所走折线。\n\n输出格式：\n\n一行，输出一个实数，代表答案。若无法满足，则输出`impossible`。"
}