{
    "description": " ![](https://vj.z180.cn/751a8fdd9863b69e86176e87e1fd5b20?v=1600415919)  \n\nFatima Cynara is an analyst at Amalgamated Artichokes (AA). As with any company, AA has had some very good times as well as some bad ones. Fatima does trending analysis of the stock prices for AA, and she wants to determine the largest decline in stock prices over various time spans. For example, if over a span of time the stock prices were $19$, $12$, $13$, $11$, $20$ and $14$, then the largest decline would be $8$ between the first and fourth price. If the last price had been $10$ instead of $14$, then the largest decline would have been $10$ between the last two prices. \n\nFatima has done some previous analyses and has found that the stock price over any period of time can be modelled reasonably accurately with the following equation:\n\n$$ \\operatorname {price}(k) = p \\cdot (\\sin (a \\cdot k+b) + \\cos (c \\cdot k+d) + 2) $$\n\nwhere $p$, $a$, $b$, $c$ and $d$ are constants. Fatima would like you to write a program to determine the largest price decline over a given sequence of prices. Figure 1 illustrates the price function for Sample Input 1. You have to consider the prices only for integer values of $k$.\n\n  ![](https://vj.z180.cn/800605356b7337600d5163d2e5d7aab4?v=1600415919) \n\n   Figure 1: Sample Input 1. The largest decline occurs from the fourth to the seventh price. ",
    "inputFormat": "The input consists of a single line containing $6$ integers $p$ ($1 \\le p \\le 1\\, 000$), $a$, $b$, $c$, $d$ ($0 \\le a, b, c, d \\le 1\\, 000$) and $n$ ($1 \\le n \\le 10^6$). The first $5$ integers are described above. The sequence of stock prices to consider is $\\operatorname {price(1)}, \\operatorname {price(2)}, \\ldots , \\operatorname {price}(n)$.",
    "outputFormat": "Display the maximum decline in the stock prices. If there is no decline, display the number $0$. Your output should have an absolute or relative error of at most $10^{-6}$.",
    "samples": [
        [
            "42 1 23 4 8 10\n",
            "104.855110477\n"
        ],
        [
            "100 7 615 998 801 3\n",
            "0.00\n"
        ],
        [
            "100 432 406 867 60 1000\n",
            "399.303813\n"
        ]
    ],
    "hint": "Time limit: 5000 ms, Memory limit: 1048576 kB. \n\n International Collegiate Programming Contest (ACM-ICPC) World Finals 2015",
    "translation": "**题目背景**\n\n法蒂玛是针对联合洋蓟果业公司 (Amalgamated Artichokes , AA) 的股票分析员。和其他的公司一样，联合洋蓟果业公司有的时候行情较好，有的时候不太行。法蒂玛对联合洋蓟果业公司的股票价格做了跟踪分析，她想确定不同时间段内股价最大跌幅是多少。比如如果一段时间内股价分别为191919元，121212元，131313元，111111元，202020元，141414元，则最大的跌幅为第一天和第四天之间的888。如果最后一天的价格不是141414元而是101010元，则最大跌幅为最后两天股价之间的101010元。\n\n法蒂玛做了些前期的分析，发现一段时间的股价可以建模精确合理地表示为以下方程式：\n$$\nprice⁡(k)=p⋅(sin⁡(a⋅k+b)+cos⁡(c⋅k+d)+2)\n$$\n其中$p,a,b,c,d$均为常数。法蒂玛想要你写个程序确定给定价格序列上的最大股价跌幅。\n\n图1说明了第一组样例的价格函数，你只能考虑时间为整数$k$时的价格。\n\n对于第一组样例，最大股价跌幅出现在第四天和第七天之间。\n\n**一句话题意**\n\n对于给定序列，求差值最大的逆序对\n\n**输入格式**\n\n输入共一行，包含六个整数$p (1 \\le p \\le 1000), a, b, c, d ( 0 \\le a, b, c, d \\le 1\\, 000)$ 和$ n (1 \\le n \\le 10^6).$\n\n前五个整数意义如题目所述，给定序列长度为n。\n\n**输出格式**\n\n输出股价最大跌幅，如果没有股价下跌则输出0。\n\n输出最多和标准答案有$10^{-6}$的相对或绝对误差。\n\n**说明/提示**\n\n时间限制: 5000 ms \n\n空间限制: 1048576 kB.\n\nInternational Collegiate Programming Contest (ACM-ICPC) World Finals 2015"
}