{
    "description": "![](https://cdn.luogu.com.cn/upload/image_hosting/f8fpcjx7.png) \n\nYoussef is a Moroccan tile installer who specializes in mosaics like the one shown on the right. He has rectangular tiles of many dimensions at his disposal, and the dimensions of all his tiles are integer numbers of centimeters. When Youssef needs parallelogram-shaped tiles, he cuts them from his supply on hand. To make this work easier, he invented a tile cutting machine that superimposes a centimeter grid on the cutting surface to guide the cuts on the tiles. Due to machine limitations, aesthetic sensibilities, and Youssef’s dislike of wasted tiles, the following rules determine the possible cuts. \n\nThe rectangular tile to be cut must be positioned in the bottom left corner of the cutting surface and the edges must be aligned with the grid lines.\n\nThe cutting blade can cut along any line connecting two different grid points on the tile boundary as long as the points are on adjacent boundary edges.\n\nThe four corners of the resulting parallelogram tile must lie on the four sides of the original rectangular tile.\n\nNo edge of the parallelogram tile can lie along an edge of the rectangular tile.\n\nFigure 1 shows the eight different ways in which a parallelogram tile of area $4$ square centimeters can be cut out of a rectangular tile, subject to these restrictions.\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/figekxdx.png)\n\n   Figure 1: The eight different ways for cutting a parallelogram of area 4. \n\nYoussef needs to cut tiles of every area between $a_{\\text {lo}}$ and $a_{\\text {hi}}$. Now he wonders, for which area $a$ in this range can he cut the maximum number of different tiles?",
    "inputFormat": "The input consists of multiple test cases. The first line of input contains an integer $n$ ($1 \\le n \\le 500$), the number of test cases. The next $n$ lines each contain two integers $a_{\\text {lo}}, a_{\\text {hi}}$ ($1 \\le a_{\\text {lo}} \\le a_{\\text {hi}} \\le 500\\, 000$), the range of areas of the tiles.",
    "outputFormat": "For each test case $a_{\\text {lo}}$, $a_{\\text {hi}}$, display the value $a$ between $a_{\\text {lo}}$ and $a_{\\text {hi}}$ such that the number of possible ways to cut a parallelogram of area $a$ is maximized as well as the number of different ways $w$ in which such a parallelogram can be cut. If there are multiple possible values of $a$ display the smallest one.",
    "samples": [
        [
            "2\n4 4\n2 6\n",
            "4 8\n6 20\n"
        ]
    ],
    "hint": "Time limit: 11000 ms, Memory limit: 1048576 kB. \n\n International Collegiate Programming Contest (ACM-ICPC) World Finals 2015",
    "translation": "Youssef是一名专业贴瓷砖的修墙工，并且擅长用瓷砖贴出马赛克图案（如上图所示）。所有的瓷砖的尺寸长度均为整数，单位为$cm$。在马赛克图案中，平行四边形是不可或缺的。因此，Youssef会使用切割机，将矩形的瓷砖进行切割。在切割过程中，Youssef选择使用网格辅助切割机进行切割（在瓷砖上布上$cm$的网格方便切割）。\n\n\t切割过程有以下要求：\n1.\t可以从两个不同端点的连线切割（可以斜着切割）\n2.\t新平行四边形的四个角必须在矩形瓷砖的最外侧边上\n3.\t平行四边形的边不能与矩形的任意一条边边重叠\n\n现在给出切割的面积的两个边界值$a_{lo}$和$a_{hi}$，求出Youssef能够最多切割掉的小矩形瓷砖数量。\n\n**输入格式：**\n\n给出测试样例数量$n$($1≤n≤500$)。下面$n$行给出切割面积的两个边界值$a_{lo}$和$a_{hi}$（$1≤a_{lo}≤a_{hi}≤500 000$）\n\n**输出格式：**\n\n每行先输出平行四边形面积$a$，再输出小矩形最多切割数量$w$。如果$a$有不同值的时候，输出最小的即可。"
}