{
    "description": "During last year’s ACM ICPC World Finals in Marrakesh, one of the judges bought a pretty wooden puzzle depicting a camel and palm trees (see Figure 1). Unlike traditional jigsaw puzzles, which are usually created by cutting up an existing rectangular picture, all the pieces of this puzzle have been cut and painted separately. As a result, adjacent pieces often do not share common picture elements or colors. Moreover, the resulting picture itself is irregularly shaped. Given these properties, the shape of individual pieces is often the only possible way to tell where each piece should be placed.\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/ug8atpvc.png)\n\n   Figure 1: The judge’s wooden puzzle. \n\nThe judge has been wondering ever since last year whether it is possible to write a program to solve this puzzle. An important part of such a program is a method to evaluate how well two puzzle pieces “match” each other. The better the match, the more likely it is that those pieces are adjacent in the puzzle.\n\nPieces are modeled as simple polygons. Your task is to find a placement of two given polygons such that their interiors do not overlap but the polygons touch with their boundaries and the length of the common boundary is maximized. For this placement, polygons can be translated and rotated, but not reflected or resized. Figure 2 illustrates the optimal placement for Sample Input 1.\n\n ![](https://cdn.luogu.com.cn/upload/image_hosting/xhl8b2h0.png)\n\n   Figure 2: Sample Input 1 and its optimal placement. ",
    "inputFormat": "The input contains the description of two polygons, one after the other. Each polygon description starts with a line containing an integer $n$ ($3 \\leq n \\leq 50$) denoting the number of vertices of the polygon. This is followed by $n$ lines, each containing two integer coordinates $x$, $y$ of a polygon vertex ($|x|, |y| \\leq 100$). The vertices of each polygon are given in clockwise order, and no three consecutive vertices are collinear.\n\nThe input data is chosen so that even if the vertices were moved by a distance of up to $10^{-7}$, the answer would not increase by more than $10^{-4}$.",
    "outputFormat": "Display the maximum possible length of the common boundary of these polygons when they are optimally placed. Your answer should have an absolute or relative error of less than $10^{-3}$.",
    "samples": [
        [
            "8\n0 0\n0 10\n10 10\n15 15\n24 6\n24 10\n30 10\n30 0\n7\n-5 0\n-5 10\n10 10\n15 5\n20 10\n35 10\n35 0\n",
            "30.142135624\n"
        ],
        [
            "3\n1 0\n0 30\n40 0\n3\n1 0\n0 30\n40 0\n",
            "50\n"
        ]
    ],
    "hint": "Time limit: 18000 ms, Memory limit: 1048576 kB. \n\n International Collegiate Programming Contest (ACM-ICPC) World Finals 2016",
    "translation": "## 题意简述\n有两个多边形，可以平移旋转（但不能对称、缩放等），求这两个多边形贴在一起但不重合的情况下贴贴部分的最大总长度。\n\n## 输入格式\n第一行一个数字$n_1$，表示第一个多边形是$n_1$边形。\n\n接下来$n_1$行，每行两个数字，表示第一个多边形每个端点的横、纵坐标。\n\n接下来一个数字$n_2$，表示第二个多边形是$n_2$边形。\n\n最后$n_2$行，每行两个数字，表示第二个多边形每个端点的横、纵坐标。\n\n## 输出格式\n一行，最大的贴贴部分长度，绝对误差或相对误差任一小于$10^{-3}$即可通过。\n\n## 数据范围\n$3 \\leq n_1, n_2 \\leq 50$,\n横纵坐标均为整数且绝对值不超过100。"
}