{
    "description": "My birthday is coming up. Alas, I am getting old and would like to feel young again. Fortunately, I have come up with an excellent way of feeling younger: if I write my age as a number in an appropriately chosen base $b$, then it appears to be smaller. For instance, suppose my age in base $10$ is $32$. Written in base $16$ it is only $20$!\n\nHowever, I cannot choose an arbitrary base when doing this. If my age written in base $b$ contains digits other than $0$ to $9$, then it will be obvious that I am cheating, which defeats the purpose. In addition, if my age written in base $b$ is too small then it would again be obvious that I am cheating.\n\nGiven my age $y$ and a lower bound $\\ell $ on how small I want my age to appear, find the largest base $b$ such that $y$ written in base $b$ contains only decimal digits, and is at least $\\ell $ when interpreted as a number in base $10$.",
    "inputFormat": "The input consists of a single line containing two base 10 integers $y$ ($10 \\le y \\le 10^{18}$ – yes, I am very old) and $\\ell $ ($10 \\le \\ell \\le y$).",
    "outputFormat": "Display the largest base $b$ as described above.",
    "samples": [
        [
            "32 20\n",
            "16\n"
        ],
        [
            "2016 100\n",
            "42\n"
        ]
    ],
    "hint": "Time limit: 1000 ms, Memory limit: 1048576 kB. \n\n International Collegiate Programming Contest (ACM-ICPC) World Finals 2016",
    "translation": "# 题目大意\n我的生日快到了！唉，但如今我已经老了，我想重新获得年轻的感觉。\n\n幸运的是，我想出了一个让人感觉更年轻的好方法：如果我把我的年龄以适当选择的$b$进制书写，那么它看起来会更小。例如，假设我以$10$进制书写的年龄是$32$岁；以$16$进制书写，它只有$20$($0x20$)！\n\n然而，在这样做时，我不能选择任意进制数。如果以$b$进制为数写的我的年龄包含$0-9$以外的数字，那么很明显我在作弊，这违背了目的。此外，如果我的年龄的进制数$b$太小，那么很明显我在作弊。\n\n在我希望我的年龄看起来有多小的问题上,考虑到我的年龄$y$和下限$l$，找到最大的进制数$b$，这样写在基数$b$中的$y$只包含十进制数字，并且当将其看做一个十进制数字时至少是$l$。\n# 输入格式\n输入由一行组成，其中包含两个$10$进制的整数$y$ ($10\\le y\\le10^{18}$ –是的,我很老）和$l$($10\\le l \\le y$)\n# 输出格式\n如上所述，输出最大进制数$b$。\n# 说明/提示\n时间限制：$1s$，内存限制：$1GB$\n\n(洛谷这里实际是$512MB$,但原题是$1GB$)\n\n$2016年$国际大学生编程大赛$ACM$-$ICPC$世界总决赛"
}