{
    "description": "\n\nIt is a sunny day in spring and you are about to meet Patrick, a close friend and former partner in crime. Patrick lost most of his money betting on programming contests, so he needs to pull off another job. For this he needs your help, even though you have retired from a life of crime. You are reluctant at first, as you have no desire to return to your old criminal ways, but you figure there is no harm in listening to his plan.\n\nThere is a shipment of expensive consumer widgets in a nearby warehouse and Patrick intends to steal as much of it as he can. This entails finding a way into the building, incapacitating security guards, passing through various arrays of laser beams $-$ you know, the usual heist techniques. However, the heart of the warehouse has been equipped with a security system that Patrick cannot disable. This is where he needs your help.\n\nThe shipment is stored in large cubical crates, all of which have the same dimensions. The crates are stacked in neat piles, forming a three-dimensional grid. The security system takes pictures of the piles once per hour using three cameras: a front camera, a side camera and a top camera. The image from the front camera shows the height of the tallest pile in each column, the image from the side camera shows the height of the tallest pile in each row, and the image from the top camera shows whether or not each pile is empty. If the security system detects a change in any of the images, it sounds an alarm.\n\nOnce Patrick is inside, he will determine the heights of the piles and send them to you. Figure C.1 shows a possible layout of the grid and the view from each of the cameras.\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/14635/1.png)\n\nFigure C.1 : Grid of heights and the corresponding camera views.\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/14635/2.png)\n\nFigure C.2 : Possible grid of heights after the heist\n\nPatrick wants to steal as many crates as possible. Since he cannot disable the security system, he plans to fool it by arranging the remaining crates into piles so that the next set of camera images are the same. In the above example, it is possible to steal nine crates. Figure C.2 shows one possible post-heist configuration that appears identical to the security system.\n\nPatrick asks you to help him determine the maximum number of crates that can be stolen while leaving a configuration of crates that will fool the security system. Will you help him pull off this final job?\n\n",
    "inputFormat": "\n\nThe first line of input contains two integers $r (1 \\le r \\le 100)$ and $c (1 \\le c \\le 100)$ , the number of rows and columns in the grid, respectively. Each of the following $r$ lines contains $c$ integers, the heights (in crates) of the piles in the corresponding row. All heights are between $0$ and $10^{9}$ inclusive.\n\n",
    "outputFormat": "\n\nDisplay the maximum number of crates that can be stolen without being detected.\n\n",
    "samples": [
        [
            "5 5\n1 4 0 5 2\n2 1 2 0 1\n0 2 3 4 4\n0 3 0 3 1\n1 2 2 1 1\n",
            "9\n"
        ],
        [
            "2 3\n50 20 3\n20 10 3\n",
            "30\n"
        ]
    ],
    "hint": "Time limit: 1 s, Memory limit: 512 MB. \n\n",
    "translation": "给定一个 $r \\times c$ 的平面，在上面摆有一些箱子。我们可以得到他的三视图（如下图，左边矩阵上的值为平面上每一位摆放的箱子个数，右边三个视图为正视图，俯视图，左视图）：\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/14635/1.png)\n\n你可以拿走一些箱子，和重新排列这些箱子的位置，你想知道，最多能拿走多少个箱子，使得这些箱子重新排列后正视图，俯视图，左视图不变？\n\n比如上面这个例子，下面这种拿走 $9$ 个箱子后的重新排列方式也是可以的：\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/14635/2.png)\n\n$1 \\le r,c \\le 100$，平面上每一个位置的箱子个数在 $[0,10^9]$ 内。\n\n翻译者：一只书虫仔"
}