{
    "description": "\n\nIn this problem you will be solving one of the most profound challenges of humans across the world since the beginning of time $-$ how to make lots of money.\n\nYou are a middleman in the widget market. Your job is to buy widgets from widget producer companies and sell them to widget consumer companies. Each widget consumer company has an open request for one widget per day, until some end date, and a price at which it is willing to buy the widgets. On the other hand, each widget producer company has a start date at which it can start delivering widgets and a price at which it will deliver each widget.\n\nDue to fair competition laws, you can sign a contract with only one producer company and only one consumer company. You will buy widgets from the producer company, one per day, starting on the day it can start delivering, and ending on the date specified by the consumer company. On each of those days you earn the difference between the producer's selling price and the consumer's buying price.\n\nYour goal is to choose the consumer company and the producer company that will maximize your profits.\n\n",
    "inputFormat": "\n\nThe first line of input contains two integers $m$ and $n (1 \\le m , n \\le 500 000)$ denoting the number of producer and consumer companies in the market, respectively. It is followed by $m$ lines, the $i$ th of which contains two integers $p_{i}$ and $d_{i} (1 \\le p_{i}, d_{i} \\le 10^{9}),$ the price (in dollars) at which the $i$ th producer sells one widget and the day on which the first widget will be available from this company. Then follow $n$ lines, the $j$ th of which contains two integers $q_{j}$ and $e_{j} (1 \\le q_{j}, e_{j} \\le 10^{9}),$ the price (in dollars) at which the $j$ th consumer is willing to buy widgets and the day immediately after the day on which the last widget has to be delivered to this company.\n\n",
    "outputFormat": "\n\nDisplay the maximum total number of dollars you can earn. If there is no way to sign contracts that gives you any profit, display $0$ .\n\n",
    "samples": [
        [
            "2 2\n1 3\n2 1\n3 5\n7 2\n",
            "5\n"
        ],
        [
            "1 2\n10 10\n9 11\n11 9\n",
            "0\n"
        ]
    ],
    "hint": "Time limit: 5 s, Memory limit: 512 MB. \n\n",
    "translation": "一共有 $m$ 个生产商和 $n$ 个消费商。第 $i$ 个生产商从第 $d_i$ 个时刻开始销售物品，每个物品卖 $p_i$ 元。第 $i$ 个消费商从第 $1$ 个时刻开始需要消费，他的消费欲望一直到第 $e_i-1$ 的时刻，每个物品出价 $q_i$ 元。你作为中间商，只能与一间生产商和一间消费商签订合约，可以选择在生产商那里买下一些物品，也可以选择卖向消费商，你的目的就是赚中间的差价。\n\n你想知道最多能赚到多少差价。\n\n$1 \\le m,n \\le 5\\times 10^5$，$1 \\le p_i,d_i,q_i,e_i \\le 10^9$。\n\n翻译者：一只书虫仔"
}