{
    "description": "\n\nThe owner of the Automatic Cellular Manufacturing corporation has just patented a new process for the mass production of identical parts. Her approach uses a two-dimensional lattice of two-state cells, each of which is either `empty` or `filled. ` The exact details are, of course, proprietary.\n\nInitially, a set of cells in the lattice is filled with a copy of the part that is to be reproduced. In a sequence of discrete steps, each cell in the lattice simultaneously updates its state by examining its own state and those of its eight surrounding neighbors. If an odd number of these nine cells are filled, the cell's state in the next time step will be filled, otherwise it will be empty. Figure G.1 shows several steps in the replication process for a simple pattern consisting of three filled cells.\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/14639/1.png)\n\nFigure G.1 : The replication process.\n\nHowever, a bug has crept into the process. After each update step, one cell in the lattice might spontaneously flip its state. For instance, Figure G.2 shows what might happen if a cell flipped its state after the first time step and another flipped its state after the third time step.\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/14639/2.png)\n\nFigure G.2 : Errors in the replication process. This figure corresponds to Sample Input $1$ .\n\nUnfortunately, the original patterns were lost, and only the (possibly corrupted) results of the replication remain. Can you write a program to determine a smallest possible nonempty initial pattern that could have resulted in a given final pattern?\n\n",
    "inputFormat": "\n\nThe first line of input contains two integers $w (1 \\le w \\le 300)$ and $h (1 \\le h \\le 300)$ , where $w$ and $h$ are the width and height of the bounding box of the final pattern. Following that are $h$ lines, each containing $w$ characters, giving the final pattern. Each character is either $‘. '$ (representing an empty cell) or $‘#'$ (representing a filled cell). There is at least one filled cell in the first row, in the last row, in the first column, and in the last column.\n\n",
    "outputFormat": "\n\nDisplay a minimum-size nonempty pattern that could have resulted in the given pattern, assuming that at each stage of the replication process at most one cell spontaneously changed state. The size of a pattern is the area of its bounding box. If there is more than one possible minimum-size nonempty starting pattern, any one will be accepted. Use the character $‘. '$ for empty cells and $‘#'$ for filled cells. Use the minimum number of rows and columns needed to display the pattern.\n\n",
    "samples": [
        [
            "10 10\n.#...#...#\n##..##..##\n##.#.##...\n##.#.##...\n.#...#####\n...##..#.#\n......###.\n##.#.##...\n#..#..#..#\n##..##..##\n",
            ".#\n##\n"
        ],
        [
            "8 8\n##..#.##\n#.####.#\n.#.#.#..\n.##.#.##\n.#.#.#..\n.##.#.##\n#..#.###\n##.#.##.\n",
            "####\n#..#\n#.##\n###.\n"
        ],
        [
            "5 4\n#....\n..###\n..###\n..###\n",
            "#\n"
        ]
    ],
    "hint": "Time limit: 3 s, Memory limit: 512 MB. \n\n",
    "translation": "定义一个黑白复制过程，每一次枚举所有格子初始时自身和周围 $8$ 个格子这 $9$ 个格子的黑白情况，如果有奇数个位置为黑，那么这个格子变为黑，否则变为白。但不幸的是，复制过程有 bug，每一次进行复制后，都会有任意一个格子从黑变为白，或者从白变为黑，当然也可以不变。现在给定一份包含 bug 的复制最终结果，包含 $w$ 行 $h$ 列，求行列数最小的初始黑白格子，使得能通过复制过程和 bug 变为最终结果。\r\n\r\n$\\texttt \\#$ 为黑，$\\texttt .$ 为白。\r\n\r\n注意，如果有多余的白色格子请省掉，比如左边这个黑白格子情况可以变为右边的：\r\n\r\n```\r\n...........   .....##..#\r\n......##..#   #........#\r\n.#........#   #..#...#..\r\n.#..#...#..   .#.......#\r\n..#.......#\r\n...........\r\n...........\r\n```\r\n\r\n$1 \\le w,h \\le 300$。\r\n\r\n翻译者：一只书虫仔"
}