{
    "description": "\n\nGem Island is a tiny island in the middle of the Pacific Ocean. Until recently, it was known as one of the poorest, but also most peaceful, places on Earth. Today, it is neither poor nor peaceful. What happened?\n\nOne sunny morning, not too long ago, all inhabitants of Gem Island woke up to a surprise. That morning, each of them suddenly held one sparkling gem in their hand. The gems had magically appeared overnight. This was cause for much rejoicing $-$ everybody was suddenly rich, they could finally afford all the things they had ever dreamed of, and the name of their island made so much more sense now.\n\nThe next morning, one of the inhabitants woke up to another surprise $-$ her gem had magically split into two gems! The same thing happened on each of the following nights, when exactly one of the gems (apparently uniformly at random among all the gems on the island) would split into two.\n\nAfter a while, the inhabitants of Gem Island possessed a widely varying number of gems. Some had a lot and many had only a few. How come some inhabitants had more gems than others? Did they cheat, were they just lucky, or was something else at work?\n\nThe island elders have asked for your help. They want you to determine if the uneven distribution of gems is explained by pure chance. If so, that would greatly reduce tensions on the island.\n\nThe island has $n$ inhabitants. You are to determine the gem distribution after $d$ nights of gem splitting. In particular, you are interested in the expected number of gems collectively held by the $r$ people with the largest numbers of gems. More formally, suppose that after $d$ nights the numbers of gems held by the $n$ inhabitants are listed in non-increasing order as $a_{1} \\ge a_{2} \\ge $ . . . $ \\ge a_{n}.$ What is the expected value of $a_{1} + · · · + a_{r}?$\n\n",
    "inputFormat": "\n\nThe input consists of a single line containing the three integers $n , d$ , and $r (1 \\le n , d \\le 500 , 1 \\le r \\le n)$ , as described in the problem statement above.\n\n",
    "outputFormat": "\n\nDisplay the expected number of gems that the top $r$ inhabitants hold after $d$ nights, with an absolute or relative error of at most $10^{−6}.$\n\n",
    "samples": [
        [
            "2 3 1\n",
            "3.5\n"
        ],
        [
            "3 3 2\n",
            "4.9\n"
        ],
        [
            "5 10 3\n",
            "12.2567433\n"
        ]
    ],
    "hint": "Time limit: 3 s, Memory limit: 1024 MB. \n\n",
    "translation": "有 $n$ 个人，最开始每个人手中有 $1$ 颗绿宝石，每天晚上，会随机选一个绿宝石分裂为两个。\n\n求 $d$ 个晚上后绿宝石数量最多的 $r$ 个人的绿宝石数和的期望值。\n\n$1 \\le n,d \\le 500$，$1 \\le r\\le n$。\n\n翻译者：一只书虫仔"
}