{
    "description": "\n\nA young hero is starting his heroic life. The wise wizard suggested him an easy first quest. During this quest our young hero meets $n$ magical creatures, in specific order. In order to help the young hero, the wizard gave him a clue -- a list of $n$ integers $a_{i}.$\n\nIf $a_{i}$ is positive, then the i-th magical creature is benevolent and gives to our hero one magical item of type $a_{i}.$ The hero can keep several items of the same type.\n\nIf $a_i$ is negative, then the i-th magical creature is evil and in order to defeat it the young hero needs one magical item of type $−a_{i}.$ All magical items are fragile and can be used only once.\n\nIf $a_{i}$ is zero, then the i-th creature is a unicorn. It gives the hero any magical item he asks for, but only one.\n\nYour task is to help the young hero to finish the first quest, defeating all enemies on the way, or say that it is impossible.\n\n",
    "inputFormat": "\n\nThe first line of input contains one integer $n (1 \\le n \\le 1000)$ . The second line contains $n$ integers $a_{i} (−1000 \\le a_{i} \\le 1000)$ .\n\n",
    "outputFormat": "\n\nIf it is impossible to defeat all enemies, then output one string `No`. If it is possible, then output string `Yes`, and in the next line output the types of items the hero should ask the unicorns for, in order they meet during the quest. Types must be integers in range from $1$ to $1000$ inclusive. If there are several solutions, output any of them.\n\n",
    "samples": [
        [
            "10\n1 0 -4 0 0 -1 -3 0 -1 -2\n",
            "Yes\n4 1 3 2\n"
        ],
        [
            "5\n5 8 0 -6 -3\n",
            "No\n"
        ],
        [
            "3\n2 -2 -2\n",
            "No\n"
        ]
    ],
    "hint": "Time limit: 3 s, Memory limit: 512 MB. \n\nspj provider:@[shenyouran](/user/137367).",
    "translation": "一个英雄进行了一次探索。在这次探索中，英雄按特定顺序遇到了 $n$ 个魔法生物，第 $i$ 个魔法生物对应 $a_i$。\n\n当 $a_i$ 为正数时，第 $i$ 个魔法生物会给英雄提供一个为 $a_i$ 的魔法物品。\n\n当 $a_i$ 为负数时，第 $i$ 个魔法生物需要英雄消耗一个为 $-a_i$ 的魔法物品。\n\n当 $a_i$ 为 $0$ 时，第 $i$ 个魔法生物可以给英雄提供一个任意的魔法物品。\n\n你需要回答英雄是否可以完成这次探索（经过所有魔法生物），如果可以，请回答 $a_i$ 为 $0$ 魔法生物应该为英雄提供哪种魔法物品。"
}