{
    "description": "\n\nYou were invited to the annual archery tournament. You are going to compete against the best archers from all of the Northern Eurasia. This year, a new type of competition is introduced, where a shooting range is dynamic and new targets might appear at any second.\n\nAs the shooting range is far enough from you, it can be represented as a 2D plane, where $y = 0$ is the ground level. There are some targets in a shape of a circle, and all the targets are standing on the ground. That means, if a target's center is $(x , y) (y > 0)$ , then its radius is equal to $y$ , so that it touches the line $y = 0$ . No two targets simultaneously present at the range at any given time intersect (but they may touch).\n\nInitially, the shooting range is empty. Your participation in this competition can be described as $n$ events: either a new target appears at the range, or you shoot an arrow at some point at the range. To hit a target, you must shoot strictly inside the circle (hitting the border does not count). If you shoot and hit some target, then the target is removed from the range and you are awarded one point.\n\n",
    "inputFormat": "\n\nThe first line of the input contains integer $n (1 \\le n \\le 2·10^{5}).$ Next $n$ lines describe the events happening at the tournament. The i-th line contains three integers $t_{i}, x_{i},$ and $y_{i} (t_{i} = 1 , 2$ ; $−10^{9} \\le x_{i}, y_{i} \\le 10^{9}$ ; $y_{i} > 0)$ .\n\nIf $t_{i} = 1$ , then a new target with center $(x_{i}, y_{i})$ and radius $y_{i}$ appears at the range.\n\nIf $t_{i} = 2$ , then you perform a shot, which hits the range at $(x_{i}, y_{i}).$\n\n",
    "outputFormat": "\n\nFor each of your shots, output a separate line with the single integer. If the shot did not hit any target, print `-1`. If the shot hit a target, print the number of event when that target was added to the range. Events are numbered starting from $1$ .\n\n",
    "samples": [
        [
            "8\n1 0 12\n2 -11 22\n1 24 10\n1 12 3\n2 12 12\n2 16 14\n1 28 15\n2 3 6\n",
            "-1\n-1\n3\n1\n"
        ]
    ],
    "hint": "Time limit: 3 s, Memory limit: 512 MB. \n\n",
    "translation": "给出一些圆，这些圆圆心在 $x$ 轴上方，且与 $x$ 轴相切，任意时刻，不存在图上的圆相交，给出两种操作：增加一个圆；向图中发送一颗子弹，如果击中某个圆，输出该圆编号并且删掉这个圆。如果未击中，则输出 `-1`。"
}