{
    "description": "\n\nAn abbreviation (from Latin brevis, meaning short) is a shortened form of a word or phrase. In this problem you must write an automated tool that replaces a sequence of capitalized words with the corresponding abbreviation that consists of the first upper case letters only, followed by a full definition in parenthesis. See sample input and output.\n\nLet us make some formal definitions. A word in a text is a maximally long sequence of lower and upper case English letters. A capitalized word is a word that consists of an upper case letter followed by one or more lower case letters. For example, `Ab`, `Abc`, `Abcd`, and `Abcde` are all capitalized words, while `ab`, `A`, `AB`, `ABc` and `AbC` are not.\n\nAn abbreviatable sequence of words is a sequence of two or more capitalized words that are separated by exactly one space, no line breaks or punctuation are allowed inside it.\n\nAn abbreviation of an abbreviatable sequence of words is a sequence of the first (upper case) letters of each word, followed by a single space, an opening parenthesis, the original abbreviatable sequence, and a closing parenthesis.\n\n",
    "inputFormat": "\n\nThe input file consists of up to $1 000$ lines of text with up to $120$ characters on each line. Each line consists of spaces, upper and lower case letters, commas or dots. There are no leading or trailing spaces on lines and there are no empty lines. There is at least one line in the input file.\n\n",
    "outputFormat": "\n\nWrite to the output file the original text with every abbreviatable sequence of words replaced with the corresponding abbreviation.\n\n",
    "samples": [
        [
            "This is ACM North Eastern European Regional Contest,\nsponsored by International Business Machines.\nThe. Best. Contest. Ever.\nA Great Opportunity for all contestants.\n",
            "This is ACM NEERC (North Eastern European Regional Contest),\nsponsored by IBM (International Business Machines).\nThe. Best. Contest. Ever.\nA GO (Great Opportunity) for all contestants.\n"
        ],
        [
            "ab Ab A Abc AB Abcd ABc Abcde AbC\n",
            "ab Ab A Abc AB Abcd ABc Abcde AbC\n"
        ],
        [
            "Oh  No  Extra Spaces.And,Punctuation Ruin Everything\n",
            "Oh  No  ES (Extra Spaces).And,PRE (Punctuation Ruin Everything)\n"
        ]
    ],
    "hint": "Time limit: 1 s, Memory limit: 512 MB. \n\n",
    "translation": "### 题目描述\n定义 word 为一个首字母大写、长度大于 1 、 其他位为小写字母的单词，如 `Ab`、 `Abc`、 `Abcd`、 和 `Abcde`，但 `ab`、`A`、 `AB`、 `ABc` 和 `AbC`。\n\n定义一个 word 串为一个有大于 1 个 word 、每两个 word 中有且只有一个空格的串，如 `International Business Machines`。\n\n现给你若干行，如遇到 word 串则让他变为缩写，缩写方式为：先提取首字母（大写），再加空格和 `(` ，再把全称写出来，最后加上 `)` ，如: `International Business Machines` 可缩写为 `IBM (International Business Machines)` 。\n\n### 输入格式\n若干行（不超过 1000 行）由大小写字母、标点和空格组成的的字符串（每行不超过 120 个字符）。\n\n### 输出格式\n缩写后的若干行字符串（无法缩写的不用缩写）。\n\n#### translate by:`ddgtang`"
}