{
    "description": "\n\nA tank car that transports gasoline via rail road has a shape of cylinder with two spherical caps at the sides. The cylinder has a diameter $\\(d\\)$ and a length $\\(l\\).$ The spherical caps have a radius $\\(r\\) (\\(2r\\) \\ge \\(d\\)).$ There was the rail road accident and the tank car had derailed. It now lies on the ground and some of the stored gasoline had flown out. The damage assessment must be performed. The location of the tank on the ground was established by measuring its tilt as the height difference $\\(t\\)$ from the bottom points of the cylinder on its left and right sides $(0 \\le \\(t\\) \\le \\(l\\)).$ The level of gasoline in the tank was established by measuring the height difference $\\(h\\)$ from the bottom point of the cylinder and the top level of gasoline. For the purpose of this problem, the top level of gasoline always intersects the cylinder part of the tank $(0 \\le \\(h\\) \\le \\(t + d \\sqrt{1 - (t/l)^2}).$\n\nYour task is to figure out how much gasoline was left in the tank.\n\n![](/upload/images2/dmaage.png)\n\n",
    "inputFormat": "\n\nThe input file consists of a single line with five integer numbers -- $\\(d\\), \\(l\\), \\(r\\), \\(t\\)$ and $\\(h\\),$ which represent the diameter and the length of the tank's cylinder part, the radius of its spherical caps, tilt and gasoline level measurements. They are all expressed in millimeters ($1$ millimeter $= 10^{−3}$ meters), they satisfy all constraints expressed in the problem statement and $\\(d\\), \\(l\\) \\ge 100 , \\(d\\), \\(l\\), \\(r\\) \\le 10 000$ .\n\n",
    "outputFormat": "\n\nWrite a single real number to the output file -- the volume of gasoline in the tank in liters ($1$ liter $= 10^{−3}$ cubic meters). The absolute error of the answer must not exceed $0$ . $1$ liters.\n\n",
    "samples": [
        [
            "3000 6000 1600 0 3000\n",
            "50974.56\n"
        ],
        [
            "3000 6000 1600 3441 4228\n",
            "40728.90\n"
        ]
    ],
    "hint": "Time limit: 1 s, Memory limit: 256 MB. \n\n",
    "translation": "有一个由一个长度为 $l$，底面直径为 $d$ 的圆柱和两个半径均为 $r\\ (2r\\ge d)$ 的球形盖组成的油箱。由于一个交通事故，该油箱现在倾斜了一个角度，有一些汽油被洒了出来。现在给定圆柱底部的左右两个端点的高度差 $t\\ (0\\le t\\le l)$ 以及剩余汽油的水平面到圆柱底端的距离 $h$，保证汽油的水平面一定与油箱的圆柱部分有交，即 $(0\\le h\\le t+d\\sqrt {1-(t/l)^2})$。所有长度单位均用毫米给出。\n\n求还剩下多少汽油（升），精确到 $0.1$。\n\n$d,l\\ge 100$，$d,l,r\\le 10^4$。\n\n下图为原题图。\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/465n22d6.png)"
}