{
    "description": "\n\nHelen and Henry are fans of the TV show `Hidden Maze`, which is very popular in Hiddenland. During this show two participants (usually a married couple) are rushing through the maze consisting of $n$ halls connected by some tunnels. Each tunnel connects two different halls and there can't be more than one tunnel connecting any pair of halls.\n\nIn the beginning of the show, two participants are placed in two different halls. Then they need to move very quickly to meet each other before the time runs out. To pass through each tunnel, the participant needs to find a clue which is some positive integer number written on a small piece of paper.\n\nIf the participants finally meet in some tunnel before the time runs out, and successfully find a clue contained in the tunnel where they met, they are considered winners. The value of their prize is calculated by sorting all the clues found by them and taking the median value. The game is always set up in such a way, that the number of clues they find is odd.\n\nHelen and Henry saw a large number of episodes of the show, and now they understand a lot about the mechanics of it. They noticed that the maze doesn't change between episodes, and they drew a complete map of the maze. Shortly after, Helen and Henry have discovered that the maze is built in such a manner that if you visit any tunnel at most once, then there is exactly one path between any two halls.\n\nHelen and Henry have been wondering how this great maze is created, and not so long time ago they have seen an interview with Hillary, who worked for the company which had built the maze. Hillary has told that to make the show fair, the maze had been created using the following randomized algorithm:\n\nPick the number of halls $n$ . Build $n$ halls enumerated from $1$ to $n$ .\n\nChoose at random two integers $i$ and $j$ , each of them uniformly distributed between $1$ and $n$ .\n\nIf halls $i$ and $j$ are the same or are already connected with some path of tunnels, then go to step $2$ .\n\nBuild the tunnel between $i$ and $j$ . If there is a path of tunnels from any hall to any other one, stop the process, otherwise go to step $2$ .\n\nHelen and Henry have also noticed that each tunnel contains exactly one clue and its value never changes from episode to episode. However, they don't know what algorithm was used to generate clue values. Helen and Henry have written on their map the value of the clue for each tunnel.\n\nIt always takes $1$ minute to find a clue and to run through the tunnel from one hall to another. It takes half a minute to run from the hall to the center of the tunnel when the participants meet in the center of the tunnel at the end. The time given to participants is only enough to meet each other if they act optimally, that is they just run to each other via the shortest possible path, never make mistakes when finding clues, and never turn into any other tunnels that do not belong to the shortest path. To make the participants meet in the center of some tunnel, they are placed in the beginning of the show in such a way that the length of the shortest path between the halls where they are placed is odd.\n\nHelen and Henry want to participate in the show. They know the maze by heart and they are pretty sure that they will succeed in moving optimally to each other and finding all clues in time. Provided that the pair of initial halls is selected uniformly from all pairs with an odd-length shortest path between them, they need to know the expected value of the prize they win. Your task is to help them find this expected value.\n\n",
    "inputFormat": "\n\nThe first line of the input contains an integer number $n (2 \\le n \\le 30 000)$ -- the number of halls. Each of the following $n − 1$ lines contains three integers: $u_{i}, v_{i}, c_{i} (1 \\le u_{i}, v_{i} \\le n , 1 \\le c_{i} \\le 10^{6}),$ describing the i-th tunnel connecting the halls $u_{i}$ and $v_{i},$ containing the clue with the value $c_{i}.$ The maze is always created by the randomized algorithm that is specified in the problem statement.\n\n",
    "outputFormat": "\n\nWrite to the output file a single real number -- the expected value of the prize. The absolute or relative error of the answer must not exceed $10^{−9}.$\n\n",
    "samples": [
        [
            "2\n2 1 1\n",
            "1\n"
        ],
        [
            "5\n2 4 4\n1 2 5\n5 4 2\n5 3 3\n",
            "3.50\n"
        ],
        [
            "5\n4 1 2\n5 3 2\n4 2 3\n5 4 7\n",
            "3.1666666667\n"
        ]
    ],
    "hint": "",
    "translation": "给定一个 $n$ 个点的随机生成的无根树，每条边有正整数边权。每次随机两个最短路径边数为奇数的点，将这两点间路径上边权的中位数作为贡献。求这个贡献的期望。  \n\nby a___"
}