{
    "description": "Determined to discover the ancient mystery—the sound that the fox makes—you went into the forest, armed with a very good digital audio recorder. The forest is, however, full of animals’ voices, and on your recording, many different sounds can be heard. But you are well prepared for your task: you know exactly all the sounds which other animals make. Therefore the rest of the recording—all the unidentified noises—must have been made by the fox.",
    "inputFormat": "The first line of input contains the number of test cases $T$. The descriptions of the test cases follow:\n\nThe first line of each test case contains the recording—words over lower case English alphabet, separated by spaces. Each contains at most 100 letters and there are no more than 100 words. The next few lines are your pre-gathered information about other animals, in the format <animal> goes <sound>. There are no more than 100 animals, their names are not longer than 100 letters each and are actual names of animals in English. There is no fox goes ... among these lines.\n\nThe last line of the test case is exactly the question you are supposed to answer: what does the fox say?",
    "outputFormat": "For each test case, output one line containing the sounds made by the fox, in the order from the recording. You may assume that the fox was not silent (contrary to popular belief, foxes do not communicate by Morse code).",
    "samples": [
        [
            "1\ntoot woof wa ow ow ow pa blub blub pa toot pa blub pa pa ow pow toot\ndog goes woof\nfish goes blub\nelephant goes toot\nseal goes ow\nwhat does the fox say?\n",
            "wa pa pa pa pa pa pow\n"
        ]
    ],
    "hint": "Time limit: 1000 ms, Memory limit: 1048576 kB. \n\n Central Europe Regional Contest (CERC) 2013",
    "translation": "### 题目大意\r\n\r\n森林里面有很多声响，你想知道有哪些声响是由狐狸发出来的。\r\n\r\n已知你搜集到了 $n$ 个声响，并且还知道某些其他动物能够发出的声响，已知如果没有哪一个声响是由其他任何一种动物发出来的话，那这个声响绝对是由狐狸发出来的。现在，给定你这 $n$ 个声响，以及某些其他动物能够发出的声响，请你求出狐狸发出的声响。\r\n\r\n### 输入格式\r\n**本题有多组询问。**\r\n\r\n第一行包含一个整数 $T$，表示数据的组数。  \r\n接下来若干组数据，每组数据由三部分组成：\r\n\r\n- 第一行 $n$ 个仅由小写字母组成的字符串，代表搜集到的 $n$ 个声响。\r\n- 接下来有若干行，代表某些其他动物能够发出的声响。格式为 ``<animal> goes <sound>``，其中 `<animal>` 代表动物的名称（仅由一个字符串组成），`<sound>` 代表这个动物发出的声响（仅由一个字符串组成）。保证不会在这些动物中出现狐狸。\r\n- 最后一行，一个确定的字符串 ``what does the fox say?``。\r\n\r\n### 输出格式\r\n对于每组数据，输出仅一行，代表狐狸能够发出的声响。\r\n\r\n### 数据范围\r\n$n\\leqslant 100$。  \r\n保证每个字符串的长度不超过 $100$。\r\n\r\nTranslated by Eason_AC  \r\n2020.10.30"
}