{
    "description": "\n\nThe number of cars in Default City that travel to the city center daily vastly exceeds the number of available parking spots. The City Council had decided to introduce parking fees to combat the problem of overspill parking on the city streets. Parking fees are enforced using an automated vehicle registration plate scanners that take a picture of the vehicle registration plate, recognize the sequence of digits and letters in the code on the plate, and check the code against a vehicle registration database to ensure that parking fees are dutifully paid or to automatically issue a fine to the vehicle owner otherwise.\n\nAs soon as parking fees were introduced, a parking fee fraud had appeared. Some vehicle owners had started to close one or several digits or letters on their vehicle registration plate with pieces of paper while they park, thus making it impossible for the current version of the automated scanner to recognize their vehicle's registration code and to issue them a fine.\n\nThe Default City Council had instituted the Fraud Busters Initiative (FBI) to design a solution to prevent this kind of fraud. The overall approach that FBI had selected is to expand the number of vehicle features that scanners recognize (including features like vehicle type and color), as well as excluding from the list any vehicles that are detected to be elsewhere at this time. This information should help to identify the correct vehicle by narrowing down the search in the vehicle registration database.\n\nYou are working for FBI. Your colleagues had already written all the complex pieces of the recognition software that analyses various vehicle features and provides you with a list of registration codes that might potentially belong to a scanned car. Your task it to take this list and a recognized code from the license plate (which may be partially unrecognized) and find all the registration codes that match.\n\n",
    "inputFormat": "\n\nThe first line of the input file contains $9$ characters of the code as recognized by the scanner. Code that was recognized by the the scanner is represented as a sequence of $9$ digits, uppercase English letters, and characters $` \\times ` (star).$ Star represents a digit or a letter that scanner could not recognize.\n\nThe second line of the input file contains a single integer number $n (1 \\le n \\le 1000)$ -- the number of vehicle registration codes from the vehicle registration database.\n\nThe following $n$ lines contain the corresponding registration codes, one code per line. Vehicle registration codes are represented as a sequence of $9$ digits and uppercase English letters. All codes on these $n$ lines of the input file are different.\n\n",
    "outputFormat": "\n\nOn the first line of the output file write a single integer $k (0 \\le k \\le n)$ -- the number of codes from the input file that match the code that was recognized by the scanner. The code from the scanner matches the code from the database if the characters on all the corresponding positions in the codes are equal or the character from the scanner code is $` \\times `.$\n\nOn the following $k$ lines write the matching codes, one code per line, in the same order as they are given in the input file.\n\n",
    "samples": [
        [
            "A**1MP19*\n4\nA001MP199\nE885EE098\nA111MP199\nKT7351TTB\n",
            "2\nA001MP199\nA111MP199\n"
        ]
    ],
    "hint": "Time limit: 1 s, Memory limit: 128 MB. \n\n",
    "translation": "给定一个含未知字符的长度为9字符串，未知字符用'*'表示（不含引号）。下面给出n个长度为9字符串，如果下面输入的字符串与一开始输入的字符串除未知部分的其他部分完全相同，则该字符串符合要求。输出符合要求的字符串的数量和每个符合要求的字符串。\n\n举例：假设一开始输入的字符串为A58**52*1,则字符串A58ZS52T1符合要求，而字符串A589992G1不符合要求"
}