{
    "description": "\n\nJeremy, Richard and James like to test cars. It is always hard for them to decide where they should do it. Usually car test looks like this. They choose a country and examine its cities and two-way roads that connect them. To perform a test, they need to choose two different cities $S$ and $F$ , such that there exist three routes between them. Moreover, each city except $S$ and $F$ should be visited by at most one route, and none of the roads may be used twice.\n\nThen each of them takes a car in city $S$ , drives along one of those routes and tries to get to city $F$ faster than others.\n\nYou are given a description of multiple countries. For each country you should decide if it is possible to choose two cities and three routes between them in a way described above.\n\n",
    "inputFormat": "\n\nThe first line of the input contains a single integer $T$ -- number of countries $(1 \\le T \\le 100 000)$ . It is followed by $T$ country descriptions.\n\nThe first line of each country description contains two integers $n$ and $m$ -- the number of its cities and roads $(1 \\le n , m \\le 100 000)$ . The following $m$ lines contain two integer numbers each: $u_{i}$ and $v_{i}$ -- the cities at the ends of the road $(1 \\le u_{i} < v_{i} \\le n)$ . All roads are two-way. Each pair of cities is connected by at most one road.\n\nBoth the total number of cities and roads in all countries does not exceed $100 000$ .\n\n",
    "outputFormat": "\n\nOutput the answer for each country in the order they are given in the input.\n\nIf it is not possible to test cars in this country, the answer is $−1$ . Otherwise the first line of the answer should contain two integers $S$ and $F$ -- start and finish cities. The next three lines should contain three distinct routes. Each route is described by an integer $k$ -- the number of cities it visits, and $k$ numbers $v_{1}, v_{2}, \\cdots , v_{k}$ -- the cities, where $v_{1} = S , v_{k} = F$ , and there is a road between cities $v_{i}$ and $v_{i+1}$ for all $1 \\le i \\le k − 1$ .\n\n",
    "samples": [
        [
            "2\n6 6\n3 6\n3 4\n1 4\n1 2\n1 3\n2 3\n3 1\n1 2\n",
            "1 3\n3 1 2 3\n2 1 3\n3 1 4 3\n-1\n"
        ]
    ],
    "hint": "Time limit: 3 s, Memory limit: 512 MB. \n\n",
    "translation": "**题目描述**  \n给定一张 $n$ 个节点 $m$ 条边的无向图，请在图中找出两个点 $S$ 和 $F$，使得这两点间至少存在三条不相交的路径。\n\n**输入格式**   \n输入的第一行包数据组数 $T(1 \\leq T \\leq 100000)$。对于每组数据，第一行为两个整数 $n$ 和 $m$。接下来 $m$ 行每行包含两个整数 $u$ 和 $v(1 \\leq u < v \\leq n)$，表示节点 $u$ 和 $v$ 之间有一条边。每对节点至多被一条边连接。保证 $\\sum n$ 及 $\\sum m$ 不超过 $100000$。\n\n**输出格式**  \n对于每组数据，若不存在，则输出`-1`。若存在，则第一行输出 $S$ 和 $F$。接下来三行输出三条路径。每行先输出路径路径包含的点数，然后依次输出由 $S$ 到 $F$ 的路径上各点。"
}