{
    "description": "\n\nThe king is dead, long live the king! After the sudden death of the king Fert XIII the people of the Flatland Kingdom are going to welcome the new king. Unfortunately, there is a problem, Fert has too many sons.\n\nActually, he has $n$ sons and he loved each new son more than all of his previous sons. Well, probably he just stopped loving his sons because of their bad behavior. Anyway, after the new son was born Fert made the new testament that declared that the newly born son would be the heir.\n\nHowever, there is a problem. Only the king's son who is at least $18$ years old at the moment of the $king's death$ can become a new king. Now the ministers of the government are trying to find the correct $new king,$ but they seem to fail. Help them!\n\n",
    "inputFormat": "\n\nThe first line of the input contains three integers: $d , m$ and $y$ -- the day, the month and the year of the king's death, $d$ is from $1$ to $31$ , $m$ is from $1$ to $12 , y$ is from $1$ to $9999$ . It is guaranteed that there exists day $d$ in month $m$ , all months have the same number of days in Flatland as in our country, except that Flatland calendar doesn't have leap years, so February (month $2$) always has $28$ days.\n\nThe second line contains $n (1 \\le n \\le 100)$ -- the number of king's sons. The following $n$ lines contain three integers each $d_{i}, m_{i}$ and $ y_{i}$ and specify the birth dates of king's sons. All dates are correct and no son is born after or on the day of king's death. The king had no twins, so no two sons were born on the same date.\n\n",
    "outputFormat": "\n\nOutput one integer -- the number of the son that would become the king, or $−1$ if none of them is $at least 18$ years old. The sons are numbered from $1$ to $n$ in order they are described in the input. The youngest son who is at least $18$ years old at the moment of the king's death would become the king. $If the$ son has his 18th birthday exactly on the day of the king's death, he can become a king.\n\n",
    "samples": [
        [
            "22 10 2016\n7\n28 2 1999\n22 7 1995\n21 10 1998\n23 10 1998\n3 9 2000\n1 4 2013\n17 12 2004\n",
            "3\n"
        ],
        [
            "22 10 2016\n1\n28 2 1999\n",
            "-1\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n",
    "translation": "在国王去世的那一天，国王会让年龄最小但已满十八周岁的儿子继承国王，求哪一个儿子继承了国王，若没有儿子满足条件，则输出`-1`。保证国王不会有双胞胎。"
}