{
    "description": "\n\nFrederick is a young programmer. He participates in all programming contests he can find and always uses his favorite programming language Fygon. Unfortunately, he often receives Time Limit Exceeded outcome, even when his algorithm is asymptotically optimal. That's because the Fygon interpreter is very slow. Nevertheless, Frederick likes Fygon so much, that he uses non-asymptotical optimizations to fit the solution into time limit. To make it easier, he asks you to write a program, which will be able to estimate the exact number of operations that his Fygon program makes.\n\nFor simplicity, we will assume that Fygon has only two statements. The first statement is lag. It substitutes almost any other statement. The second statement is a for loop:\n\nfor in range $():$\n\nThis means that iterates over values from $0$ to $−1$ . In Fygon is a lowercase letter from a to $z$ , and is either already defined or a positive integer constant. The of the loop is indented by four spaces and contains at least one statement.\n\nThe program receives the input in the variable $n$ . This variable has special meaning and cannot be used as a loop variable.\n\nYour task is to find the formula that calculates the number of performed lag operations by the given Fygon program, depending on the value of the variable $n$ .\n\n",
    "inputFormat": "\n\nThe input file contains the Fygon program. No two loops use the same variable as iterators. Each variable used inside a range is either $n$ or declared in some outer loop.\n\nThe program has at most $20$ statements and at most $6$ of them are loops. All integer constants are from $1$ to $9$ . Outpu\n\n",
    "outputFormat": "\n\nOutput the formula for the number of performed lag operations depending on $n$ . The length of the formula should be at most $100$ characters (excluding spaces). The formula should correspond to the following grammar:\n\n$〈Expressio_n〉 ::= 〈Product〉 ( (‘+' | ‘-') 〈Product〉) ^{ \\times }$\n\n$〈Product〉 ::= 〈Value〉 (‘ \\times '〈Value〉) ^{ \\times }$\n\n$〈Value〉 ::= ‘n' | 〈Number〉 | ‘-'〈Value〉 | ‘('〈Expressio_n〉‘)'$\n\n$〈Number〉 ::= [‘0' \\cdots ‘9'] ^{+} (‘/' [‘0' \\cdots ‘9'] ^{+}) ^{?}$\n\n",
    "samples": [
        [
            "for i in range(n):\n    for j in range(i):\n        lag\nfor x in range(5):\n    for y in range(n):\n        for z in range(n):\n            lag\n    lag\n",
            "1/2 * n * (n-1) + 5 * (n*n + 1)\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n"
}