{
    "description": "\n\nLucky Chances is a lottery game. Each lottery ticket has a play field and a scratch area. The play field is a rectangular $r \\times c$ field filled with numbers. The scratch area hides row and column numbers that specify the bet cell.\n\nThere are four possible winning directions: up, down, left and right. You win a direction if all numbers in this direction from the bet cell are strictly less than a number in the bet cell. And if the bet cell is on the edge of the grid, you win the corresponding direction automatically!\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/11477/1.png)\n\nUnscratched ticket\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/11477/2.png)\n\nScratched ticket $1$\n\n![](https://onlinejudgeimages.s3-ap-northeast-1.amazonaws.com/problem/11477/3.png)\n\nScratched ticket $2$\n\nLarry wants to choose the ticket that has maximum total number of winning directions for all possible bet cells. Write a program that determines this number for the given grid.\n\n",
    "inputFormat": "\n\nThe first line of the input file contains two integers $r$ and $c$ -- the number of rows and columns in the grid $(1 \\le r , c \\le 100)$ .\n\nThe following $r$ lines contain $c$ integers each -- the numbers printed on the grid. Each number is positive and does not exceed $1000$ .\n\n",
    "outputFormat": "\n\nOutput a single integer $w$ -- the total number of winning directions for the given grid.\n\n",
    "samples": [
        [
            "3 4\n5 3 9 10\n1 8 8 2\n4 3 4 3\n",
            "25\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n",
    "translation": "有一个名叫 Lucky chances 的游戏，游戏一开始给出一个 $r\\times c$ 的矩阵，你可以选定矩阵中任意一个元素以及上、下、左、右四个方向中的任意一个方向进行游戏。如果这个方向上的任意一个元素都**严格小于**所选的元素，那么你就赢了。\n\n试求出所有元素的能够使得你赢得游戏的方向的总和。\n\nTranslated by Eason_AC  \n2020.11.15"
}