{
    "description": "\n\nFamous programmer Gennady likes to create new words. One way to do it is to concatenate existing words. That means writing one word after another. For example, if he has words `cat` and `dog`, he would get a word `catdog`, that could mean something like the name of a creature with two heads: one cat head and one dog head.\n\nGennady is a bit bored of this way of creating new words, so he has invented another method. He takes a non-empty prefix of the first word, a non-empty suffix of the second word, and concatenates them. For example, if he has words `tree` and `heap`, he can get such words as `treap`, `tap`, or `theap`. Who knows what they could mean?\n\nGennady chooses two words and wants to know how many different words he can create using his new method. Of course, being a famous programmer, he has already calculated the answer. Can you do the same?\n\n",
    "inputFormat": "\n\nTwo lines of the input file contain words chosen by Gennady. They have lengths between $1$ and $100 000$ characters and consist of lowercase English letters only.\n\n",
    "outputFormat": "\n\nOutput one integer -- the number of different words Gennady can create out of words given in the input file.\n\n",
    "samples": [
        [
            "cat\ndog\n",
            "9\n"
        ],
        [
            "tree\nheap\n",
            "14\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n",
    "translation": "### 题目描述\n\n著名的程序员 Gennady 喜欢创造新单词。其中一种方法是连接现有单词。\n\n举个例子：如果 Gennady 有 `cat` 和 `dog` 两个词，那么他会得到一个新词： `catdog`，这可能意味着带有两个头的生物的名字：一个猫头和一个狗头。\n\nGennady 觉得这种创建新单词的方式有点无聊，因此他发明了另一种方法：使用第一个单词的非空前缀，第二个单词的非空后缀，并将它们连接起来。例如，如果他有单词 `tree` 和 `heap` ，则可以得到诸如 `treap`，`tap` 或 `theap` 之类的单词。\n\nGennady 选择了两个单词，并想知道他可以使用新方法创建多少个不同的单词。当然，作为著名的程序员，他已经计算出了答案。他突然想考考你，那么你能编写一个程序把答案计算出来吗？\n\n### 输入格式\n\n两行，每行有一个 Gennady 选择的单词 $s_i$ （$1\\leq |s_i| \\leq 100000$，$s_i$ 仅由小写英文字母组成）。\n\n### 输出格式\n\n输出一个整数，这个整数表示 Gennady 可以从这两个给定的单词中创建不同单词的数量。"
}