{
    "description": "\n\nThere are one hundred noble families in the country of Metagonia, and each year some of these families receive several ritual cubes from the Seer of the One. The One has several rules about cube distribution: if a family receives at least one cube, every prime divisor of the number of cubes received should be either $2$ or $3$ , moreover if one family receives a $> 0$ cubes and another family in the same year receives $b > 0$ cubes then a should not be divisible by $b$ and vice versa.\n\nYou are the Seer of the One. You know in advance how many cubes would be available for distribution for the next $t$ years. You want to find any valid distribution of cubes for each of these years. Each year you have to distribute all cubes available for that year.\n\n",
    "inputFormat": "\n\nThe first line of input file contains a single integer $t$ -- the number of years to come $(1 \\le t \\le 1000)$ . Each of the following $t$ lines contains a single integer $n_{i}$ -- the number of cubes to distribute in i-th year $(1 \\le n_{i} \\le 10^{18}).$\n\n",
    "outputFormat": "\n\nFor each year $i$ output two lines. The first line should contain $m_{i}$ -- the number of families that would receive at least one cube in i-th year $(1 \\le m_{i} \\le 100)$ . The second line should contain $m_{i}$ integers -- the number of cubes received by each family. The sum of these numbers should be equal to $n_{i}.$\n\n",
    "samples": [
        [
            "4\n1\n2\n3\n10\n",
            "1\n1\n1\n2\n1\n3\n2\n4 6\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n",
    "translation": "在一个叫做 镁铊铬铌氩$ (Metagonia)$ 的国度中，有$100$个贵族家庭。\n\n每年，这些贵族家庭都要收到来自先知之首的若干个典礼用的小方块。先知有一些分配小方块的规则：\n\n1. 如果某年有一个家庭收到了小方块，那么这个家庭所收到的小方块的个数的质因数只能是$2$和$3$。\n\n2. 如果某年有一个家庭收到了$a>0$个小方块，同年另一个家庭收到了$b>0$个小方块，那么$a$不整除$b$，$b$也不整除$a$。\n\n现在，你作为先知之首，你知道你接下来的$t$年中，你每年有多少个小方块。你现在想要找到任意一个可行的方案，以便在接下来$t$年中能够进行按规则分配。\n\n--------\n\n第一行，包含一个正整数$t(1≤t≤1000)$。\n\n接下来有$t$行，每行有一个正整数$n_i(1≤n_i≤10^{18})$，表示在第$i$年中，你可以用于支配的小方块个数。\n\n--------\n\n对于每年输出两行。第一行应包含一个数$m_i$,表示能够收到小方块的家庭的数目。\n\n第二行有$m_i$个整数，代表每个家庭应该收到的小方块的个数。这些整数之和应该等于$n_i$。\n\n---------\n\n时间限制：$2s$\n\n空间限制：$256MB$\n\n翻译提供：@Trexmao"
}