{
    "description": "\n\nIngrid is a head of a big railway station and, among other duties, is responsible for routing trains to the right platforms. The station has one entrance, and there are many switches that direct trains to other switches and platforms.\n\nEach switch has one inbound track and two outbound tracks, platforms have one inbound track, and station entrance has one outbound track. Each outbound track is connected to one inbound track and vice versa. Every switch and platform is reachable from station entrance.\n\nPlatforms have a rail dead ends and you may assume that trains disappear from the platform immediately after arriving to it.\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/i6zwkhqd.png)\n\nEach morning Ingrid looks at the timetable and writes switch toggling instruction: when and which switch to toggle. She would like to automate this process to save a lot of time.\n\n",
    "inputFormat": "\n\nThe first line of the input file contains a single integer $n$ — the total number of switches and platforms on the station $(3 \\le n \\le 51)$ .\n\nThe i-th of the following $n$ lines describes a switch or a platform with an index $i$ . Description starts with a character `p` for a platform or `s` for a switch. Next number $q_{i}$ indicates the number of the switch the inbound track is connected to or $0$ if it is connected to station entrance $(0 \\le q_{i} < i)$ . Description of the platform also contains a unique lowercase English letter — the platform identifier.\n\nTrains spend exactly one minute to move between two connected switches or a switch and a platform. In the morning, each switch is toggled in a way that a train would pass to the one of the two outbound tracks connected to the switch/platform with the lower number.\n\nNext line of the input file contains a single integer $m (1 \\le m \\le 1000)$ — the number of trains in timetable.\n\nEach of the following $m$ lines contains integer $a_{i} (0 \\le a_{i} \\le 10 000$ ; $a_{i} > a_{i−1})$ — the time in minutes when a train arrives to the station entrance, and the letter $p_{i}$ — identifier of the destination platform for this train.\n\n",
    "outputFormat": "\n\nIn the first line output integer $c$ — the number of commands in the switch toggling instruction. For each command, output two integers $s_{i}$ and $t_{i} (1 \\le s_{i} \\le n$ ; $0 \\le t_{i} \\le 10^{9})$ — the number of the switch and the time to toggle it. Assume that the switch is toggled between minutes $t_{i} − 1$ and $t_{i}.$\n\nOutput commands in order of non-decreasing time. The number of commands should not exceed $100 000$ .\n\n",
    "samples": [
        [
            "7\ns 0\ns 1\ns 1\np 2 a\np 2 b\np 3 c\np 3 d\n5\n0 a\n1 c\n3 b\n4 a\n5 d\n",
            "6\n1 2\n1 4\n2 4\n2 6\n1 6\n3 7\n"
        ],
        [
            "5\ns 0\np 1 y\ns 1\np 3 z\np 3 x\n3\n7 y\n8 y\n15 y\n",
            "0\n"
        ],
        [
            "3\ns 0\np 1 y\np 1 z\n3\n7 y\n8 y\n10 y\n",
            "5\n1 1\n1 2\n1 2\n1 3\n1 200\n"
        ]
    ],
    "hint": "Below is the time trace for the first example.\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/j38jeq0g.png)\n\nTime limit: 2 s, Memory limit: 256 MB. \n\n",
    "translation": "## 题目描述\n\n英格丽德是一家大型火车站的站长，除其他职责外，还负责将火车开到正确的站台。车站有一个入口，有许多道岔将列车引导至其他道岔和站台。\n\n每个道岔有一条入站轨道和两条出站轨道，站台有一条入站轨道，车站入口有一条出站轨道。每个出站磁道连接到一个入站磁道，反之亦然。每个道岔和站台都可以从车站入口到达。\n\n月台有一个铁路死胡同，你可以假设火车到达月台后立即从月台上消失。\n\n每天早上，英格丽德都会查看时间表，并编写切换指令：何时以及切换哪个开关。她希望将此过程自动化以节省大量时间。\n\n## 输入格式\n\n输入文件的第一行包含一个整数n—站点上交换机和平台的总数\n\n以下n行的第i行描述了具有索引i的交换机或平台。说明以字符p开头表示平台，以字符s开头表示交换机。下一个数字q`i`表示入站轨道连接到的道岔的编号，如果连接到车站入口，则表示0(0≤q$i$≤i)平台说明还包含一个唯一的小写英文字母 -- 平台标识符。\n\n列车在两个相连的道岔或道岔与站台之间移动只需一分钟。早上，每一个道岔都会以一种方式进行切换，列车将通过连接到道岔/站台的两条出站轨道中编号较低的一条。\n输入文件的下一行包含一个整数m(0≤m≤1000) -- 时刻表上的列车数量。\n\n以下m行中的每一行都包含整数a*i* (0≤a$i$ ≤10000;a$i$>a$i-1$) -- 列车到达车站入口的时间（以分钟为单位），以及字母p*i* -- 列车目的站台的标识符。\n\n## 输出格式\n\n在第一行输出整数c中，开关切换指令中的命令数。对于每个命令，输出两个整数 s`i`和 t$i$ (1≤s$i$ ≤n;0≤ t$i$ ≤10^9) -- 开关的编号和切换开关的时间。假设开关在分钟之间切换 t$i$-1 和 `t`。\n\n按非递减时间顺序输出命令。命令的数量不应超过100000。"
}