{
    "description": "\n\nBrenda enjoys a new role-playing game Buffcraft. Shields, swords, books and other carry-on items do not affects character stats in Buffcraft. The only way to increase the stats of your character is to buff her.\n\nThere are two types of buffs in Buffcraft. Direct buffs increase a base value of the stat, while percentage buffs increase stats by the fraction of the base value. To be precise, if unbuffed base value of your character stat is $b$ , you have buffed her using $n$ direct buffs of strength $d_1 , d_2 , \\cdots d_n$ and $m$ percentage buffs of strength $p_{1}, p_{2}, \\cdots , p_{m},$ the resulting stat will be equal to $(b + d_{1} + d_{2} + · · · + d_{n})(100 + p_{1} + p_{2} + · · · + p_{m})/100$ . Note that the resulting stat may be fractional.\n\nUnfortunately, your character has only $k$ buff slots and if you apply more than $k$ buffs on her, only the last $k$ buffs remains active. Thus, there is no reason to apply more than $k$ buffs simultaneously. You cannot apply the same buff more than once.\n\nBrenda is going to send his character to raid and wants to buff her health to maximal possible value. She has some direct and some percentage buffs at her disposal and needs your help to select the set of buffs that leads to maximal possible total health.\n\n",
    "inputFormat": "\n\nThe first line of the input file contains four integers $b , k , c_{d}$ and $c_{p}$ — the base health of the character, the number of buff slots, the number of available directs buffs, and the number of available percentage buffs.\n\nThe following line contains $c_{d}$ integers $d_{i}$ — strengths of direct buffs.\n\nThe last line of the input file contains $c_{p}$ integer numbers $p_{i}$ — strengths of percentage buffs.\n\nAll numbers in the input file are greater than or equal to zero, and less than or equal to fifty thousand.\n\n",
    "outputFormat": "\n\nThe first line of the output file must contain two integers $n$ and $m$ — the number of direct and percentage buffs to use $(0 \\le n \\le c_{d}; 0 \\le m \\le c_{p}; 0 \\le n + m \\le k)$ .\n\nThe following line must contain $n$ different numbers — indices of direct buffs to apply (buffs are numbered from one).\n\nThe last line of the output must contain $m$ different numbers — indices of percentage buffs to apply (also numbered from one).\n\nThe resulting total health after application of all $n + m$ buffs must be maximal possible.\n\n",
    "samples": [
        [
            "70 3 2 2\n40 30\n50 40\n",
            "2 1\n2 1\n1\n"
        ],
        [
            "1 2 3 4\n6 6 5\n8 10 7 9\n",
            "2 0\n1 2\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n"
}