{
    "description": "\n\nLittle Vasya is playing a new computer game -- turn-based strategy `Energy Tycoon`.\n\nThe rules of the game are quite simple:\n\nThe board contains $n$ slots arranged in a line.\n\nThere are power plants, one power plant occupies one or two consecutive slots, and produces one unit of energy.\n\nEach turn the game allows you to build one new power plant, you can put it on the board if you wish. If there is no place for the new power plant, you can remove some older power plants.\n\nAfter each turn, the computer counts the amount of energy produced by the power plants on the board and adds it to the total score.\n\n![](/upload/images2/enegrgytycoon.png)\n\nVasya already knows the types of power plant he will be able to build each turn. Now he wants to know, what the maximum possible score he can get is. Can you help him?\n\n",
    "inputFormat": "\n\nThe first line of the input contains one integer $n (1 \\le n \\le 100 000)$ -- the number of slots on the board. The second line contains the string $s$ . The i-th character of the string is $1$ if you can build one-slot power plant at the i-th turn and the character is $2$ if you can build two-slot power plant at the i-th turn. The number of turns does not exceed $100 000$ .\n\n",
    "outputFormat": "\n\nThe output should contain a single integer -- the maximal score that can be achieved.\n\n",
    "samples": [
        [
            "3\n21121\n",
            "10\n"
        ],
        [
            "2\n12\n",
            "2\n"
        ],
        [
            "2\n211\n",
            "4\n"
        ]
    ],
    "hint": "Time limit: 2 s, Memory limit: 256 MB. \n\n",
    "translation": "Vasya 正在玩一款新的电脑游戏 `Energy Tycoon`\n\n游戏的规则非常简单：\n\n有一行 $n$ 个空位。\n\n有一些能源装置，每个能源装置会占用 $1$ 或 $2$ 个相邻的空位，并且每回合产生一个单位的能量。\n\n在游戏里，每个回合可以建造一个新的能源装置（也可以不建造）。如果没有地方建新的能源装置，可以拆除一些旧的能源装置。\n\n每一回合过后，电脑会统计这一回合内所有已经建造的能源装置产生的能量，并将其加到总分中。\n\nVasya 已经知道了每个回合他可以建造的能源装置的类型。现在他想知道，他能得到的最大分数是多少。你能帮他吗?"
}