{
    "description": "\n**This is an interactive problem.**\n\n\nRan is helping Yukari to maintain the border of Gensokyo. \n\nThe border of Gensokyo is a $n\\times m$ matrix, where $n$ and $m$ are both even. Unfortunately, due to Moriya Shrine's moving in, there are now $4$ weakened points within the matrix.\n\nTo ease the maintenance work, Ran have already found a path from $(1,1)$ to $(n,m)$, going only down or right. The path separates the four weakened points so that exactly two of them are on either side. She will tell you this path in the input.\n\nNow you need to help Ran maintain the border. You can use the operation `? x y` to ask whether the point $(x,y)$ is weakened. And after the query, Ran will mark the point with blue.\n\nIf, after a query, you have just found out the $k$-th weakened point, and $k$ is even, you will need to construct a simple path from the $(k-1)$-th weakened point to the $k$-th. The path you constructed must pass through and only pass through **all** the points that are marked blue.  Ran will then strengthen these points in the border and recolor them red.\n\nRan does not want to do repetitive work, so you can only ask for points that are white with the `?` query.\n\nNow Ran hopes that you can ask all the \"weakened points\" and finish all the constructions.\n\n### Interaction Protocol\n\nFirst read two integers $n$ and $m$ from standard input.\n\nThen read several points (including start and end points) from standard input, one per line, representing a simple path from $(1,1)$ to $(n,m)$.\n\nThen you can make **unlimited** queries. Print your queries to standard output in the format of `? x y`. You will then receive an integer $p$ from standard input. If $p=1$, it means that the point you asked is indeed weakened; if $p=0$, it means that it is not weakened.\n\nRemember to flush your output, you can use `fflush(stdout);` in C++. Please refer to your programming language's documentation.\n\nOn the $k$-th time ($k$ is even) of receiving the result $p=1$, please output several points (including the two weakened points) in order, one per line, ending with $-1,-1$, so that they represent the simple path from the $(k-1)$-th to the $k$-th weakened point.\n\nYou need to exit your program immediately after finding the fourth weakened point and finishing the construction.\n",
    "inputFormat": "Refer to \"Interactive Method\".",
    "outputFormat": "Refer to \"Interactive Method\".",
    "samples": [
        [
            "4 4\n1 1\n1 2\n2 2\n3 2\n3 3\n3 4\n4 4\n\n0\n\n1\n\n0\n\n0\n\n1\n\n\n\n\n\n\n\n1\n\n1\n",
            "\n\n\n\n\n\n\n\n? 2 2\n\n? 2 1\n\n? 3 1\n\n? 3 2\n\n? 4 1\n\n2 1\n2 2\n3 2\n3 1\n4 1\n-1 -1\n? 1 4\n\n? 1 3\n\n1 4\n1 3\n-1 -1\n"
        ]
    ],
    "hint": "### Explanation\n\nThe matrix in the sample is as follows:\n\n```plain\n..XX\nX...\n....\nX...\n```\n\nWhich `X` means a \"weakened point\".\n\n### Constraints\n\n$4\\le n,m\\le100$。",
    "translation": "**这是一道交互题。**\n\n有一个 $n\\times m$ 的矩阵，保证 $n$ 和 $m$ **均为偶数**。初始所有格子都是白色。用 $(x,y)$ 表示矩阵第 $x$ 行第 $y$ 列的格子。\n\n矩阵中有四个关键点（也就是特殊的格子），并且保证存在一条从 $(1,1)$ 到 $(n,m)$ 的只能向下或向右的路径，将四个关键点分隔成两侧每侧两个。**路径已被给出。**\n\n你可以用操作 `? x y` 来询问格子 $(x,y)$ 是否为关键点（是的话交互器返回 $1$，否则返回 $0$），并且询问过后该格子会被染成蓝色。\n\n在你第偶数次询问到关键点后，你需要输出一条从倒数第二次被询问到的关键点到最近一次询问到的关键点的简单路径，满足经过且仅经过**所有**被染成蓝色的格子。输出完成后，所有的蓝色格子都会变成红色。\n\n需要注意，你**只能询问白色格子**。"
}