{
    "description": "By the year 3031, the ICPC has become so popular that a whole new town has to be built to house all the\nWorld Finals teams.\nThe town is beautifully designed, complete with a road network.\nUnfortunately, when preparing the budget, the town planners forgot to take into account the cost of speed-limit signs.\nThey have asked you to help them determine the minimum additional funds they will need.\n\nThe ICPC road network consists of roads, each connecting two intersections. Each road is two-way\nand has already been assigned a speed limit, valid for both directions.\nTo save money, the minimum possible number of roads was used. In other words, there is exactly\none route from any intersection to any other intersection.\n\nThe speed-limit signs need to be installed\nin all places where the speed limit may change for any driver that follows any route.\nMore precisely, if there exists an intersection where at least two roads meet with different speed limits,\nthen *all* of the roads going from that intersection need a speed-limit sign installed at that intersection. \nNote that some roads might need two speed-limit signs, one at each end.\n\nIt costs $c$ dollars to install one speed-limit sign. It is also possible to improve the safety and quality of\nany road so that its speed limit can be increased, which may in turn reduce the number of speed-limit signs required.\nIt costs $x$ dollars to increase the speed limit of one road by $x$ km/h (in both directions).\nTo avoid complaints, the town council does not allow decreasing any of the already-assigned speed limits.\n\nFigure B.1 illustrates the situation given in both Sample Input 1 and Sample Input 2.\n\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/4kx82pq4.png)",
    "inputFormat": "The first line of input contains two integers $n$ and $c$, where $n$ ($1 \\le n \\le 20\\,000$) is the number of intersections\nand $c$ ($1 \\le c \\le 10^5$) is the cost of installing one sign.\nEach of the remaining $n-1$ lines contains three integers $u$, $v$, and $s$, where $u$ and $v$ ($1 \\le u, v \\le n; u \\ne v$)\nare the intersections at the ends of a road, and $s$ ($1 \\le s \\le 10^5$) is the current speed limit of that\nroad in kilometers per hour.",
    "outputFormat": "Output the minimum cost to upgrade roads and install speed-limit signs such that the town\nplan satisfies all the rules above.",
    "samples": [
        [
            "5 2\n1 2 10\n1 3 5\n1 4 7\n2 5 9",
            "7"
        ],
        [
            "5 100\n1 2 10\n1 3 5\n1 4 7\n2 5 9",
            "9"
        ]
    ],
    "hint": "",
    "translation": "到 3031 年，ICPC 已经变得如此受欢迎，以至于必须建造一个全新的 ICPC 镇来容纳所有参加 World Finals 的队伍。这座城镇设计精美，有完整的道路网。不幸的是，在编制预算时，城市规划者忘记了考虑限速标志的成本。他们要求你帮助他们确定他们需要的最低额外资金。\n\nICPC 镇的道路网由道路组成，每条道路连接两个十字路口。每条道路都是**双向**的，并且已经指定了一个速度限制 $s$，对两个方向都有效。为了省钱，ICPC 镇使用了尽可能少的道路。换句话说，从任何交叉口到任何其他交叉口只有一条路线。\n\n限速标志需要安装在所有可能改变任何路线驾驶员限速的地方。更准确地说，如果存在至少两条道路满足不同限速要求的交叉口，那么从该交叉口出发的所有道路都需要在该交叉口安装限速标志。请注意，有些道路可能需要两个限速标志，每端一个。\n\n安装一个限速标志需要花费 $c$ 美元。还可以提高任何道路的安全性和质量，从而提高其限速，从而减少所需限速标志的数量。将一条道路的限速提高 $x$ 公里每小时（**双向**）需要 $x$ 美元。为了避免投诉，市议会**不允许降低任何已经指定的限速**。\n\n数据范围：\n\n- $1\\leqslant n\\leqslant 2\\times 10^4$，$1\\leqslant c\\leqslant 10^5$。\n- $1\\leqslant s\\leqslant 10^5$。\n\nTranslated by Eason_AC"
}