{
    "description": "Vector embeddings are a common tool in machine learning systems.\nComplex real-world concepts (for instance, words in a dictionary) are mapped onto vectors of real numbers.\nIf embeddings are trained properly, related concepts remain close together in the vector space, so questions like \"are these two words synonyms?\" can be reduced to straightforward mathematical tests.\n\nYou have been hired by Ye Olde Ice Cream Shoppe to create an embedding model for flavors, so that when they are out of an ice cream flavor they can recommend related flavors to customers.\nAfter training your embedding on six cloud datacenters for four months, you finally had the perfect flavor model!\nYou were ready to revolutionize the ice cream industry on your street and, dare we say it, your neighborhood!\nWell, until you accidentally dripped some free ice cream on your keyboard and deleted half the data.\nThe Shoppe cannot afford the 30 billion rubles needed to retrain the model, so you are in trouble.\n\nFortunately, you still have various training results lying around.\nFor a given deleted vector, the training data tells you how close it was to some known flavor vectors.\nThe closeness of vectors $A$ and $B$ is just the standard Euclidean distance metric (that is, the length of the vector $A - B$).\nWrite a tool that reconstructs embeddings which are consistent with the training results.",
    "inputFormat": "The first line contains two integers $d$ and $n$, where $d$ ($1 \\leq d \\leq 500$) is the number of dimensions of the\nvectors, and $n$ ($1 \\leq n \\leq 500$) is the number of training results for a deleted embedding vector you want to reconstruct.\nEach of the next $n$ lines describes a training result using $d + 1$ numbers $x_1, \\dots, x_d$ and $e$.\nIn a training result, $x_1, \\dots, x_d$ ($-100 \\leq x_i \\leq 100$) are the coordinates of a known vector, and \n$e$ ($0 \\leq e \\leq 5\\,000$) is the Euclidean distance from that vector to the deleted one.\n\nYour submission will be tested only with the sample inputs given below and inputs generated according to the following procedure.\nFirst, $d$ and $n$ are chosen.\nThen, $n$ input vectors and $1$ output vector, each with dimension $d$, are chosen at random.\nThe $d \\cdot (n + 1)$ coordinates are independent and uniformly distributed in the interval $[-100,100]$.\nNext, the Euclidean distance from each input vector to the output vector is computed.\nFinally, the output vector is discarded.\nCalculations use double-precision floating-point numbers.\nNumbers obtained using this procedure appear in the input with $17$ digits after the decimal point.",
    "outputFormat": "Output $d$ values, the coordinates of any vector that has the given distance to each training vector with an absolute or relative error of at most $10^{-5}$.",
    "samples": [
        [
            "2 3\n0 0 2.5\n3 0 2.5\n1.5 0.5 2.5",
            "1.5 -2"
        ],
        [
            "2 2\n0 0 2\n4 -4 6",
            "1.414213562373 1.414213562373"
        ],
        [
            "4 3\n0 1 2 3 2\n1 2 -1 7 5\n1 0.3 3.4 1.2 3.3",
            "1 2 3 4"
        ]
    ],
    "hint": "",
    "translation": "**【题目描述】**\n\n向量嵌入是机器学习系统中的一种常用工具。现实世界中的某些复杂的概念（例如词典中的单词）通过这种方法可以映射到一个实向量上。如果能让机器正确地训练向量嵌入，由于相关概念在向量空间中保持着紧密的联系，因此像“这两个单词是同义词吗？”这种问题可以简化为简单的数学测试了。\n\n你最近被 Ye Olde 冰淇淋专柜受雇，专门负责为冰淇淋口味创建一个向量嵌入式模型，这样当一种口味的冰淇淋卖完以后，这个嵌入式模型就可以像顾客推荐其它味道相近的冰淇淋。在六个云数据中心里训练了四个月以后，你终于拥有了一个完美的模型，正准备好改变你所在街区的冰淇淋行业，乃至整个街区时，你不小心把一些免费的冰淇淋滴到了键盘上，导致一半的数据被删除。重新训练模型需要花费 300 亿卢布，而专柜显然承受不了这么高的价格，因此你陷入了巨大的麻烦之中。幸运的是，你可以通过剩下的数据来还原出被删除的向量。具体地，对于一个给定的被删除的向量，数据会告诉你它与某些已知的味道向量的接近程度。两个向量 $A,B$ 的接近程度即为这两个向量之间的标准欧几里得距离（即向量 $A-B$ 的长度）。\n\n现在，给定向量所处的空间维度 $d$ 和已知向量个数 $n$，并给定所有 $n$ 个向量的坐标 $(x_{i,1},x_{i,2},\\cdots,x_{i,d})$ 和到同一个被删除的向量的标准欧几里得距离 $e_i$，请你编写一个程序，求出被删除的向量的坐标。\n\n**【输入格式】**\n\n第一行输入两个整数 $d,n$，分别表示向量空间的维度和向量个数。  \n随后 $n$ 行，每行 $d+1$ 个整数 $x_{i,1},x_{i,2},\\cdots,x_{i,d},e_i$，其中前 $d$ 个整数描述了第 $i$ 个向量的坐标，第 $d+1$ 个整数则表示第 $i$ 个向量与被删除的向量之间的标准欧几里得距离。\n\n你提交的代码只会在样例输入数据和按以下方式生成的输入数据上进行测试：\n\n- 在区间 $[1,500]$ 中选出两个整数作为 $d,n$。\n- 随机生成 $n$ 个 $d$ 维输入向量和一个 $d$ 维输出向量。这 $d\\cdot(n+1)$ 个坐标在区间 $[-100,100]$ 中独立且均匀地生成。\n- 对于每个输入向量，计算其与输出向量之间的标准欧几里得距离。\n- 忽略输出向量。\n\n所有在上述过程中的计算使用双精度浮点数，用这种方式生成的所有实数均保留到小数点后 $17$ 位。\n\n**【输出格式】**\n\n输出 $d$ 个整数，描述被删除向量的坐标。你需要保证你输出的答案和标准答案之间的误差不会超过 $10^{-5}$。\n\n**【样例】**\n\n见『输入输出样例』部分。\n\n**【数据范围】**\n\n对于所有数据：\n\n- $1\\leqslant d,n\\leqslant 500$。\n- $-100\\leqslant x_{i,j}\\leqslant 100$。\n- $0\\leqslant e_i\\leqslant 5000$。\n\nTranslated by Eason_AC"
}