{
    "description": "Bessie the cow was excited to recently return to in-person learning! Unfortunately, her instructor, Farmer John, is a very boring lecturer, and so she ends up falling asleep in class often.\nFarmer John has noticed that Bessie has not been paying attention in class. He has asked another student in class, Elsie, to keep track of the number of times Bessie falls asleep in a given class. There are $N$ class periods $(1\\le N\\le 10^5)$, and Elsie logs that Bessie fell asleep $a_i$ times $(0\\le a_i\\le 10^6)$ in the $i$-th class period. The total number of times Bessie fell asleep across all class periods is at most $10^6$.\n\nElsie, feeling very competitive with Bessie, wants to make Farmer John feel like Bessie is consistently falling asleep the same number of times in every class -- making it appear that the issue is entirely Bessie's fault, with no dependence on Farmer John's sometimes-boring lectures. The only way Elsie may modify the log is by combining two adjacent class periods. For example, if $a=[1,2,3,4,5]$, then if Elsie combines the second and third class periods the log will become $[1,5,4,5]$.\n\nHelp Elsie compute the minimum number of modifications to the log that she needs to make so that she can make all the numbers in the log equal.",
    "inputFormat": "Each input will contain $T$ $(1\\le T\\le 10)$ test cases that should be solved independently.\n\nThe first line contains $T$, the number of test cases to be solved. The $T$ test cases follow, each described by a pair of lines. The first line of each pair contains $N$, and the second contains $a_1,a_2,\\ldots,a_N$. \n\nIt is guaranteed that within each test case, the sum of all values in $a$ is at most $10^6$. It is also guaranteed that the sum of $N$ over all test cases is at most $10^5$.",
    "outputFormat": "Please write $T$ lines of output, giving the minimum number of modifications Elsie could perform to make all the log entries equal for each case.",
    "samples": [
        [
            "3\n6\n1 2 3 1 1 1\n3\n2 2 3\n5\n0 0 0 0 0",
            "3\n2\n0"
        ]
    ],
    "hint": "【样例解释】\n\nFor the first test case in this example, Elsie can change her log to consist solely of 3s with 3 modifications.\n```\n   1 2 3 1 1 1\n-> 3 3 1 1 1\n-> 3 3 2 1\n-> 3 3 3\n```\nFor the second test case, Elsie can change her log to 7 with 2 modifications.\n```\n   2 2 3\n-> 2 5\n-> 7\n```\nFor the last test case, Elsie doesn’t need to perform any operations; the log already consists of equal entries.",
    "translation": "$T$ 组数据，每组给定一个长度为 $N$ 的数组 $a_1, a_2, \\dotsb , a_n$。\n\n每次操作可选择两个相邻的数合并，得到的新数为两者之和。\n\n求最少操作次数使得所有数相等。\n\n数据范围： $1 \\leq T \\leq 10$，$\\sum a_i \\leq 10^6$，$\\sum N \\leq 10^5$，$1 \\le T \\le 10$。\n\n**【输入格式】**\n\n一行一个整数 $T$。\n\n接下来 $T$ 组数据，每组数据第一行一个整数 $N$，第二行 $N$ 个整数，$a_1, a_2, \\dotsb , a_n$，含义如题目描述。\n\n**【输出格式】**\n\n$T$ 行，每行一个整数，表示最少操作次数。可证明总存在一种操作满足题意。\n\n**【样例解释】**\n\n对于样例 $1$，显然可以通过如下 $3$ 次操作将原序列变成 `3 3 3`：\n\n```plain\n   1 2 3 1 1 1\n-> 3 3 1 1 1\n-> 3 3 2 1\n-> 3 3 3\n```\n\n对于样例 $2$，显然可以通过如下 $2$ 次操作将原序列变成 `7`：\n\n```plain\n   2 2 3\n-> 2 5\n-> 7\n```\n\n对于样例 $3$，显然无需操作。"
}