{
    "description": "Farmer John has $N$ cows $(2 \\le N \\le 10^5)$. Each cow has a breed that is either Guernsey or Holstein. As is often the case, the cows are standing in a line, numbered $1 \\cdots N$ in this order.\n\nOver the course of the day, each cow writes down a list of cows. Specifically, cow $i$\n's list contains the range of cows starting with herself (cow $i$) up to and including cow $E_i(i \\le E_i \\le N)$.\n\nFJ has recently discovered that each breed of cow has exactly one distinct leader. FJ does not know who the leaders are, but he knows that each leader must have a list that includes all the cows of their breed, or the other breed's leader (or both).\n\nHelp FJ count the number of pairs of cows that could be leaders. It is guaranteed that there is at least one possible pair. ",
    "inputFormat": "The first line contains $N$.\n\nThe second line contains a string of length $N$\n, with the ith character denoting the breed of the $i$-th cow (G meaning Guernsey and H meaning Holstein). It is guaranteed that there is at least one Guernsey and one Holstein.\n\nThe third line contains $E_1 \\cdots E_N$. ",
    "outputFormat": "Output the number of possible pairs of leaders. ",
    "samples": [
        [
            "4\nGHHG\n2 4 3 4",
            "1"
        ],
        [
            "3\nGGH\n2 3 3",
            "2"
        ]
    ],
    "hint": "### Explanation for Sample 1\n\nThe only valid leader pair is $(1,2)$. Cow $1$'s list contains the other breed's leader (cow $2$). Cow $2$'s list contains all cows of her breed (Holstein).\n\nNo other pairs are valid. For example, $(2,4)$\nis invalid since cow $4$'s list does not contain the other breed's leader, and it also does not contain all cows of her breed.\n\n### Explanation for Sample 2\n\nThere are two valid leader pairs, $(1,3)$ and $(2,3)$.\n\n### Scoring\n\n - Inputs $3-5$: $N \\le 100$  \n - Inputs $6-10$: $N \\le 3000$\n - Inputs $11-17$: No additional constraints.",
    "translation": "### 题面描述\n\nFJ 有 $N$ 头奶牛，每一头奶牛的品种是根西岛 `G` 或荷斯坦 `H` 中的一种。\n\n每一头奶牛都有一个名单，第 $i$ 头奶牛的名单上记录了从第 $i$ 头奶牛到第 $E_i$ 头奶牛的所有奶牛。\n\n每一种奶牛都有且仅有一位“领导者”，对于某一头牛 $i$，如果它能成为“领导者”仅当它满足以下条件的**至少一个**：\n\n- 其记录的名单上包含它的品种的所有奶牛。\n\n- 其记录的名单上记录了另一品种奶牛的“领导者”。\n\n请求出有多少对奶牛可能成为两种奶牛的领导者，保证存在至少一种。\n\n### 数据范围\n对于 $100\\%$ 的数据：$1\\leq N\\leq 2\\times 10^5,i\\leq E_i\\leq N$。"
}