{
    "description": "Moo language is actually quite similar to English, but more minimalistic. There\nare only four types of words: nouns, transitive verbs, intransitive verbs, and\nconjunctions. Every two consecutive words must be separated by a space.  There\nare also only two types of punctuation: periods and commas.  When a period or\ncomma appears after a word, it appears directly after the word, and is then\nfollowed  by a space if another word appears next.\n\nA sentence needs to follow one of the following formats:\n- Type 1: noun + intransitive verb.\n- Type 2: noun + transitive verb + noun(s). Specifically, at least one noun\nmust follow the transitive verb, and there must be a comma in front of every \nfollowing noun besides the first following noun.\n\nTwo sentences may be joined into a compound sentence if a conjunction is placed\nin between them.  The resulting compound sentence cannot be further joined with\nother sentences or other compound sentences.  Every sentence (or compound\nsentence, if two sentences are joined) must end with a period.\n\nFarmer John has a word bank of $N$ words, $C$ commas, and $P$ periods. He may only use a word or punctuation mark as\nmany times as it appears in the word bank. Help him output a sequence of\nsentences containing the maximum possible number of words.\n\nEach input file contains $T$ independent instances of this\nproblem.\n",
    "inputFormat": "The first line contains $T$, the number of instances. Each instance is specified\nas follows:\n\nThe first line consists of three integers $N, C$ and $P$.\n\nThe $N$ following lines will consist of two strings. The first string will be\nthe word itself that FJ can use (a string of at least $1$ and at most $10$ lowercase\nletters), and the second string will be either one of the following: noun,\ntransitive-verb, intransitive-verb, or conjunction, denoting the type of the\nword. It is possible the same word occurs more than once in FJ's word bank, but\nit will always have the same type each time it appears.",
    "outputFormat": "In the first line, output the maximum possible number of words.\n\nIn the second line, output any sequence of sentences with the maximum possible\nnumber of words. Any valid sequence will be accepted.\n\n**The grader is sensitive to whitespace, so make sure not to output any\nextraneous spaces, particularly at the end of each line.**",
    "samples": [
        [
            "3\n1 1 1\nbessie noun\n10 5 4\nbessie noun\ntaught transitive-verb\nflew intransitive-verb\nelsie noun\nfarmer noun\njohn noun\nand conjunction\nand conjunction\nnhoj noun\nmooed intransitive-verb\n24 5 4\nbut conjunction\nbessie noun\ntaught transitive-verb\nflew intransitive-verb\nelsie noun\nfarmer noun\njohn noun\nand conjunction\nand conjunction\nnhoj noun\nmooed intransitive-verb\nbob noun\nimpressed transitive-verb\ncow noun\nimpressed transitive-verb\nleaped intransitive-verb\nelsie noun\nbella noun\nbuttercup noun\npushed transitive-verb\nmooed intransitive-verb\nenvy noun\njohn noun\nnhoj noun\n",
            "0\n\n9\nnhoj mooed. farmer taught elsie, bessie and john flew.\n23\nnhoj mooed. nhoj impressed john, farmer, elsie, bessie and cow impressed bob. bella pushed elsie and buttercup flew. envy mooed but john leaped."
        ]
    ],
    "hint": "$1\\le T\\le 100$，$1 \\leq P,C\\le N \\leq 10^3$.\n\n- Inputs 2-6: $N\\le 10$.\n- Inputs 7-11: $N\\le 100$.\n- Inputs 12-16: $N\\le 1000$.\n- Inputs with remainder 2 when divided by 5: There are no transitive\nverbs.\n- Inputs with remainder 3 when divided by 5: There are no intransitive\nverbs.\n- Inputs with remainder 4 when divided by 5: There are no conjunctions.",
    "translation": "### 题目背景\n\nFJ 对与奶牛更好地互动感兴趣，所以他决定学习 moo 语言！\n\n### 题目描述\n\nmoo 语言与英语相似，但更为简单。单词只有四种类型：名词、及物动词、不及物动词和连词，每两个单词之间必须用空格隔开。标点符号仅包含逗号和句号，它会跟在单词后面，若该标点符号后面存在单词，则需要隔一个空格再放单词。\n\n对于每个句子，都需要遵循以下格式中的一条：\n\n1. 名词+不及物动词。\n2. 名词+及物动词+名词（可以有多个）。及物动词后面必须有至少一个名词。除及物动词后面的第一个名词外，后面的每个名词前面都必须加一个逗号。\n\n也可以在两个句子之间加一个连词，形成复合句，复合句不能与其他句子用连词连接。每一个句子（包括复合句）都必须以句号结尾。\n\nFJ 的词库中有 $N$ 个单词、$C$ 个逗号和 $P$ 个句号。每个单词的使用次数不能超过这个单词在词库中出现的次数。现在，你要帮他输出几个符合以上要求的句子，使总单词数尽量多。\n\n每个输入文件中共包含 $T$ 组样例。\n\n### 输入格式\n\n第一行输入 $T$，表示样例组数。对于每组样例，格式如下：\n\n第一行输入三个正整数 $N$、$C$ 和 $P$。\n\n在接下来的 $N$ 行，每行输入两个字符串。第一个字符串输入一个 FJ 可以用的单词（全为小写字母，长度为 $1$ 至 $10$），第二个字符串为以下字符串中的任意一个，表示该单词的类型：\n\n- `noun`（名词）；\n- `transitive-verb`（及物动词）；\n- `intransitive-verb`（不及物动词）；\n- `conjunction`（连词）。\n\n同一个单词可能在词库中出现多次，但是每次出现时它们的类型都相同。\n\n### 输出格式\n\n第一行输出组成符合以上要求的句子序列的最大单词数。\n\n在第二行中，输出句子序列，使单词数最多。本题开启 SPJ，任何符合以上要求的句子序列均可通过。\n\n**请不要输出多余的空格，尤其是在每行末尾。**\n\ntranslated by [liyuanchen2021](https://www.luogu.com.cn/user/557680)"
}