{
    "description": "Bocchi the Builder just finished constructing her latest project: a laneway consisting of two rows of white equilateral triangular tiles. However, at the last moment, disaster struck! She accidentally spilled black paint on some of the tiles. Now, some of the tiles are wet and the other tiles are dry. Bocchi must place warning tape around the perimeters of all wet areas. Can you help her determine how many metres of tape she needs?\n\nThe first triangular tile will point upwards. Each pair of adjacent tiles (that is, tiles that share a common side) will point in opposite directions. Each tile has a side length of $1$ metre.",
    "inputFormat": "The first line of input will consist of one positive integer $C$, representing the number of columns.\n\nThe next two lines will each consist of $C$ integers separated by spaces. Each integer represents\nthe colour of a tile along the laneway, with `1` indicating that the tile is black (wet) and `0` indicating that the tile is white (dry).\n\nThe following table shows how the available 15 marks are distributed:\n\n| Marks | Description | Bound |\n| :----------: | :---------- | :----------: |\n| 3 | The laneway is not very long, black tiles are never adjacent and the second row is fully white. | $C \\le 2 \\times 10^3$ |\n| 3 | The laneway is not very long, black tiles may be adjacent and the second row is fully white. | $C \\le 2 \\times 10^3$ |\n| 5 | The laneway is not very long, black tiles may be adjacent and may appear in the second row. | $C \\le 2 \\times 10^3$ |\n| 4 | The laneway may be very long, black tiles may be adjacent and may appear in the second row. | $C \\le 2 \\times 10^5$ |\n",
    "outputFormat": "Output a single integer representing the length of tape Bocchi needs,in metres.",
    "samples": [
        [
            "5\n1 0 1 0 1\n0 0 0 0 0",
            "9"
        ],
        [
            "7\n0 0 1 1 0 1 0\n0 0 1 0 1 0 0",
            "11"
        ]
    ],
    "hint": "**本题采用捆绑测试**。\n\n- Subtask $1$（$3$ points）：$C \\leq 2 \\times 10^3$，黑色三角形不相邻，第二行全部为白色三角形。\n- Subtask $2$（$3$ points）：$C \\leq 2 \\times 10^3$，黑色三角形可能相邻，第二行全部为白色三角形。\n- Subtask $3$（$5$ points）：$C \\leq 2 \\times 10^3$，黑色三角形可能相邻，第二行可能有黑色三角形。\n- Subtask $4$（$4$ points）：$C \\leq 2 \\times 10^5$，黑色三角形可能相邻，第二行可能有黑色三角形。\n\n样例 $1$ 图解：\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/5tfc7u5b.png)\n\n样例 $2$ 图解：\n\n![](https://cdn.luogu.com.cn/upload/image_hosting/4e22mx61.png)",
    "translation": "设计师 Bocchi 刚刚完成一个工程：一个由上下两部分组成的巷道，每一部分都由一排边长为 $1$ 米的三角形构成。不过这项工程还有一点小瑕疵：有一部分三角形被涂成了黑色，它们的油漆还没干，所以暂时不能使用。Bocchi 想用警戒线将这部分三角形围住，请问至少需要几米长的警戒线才能围上。\n\n一个图形由上下均由 $C$ 个三角形构成。\n\n你需要实现一个程序：\n\n输入一个整数 $C$（$1 \\leq C \\leq 2 \\times 10^5$），接下来两行，每行 $C$ 个数字，`1` 表示黑色三角形，`0` 表示白色三角形，请你求出围上黑色三角形需要多少米栅栏。"
}