{
    "description": "In JOI Kingdom, a national festival is held once a year. During the period of the festival, there are $N$ events in total. The schedule for each event is already fixed. The schedule of the $N$ events are described by sequences $a, b$ of length $N$ satisfying the following conditions.\n\n- Every integer between $1$ and $2N$, inclusive, appears as an element of $a$ or $b$.\n- $a_i < b_i \\ (1 \\le i \\le N)$.\n- $a_i < a_{i + 1} \\ (1 \\le i \\le N - 1)$.\n\nThe $i$-th event will start at $a_i$ minutes after the beginning of the festival, and end at $b_i$ minutes after the beginning of the festival.\n\nParticipants of the festival may choose any events in which they will participate. However, it is not allowed to participate in two events whose schedules overlap. (Note that the starting times and the ending times of the events are different from each other.)\n\nJOI-kun wants to participate in as many events as possible. Until last year, he chose the events in which he participated by the following procedures on a computer.\n\n> For $i = 1, 2, \\dots, N$，the following are done in this order.\n> > If the schedule of the $i$-th event does not overlap the schedules of the other events in which he already chose to participate, he will participate in the $i$-th event. Otherwise, he will not participate in the $i$-th event.\n\nHowever, after studying computer science, JOI-kun noticed that the above algorithm does not necessarily maximize the number of events in which JOI-kun will participate. From this year, JOI-kun will use an improved algorithm. Using the improved algorithm, JOI-kun will be able to maximize the number of events in which JOI-kun will participate.\n\nJOI-kun wants to know the number of cases where the improved algorithm produces a larger number of events.\n\nWrite a program which, given the integer $N$ and a large prime number $P$, calculates the number of pairs of sequences $a, b$ describing the schedules of the $N$ events for which the improved algorithm produces a larger number of events. Since the answer can be very large, your program should output the remainder of the answer when divided by $P$.",
    "inputFormat": "Read the following data from the standard input.\n\n> $N \\ P$",
    "outputFormat": "Write one line to the standard output. The output should contain the remainder of the answer, the number of pairs of sequences $a, b$ describing the schedules of the $N$ events for which the improved algorithm produces a larger number of events, when divided by $P$.",
    "samples": [
        [
            "3 100000007\n",
            "2\n"
        ],
        [
            "4 100000007\n",
            "28\n"
        ],
        [
            "15 999999937\n",
            "935834920\n"
        ]
    ],
    "hint": "**【样例解释 #1】**\n\nFor example, consider the case where $a = (1, 2, 4)$ and $b = (6, 3, 5)$. If JOI-kun uses the algorithm used until last year, he will participate in the first event only. On the other hand, if he uses a correct algorithm to maximize the number of events, he will participate in the second event and the third event. Thus, he will participate in two events. In this case, the improved algorithm produces a larger number of events.\n\nThe following are the pair of sequences $a, b$ for which the improved algorithm produces a larger number of events.\n\n- $a = (1, 2, 4), b = (6, 3, 5)$\n- $a = (1, 2, 4), b = (5, 3, 6)$\n\nTherefore, output $2$, which is the remainder of $2$ when divided by $100000007$.\n\n该样例满足所有子任务的限制。\n\n**【样例解释 #2】**\n\nThere are $28$ pairs of sequences $a, b$ satisfying the condition. Therefore, output $28$, which is the remainder of $28$ when divided by $100000007$.\n\n该样例满足所有子任务的限制。\n\n**【样例解释 #3】**\n\nThere are $5295044602247148$ pairs of sequences $a, b$ satisfying the condition. Therefore, output $935834920$, which is the remainder of $935834920$ when divided by $999999937$.\n\n该样例满足子任务 $3 \\sim 6$ 的限制。\n\n**【数据范围】**\n\n对于所有测试数据，满足 $1 \\le N \\le 2 \\times 10 ^ 4$，$10 ^ 8 < P < 10 ^ 9$，保证 $P$ 是质数，保证所有输入均为整数。\n\n|子任务编号|分值|$N \\le$|\n|:-:|:-:|:-:|\n|$1$|$5$|$5$|\n|$2$|$5$|$8$|\n|$3$|$27$|$30$|\n|$4$|$14$|$300$|\n|$5$|$36$|$3000$|\n|$6$|$13$|$2 \\times 10 ^ 4$|",
    "translation": "#### 简化题意\n\n给你 $n$ 个区间，在保证每个区间没有重叠（即起点和终点都是 $a_i$ 或者 $b_i$ 的点不能同时存在于一段区间内）的前提下，最多可以选取多少个区间。求有多少个至少以一种方法选取区间才能选取更多的方案数。\n\n输出答案对 $p$ 取模的结果。其中 $p$ 是一个质数，且 $10^8<p<10^9$。\n\n#### 输入格式\n\n一行两个整数，表示 $n$，$p$。\n\n#### 输出格式\n\n一行，表示总方案数。"
}