{
    "description": "JOI Kingdom is an insular country consisting of $N$ islands, numbered from $1$ to $N$. The islands are connected by $N − 1$ bridges, numbered from $1$ to $N − 1$. The bridge $i\\ (1 ≤ i ≤ N − 1)$ connects the island $A_i$ and the island $B_i$ bidirectionally. It is possible to travel from any island to any other island by passing through a number of\nbridges.\nIn JOI Kingdom, there are $M$ sightseeing spots, numbered from $1$ to $M$. The sightseeing spot $j\\ (1 ≤ j ≤ M)$ is located in the island $C_j$.\nThere are $Q$ travelers. They plan to visit sightseeing spots in JOI Kingdom. The travelers are numbered from $1$ to $Q$. Each traveler makes a trip in the following way.\n\n1. The traveler chooses an island $x\\ (1 ≤ x ≤ N)$. Taking an airplane, the traveler arrives at the island $x$.\n2. The traveler takes the following actions a number of times. The order and the kinds of actions are arbitrary.\n\n    - The traveler chooses a sightseeing spot in the current island, and visits there.\n    - The traveler moves to another island by passing through a bridge.\n\n3. Taking an airplane, the traveler leaves JOI Kingdom.\n    The traveler $k\\ (1 ≤ k ≤ Q)$ wants to visit all of the sightseeing spots $L_k, L_{k + 1}, . . . , R_k$. However, since the budget is limited, the traveler $k$ wants to minimize the number of islands where the traveler $k$ visits at least once.\n\nWrite a program which, given information of JOI Kingdom and the travelers, calculates, for each $k\\ (1 ≤ k ≤ Q)$, the minimum possible number of islands where the traveler $k​$ visits at least once.",
    "inputFormat": "Read the following data from the standard input.\n\n> $N\\ M\\ Q$\n> \n> $A_1\\ B_1$\n> \n> $A_2\\ B_2$\n> \n> $\\vdots$\n> \n> $A_{N−1}\\ B_{N−1}$\n> \n> $C_1\\ C_2\\ · · ·\\ C_M$\n> \n> $L_1\\ R_1$\n> \n> $L_2\\ R_2$\n> \n> $\\vdots$\n> \n> $L_Q\\ R_Q$\n",
    "outputFormat": "Write $Q$ lines to the standard output. The $k$-th line $(1 ≤ k ≤ Q)$ of output should contain the minimum possible number of islands where the traveler $k$ visits at least once.",
    "samples": [
        [
            "7 6 2\n1 2\n1 3\n2 4\n2 5\n3 6\n3 7\n2 3 6 4 5 7\n1 3\n4 6",
            "4\n6"
        ],
        [
            "8 8 9\n1 2\n2 3\n3 4\n4 5\n5 6\n6 7\n7 8\n8 6 4 3 5 2 4 7\n3 5\n4 6\n6 8\n1 4\n2 3\n6 8\n5 5\n2 8\n1 2",
            "3\n4\n6\n6\n3\n6\n1\n6\n3"
        ],
        [
            "10 7 9\n6 5\n3 6\n9 3\n8 3\n7 8\n7 1\n2 5\n7 10\n8 4\n9 4 10 1 10 7 6\n4 4\n1 3\n1 3\n6 7\n3 6\n3 3\n1 5\n2 5\n1 2",
            "1\n6\n6\n4\n3\n1\n7\n5\n4"
        ]
    ],
    "hint": "**【样例解释 #1】**\n\nThe traveler 1 makes a trip in the following way, and visits all of the sightseeing spots 1, 2, 3.\n1. The traveler 1 arrives at the island 2.\n2. The traveler 1 visits the sightseeing spot 1 in the island 2.\n3. The traveler 1 moves from the island 2 to the island 1 by passing through the bridge 1.\n4. The traveler 1 moves from the island 1 to the island 3 by passing through the bridge 2.\n5. The traveler 1 visits the sightseeing spot 2 in the island 3.\n6. The traveler 1 moves from the island 3 to the island 6 by passing through the bridge 5.\n7. The traveler 1 visits the sightseeing spot 3 in the island 6.\n8. The traveler 1 departs from the island 6 and leaves JOI Kingdom.\n\nThe islands 1, 2, 3, 6 are the four islands where the traveler 1 visits at least once. If the number of islands traveler 1 visits at least once is less than or equal to 3, it is impossible to visit all of the sightseeing spots 1, 2, 3.\nTherefore, output 4 in the first line.\nThe traveler 2 makes a trip in the following way, and visits all of the sightseeing spots 4, 5, 6.\n1. The traveler 2 arrives at the island 3.\n2. The traveler 2 moves from the island 3 to the island 7 by passing through the bridge 6.\n3. The traveler 2 visits the sightseeing spot 6 in the island 7.\n4. The traveler 2 moves from the island 7 to the island 3 by passing through the bridge 6.\n5. The traveler 2 moves from the island 3 to the island 1 by passing through the bridge 2.\n6. The traveler 2 moves from the island 1 to the island 2 by passing through the bridge 1.\n7. The traveler 2 moves from the island 2 to the island 4 by passing through the bridge 3.\n8. The traveler 2 visits the sightseeing spot 4 in the island 4.\n9. The traveler 2 moves from the island 4 to the island 2 by passing through the bridge 3.\n10. The traveler 2 moves from the island 2 to the island 5 by passing through the bridge 4.\n11. The traveler 2 visits the sightseeing spot 5 in the island 5.\n12. The traveler 2 departs from the island 5 and leaves JOI Kingdom.\n\nThe islands 1, 2, 3, 4, 5, 7 are the six islands where the traveler 2 visits at least once. If the number of islands\ntraveler 2 visits at least once is less than or equal to 5, it is impossible to visit all of the sightseeing spots 4, 5, 6.\nTherefore, output 6 in the second line.\nThis sample input satisfies the constraints of Subtasks 1, 2, 4, 5, 6.\n\nThe islands 1, 2, 3, 4, 5, 7 are the six islands where the traveler 2 visits at least once. If the number of islands\ntraveler 2 visits at least once is less than or equal to 5, it is impossible to visit all of the sightseeing spots 4, 5, 6.\nTherefore, output 6 in the second line.\n\nThis sample input satisfies the constraints of Subtasks 1, 2, 4, 5, 6.\n\n**【样例解释 #2】**\n\nThis sample input satisfies the constraints of Subtasks 1, 2, 3, 6.\n\n**【样例解释 #3】**\n\nThis sample input satisfies the constraints of Subtasks 1, 2, 6.\n\n**【数据范围】**\n\n- $1 ≤ N ≤ 100 000$.\n- $1 ≤ M ≤ 100 000$.\n- $1 ≤ Q ≤ 100 000$.\n- $1 ≤ A_i ≤ N\\ (1 ≤ i ≤ N − 1)$.\n- $1 ≤ B_i ≤ N\\ (1 ≤ i ≤ N − 1)$.\n- It is possible to travel from any island to any other island by passing through a number of bridges.\n- $1 ≤ C_j ≤ N\\ (1 ≤ j ≤ M)$.\n- $1 ≤ L_k ≤ R_k ≤ M\\ (1 ≤ k ≤ Q)$.\n- Given values are all integers.\n\n**【子任务】**\n\n1. (5 points) $N ≤ 300, M ≤ 300, Q ≤ 300$.\n2. (5 points) $N ≤ 2 000, M ≤ 2 000, Q ≤ 2 000$.\n3. (7 points) $A_i = i, B_i = i + 1\\ (1 ≤ i ≤ N − 1)$.\n4. (18 points) $L_1 = 1, R_{k} + 1 = L_{k+1}\\ (1 ≤ k ≤ Q − 1), R_Q = M$.\n5. (24 points) $A_i = \\lfloor\\frac{i+1}2\\rfloor, B_i = i + 1\\ (1 ≤ i ≤ N−1)$. Here, $⌊x⌋$ is the largest integer not exceeding x.\n6. (41 points) No additional constraints.",
    "translation": "给出一颗 $n$ 个节点的树，和一个长度为 $m$ 的序列 $a$，$q$ 次询问包含 $a_{l\\cdots r}$ 中所有节点的最小联通块大小。\n\n$n,m,q\\le 10^5$"
}